{
    "job": {
        "title": "Senior Site Reliability Engineer",
        "industry": "Internet",
        "description": "Company Description Twitter is what’s happening and what people are talking about right now. For us, life's not about a job, it's about purpose. We feel real change starts with conversation. Here, your voice matters. Come as you are and together we'll do what's right (not what's easy) to serve the public conversation. Job Description Who We Are Twitter Site Reliability Engineering (SRE) scales Twitter to serve the public conversation around the globe! We encourage engineering confidence by systematically making services reliable and efficient, and ensuring changes are safe and fast. Our SRE teams embed deeply with development teams, sharing on-call with a focus on up-leveling services and increasing automation. Twitter offers engineers the unique opportunity to personally make a noticeable difference at a company that makes a difference in the world. Our team is seeking someone who enjoys coding and is passionate about solving unique challenges in a large-scale distributed environment. We are passionate about systems performance measurement and tuning, and we love to fix complex distributed service issues. Who You Are You have a solid understanding of systems and application design, including the operational trade-offs of various designs A detailed problem-solving approach with a track record of crafting and debugging distributed systems in production You are adaptable and enjoy working with large, complex, and multi-team owned services You seek new initiatives on tasks and work well as a member of a remote and distributed team Qualifications 5+ years of SRE or software engineering experience Practical knowledge of shell scripting and at least one higher-level language (Python, Go, Ruby, or similar). Solid understanding of Linux servers, specifically RHEL/CentOS. Detailed understanding of tools, methodologies, and analysis techniques in a distributed systems environment. Experience developing infrastructure, configuration, and deployment scripting and automation for large-scale/high complexity services in a microservice environment. Experience dealing with large data sets that inform your knowledge around building robust data pipelines and architectures, and tuning Java applications. Experience using containerization software such as Mesos, Kubernetes, or Docker B.S. in computer science or similar field or equivalent experience",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-10-04T20:51:20.000Z"
    },
    "company": {
        "name": "Twitter",
        "link": "https://www.linkedin.com/company/twitter"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "New York",
        "region": "NY",
        "postal_code": "10132",
        "street_address": null,
        "latitude": 40.713047,
        "longitude": -74.00723
    }
}