{
    "job": {
        "title": "Senior Site Reliability Engineer",
        "industry": "Marketing and Advertising,Information Technology and Services,Computer Software",
        "description": "If you’re ready to innovate and lead in the Digital space, join Nike’s Global Technology organization. We bring together technology and process expertise to deliver one-stop solutions that enable Nike, Inc.'s digital products and services. We are responsible for creating, developing and deploying seamless experiences to its Digital consumers. Working with our organization will be rewarding, ambitious, and most definitely not be just another job. Nike is seeking a Senior Site Reliability Engineer to help drive our Core Site Reliability strategic programs and initiatives. As a Senior Site Reliability Engineer, you will be responsible for continuously driving best practices and consumer experience improvements. You will focus on enforcing core operations principles through the development and continuous delivery processes. This role will be accountable for helping with our AWS cloud infrastructure, supporting observability instrumentation and uncovering any gaps for Nike production systems, and put in place mitigations to lower the effects of any failures on consumers. As an SRE, you will establish global observability solutions for In-Season experiences for our demand and supply management teams. It will also include building tooling to improve our automatic failure detection and devops focus. SREs perform deep problem analysis, detect infrastructure problems versus code defects, define and report on scale metrics and incidents and provide long term solutions for reporting. What you will work on We are looking for talented and passionate full stack developers with knowledge of the datacenter infrastructure and cloud platforms. The Responsibilities Are Ensure solutions are designed and developed for large-scale, highly distributed systems Building Continuous Resilience through automation and deployment pipelines Guiding product teams to build systems designed to handle failures Incorporating strategies for full automation, auto-remediation, and comprehensive monitoring Collaborate with and consult Architecture, Security, Privacy, and other Nike SWE teams. Deliver well-documented and well-tested code and participate in peer code reviews. Build and maintain micro services in Node.js and Java. Build and maintain reusable components and libraries in JavaScript and Java. Develop and drive real time observability solutions that provide visibility into system health. Diagnose and develop fixes to implement quickly and efficiently for production incidents. Participate in a 24x7 on-call rotation. What you bring 7+ years of software development experience. 3 - 5+ years’ experience in building cloud-based enterprise systems, ideally on AWS. Proficient in Java 8 and newer Proficient with JavaScript on frontend (React, Angular, etc.) and backend (Node.js) components. Proven knowledge of Linux operating system internals, TCP/IP, filesystems, disk/storage technologies Basic understanding of DNS, Networking, Virtualization Experience with Docker and/or Serverless patterns. Expertise in designing and building scalable Micro Services Expertise in web and web-app patterns Expertise in NoSQL datastore systems to build highly scalable solutions Experience with expertise in other modern enterprise languages (functional or other - Scala, Python, Golang, etc.) Experience with securing Restful APIs and Apps using OAuth and OpenID Connect and JWT Good understanding of async/non-blocking Restful APIs approaches and frameworks Experience within messaging (pub-sub) patterns Demonstrated negotiation and influencing skills Basic understanding of most of the following: ServiceNow, Jira, Jenkins, Splunk, New Relic, SignalFx, or equivalent Application Performance Monitoring Tool Background with ITIL or Lean a plus Bachelor’s degree in Computer Science, Engineering, IT or a related field; MBA a plus or relevant work experience.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-18T05:40:19.000Z"
    },
    "company": {
        "name": "Nike",
        "link": "https://www.linkedin.com/company/nike"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 84,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Beaverton",
        "region": "OR",
        "postal_code": "97007",
        "street_address": null,
        "latitude": 45.486595,
        "longitude": -122.795616
    }
}