{
    "job": {
        "title": "Senior Software Engineer, Platform",
        "industry": "Research,Biotechnology,Pharmaceuticals",
        "description": "At Roivant, we are passionate about discovering and developing new drugs to impact patients' lives. Since its inception in 2014, Roivant has launched over 20 portfolio companies (Vants), overseen 5 successful IPOs, established a $3B partnership with a global pharma, built a pipeline of over 40 assets across various modalities and therapeutic areas, and delivered 8 successful phase 3 readouts. Roivant is currently building new capabilities in drug discovery and expanding its existing development engine to become the world's leading tech-enabled pharmaceutical company. Roivant's drug discovery capabilities are driven by our computational discovery platform, which combines preeminent physics-based tools with deep expertise in machine learning to generate unprecedented analytical power that can tackle previously intractable discovery challenges. The tight integration of this computational platform with our experimental capabilities enables the rapid design and optimization of new drugs to address a wide range of targets for diseases with high unmet need. We believe that the future of drug discovery lies in integrating predictive sciences, biology and medicinal chemistry to accelerate the path to new medicines. This role is an opportunity to be an architect of this paradigm shift and generate transformative benefit for patients. Job Summary Roivant Discovery is seeking a highly motivated, collaborative, and talented Senior Software Engineer to work in a multi-disciplinary organization with a focus on overcoming challenging drug discovery bottlenecks using advanced molecular simulation methods to complement our integrated experimental capabilities. Responsibilities Work closely with Silicon Tx scientists to design, develop, and deploy computational methods and software for our drug discovery efforts Conceptualize, implement, and maintain software engineering best practices Ensure scalability, extensibility, and portability of platform code Create, integrate, and maintain databases for storage and access of results Investigate latest trends and scientific advancements in data analytics and high performance computing and propose adoption where appropriate Coordinate joint software development efforts between our Boston and Suzhou offices and facilitate their communications and collaborations Required Qualifications Fluent speaker in English and Chinese with strong communication skills Outstanding development skills Demonstrated track record of overcoming challenging problems Experience leading projects with geographically distributed teams Strong knowledge of Python Familiarity with version control (such as Git) and test-and-release (such as Jenkins) frameworks. Flexible work hours to accommodate colleagues in China Additional Preferred Qualifications Ability to mentor other software engineers and manage outsourced software development projects Experience with parallel programming, especially data-parallel, using MPI, OpenMP, OpenACC or CUDA C/C++/Fortran Experience working with containers Ability to manage HPC clusters (CPU and GPU based) Experience in using/deploying workflow frameworks such as Airflow, CWL, etc. Experience with scientific computing systems and schedulers Passionate about developing software to advance drug discovery Roivant Discovery provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-01T07:33:24.000Z"
    },
    "company": {
        "name": "Roivant Sciences",
        "link": "https://www.linkedin.com/company/roivant-sciences-inc-"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Boston",
        "region": "MA",
        "postal_code": "02118",
        "street_address": null,
        "latitude": 42.358994,
        "longitude": -71.05863
    }
}