{
    "job": {
        "title": "Sr. Site Reliability Engineer",
        "industry": "Information Technology and Services",
        "description": "**C2C or Sponsorship is NOT available for this position** Job Title: Sr. Site Reliability Engineer (SRE) Job Type: Permanent/Direct Hire Job Location: Marietta, GA - The client is still working remote, but will eventually move to a hybrid work schedule. Candidates based in Atlanta are preferred. Target years of Experience: 4+ years of engineering experience Top 3-5 Skillsets: Experience with AWS (The client is migrating to AWS right now). Senior level Linux administration experience Programming experience with Bash, Python, Ruby, Go, Java, or C/C++ Experience building CI/CD & deployment pipelines Preferred: Kubernetes experience What this job is: Building automation of: Infrastructure Configuration Deployment of infrastructure Build/Test/Deploy/Release of code Maintain log shipping best practices, including tagging, tracing, alerting and analysis tools. Maintain monitoring and observe of applications and systems. Deploy and maintain healthy, performance, compliant platforms (Linux, dependencies, application servers, database). Build and maintain pipelines for CI, CD and deployment. Writing Infrastructure as code (Terraform) Tech Stack: Linux, Chef, Puppet, Terraform, Jenkins, AWS. Team Dynamics: Agile environment. TDD, Collaborative team environment. **C2C or Sponsorship is Not available for this position** Equal Opportunity Employer/Veterans/Disabled To read our Candidate Privacy Information Statement, which explains how we will use your information, please visit https://www.modis.com/en-us/candidate-privacy/ The Company will consider qualified applicants with arrest and conviction records.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-10-04T20:19:49.000Z"
    },
    "company": {
        "name": "Modis",
        "link": "https://ch.linkedin.com/company/modis"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 48,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Marietta",
        "region": "GA",
        "postal_code": "30066",
        "street_address": null,
        "latitude": 33.952305,
        "longitude": -84.54905
    }
}