{
    "job": {
        "title": "Front End Software Engineer",
        "industry": "Entertainment",
        "description": "Founded in 2016 by childhood friends and business partners Ryan Hogan and Derrick Smith, Hunt A Killer is a fast-growing entertainment company disrupting conventional storytelling by delivering immersive, interactive entertainment experiences to over 100,000 subscribers worldwide. Hunt A Killer started as a single event that blended the concepts of escape rooms, interactive theater, and live entertainment by engaging participants in a 200-acre living crime scene. From that first foray into entertainment, we learned invaluable lessons, including how to truly immerse our audience in our experiences and the importance of learning from our audience. In October 2016, Hunt A Killer launched our flagship monthly subscription box to 56 subscribers. Hunt A Killer has continued to learn and grow, evolving its products and distribution model to double our business year-over-year. Today, we ship 150,000 episodic and complete mystery game boxes direct to consumers each month and sell purpose-built games through retail channels. In 2019, Hunt A Killer was named one of Fast Company’s World’s Most Innovative Companies, and in 2020, we placed 6th in the INC 5000 Fastest-Growing Companies. Hunt A Killer is now working on additional ways to distribute our revolutionary content including licensing and digital channels, to immerse more people in our stories. With this in mind and a course set for the horizon, we continue building a diverse team of creative decision-makers because together, we can do anything! Hunt A Killer is committed to bringing together individuals from different backgrounds and perspectives. We strive to create an inclusive environment where everyone can thrive, feel a sense of belonging, and do great work together. Our goal is to build a great team – with a great team, we can accomplish anything! ABOUT THE ROLE We are seeking a Front-End Engineer to join the Technology team, who will have responsibilities across the full software development lifecycle. You will be primarily focused on development using frameworks and tools such as ASP.NET Core and ReactJS. Development activities include working with business SMEs to understand requirements and working with like-minded team members to apply best practices such as SOA, Agile, and TDD/BDD to daily development activities. LOCATION We encourage candidates in near both Baltimore, MD and Seattle, WA to apply! YOU'RE THRILLED ABOUT THIS ROLE BECAUSE YOU WILL Love solving problems, have a love for programming, and enjoy working in a small team environment Be constantly thinking of ways to use to code to make products and processes better Be constantly focused on finding the right solutions for some of the most challenging problems Rally the team around you to keep pushing when everyone throws their hands in the air in frustration – because, after all it takes a team to launch things successfully. And of course… working at a gaming company is a big plus for you! WE'RE THRILLED TO WELCOME YOU TO THE TEAM BECAUSE YOU HAVE A BS or MS degree in Computer Science, Information Technology, or related field from an accredited college or university Minimum of 3 years of experience in many/most of the following skills: C# & .NET Framework and/or .NET Core, ASP.NET MVC 4.0 & 5.0, Web API 2.0, HTML5 with Razor, Entity Framework, MSSQL, Entity Framework, React, React Native, vanilla JavaScript, and PHP ework, MSSQL, Entity Framework, React, React Native, vanilla JavaScript, and PHP Sufficient experience developing and deploying applications in Azure RESTful web services development and integration experience Demonstrated proficiency working on development platforms, using multiple programming languages Demonstrated proficiency working on development platforms, using multiple programming languages The ability to pick up new technologies quickly A high comfortable level of experience with source control solutions such as Git/GitHub Strong analytical and problem-solving skills Excellent written and oral communication skills The ability to identify and communicate potential issues while determining solutions Excellent development estimation skills Demonstrated understanding of development standards and expectations for deliverables The ability to adapt to and embrace new situations, changing priorities, and emerging technologies The ability to work on teams with diverse skills backgrounds Must have the ability to work under pressure but continue to think clearly and provide support or guidance to team members during challenging projects and schedules Demonstrated proficiency working collaboratively with less-technical teams across the software development life cycle YOU'LL LOVE HUNT A KILLER BECAUSE WE Are passionate about innovations in entertainment and are obsessed with member satisfaction Offer competitive compensation, comprehensive health, dental and vision, and 401k with matching Believe in time off, and encourage as much Solve complex problems on a daily basis Hunt A Killer is an EOE M/F/D/V.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-15T21:57:57.000Z"
    },
    "company": {
        "name": "Hunt A Killer",
        "link": "https://www.linkedin.com/company/hunt-a-killer"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Baltimore",
        "region": "MD",
        "postal_code": "21226",
        "street_address": null,
        "latitude": 39.290443,
        "longitude": -76.612335
    }
}