{
    "job": {
        "title": "College Intern - EHS Compliance",
        "industry": "",
        "description": "College Intern - Environmental, Health & Safety (EHS) Compliance Sustainagility provides environmental, health and safety (EHS) risk management solutions to businesses located nationwide. Our job is to cost-effectively assist our clients in balancing the bottom-line with the local, state, and federal regulatory requirements, both new and old. Because we work with varied industries in several locales, members of our team have the opportunity to gain experience in numerous areas within the EHS field. We are looking for a part-time intern to work remotely. This position will become available in September 2021 and applicants must currently be enrolled in a degree program at an accredited college or university. Sustainagility will provide you with training and experience in various environmental and safety programs as you complete your degree. Our new intern can expect to receive: ·        One-on-one training ·        Practical experience ·        Competitive salary ·        Resume-enhancing skills ·        Possible future employment In this position, as an important part of our EHS Team, your responsibilities will include, but are not limited to: ·        Work on independent and collaborative projects ·        Provide support for management ·        Research local hazardous material reporting requirements ·        Update emergency response documentation ·        Develop emergency evacuation plans ·        Monitor and update project schedules ·        Create informational EHS content (e.g., blog, social media) A successful applicant will possess the following qualifications: ·        Eagerness to learn ·        Pursuing a Bachelor’s degree ·        Educational course history related to environmental, health and safety programs ·        Proficiency with Microsoft Office ·        Exceptional verbal and written communication skills Requirements for applying: ·        Must be a U.S. Citizen or have Resident Alien status Applications must include: ·        Resume ·        Cover letter (preferred but not required) ·        Current major ·        Expected graduation date ·        A copy of your unofficial transcript Compensation and benefits: ·        This is a paid internship with hourly rates between $12.00 and $17.00 ·        This is a remote, work-from-home position ·        We offer schedule flexibility (10 to 20 hours per week M-F) We are an equal opportunity employer: All qualified applicants will receive consideration for employment without regard to race, color, religion, religious creed, sex, national origin, ancestry, age, physical or mental disability, medical condition, genetic information, military and veteran status, marital status, pregnancy, gender, gender expression, gender identity, sexual orientation, or any other characteristic protected by local law, regulation, or ordinance.",
        "employment_type": "INTERN",
        "date_posted": "2021-08-20T00:27:25.000Z"
    },
    "company": {
        "name": "Sustainagility",
        "link": "https://www.linkedin.com/company/sustainagility"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Phoenix",
        "region": "AZ",
        "postal_code": "85009",
        "street_address": null,
        "latitude": 33.448204,
        "longitude": -112.072586
    }
}