{
    "job": {
        "title": "Cleared Software Engineer (Full Stack with any languages, Big Data Environment. Junior candidates can apply)",
        "industry": "Information Technology and Services,Computer Software,Staffing and Recruiting",
        "description": "This position is funded and vacant and the customer is actively hiring for this role. Will consider Junior candidates!!! Position is with the VA McLean Customer and requires an active TS/SCI with Full Scope Poly clearance. The Software Engineer will design, develop, code, test, and debug complex new software products, or make significant enhancements to existing software. The ideal candidate is a hands-on platform builder with experience in developing scalable data platforms, with experience in business intelligence, analytics, data science and data products. They must have firsthand technical expertise in a variety of configuration management and big data technologies and the proven ability to fashion robust scalable solutions that can manage large data sets. They must be at ease working in an agile environment with little supervision. This person should embody a passion for continuous improvement and innovation. Requirements Demonstrated experience with software development in any language Bachelor’s Degree in Computer Science, Electrical or Computer Engineering or a related technical discipline, or the equivalent combination of education, technical training, or work/military experience Benefits Leading Path is an award-winning Information Technology and Management Consulting firm focused on providing solutions in process, technology, and operations to our government and Fortune 500 clients. We offer a professional and supportive family-friendly work environment with a strong work-life balance. Leading Path provides a comprehensive and competitive benefits package, 401K, tuition reimbursement and opportunities for professional growth and advancement.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-06-25T15:19:59.000Z"
    },
    "company": {
        "name": "Leading Path Consulting",
        "link": "https://www.linkedin.com/company/leading-path-consulting-llc"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Reston",
        "region": "VA",
        "postal_code": "22096",
        "street_address": null,
        "latitude": 38.960186,
        "longitude": -77.3545
    }
}