{
    "job": {
        "title": "Senior Integration &amp; Test Engineer, Structured Test",
        "industry": "Computer Software,Automotive,Information Technology and Services",
        "description": "Who We Are Argo AI is in the business of building self-driving technology you can trust. With experienced leaders in the field and collaborative partnerships with some of the world’s largest automakers, we’re building self-driving technology that is engineered to scale globally and transform mobility for millions. Talented individuals join our team because they share our purpose to make it safe, easy, and enjoyable for everyone to get around cities. We aspire to impact key industries that move people and goods, from ride hailing to deliveries. Meet The Team The Test Autonomy, Structured Test team designs tests and fabricates test assets for targeted testing of Autonomous Vehicle functional areas. Tests are designed to either utilize fleet data or be executed in the closed course environment. Test assets are primarily used in closed course testing to: 1) physically simulate edge cases, 2) improve testing safety and 3) automate testing. What You’ll Do Influence development of requirements for Autonomous Vehicles from the perspective of testing Plan testing to define and verify performance metrics with Cameras, Lidar, and Radar Interface with a small team of Engineers to devise simple solutions to complex problems Collaborate with Systems Engineers and Test Engineers to drive Objective and Key Results Provide input to Test Execution and Test Asset design What You'll Need To Succeed Degree in Computer Engineering, Computer Science, Electrical Engineering, Robotics or a related field 10+ years experience in a test engineering or related field Experience as a technical lead on projects Experience working directly with other engineers Familiarity with working in a fast paced environment Excellent communication skills Experience executing on Validation Plans Nice To Haves Experience testing Camera, Lidar, or Radar Programming experience in languages such as Python Nice to have experience with autonomous vehicles or robotics What We Offer You High-quality individual and family medical, dental, and vision insurance Competitive compensation packages Employer-matched 401(k) retirement plan with immediate vesting Employer-paid group term life insurance and the option to elect voluntary life insurance Paid parental leave Paid medical leave Unlimited vacation Complimentary daily lunches, beverages, and snacks Pre-tax commuter benefits Monthly wellness stipend Professional development reimbursement Employee assistance program Discounted programs that include legal services, identity theft protection, pet insurance, and more Company and team bonding outlets: employee resource groups, quarterly team activity stipend, and wellness initiatives Our Background Argo AI was founded in late 2016 by industry experts with extensive experience building robotic systems for commercial applications. Our once-small team has since grown into an over 1,000-person strong company with strategic partnerships with two of the world’s leading automakers: Ford and Volkswagen. Our self-driving system is the first with commercial deployment plans for Europe and the U.S., and thanks to an ability to tap into both automakers’ global reach, our technology platform has the largest geographic deployment potential of any self-driving technology to date. At Argo AI, we believe that embracing differences delivers superior results. We are an equal opportunity employer that is committed to an inclusive environment for all employees.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-15T18:43:22.000Z"
    },
    "company": {
        "name": "Argo AI",
        "link": "https://www.linkedin.com/company/argo-ai"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 120,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Detroit",
        "region": "MI",
        "postal_code": "48242",
        "street_address": null,
        "latitude": 42.33294,
        "longitude": -83.04784
    }
}