{
    "job": {
        "title": "Software Development Engineer II",
        "industry": "Financial Services,Information Technology and Services,Internet",
        "description": "Our Purpose We work to connect and power an inclusive, digital economy that benefits everyone, everywhere by making transactions safe, simple, smart and accessible. Using secure data and networks, partnerships and passion, our innovations and solutions help individuals, financial institutions, governments and businesses realize their greatest potential. Our decency quotient, or DQ, drives our culture and everything we do inside and outside of our company. We cultivate a culture of inclusion for all employees that respects their individual strengths, views, and experiences. We believe that our differences enable us to be a better team – one that makes better decisions, drives innovation and delivers better business results. Job Title Software Development Engineer II Engineer, Software Engineering Overview The Cyber and Security Services team develops new capabilities for Mastercard's fraud prevention platform. We protect cardholders / card issuers and aim to eradicate credit card fraud. Our industry-leading platform processes billions of transactions per month with execution times literally 10X faster than you can blink. To enable us to uphold the high standard of these fraud and security applications we are looking for out-of-the-box thinkers to play a critical role in the upkeep and continual health of these products. The Software Engineer role will ensure these products continue to meet the high expectations from our customers by notably improving existing functionality, updating stale or outdated functions, proactively adding scalability while continuing to add enhanced value to these products. ROLE Work with a team of talented developers to develop high performance, high volume Java fraud management applications Deliver solutions by providing direct development of software solutions Work closely with technical leads to define features and user stories Assist with support issues by troubleshooting incidents and problem tickets Possess the aptitude to quickly learn and contribute to our complex platform Provide technical expertise to ensure effective delivery of software capabilities Contribute to the planning and development of software solutions Perform code reviews of co-worker’s deliverables to ensure best practices All About You Considerate, polite, fun-loving, collaborative Strong organizational and communication skills: both verbal and written. Proven experience with Linux and Java development (JDK 1.7 or greater), design patterns, threading, unit testing, debugging. Understanding of agile software development processes, ideally a knowledge of SAFe Competent with one or more of the following: JBoss, Tomcat, shell scripting, JSON, multi-threading, Maven, Oracle PL/SQL Proven experience with Eclipse or IntelliJ and ability to compile, deploy, and execute code artifacts Due to COVID-19, most of our employees are working from home. We’ve implemented a virtual hiring process and continue to interview candidates by phone or video and are onboarding new hires remotely. We value the safety of each member of our community because we know we’re all in this together. Mastercard is an inclusive Equal Employment Opportunity employer that considers applicants without regard to gender, gender identity, sexual orientation, race, ethnicity, disabled or veteran status, or any other characteristic protected by law. If you require accommodations or assistance to complete the online application process, please contact reasonable.accommodation@mastercard.com and identify the type of accommodation or assistance you are requesting. Do not include any medical or health information in this email. The Reasonable Accommodations team will respond to your email promptly.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-23T06:23:10.000Z"
    },
    "company": {
        "name": "Mastercard",
        "link": "https://www.linkedin.com/company/mastercard"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "New York",
        "region": "NY",
        "postal_code": "10132",
        "street_address": null,
        "latitude": 40.713047,
        "longitude": -74.00723
    }
}