{
    "job": {
        "title": "Software Engineer - Entry Level (Remote)",
        "industry": "Computer Software,Hospital &amp; Health Care",
        "description": "As a Software Engineer you are responsible for delivering highly scalable, distributed multi-tenant enterprise class software solutions. This includes responsibility for the entire application lifecycle from research and design to technical support of the products once deployed. This includes being given complicated problems and being asked to find solutions.  It includes all aspects of the software development lifecycle and involves working within an agile software development team.  It requires adherence to company standards for quality, compliance, architecture, and software development best practices. A symplr Software Engineer will work with their team and others around the globe to help create the best possible outcomes for our customers! Duties and Responsibilities: Design, code, test & maintain enterprise software solutions Adhere to, and help others adhere to symplr’s coding, quality, and architectural standards guidelines Work productively in an agile SDLC environment, assisting the team and supporting group goals Demonstrates clear solution thinking & adherence to quality by creating code comments, documentation, diagrams, and maintainable, testable code Work closely with Architects, Quality Engineers, and Product Management Determines operational feasibility by evaluating analysis, problem definition, requirements, solution development, and proposed solutions Communicate in a professional manner when interacting with coworkers and customers Participate in internal and external technical reviews, as required Skills Required: Excellent time management, resource organization and priority establishment skills, and ability to multi-task in a fast-paced environment Ability to work independently and as part of a team Robust understanding of SOLID design principals Can work quickly and efficiently with minimal supervision Experience working in multiple programming languages like C#, Java, TypeScript, CSS, etc. with the desire and ability to learn more Have a basic knowledge or understanding of the following: SOLID design principals Object-Oriented design REST Web services Agile (Scrum) methodologies Experience with front end frameworks like Angular, React Qualifications: Have HEART. To work here, you must be: Humble - self-aware and respectful Effective - measurably move the needle & immeasurably add value Adaptable - innately curious and constantly changing Remarkable - stand out in some way Transparent - openly and honestly sharing knowledge Legal authorization to work in the U.S. is required. Bachelor’s Degree in Computer Science, or in “STEM” Majors (Science, Technology, Engineering and Math) is preferred. 1+ years of proven working experience in software engineering The above job description is not intended to be an all-inclusive list of duties and standards of the position. Incumbents will follow any other instructions, and perform any other related duties, as assigned by their supervisor. About symplr: As the global leader in enterprise healthcare operations including governance, risk management, and compliance software (GRC), symplr has a single mission: to make healthcare GRC simpler, resulting in improved efficiency, better outcomes, and safer patients. symplr customers depend on our provider data management, workforce and talent management, contract and spend management, access management, and compliance, quality, safety solutions to drive positive outcomes and to protect their patients and staff. More information is available at www.symplr.com. We’re based in many major healthcare technology hubs in the US: Houston (TX), Hartford (WI), Nashville (TN), Boston (MA), and Kansas City (KS). We proudly serve over 6,500 healthcare facilities, from small surgery centers to the largest integrated delivery networks (IDNs) and payers nationwide. Perks & Benefits: Employer Contribution to Medical, Dental, Vision & Life Insurance 401K with Employer Matching PTO, Personal Days, Volunteer Days, & 12 Paid Holidays Casual Dress Code Every Day Progressive Company Culture symplr is an Equal Opportunity/Affirmative Action Employer. We consider applicants without regard to race, color, religion, age, national origin, ancestry, ethnicity, gender, gender identity, gender expression, sexual orientation, marital status, veteran status, disability, genetic information, citizenship status, or membership in any other group protected by federal, state or local law. As an ongoing commitment to reasonably accommodate individuals with disabilities, symplr has established alternative methods to complete the application process. Disabled applicants needing assistance are encouraged to call 281.863.9500 if further assistance is required. To all recruitment agencies: we do not accept resumes or partnership opportunities. Please do not forward resumes to symplr or any of our employees. We are not responsible for any fees related to unsolicited resumes. Equal Opportunity Employer/Protected Veterans/Individuals with Disabilities The contractor will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with the contractor’s legal duty to furnish information. 41 CFR 60-1.35(c)",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-06T13:39:44.000Z"
    },
    "company": {
        "name": "symplr",
        "link": "https://www.linkedin.com/company/symplr"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 12,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Houston",
        "region": "TX",
        "postal_code": "77208",
        "street_address": null,
        "latitude": 29.760803,
        "longitude": -95.36951
    }
}