{
    "job": {
        "title": "Developer I - Software Engineering",
        "industry": "Information Technology and Services,Computer Software,Financial Services",
        "description": "Role Proficiency Job Description Acts under continuous guidance and support develop test and document applications Outcomes Interpret the applications features and component design developing the same in accordance with user stories/ specifications per directions provided Code debug test. document and communicate product/component/feature development stages. Identify and report opportunities to improve efficiency and quality (e.g. repeatable processes that can be automated) Adhere to project timelines and communicate effectively over e-mails and conversations Conduct unit testing to validate unit level functionalities Practice FAST goals; seek and accept feedback Learn technology business domain system domain individually and as recommended by the project/account Measures Of Outcomes Adherence to engineering process and standards (coding standards) Adherence to schedule / timelines Adherence to SLAs where applicable Number of defects post delivery Number of non-compliance issues Reduction of reoccurrence of known defects Quickly turnaround production bugs Meet the Defined productivity standards for project Completion of all mandatory training requirements Code Outputs Expected: Learn coding standards and practice them in development. Develop code with guidance for the above Configure Follow configuration process Test Create and conduct unit testing Document test results Domain Relevance Develop features and components with good understanding of the business problem being addressed for the client Manage Defects Raise fix retest defects Document Create documentation for one's own work Status Reporting Report status of tasks assigned Comply with project related reporting standards/process Manage Knowledge Consume project related documents share point libraries and client universities Release Adhere to release management process Requirement Understand the requirements/user stories Design Understand the design/LLD and link it to requirements/user stories Skill Examples Explain and communicate the design / development to the mentors/leads Perform and evaluate test results against product specifications Develop user interfaces business software components and embedded software components Manage and guarantee high levels of cohesion and quality Use data models Perform and evaluate tests in the customer or target environment Team player Good written and verbal communication abilities Proactively ask for and offer help Knowledge Examples Additional Comments: None",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-09-12T05:24:13.000Z"
    },
    "company": {
        "name": "UST",
        "link": "https://www.linkedin.com/company/ustglobal"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "San Diego",
        "region": "CA",
        "postal_code": "92161",
        "street_address": null,
        "latitude": 32.71576,
        "longitude": -117.16382
    }
}