{
    "job": {
        "title": "Product Manager Circuit Breakers Relays Surge Protectors",
        "industry": "Electrical/Electronic Manufacturing",
        "description": "Position: Product Manager – Cabinet Products (North America) Business Unit: Circuit Breakers/Relays/Surge Protection T eam: Cabinet Products Division Reports to: Director of CP Division, North America ID: Exempt Summary / Scope of Position Position is responsible for the strategic and tactical marketing of Weidmuller’s Electronics products in North America. Products include: Relays, Circuit Breakers and Surge Protection. Position is the product authority within Weidmuller North America. As such it requires close work with Weidmuller sales force and industry managers, manufacturer’s representatives and distributors to offer solutions to customer applications. Essential Functions Functional Assists and coordinates the development and execution of product marketing plans and related objectives. Generates product literature and marketing collateral. Develops product promotions and adverting copy. Generates and coordinates special pricing requests. Provides input to Weidmuller Germany for product development regarding new product opportunities and markets. Researches and tracks product market share and competitive positions. Responsible for new product introductions which include Market Pricing, Product Positioning and Promotion. Conducts analysis of competition that will include features/benefits, pricing, advertising, promotion and support. Conducts product and application training for the Weidmuller sales channel, internal departments and, when needed, customers. Responsible for notifying your direct supervisor, manager and/or a member of the Executive Staff of any risks associated with the Quality Management System. Leadership Visible as the national product champion / authority, both internally and externally. Actively engages with the industrial industry, distributors, customers and overall market to develop and maintain the highest knowledge of market served and related applications for existing and new products. Participates in the annual strategic planning for the marketing organization. Ensures thorough familiarity with and actively adheres to all Environmental and Safety and Security Policies and performs duties in accordance with those policies. Conducts tasks in accordance with applicable health, safety, quality, environmental and security regulations (state/federal laws, ISO 9001, CFR 1910 OSHA) as well as company policies and procedures. Responsible for notifying your direct supervisor, manager and/or a member of the Executive Staff of any risks associated with the Quality Management System Interpersonal Utilize strong communication skills and abilities to deal tactfully and efficiently with field /customer situations. Teams with Weidmuller sales organization, industry managers, manufacturer’s representatives and distributors to grow markets, sales and customer relationships. Works and collaborates with Weidmuller Germany Product Managers and factory personnel. Team player who works well with Technical Support, Marketing Communication and Marketing Teams. Must have good writing skills for marketing communications. Business Responds promptly to customer sensitive issues to alleviate potential customer issues and generate corrective actions. Conducts him/herself/themselves in a professional manner when dealing with customers. Experience Requirements Minimum of four years of marketing and sales experience with electronic products for factory automation / process control and instrumentation. Effective presentation skills adaptable to various management levels. Computer/PC literate with MS Office Products. Travel Up to 30% domestic travel with some international travel expected. Education Requirements Four-year undergraduate degree in Electrical engineering or Business with electronics experience required.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-25T17:24:45.000Z"
    },
    "company": {
        "name": "Weidmuller USA",
        "link": "https://www.linkedin.com/company/weidmuller-north-america"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 48,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Richmond",
        "region": "VA",
        "postal_code": "23284",
        "street_address": null,
        "latitude": 37.54076,
        "longitude": -77.43393
    }
}