{
    "job": {
        "title": "Info Security Sr Engineer - Senior Security Data Scientist",
        "industry": "Financial Services,Investment Management,Banking",
        "description": "Job Description Important Note: During the application process, ensure your contact information (email and phone number) is up to date and upload your current resume when submitting your application for consideration. To participate in some selection activities you will need to respond to an invitation. The invitation can be sent by both email and text message. In order to receive text message invitations, your profile must include a mobile phone number designated as “Personal Cell” or “Cellular” in the contact information of your application. At Wells Fargo, we are looking for talented people who will put our customers at the center of everything we do. We are seeking candidates who embrace diversity, equity and inclusion in a workplace where everyone feels valued and inspired. Help us build a better Wells Fargo. It all begins with outstanding talent. It all begins with you. Technology sets IT strategy; enhances the design, development, and operations of our systems; optimizes the Wells Fargo infrastructure; provides information security; and enables Wells Fargo global customers to have 24 hours a day, 7 days a week banking access through in-branch, online, ATMs, and other channels. Our mission is to deliver stable, secure, scalable, and innovative services at speeds that delight and satisfy our customers and unleash the skills potential of our employees. The Information and Cyber Security (ICS) team is embarking on a multi-year initiative to improve Wells Fargo’s resiliency to the tactics, and techniques used by today’s most advanced adversaries. ICS is looking to bring together a multi-functional, agile team to partner across disciplines in order to create a more secure future for the company and its customers. Join a team of dedicated cybersecurity professionals working to implement cutting edge threat detection and prevention tools and techniques. Wells Fargo Secure Code Review (SCR) provides application vulnerability identification and also validation of remediated findings at the code level for critical applications used by Wells Fargo, from an automated and manual static analysis perspective. This role is a key member of the Secure Code Review team who will help to further our machine learning capabilities in advancement of our static analysis competencies. Primary Job Responsibilities Include Work with stakeholders throughout the organization to identify opportunities for using company data to drive automation and process improvement. Leverage large data sets to find opportunity for process optimization, using models to test the effectiveness of different courses of action. Mine and analyze data from systems of record to drive automation, continuous improvement and quality assurance. Assess the effectiveness and accuracy of new data sources and data gathering techniques. Develop custom data models and algorithms to apply to data sets. Develop processes and tools to monitor and analyze model performance and data accuracy as well as to design, build, and monitor a data lake. Perform model evaluation and management to test model quality, data drift and model drift, anomaly detection and more. Exhibit capabilities in a variety of data mining and data analysis methods, using varying tools to build and implement models. Submit patents, as appropriate, to protect your inventions. Salary range is determined by location of the job. The salary range displayed below is based on a Full-time 40 hour a week schedule: AZ-Chandler: Min: $112,000 Mid: $160,000 Max: $208,000 CA-SF-Financial District: Min: $134,400 Mid: $192,000 Max: $249,600 CA-Concord: Min: $134,400 Mid: $192,000 Max: $249,600 IA-West Des Moines: Min: $112,000 Mid: $160,000 Max: $208,000 IL-Chicago: Min: $123,200 Mid: $176,000 Max: $228,800 MA-Boston: Min: $134,400 Mid: $192,000 Max: $249,600 MN-Minneapolis: Min: $112,000 Mid: $160,000 Max: $208,000 MO-Saint Louis: Min: $112,000 Mid: $160,000 Max: $208,000 NY-New York: Min: $134,400 Mid: $192,000 Max: $249,600 PA-Philadelphia: Min: $123,200 Mid: $176,000 Max: $228,800 TX-DAL-Downtown Dallas: Min: $112,000 Mid: $160,000 Max: $208,000 NC-Raleigh: Min: $112,000 Mid: $160,000 Max: $208,000 GA-Atlanta: Min: $112,000 Mid: $160,000 Max: $208,000 NC-Charlotte: Min: $112,000 Mid: $160,000 Max: $208,000 NC-Charlotte: Min: $112,000 Mid: $160,000 Max: $208,000 CO-Greenwood Village: Min: $112,000 Mid: $160,000 Max: $208,000 CA-Irvine: Min: $123,200 Mid: $176,000 Max: $228,800 OR-Portland: Min: $112,000 Mid: $160,000 Max: $208,000 VA-Glen Allen: Min: $112,000 Mid: $160,000 Max: $208,000 UT-Salt Lake City: Min: $112,000 Mid: $160,000 Max: $208,000 TX-San Antonio: Min: $112,000 Mid: $160,000 Max: $208,000 VA-McLean: Min: $123,200 Mid: $176,000 Max: $228,800 NC-Winston Salem: Min: $112,000 Mid: $160,000 Max: $208,000 Required Qualifications 7+ years of information security applications and systems experience 6+ years of information technology applications and systems experience 4+ years of development experience with languages such as Python, Java, Scala, or R 3+ years of design, implementation and governance experience with Artificial Intelligence, Natural Language Processing or Machine Learning architecture 2+ years of experience with databases such as Oracle, DB2, SQL server, or Teradata Desired Qualifications Experience building microservices based on event driven architecture and domain driven design SAST (Static Analysis Software Testing) experience Ability to execute in a fast paced, high demand, environment while balancing multiple priorities Ability to articulate issues, risks, and proposed solutions to various levels of staff and management Ability to translate and present complex technical data across technical and non-technical groups A BS/BA degree or higher in one of the following statistical related fields: applied mathematics, statistics, finance, economics, or engineering Other Desired Qualifications Experience visualizing and presenting data for stakeholders using tools like Tableau, HighCharts, Matplotlib, and Seaborn Experience in call graphs, data flow, compilers. Experience with SciKitLearn, TensorFlow, Keras, XGBoost, RapidMiner, DataRobot, H20 Driverless AI, C3+.ai, Jupyter Notebooks Experience with all aspects of data security as it relates to data science, sensitive data protection, encryption, authentication and authorization Ability to stay current with emerging technologies and industry trends, as well as learn and master new technologies and techniques with excellent problem-solving skills. 4+ years of experience delivering ETL, data warehouse and data analytics capabilities on big-data architecture such as Hadoop 3+ years of software development working with large datasets and data manipulation 3+ years of experience with Big Data or Hadoop tools such as Spark, Hive, Kafka and Map Experience creating and using advanced machine learning algorithms and statistics, including regression, simulation, scenario analysis, modeling, clustering, decision trees, neural networks, NLP, and more Salary Information The salary range displayed below is based on a Full-time 40 hour a week schedule. AZ-PHX-Northwest Phoenix: Min: $112,000 Mid: $160,000 AZ-Chandler: Min: $112,000 Mid: $160,000 CA-SF-Financial District: Min: $134,400 Mid: $192,000 CA-Concord: Min: $134,400 Mid: $192,000 IA-West Des Moines: Min: $112,000 Mid: $160,000 IL-Chicago: Min: $123,200 Mid: $176,000 MA-Boston: Min: $134,400 Mid: $192,000 MN-Minneapolis: Min: $112,000 Mid: $160,000 MO-Saint Louis: Min: $112,000 Mid: $160,000 NY-New York: Min: $134,400 Mid: $192,000 PA-Philadelphia: Min: $123,200 Mid: $176,000 TX-DAL-Downtown Dallas: Min: $112,000 Mid: $160,000 NC-Raleigh: Min: $112,000 Mid: $160,000 GA-Atlanta: Min: $112,000 Mid: $160,000 NC-Charlotte: Min: $112,000 Mid: $160,000 NC-Charlotte: Min: $112,000 Mid: $160,000 CO-Greenwood Village: Min: $112,000 Mid: $160,000 CA-Irvine: Min: $123,200 Mid: $176,000 OR-Portland: Min: $112,000 Mid: $160,000 VA-Glen Allen: Min: $112,000 Mid: $160,000 UT-Salt Lake City: Min: $112,000 Mid: $160,000 TX-San Antonio: Min: $112,000 Mid: $160,000 VA-McLean: Min: $123,200 Mid: $176,000 NC-Winston Salem: Min: $112,000 Mid: $160,000 Street Address AZ-PHX-Northwest Phoenix: 2222 W Rose Garden Ln - Phoenix, AZ AZ-Chandler: 2600 S Price Rd - Chandler, AZ CA-SF-Financial District: 333 Market St - San Francisco, CA CA-Concord: 1755 Grant Street - Concord, CA IA-West Des Moines: 800 S Jordan Creek Pkwy - West Des Moines, IA IL-Chicago: 10 S Wacker Drive - Chicago, IL MA-Boston: 125 High Street - Boston, MA MN-Minneapolis: 550 South 4th St - Minneapolis, MN MO-Saint Louis: 1 N Jefferson Ave - Saint Louis, MO NY-New York: 150 E 42nd St - New York, NY PA-Philadelphia: 101 N Independence Mall E - Philadelphia, PA TX-DAL-Downtown Dallas: 1445 Ross Ave - Dallas, TX NC-Raleigh: 1100 Corporate Center Dr - Raleigh, NC GA-Atlanta: 360 Interstate North Pkwy Se - Atlanta, GA NC-Charlotte: 401 S Tryon St - Charlotte, NC NC-Charlotte: 1525 W Wt Harris Blvd - Charlotte, NC CO-Greenwood Village: 5700 Dtc Pkwy - Greenwood Village, CO CA-Irvine: 2030 Main St - Irvine, CA OR-Portland: 1300 Sw 5th Ave - Portland, OR VA-Glen Allen: 4340 Innslake Dr - Glen Allen, VA UT-Salt Lake City: 299 S Main St - Salt Lake City, UT TX-San Antonio: 4101 Wiseman Blvd - San Antonio, TX VA-McLean: 1751 Pinnacle Dr - Mclean, VA NC-Winston Salem: 809 W 4 1/2 St - Winston Salem, NC Disclaimer All offers for employment with Wells Fargo are contingent upon the candidate having successfully completed a criminal background check. Wells Fargo will consider qualified candidates with criminal histories in a manner consistent with the requirements of applicable local, state and Federal law, including Section 19 of the Federal Deposit Insurance Act. Relevant military experience is considered for veterans and transitioning service men and women. Wells Fargo is an Affirmative Action and Equal Opportunity Employer, Minority/Female/Disabled/Veteran/Gender Identity/Sexual Orientation. Benefits Benefits Summary Visit https://www.wellsfargo.com/about/careers/benefits for benefits information. Reference Number 5579954-24",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-09T20:15:12.000Z"
    },
    "company": {
        "name": "Wells Fargo",
        "link": "https://www.linkedin.com/company/wellsfargo"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 84,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Philadelphia",
        "region": "PA",
        "postal_code": "08051",
        "street_address": null,
        "latitude": 39.95106,
        "longitude": -75.16562
    }
}