{
    "job": {
        "title": "Software Engineer",
        "industry": "",
        "description": "As a Software Engineer at DiscoverLink, you will be directly responsible for the development, enhancement, and delivery of our restaurant industry leading Learning Management System (LMS). You will drive the execution of the full lifecycle development process including the development, testing and implementation of our LMS software. You will be part of a team that develops and maintains a SaaS based LMS including a cross-platform mobile app and components utilizing the latest tools available from Microsoft. The Software Engineer must be self-motivated, detailed-oriented, have a strong work ethic, process driven, possess a ‘can-do’ attitude and have strong written and verbal communication skills. DiscoverLink is now part of CrunchTime! Information Systems, Inc. DiscoverLink, a pioneer in learning and development technology for the hospitality industry was acquired by CrunchTime! in early 2021. The combined organization will provide an end-to-end Performance Management Platform that will not only enable companies to optimize all aspects of their food and beverage operations, but also support the ongoing training and professional enrichment of every team member through an integrated suite of talent management tools. Please visit this link to learn more about the acquisition. Department: Operations Reports To: Director, Software Engineer Working Relationships: Executive Team, Content Development, Client Services, Sales and Marketing Responsibilities Author and review detailed specifications for the development of system components of simple to moderate complexity. Work with a virtual team of developers to create new functionality and tools to deliver best in class software for our restaurant clients. Interface with technical and non-technical personnel and/or team members to finalize requirements, troubleshoot customer issues and bugs, problem solve and request code changes. Assist in the development and design of user acceptance test plans for new product releases. Perform unit testing as part of the development process. Update job knowledge by studying state-of-the-art development tools, programming techniques, and computing equipment; participating in educational opportunities; reading professional publications; maintaining personal networks; participating in professional organizations. Knowledge, Skills and Abilities Required 3 years of experience with C#, MS SQL Server w/ stored procedures and performance optimization 3 years of experience with HTML, CSS, JavaScript + jQuery, JSON Cloud architecture powered by Azure Visual Studio experience Experience working within an Agile framework is strongly preferred Experience creating and using Web APIs Mobile App development preferred Extensive knowledge of compatibility and cross-browser web development Attention to detail and good organization skills Must be able to communicate well with all team members and clients Education, Certifications and Training Required Bachelor's degree in Computer Science preferred or equivalent technical experience. About CrunchTime! CrunchTime! Information Systems, Inc., a Battery Ventures company, provides a comprehensive restaurant back office solution that simplifies and automates food and labor operations. By driving the flow of information throughout the organization, CrunchTime ensures operators make timely, fact-based decisions that help brands reduce food and beverage costs, drive labor efficiencies, and better manage the quality and consistency of their foodservice operations. For over 25 years, CrunchTime has enabled restaurant chains of all sizes to scale efficiently and save money. For more information, visit https://www.crunchtime.com/ About DiscoverLink DiscoverLink, Inc. is the pioneer in learning and development technology for the hospitality industry, offering a unique combination of content and technology solutions supported by extensive industry expertise and unparalleled support. Founded in 2002, DiscoverLink has delivered e-learning solutions for more than 400 hospitality brands by partnering with its clients to customize solutions that combine its library of more than 100 hospitality-specific training courses, with custom-developed courses, and a learning management system optimized for the industry. For more information, visit https://www.discoverlink.com/",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-27T15:06:10.000Z"
    },
    "company": {
        "name": "DiscoverLink",
        "link": "https://www.linkedin.com/company/discoverlink"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "United States",
        "region": null,
        "postal_code": "99999",
        "street_address": null,
        "latitude": 39.50355,
        "longitude": -99.0183
    }
}