{
    "job": {
        "title": "Software Engineer (Entry Level)",
        "industry": "Information Technology and Services",
        "description": "Position Description: As a Software Engineer you will be trained to develop information systems by designing, developing, and installing software solutions to the world class clients we serve. Campus hires begin their careers with TCS in the Initial Learning Program. A fully paid training program designed to provide you with the information and training necessary to succeed at TCS and excel at client sites. However the learning does not stop there! TCS is committed to the continuous growth of its associates, in line with the core value of Learning & Sharing. We offer a Continuous Learning Program that spans technologies, domains, processes and soft skills. In addition, TCS associates are encouraged to undertake certifications and accreditations in a wide range of subject areas. With clients located across the US and globe, TCS can offer great flexibility in work location, excellent career advancement, and a variety of opportunities. TCS’ mentoring, career development, and on-the-job training ensure a smooth transition into your professional life and orient you to our culture, values, vision, and mission. Role: Entry Level Software Developer Location: Ohio Hub - (IN/OH/KY/MI) Job Type: Full Time /Permanent Responsibilities: Develop, create, and modify general computer application software or specialized programs Analyze user needs and develop software solutions Design or customize software for client use to optimize operational efficiency Improve existing systems by analyzing areas of modification Analyze and design databases with application areas Coordinate database development with a team or individually Maintain systems by monitoring, identifying, and correcting software defects Create technical specifications and test plans Update knowledge and skills regularly through in-house and external courses, manuals, and new applications Requirements: B.S/MS in Computer Science (CS), Information Technology (IT Computer Engineering (CE), Informatics, or Software Engineering (SE) Knowledge of basic computer science concepts, programming, and Information Systems Interest and willingness to travel and relocate Knowledge in Java/J2EE Development, C++/C#, .NET The graduation date should be Aug 2020 - Sept 2021.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-10T13:41:16.000Z"
    },
    "company": {
        "name": "Tata Consultancy Services",
        "link": "https://in.linkedin.com/company/tata-consultancy-services"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Ohio",
        "region": "United States",
        "postal_code": "43334",
        "street_address": null,
        "latitude": 40.415535,
        "longitude": -82.70936
    }
}