{
    "job": {
        "title": "Machine Learning Engineer",
        "industry": "Tehnologia informației și servicii informatice",
        "description": "How would you like to work in IT , toying with cutting edge technologies and enjoying your life? At Orange Services , it’s possible! As one of the largest IT Hub within Orange Group, we are working internationally for both Orange corporate functions and country operations. Through a unique combination of know-how and expertise, our teams provide a broad range of IT & Business Solutions . We’ll recruit you from the safety of your home and we’ll prepare you for the challenges of this period – for the time being, our activity is carried out remotely. Come closer to #LifeAtOrange ! What we’re looking for: The Entity Big Data and Artificial Intelligence are today powerful drivers for the Orange Group, enabling us to reinvent customer relationship, optimize and automate the management of our networks, improve the customer experience and provide them with a competitive advantage. In this context, the main mission of the new Data & AI Division is to transform Orange into a \"data driven\" company, to define the Group's standards in terms of Data & AI, and to accelerate the development of use cases, data products and services. This Division will be responsible for the entire Orange Group. Within Data & AI, in the AIT Tools & Technology Department, from Research to Delivery, we provide knowledge extraction and understanding technologies from voice, text, social data and dialogue. We support and accelerate the Group’s transformation thanks to our own cloud infrastructure, security expertise and data. The CARS (Cloud Architecture & Security) team is in charge of supporting this transformation, especially by leveraging the Public Cloud as a catalyst. We are working to assist countries both in terms of expertise (consulting, governance, blue print writing, etc.) and operational projects (move to cloud projects, CloudOps implementation, data warehouse and datalake migration, Cloud security and admin, etc.) as needed. What you’ll be doing: Your main missions will be to: Support the teams of the Business Units and subsidiaries for designing and developing machine learning systems Understanding business objectives and developing models that help to achieve them, along with metrics to track their progress Design machine learning systems Study and develop data science prototypes Research and implement appropriate ML algorithms and tools Run machine learning tests and experiments Verifying data quality Identifying differences in data distribution that could affect performance when deploying the model in the real world Defining validation strategies Train and retrain systems when necessary Training models and tuning their hyperparameters Perform statistical analysis and fine-tuning using test results Analyzing the errors of the model and designing strategies to overcome them Deploying models to production Managing available resources such as hardware, data infrastructure Define deployment strategy (A/B testing, etc) Monitor model performance Collect metrics like number of requests, consumption, etc Collect feedback on the prediction to better iterate on the model Study the training and the evolution of the model over time and set up any correction methods You will be part of an international team (half in France and half in Romania) that leverages collective intelligence and expertise to create value in the countries. It is composed of about 25 people: a dozen Cloud and Data architects, engineers (DevOps, ML, Data/BI, Admin) and security experts. The creation of this new position will allow us to start new projects and reinforce the already existing ones. You will be involved in the different stages of the projects (study, development, production) and you will work on : Gathering the needs of operational entities and proposing solutions that can be based on the services offered by public clouds and the capabilities of internal clouds Developing appropriate strategies to help entities reduce the gap between the ML development and Ml Ops of their AI projects. Supporting the implementation of operational projects using the target infrastructures. Evaluating new technologies and and stay up-to-date What you need to know/have: You have: Understanding of data structures, data modeling and software architecture Good knowledge of machine learning frameworks (like Keras, Tensorflow or PyTorch) and libraries (like scikit-learn) Ability to select hardware to run an ML model with the required latency Familiarity with pipelines orchestration (Kubeflow pipeline, airflow) and deployment infrastructure (knowledge of public Clous stack GCP, AWS, or Azur is a plus) Strong skills in programming languages such as Python, Java or R. Knowledge of CI/CD processes and agility in general Good knowledge of math, probability, statistics and algorithms Advanced GCP certification (like ML Engineer for example) would be a plus You are : Responsive to requests and creative in your responses and proposals Pedagogical, eager to learn and able to share your knowledge- Autonomous in your work and able to make proposals You appreciate team work and you are familiar with AGILE development method You also know the issues of a project planning and to deliver on-time You have : The ability to analyze and solve business problems with a strong results-oriented culture. Excellent ability to work in English in an international context (and French would be a real plus) Synthesis mind and ability to explain things in layman's terms Taste for dialogue with your \"client\", understanding its needs and making it succeed What’s in it for you: Performance Bonuses – biannually, based on your results & the company’s; Loyalty Bonuses, if you extend your stay; Electronic Meal Tickets - as you imagine; Medical & Life insurance for you - facilities for your family, too; #WFH ; Professional GSM subscription; Personal GSM subscription, also [because we believe in communication!]; Special grants on Smartphones & devices; discounts for Orange products & services; Development Platforms - Orange Learning, Trainings, Career Counselling, Coaching & Career plan mentoring; Wellbeing Programs – we support your Zen; & more! Orange Services is about bringing together people and technology. We make IT happen! Come & work for a #TopEmployer company. You could be part of an organization where great colleagues and team spirit support your professional development. Apply and let’s have a remote-talk. At Orange, you can .",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-25T05:09:21.000Z"
    },
    "company": {
        "name": "Orange Services",
        "link": "https://ro.linkedin.com/company/orange-services"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "RO",
        "locality": "Zona metropolitană București",
        "region": null,
        "postal_code": "087080",
        "street_address": null,
        "latitude": 44.44881,
        "longitude": 26.098429
    }
}