{
    "job": {
        "title": "NOPCommerce certified developer - C#, ASP.NET",
        "industry": "Education Management",
        "description": "If you are a NOPCommerce certified developer with experience, please read on! We are currently seeking a NOPCommerce certified developer to help expand our ecommerce platform options. As on of the most prestigious schools in our field in the West Coast we would prefer a local candidate to the Southern California Area but are remote flexible. This role is a full time direct position on our growing team. Salary $80,000 - $120,000 per year What You Need for this Position NOPCommerce certified \" Experience with Microsoft Stack (C#, ASP.NET, MVC) \" eCommerce experience Nice to have \" .NET Core \" Agile experience What's In It for You \" Competitive Base Salary! \" Excellent Benefits Package! \" Flexible Work Schedule! \" Accelerated Career Growth! So, if you are a NOPCommerce certified developer with experience, please apply today! Email Your Resume In Word To Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also: Stephen.Maroda@CyberCoders.com Please do NOT change the email subject line in any way. You must keep the JobID: linkedin : SM1-1640085 -- in the email subject line for your application to be considered.*** Stephen Maroda - Lead Recruiter - CyberCoders Applicants must be authorized to work in the U.S. CyberCoders, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-25T17:42:16.000Z"
    },
    "company": {
        "name": "CyberCoders",
        "link": "https://www.linkedin.com/company/cybercoders"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "San Diego",
        "region": "CA",
        "postal_code": "92161",
        "street_address": null,
        "latitude": 32.71576,
        "longitude": -117.16382
    }
}