{
    "job": {
        "title": "Sr Full-stack Software Engineer",
        "industry": "Marketing and Advertising,Information Technology and Services,Computer Software",
        "description": "Company Description ServiceNow is making the world of work, work better for people. Our cloud‑based platform and solutions deliver digital workflows that create great experiences and unlock productivity for employees and the enterprise. We're growing fast, innovating faster, and making an impact on our customers' and employees' lives in significant and important ways. With over 6,900 customers, we serve approximately 80% of the Fortune 500, and we're on the 2020 list of FORTUNE World's Most Admired Companies.® We're looking for people who are ready to roll up their sleeves and help us build on our incredible momentum, our diverse, engaged workforce, and our purpose to make the world of work, work better. Learn more on Life at Now blog and hear from our employees about their experiences working at ServiceNow. Job Description ServiceNow is currently seeking an exceptional Software Engineer to build amazing experiences for employees everywhere. The successful candidate will work across our applications, delivering new functionality, new products and work across the entire lifecycle from design through to release. What you get to do in this role: Write applications with APIs that developers love to use. You’ll take the time to create code that is easy to understand and maintain across the team. Build high quality software with UX baked in. You’ll be involved through the whole process including requirements gathering, design, implementation, testing, release, and support. Focus on user experience across channels and form factors. You will create experiences than span web, mobile, chat and more to make sure users have seamless experiences with the product. As a senior engineer you’ll set the tone for our team and help your teammates solve problems. You’ll find the gaps we need to fill and help us level up through documentation, training, and friendly discussion. Qualifications To be successful in this role you have: Passion for collaborative, team-oriented software development Empathy for customers and their experiences using the products you build Strong software development skills, preferably in full stack web development. Exceptional debugging, testing, and problem-solving skills 4+ years of full stack development experience Bachelor’s/Master's degree in Computer Science or a related discipline Nice to have: Experience working with component-based JavaScript libraries like React, Polymer, LitElement, Vue, etc. TR21 Additional Information ServiceNow is an Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, creed, religion, sex, sexual orientation, national origin or nationality, ancestry, age, disability, gender identity or expression, marital status, veteran status or any other category protected by law. If you are an individual with a disability and require a reasonable accommodation to complete any part of the application process, or are limited in the ability or unable to access or use this online application process and need an alternative method for applying, you may contact us at +1 (408) 501-8550, or talent.acquisition@servicenow.com for assistance. For positions requiring access to technical data subject to export control regulations, including Export Administration Regulations (EAR), ServiceNow may have to obtain export licensing approval from the U.S. Government for certain individuals. All employment is contingent upon ServiceNow obtaining any export license or other approval that may be required by the U.S. Government.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-15T21:58:06.000Z"
    },
    "company": {
        "name": "ServiceNow",
        "link": "https://www.linkedin.com/company/servicenow"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 48,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "San Diego",
        "region": "CA",
        "postal_code": "92161",
        "street_address": null,
        "latitude": 32.71576,
        "longitude": -117.16382
    }
}