{
    "job": {
        "title": "Principal Software Engineer",
        "industry": "Information Technology and Services,Computer Software,Financial Services",
        "description": "Description About Us Automation Anywhere is a global leader in Robotic Process Automation (RPA), empowering customers to automate end-to-end business processes with software bots – digital workers that perform repetitive and manual tasks, resulting in dramatic productivity gains, optimized customer experience and more engaged employees. The company offers the world’s only web-based and cloud-native intelligent automation platform combining RPA, artificial intelligence, machine learning and analytics right out of the box, to help organizations rapidly start and scale their process automation journey. Its Bot Store is the world's first and largest marketplace with more than 1,000 pre-built, intelligent automation solutions. With offices in more than 40 countries and a global network of 2,000 partners, Automation Anywhere has deployed over 2.4 million bots to support some of the world’s largest enterprises across all industries. For additional information, visit www.automationanywhere.com. Our Opportunity If you love developing new features and play with breadth of technologies, then you have found the right home. We are looking for a hands-on senior architect who can help create innovative and differentiating features in our product taking a holistic solution approach. As part of a very dynamic team, you will play a critical role in envisioning and developing comprehensive solutions as part of our Product strategy. You will work in a high energy, fun and engaging work environment with talented colleagues from diverse backgrounds and experiences. This is a remote role with the ability to work anywhere within the U.S. You Will Make An Impact By Being Responsible For Adding new features to the product at rapid pace. Building prototypes to explore new scenarios and optimizations of existing solutions. Working collaboratively with product management and customer success teams from diverse technical, creative and business backgrounds. Creating and review architecture designs. Providing technical leadership to junior team members when called to do so. Maintaining very high-quality bar from the start and champion continuous quality improvements through automation. Assisting in developing, organizing and maintaining technical practices and actively engage in rolling out improvements. You Will Be a Great Fit If You Have B.S. Computer Science – or other relevant degree. 7+ years’ experience in designing software in a fast-paced environment. Strong knowledge of Java, building highly scalable server components on Windows and Linux Systems Strong knowledge and experience in building for Cloud Platforms (like AWS, and Azure). Must have experience in working with version control system like GIT, SVN etc. and build tools like Gradle and Maven, with continuous integration and delivery. Good command over Data Structures especially XML, JSON operations and processing technologies. Experience with Docker and AWS services - VPC, EC2, IAM, CloudFormation, S3, Route53, etc.. Hands on in OOP, Design Patterns, TDD, Knowledge of Serialization/De-serialization. Strong experience understanding in Databases. Experience in using Windows or Linux API desirable. You Excel In These Key Competencies Ability and willingness to work alone in a self-directed and matured manner. Excellent troubleshooting and debugging abilities for web applications and ability to work under pressure. Strong oral and written communication, with the ability to adapt to the targeted audience. Why Automation Anywhere? At our company each person brings their unique talents to work as a team and make a difference. As the leader in Robotic Process Automation (RPA), we provide a very compelling product where our teams are breaking new ground every day and given an environment to grow their skills and have fun along the way. Our technology is the game changer, and our people give us the edge to better our world and go be great! Automation Anywhere is an Affirmative Action and Equal Opportunity Employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender, sexual orientation, national origin, genetic information, age, disability, veteran status, or any other legally protected basis. All unsolicited resumes submitted to any @automationanywhere.com email address without HR/Recruiting approval, whether submitted by an individual or by an agency, will not be eligible for an agency fee. All unsolicited resumes submitted to any @automationanywhere.com email address, whether submitted by an individual or by an agency, will not be eligible for an agency fee.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-10-18T05:48:00.000Z"
    },
    "company": {
        "name": "Automation Anywhere",
        "link": "https://www.linkedin.com/company/automation-anywhere"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 84,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Atlanta",
        "region": "GA",
        "postal_code": "30355",
        "street_address": null,
        "latitude": 33.748547,
        "longitude": -84.3915
    }
}