{
    "job": {
        "title": "Senior Product Manager - Remote - Drive Decisions!",
        "industry": "Hospital &amp; Health Care",
        "description": "If you are a Senior Product Manager with 4+ years of experience, please read on! Job Title: Senior Product Manager Location: Remote (HQ's in CST) Salary: $120-130K Requirements: BS Degree with 4 + years of experience working with SaaS applications This would be an amazing opportunity for you if you are looking for a dynamic team, fast paced environment with a seat at the table to explore your passion for product. Additional ways in which a candidate may stand out would be: Internal and External \"Client Whisper\" Active Listener and Storyteller Currently has input to the roadmap prioritization Feels comfortable working in a small team environment Healthcare industry experience What's In It for You Vacation/PTO: Unlimited Medical Dental Vision 401k What You Will Be Doing Translates product strategy into detailed business and user requirements and prototypes and works with engineers to implement these features Builds deep customer understanding to represent the customers voice and solve for their needs throughout the product development processes Takes ownership for the day-to-day decisions on analytics features within the products Conducts product research to further understand the competitive landscape, opportunities for growth, and best in class product requirements Partners with internal and external domain experts to highlight current and emerging analytic product trends Assists with go to market strategy of all analytics capabilities while meeting market demand and timetable Evangelizes the product within the market Supports customer acquisition, adoption, and ongoing support activities What You Need for this Position BA or BS is required; degree in a quantitative field of study preferred 5+ years of experience working on SaaS applications and technologies Agile development process experience Has proven success in launching new features and building product adoption and engagement Familiarity with both web and native mobile applications Knows how to build empathy with customers Ability to speak fluently with everyone developers, marketers, sales, customer success, clients, prospects, and stakeholders Strong written and presentation skills Very strong analytical skills, high degree of comfort with statistical concepts, understanding how to use data to drive decisions and workflows SQL skills a plus So, if you are a Senior Product Manager with 4+ years of experience, please apply today! Email Your Resume In Word To Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also: Jenn.Parrella@CyberCoders.com Please do NOT change the email subject line in any way. You must keep the JobID: linkedin : JP10-1643065 -- in the email subject line for your application to be considered.*** Jenn Parrella - Lead Recruiter - CyberCoders Applicants must be authorized to work in the U.S. CyberCoders, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire. CyberCoders will consider for Employment in the City of Los Angeles qualified Applicants with Criminal Histories in a manner consistent with the requirements of the Los Angeles Fair Chance Initiative for Hiring (Ban the Box) Ordinance.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-25T17:27:46.000Z"
    },
    "company": {
        "name": "CyberCoders",
        "link": "https://www.linkedin.com/company/cybercoders"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Nashville",
        "region": "TN",
        "postal_code": "37221",
        "street_address": null,
        "latitude": 36.166344,
        "longitude": -86.77907
    }
}