{
    "job": {
        "title": "Site Reliability Engineer",
        "industry": "Information Technology and Services,Computer Software,Financial Services",
        "description": "Job Description Analyze, design develop, troubleshoot and debug software programs for commercial or end user applications. Writes code, completes programming and performs testing and debugging of applications. Oracle’s Construction and Engineering Global Business Unit (CEGBU) is transforming the world by helping organizations plan, build and operate critical assets. The CEGBU serves over 155,000 customers globally ranging from small subcontractors to the largest general contracting firms and asset owners. CEGBU solutions support our customer’s ability to propose, prioritize & select strategic investments as well as control, manage and execute related projects. CEGBU solutions easily integrate with financial, human resource, supply chain, asset management and other enterprise and niche solutions. We process over 9+ billion dollars in subcontractor payments monthly, manage billions of documents & pieces of correspondence while managing over 8 billion dollars in project value. As a relatively small business unit within Oracle we strive to deliver excellent results by attracting and retaining the best people, delivering the best technology in the industry and focusing on delivering exceptional service to our customers. Primary Position Objective This role’s primary purpose is to work in the Site Reliability Engineering team in delivering cloud solutions that ensure customer and internal requirements are met. This will require a proven ability to deliver on time and on budget complex technical solutions in multiple roles or projects. Previous experience working technical teams and projects at large scale is important. This is a hands-on role. Accountability Core Activities Improving processes and reducing time spent on tasks Automate internal and external processes Continuously improve systems in order to reduce inefficiencies and maximise process capabilities Work with both internal and external stakeholders to build accurate and thorough supportable systems Consult with internal customers to build customer skills and understanding Drive innovation to improve availability, capacity, performance and resilience of existing processes Development of systems and processes Analyse and review documentation of architecture, system relationships and systems flow to ensure effective end-to-end designs Create and share knowledge within the organisation Technical Project Management As Required Managing tools like our JIRA and Git workflows according to best practices Resolve and consult on complex technical issues Additional Duties As reasonably required from time to time with management Experience, Skills And Qualifications Required Skills, Knowledge and Experience A smart team player with a mature mindset Excellent communication skills, both written and verbal Curious, open-minded and always willing to learn Strong skills in Cloud and virtual computing (AWS, Azure, VMware, Oracle) Infrastructure Coding and Development (Puppet, Chef, Ansible, Cloudformation, Terraform etc.) Creating dashboards and monitoring tools (Grafana, ELK stack, Splunk, PagerDuty or OpsGenie) Automation, CI/CD, DevOps concepts (Jenkins, Bamboo) Understand Development processes (SLDC) Analytical thinking Technical troubleshooting and problem solving Stakeholder management Engaging and leading engineering teams Experience in Working with development teams to improve their systems and processes Agile or similar project management methodologies Linux systems engineering background Scripting experience desired (PowerShell, Python, Bash or others) Common Development languages for troubleshooting issues (Java, .Net, HTML, CSS, XML) Network troubleshooting experience across a range of servers, operating systems and network appliances Desirable Skills, Knowledge And Experience Worked with development teams to provide support for services before they go live in production through activities such as design discussions, developing software frameworks, capacity planning and fault tolerance discussion You tend to automate your way out of any problem and thrive on the satisfaction Experience in monitoring systems and a deep understanding of a common monitoring system Provided innovative and creative solutions to improve reliability of services in production The ability to work independently and be a self-starter Capable with collaborating with different teams to improve reliability on highly distributed and scalable platforms Comfortable having conversations that continue to improve availability, stability and performance of the services At Oracle, we don’t just value differences—we celebrate them. We’re committed to creating a workplace where all kinds of people work together. We believe innovation starts with diversity and inclusion. https://www.oracle.com/corporate/careers/culture/diversity.html Analyze, design develop, troubleshoot and debug software programs for commercial or end user applications. Writes code, completes programming and performs testing and debugging of applications. As a member of the software engineering division, you will perform high-level design based on provided external specifications. Specify, design and implement minor changes to existing software architecture. Build highly complex enhancements and resolve complex bugs. Build and execute unit tests and unit plans. Review integration and regression test plans created by QA. Communicate with QA and porting engineering as necessary to discuss minor changes to product functionality and to ensure quality and consistency across specific products. Duties and tasks are varied and complex needing independent judgment. Fully competent in own area of expertise. May have project lead role and or supervise lower level personnel. BS or MS degree or equivalent experience relevant to functional area. 4 years of software engineering or related experience. If you are a Colorado resident, Please Contact us or Email us at oracle-salary-inquiries_us@oracle.com to receive compensation and benefits information for this role. Please include this Job ID: 118325 in the subject line of the email. About Us Innovation starts with inclusion at Oracle. We are committed to creating a workplace where all kinds of people can be themselves and do their best work. It’s when everyone’s voice is heard and valued, that we are inspired to go beyond what’s been done before. That’s why we need people with diverse backgrounds, beliefs, and abilities to help us create the future, and are proud to be an affirmative-action equal opportunity employer. Oracle is an Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability and protected veterans status, age, or any other characteristic protected by law. Oracle will consider for employment qualified applicants with arrest and conviction records pursuant to applicable law.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-18T11:16:03.000Z"
    },
    "company": {
        "name": "Oracle",
        "link": "https://www.linkedin.com/company/oracle"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 48,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "United States",
        "region": null,
        "postal_code": "99999",
        "street_address": null,
        "latitude": 39.50355,
        "longitude": -99.0183
    }
}