{
    "job": {
        "title": "Software Test Engineer",
        "industry": "",
        "description": "Position Summary TIP Technologies, Inc. has an immediate opening for a full-time Software Test Engineer at our Waukesha, WI office. This individual will be responsible for the testing of our TIP QA ™ Enterprise Quality Assurance software to ensure that our software meets or exceeds specified standards and end-user requirements. Responsibilities Engage in the manual testing of the TIP QA ™ software product. Ensure that testing is thorough and rigorous and is accomplished with a high degree of accuracy and efficiency. Perform duties, as defined below, to validate performance and coded-to-design specifications. Duties Develop and execute manual test plans and manual test cases based on functional specifications. Develop and execute regression testing, stress and load testing of the application. Document, troubleshoot, and isolate problems encountered during testing. Work with members of the application development, product management, support, and QA teams to ensure high-quality applications. Enter and verify issues in the Defect Tracking system Suggest improvements with the testing life-cycle. Document evolution of testing scripts for future replication. Identifies, recommends and implements changes to enhance the effectiveness of quality assurance strategies. Performs all other duties as assigned. Experience •\tBachelors Degree, or equivalent experience preferred. •\t2+ years experience in manual software testing, or quality assurance of software applications. •\t2+ years experience developing test plans/strategies, test cases, and test scripts and traceability process of requirements to test cases. •\tExperience planning and estimating testing duration and effort. •\tExperience with database verification testing. •\tKnowledge and experience with QMS/ERP/MRP systems desired. •\tKnowledge and experience with ERP interface (Oracle, SAP, etc.) desired. •\tLoad and stress testing experience desired. •\tCustomer Support experience a plus. Requirements and Competencies •\tMust have a working knowledge of quality assurance methodologies. •\tHave a proven track record on the ability to quickly gain detailed understanding of complex applications and their designs. •\tMust have the ability to work independently with limited supervision. •\tAbility to work both independently and as part of a team and thrive on technical challenges. •\tPossess strong analytical skills. •\tDemonstrates good problem-solving skills in a software test environment. •\tCapable of establishing goals and priorities with an ability to multi-task. •\tSelf starter who can handle a high stress fast paced environment. •\tExcellent oral and written communication skills. •\tAbility to establish priorities and multitask. •\tDedication to going above and beyond during critical test situations. Candidates responding to this posting must currently possess the eligibility to work in the United States. This is a fulltime Salaried Exempt position, with the expectation of 45+ hours per week.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-08T15:26:58.000Z"
    },
    "company": {
        "name": "TIP Technologies",
        "link": "https://www.linkedin.com/company/tip-technologies"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Waukesha",
        "region": "WI",
        "postal_code": "53186",
        "street_address": null,
        "latitude": 43.012806,
        "longitude": -88.235085
    }
}