{
    "job": {
        "title": "Data Scientist/Analytics Entry Level Full Time Positions",
        "industry": "Retail",
        "description": "Description Data Science and Data Analytics Entry-Level Full-Time Positions Please note: Your application will be considered for all of our open college positions in our US locations. Our culture believes in POWERING YOUR POTENTIAL . We provide global opportunities to develop your career, make your community a better place and work with today's most innovative thinkers to solve the world's toughest problems. We believe in flexibility for you to explore your passions while making an impact through meaningful work within our inclusive workforce. That's what #LifeAtCummins is all about. We are looking for a talented Data Science and Data Analytics candidate to join our team for our Corporate Business in Columbus, IN and/or your remote home office. In this role, you will make an impact in the following ways: Data Science Solves analytical problems using quantitative approaches through a combination of analytical, mathematical, and technical skills. Researches, designs, implements, and validates algorithms to analyze diverse sources of data to achieve project specific outcomes by leveraging statistical and predictive modeling concepts. Leverages data science methodology to solve business problems. Creates individual algorithms using statistical methodologies through the use of statistical programming languages and tools. Partners with domain experts to verify model capabilities. Implements statistical techniques to clean, prepare and profile the data prior to deeper analysis. To be successful in this role you will need the following: Abstract Reasoning Data Mining Data Reduction Predictive Modeling Statistical Foundations Programming Customer Focus Global Perspectives Data Analytics Interprets data and turns it into information which can offer ways to improve how the data is used within the business, thus affecting business decisions. Gathers information from various sources and interprets patterns and trends. Develops reports and dashboards to visualize findings. Conducts descriptive and diagnostic analytics on data sources. Applies machine learning and machine learning tools on data and metadata to improve data quality. Identifies patterns and trends in data sets. Creates reports and dashboards on analysis results using business intelligence technologies. Develops data profiles for data tables and elements in the data lake. Creates data catalog entries, ensures data catalog metadata quality. Analyzes diverse data sets to identify data quality, coherency and integrability issues and reduce data redundancy. Collaborates to develop data cleansing methods and rules. Assists in creation and maintenance of documentation of key decisions, rules, controls, and processes. To be successful in this role you will need the following: Data Literacy Data Profiling Data Communication and Visualization Data Quality Data Analytics Customer Focus Tech Savvy Qualifications Degree Programs Considered: Bachelor's, Master's, PhD Major Programs Typically Considered: Information Technology; Computer and Information Science; Cyber Security; Information Systems; Computer Science; Informatics; Management Information Systems & Business with strong background I Computers Cummins Full Time Requirements College, university or equivalent technical experience required Minimum 3.0 GPA preferred Must be able to complete 40 hours per week 0-2 years in a position/internship relating to your field of study preferred Compensation And Benefits Base salary rate commensurate with experience. Additional benefits vary between locations and include options such as our 401(k) Retirement Savings Plan, Cash Balance Pension Plan, Medical/Dental/Life Insurance, Health Savings Account, Domestic Partners Coverage and a full complement of personal and professional benefits. Cummins and E-verify At Cummins, we are an equal opportunity and affirmative action employer dedicated to diversity in the workplace. Our policy is to provide equal employment opportunities to all qualified persons without regard to race, gender, color, disability, national origin, age, religion, union affiliation, sexual orientation, veteran status, citizenship, gender identity and/or expression, or other status protected by law. Cummins validates right to work using E-Verify. Cummins will provide the Social Security Administration (SSA) and, if necessary, the Department of Homeland Security (DHS), with information from each new employee's Form I-9 to confirm work authorization. Ready to think beyond your desk? Apply for this opportunity to start your career with Cummins today. careers.cummins.com Not ready to apply but want to learn more? Join our Talent Community to get the inside track on great jobs and confidentially connect to our recruiting team: http://connect.find.ly/cummins Job SYSTEMS/INFORMATION TECHNOLOGY Primary Location United States-Indiana-Columbus-US, IN, Columbus, Corporate Office Building Job Type College / University Recruitment Job Type Exempt - Entry Level Job Posting Sep 15, 2021, 6:30:59 PM Unposting Date Ongoing Req ID: 210004A3",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-10-17T16:21:40.000Z"
    },
    "company": {
        "name": "Cummins Bridgeway",
        "link": "https://www.linkedin.com/company/cummins-bridgeway"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Columbus",
        "region": "IN",
        "postal_code": "47201",
        "street_address": null,
        "latitude": 39.201397,
        "longitude": -85.92103
    }
}