{
    "job": {
        "title": "Ecommerce Marketing Strategist - NetSuite/Data Analysis",
        "industry": "Construction,Information Technology and Services,Financial Services",
        "description": "If you are a Ecommerce Marketing Specialist with experience, please read on! Job Title: Ecommerce Marketing Specialist Location: REMOTE Salary: $65-85K Requirements: Bachelors Degree with 3+ years of Ecommerce and Email Marketing Experience This would be an amazing opportunity for you if you are looking a growing team in a dynamic industry! Additional ways in which a candidate may stand out would be: WordPress Enjoys working with data and a proven analytical mindset Personally passionate about digital marketing, web design, behavioral economics and psychology What's In It for You Vacation/PTO Medical Dental Vision What You Will Be Doing Work with IT & Systems to execute and manage digital marketing plans Data analysis - Analysis of campaign and customer data to gain insights leading to improvement in marketing performance Google Analytics to diagnosis performance issues and identification of actions to resolve Drive improvement in copy, messaging, and design across web and email channels Conversion rate optimization of eCommerce website and email marketing activity Define marketing technology requirements, assist in evaluating options & delivering solutions Translate marketing needs into the language of IT specialists Create business cases and deliver on agreed ideas Create campaign strategy & briefs to support new and existing products What You Need for this Position Bachelors Degree preferred 2+ years CRM experience - NetSuite preferred 3+ years eCommerce and email marketing Data driven marketing background Excel skills, including formulae and pivot tables Google Analytics - strong experience Solid understanding of split testing strategy, sample sizes & statistics Good knowledge of research tools, including running Surveys, Hotjar or similar Google Optimize or other web split test tools - prior experience Web design, user experience and branding projects Internet and digital marketing technology So, if you are a Ecommerce Marketing Strategist with 3+ years of experience, please apply today! Email Your Resume In Word To Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also: Jenn.Parrella@CyberCoders.com Please do NOT change the email subject line in any way. You must keep the JobID: linkedin : JP10-1642036 -- in the email subject line for your application to be considered.*** Jenn Parrella - Lead Recruiter - CyberCoders Applicants must be authorized to work in the U.S. CyberCoders, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-31T07:18:51.000Z"
    },
    "company": {
        "name": "CyberCoders",
        "link": "https://www.linkedin.com/company/cybercoders"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Cheshire",
        "region": "CT",
        "postal_code": "06408",
        "street_address": null,
        "latitude": 41.49841,
        "longitude": -72.90008
    }
}