{
    "job": {
        "title": "Sr Site Reliability Engineer",
        "industry": "Automotive,Renewables &amp; Environment,Utilities",
        "description": "Tesla Cloud Engineering group is looking for a Senior Site Reliability Engineer to help lead, design and build the next generation of our large-scale Cloud offering. You will be working on the core compute platforms and infrastructure in the next generation tech stack. What You Provide Desire to learn and adapt . Our agile team has a lot of projects going on at once, and you'll have the opportunity to learn to navigate the code and features. You'll constantly be learning new areas and new technologies. Passion . Our customers are passionate about Tesla, and we want the same from our engineers. We want you to actively own your work and be excited about your projects. Ability to work with multiple programming languages . We have code in several languages, ranging from Go to Python to Shell. Drive for automation . You constantly consider, \"How can I automate this manual process?\" You will use Terraform to manage various cloud infrastructure resources. An understanding of Infrastructure-as-Code (IaC) and declarative configuration languages as preferred. Knowledge of technical excellence. You know continuous delivery, automated testing , security methodologies, system performance, and disaster recovery concepts. Cloud experience . Building and scaling secure infrastructure on different cloud providers is a plus. You will use AWS and GCP. Operational excellence. Data excites you and you make decisions based on numbers rather than assumptions. If an issue arises, you strive to be alerted before our customers notice. Keeping calm and carrying on . Capable in navigating through a product outage, skilled in identifying performance bottlenecks, spotting anomalous system behavior, and figuring out the root cause of incidents. Linux proficiency . Excited to apply system administration experience and comfort in developing or creatively addressing challenges via a linux/unix console. Experience . Eight or more years of related technical work in industry. Though not required, also awesome if you have experience in containerization such as Docker and Kubernetes, have built scalable secure services on cloud providers such as AWS, and have some Splunk expertise. What We Provide Opportunities to develop and grow as an engineer . We are always expanding into new areas, working with open-source projects and contributing back, and exploring new technologies. A team of incredibly capable and dedicated peers , all the way from engineering to product management and customer support. Growth and mentorship . We believe in growing engineers through ownership and leadership opportunities. We also believe that mentors help both sides of the equation. A stable, collaborative, and supportive work environment. We work in an open environment, work together to get things done, and adapt to the changing needs for the team. Balance . We don't expect people to work 12-hour days. We want you to be successful outside of work too. Want to work from home sometimes? No problem. We trust our colleagues to be responsible with their time and commitment and believe that balance helps cultivate a positive environment. Fun . We have frequent group outings and team building events. We are committed to having every employee want to give it their all, be respectful and a part of the family, and have a smile on their face while doing it.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-14T18:06:04.000Z"
    },
    "company": {
        "name": "Tesla",
        "link": "https://www.linkedin.com/company/tesla-motors"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 96,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Fremont",
        "region": "CA",
        "postal_code": "94537",
        "street_address": null,
        "latitude": 37.5502,
        "longitude": -121.98083
    }
}