{
    "job": {
        "title": "Software Engineer - Campus Entry-Level",
        "industry": "Information Technology and Services,Computer Software,Financial Services",
        "description": "About The Role PEAK6 is a leading investment firm headquartered in Chicago. More than 20 years ago, we were one of the first firms to develop sophisticated proprietary technology in our trading business. PEAK6 was brought to life by the idea that the development of integrative technology can improve how business is done. The passion for that idea powers our firm still. As a Software Engineer at PEAK6, you are free to explore unique solutions and try fresh ideas that may benefit our financial services and trading businesses as well as our other ventures. You’ll collaborate with some of tech’s sharpest minds to solve the firm’s ever-changing and exciting challenges. Working in tech at PEAK6 means that you’ll always be presented with a variety of new possibilities as you continue to enhance your skills. What You’ll Do All Day Develop innovative tools to enhance our proprietary trading platform. Examples include automated trading strategies, low-latency market data streams, data analysis, and visualization tools Work closely within and across small development teams and our trading and support teams Work with a variety of languages/frameworks, such as Java, Python, Go, JavaScript, HTML/CSS, and React, and technologies such as Microsoft SQL Server, PostgreSQL, Redis, MongoDB, Airflow, Kafka, Kubernetes, and Docker Attend trading and options training to learn about options trading and financial markets Rotations with our development teams aimed at team placement with a mentor to guide you and help you grow your skills Experience Agile software development lifecycle, continuous integration and delivery Collaborate with business stakeholders and end users on projects Operate in a delivery-focused, fast-paced work environment where adapting to change is a must You’ll gain loads of experience in this role but before you do, you should have: Availability for an August 2022 start date Competent software development skills in a modern object-oriented programming language and the ability to learn new languages and technologies quickly Desire and drive to learn about FinTech We’d Love To Hear About Exceptional problem-solving skills with high attention to detail Curiosity to learn and a drive to improve Ability to thrive in collaborative environments Effective communication skills Demonstrated leadership ability If you have an interest in financial markets Due to the unprecedented situation of COVID-19, PEAK6 has decided to protect our current and future employees by managing our business remotely. This is inclusive of interviewing, onboarding and each role day-to-day. Please consider that our roles will not be remote long-term and will return to an office setting once we're safe to do so following the guidance of local health authorities and the CDC.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-28T23:34:03.000Z"
    },
    "company": {
        "name": "PEAK6",
        "link": "https://www.linkedin.com/company/peak6-investments"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Chicago",
        "region": "IL",
        "postal_code": "60654",
        "street_address": null,
        "latitude": 41.88323,
        "longitude": -87.6324
    }
}