{
    "job": {
        "title": "Software Engineer",
        "industry": "Information Technology and Services,Computer Software,Financial Services",
        "description": "Company Description Experian is seeking an Cloud Engineer to join our CIS Product Delivery team. This is a great opportunity for someone with 4-5 years of programming experience to learn on the job, and to gain Cloud/AWS experience. If you are passionate about cloud solutions, cloud management, are highly organized and detail oriented with AWS experience (or the desire to learn it) then this could be the perfect role for you. About Experian Experian is the world’s leading global information services company, unlocking the power of data to create more opportunities for consumers, businesses and society. For five years in a row, we have been named in the Top 100 “World’s Most Innovative Companies” by Forbes Magazine. With a focus on our employees, we were rated the #1 Top Workplace by the Orange County Register. Experian Consumer Information Services is redefining the way our clients do business within all aspects of the customer credit lifecycle. Fueled by best-in-class data and innovative technology we help businesses make smarter decisions, identify consumers, make decisions on loans, market to prospects and collect. About This Role You need to be intimately familiar with Amazon Web Services driving cost-optimization of cloud solutions. You will meticulously review current AWS resources allocation, define governance strategies, and design/manage cloud visualizations. You’ll be driving improvements in AWS based on product and engineering feedback. The work you’ll be doing is engineering, but your goal is Cloud optimization. In addition, you’ll: Collaborate with Engineering, Finance and Product teams around AWS costs optimizations Implement cost optimization and governance strategies Develop best practices and methodologies for customers to optimize for costs Drive Cloud governance compliance requirements (tagging, finance etc.) Drive cross team collaboration to surface and share best practices related to AWS optimizations Present your findings to Technology and Finance leadership Drive Cloud Platform SRE functionality with hands-on coding Drive Platform Security related activities (access management, new account onboarding etc.) What Your Background Looks Like 2+ years of experience with the development, implementation and use of systems/tool utilized for sales billing and Cloud optimization Strong understanding of AWS concepts and AWS cloud management experience is a must Experience in a cross-functional team facing role or working within a team at an enterprise to optimize AWS cloud spending 2-3 years of programming experience with Python and Java preferred 2+ years of experience using Microsoft Excel with the ability to analyze large data sets, create financial models and simplify complex data Excellent written and verbal communication skills Demonstrate a proven ability to influence others, strong analytical skills, and a proven track record of taking ownership, leading data backed analyses and influencing results Solid understanding of the AWS Pricing model The ideal candidate will have experience with AWS cost optimization tools and/or 3rd party cost optimization solutions, AWS billing and Reserved Instances, AWS Spot Instances, AWS consolidated billing etc. AWS Certified Developer, or Solutions Architect certification preferred Understanding of Platform SRE and Infrastructure Development & Operations Experience with Cloud Health, Cloud trail is a plus Perks Three weeks of vacation to start, five sick days and two volunteer days (plus eleven paid holidays) This is a bonus eligible position Employee stock purchase program and 401K matching Wellness initiatives, online discounts, employee discounts, pet insurance and more Additional Information All your information will be kept confidential according to EEO guidelines. Experian is proud to be an Equal Opportunity and Affirmative Action employer. Our goal is to create a thriving, inclusive and diverse team where people love their work and love working together. We believe that diversity, equity and inclusion is essential to our purpose of creating a better tomorrow. We value the uniqueness of every individual and want you to bring your whole, authentic self to work. For us, this is The Power of YOU and it ensures that we live what we believe.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-30T23:58:00.000Z"
    },
    "company": {
        "name": "Experian",
        "link": "https://www.linkedin.com/company/experian"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 48,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Costa Mesa",
        "region": "CA",
        "postal_code": "92626",
        "street_address": null,
        "latitude": 33.663857,
        "longitude": -117.90476
    }
}