{
    "job": {
        "title": "Data Scientist",
        "industry": "Information Technology and Services,Computer Software,Financial Services",
        "description": "100% Remote Long Term Contract 65/hr Bill Rate Strong AWS, Python, and NLP all musts. Key Responsibilities Identify, assess, and design specific data and analytical capabilities into our core businesses. Scan a broad spectrum of internal and external, structured and unstructured data sources to define the data needed to test hypotheses and to analyze key themes and provide recommendations. Execute against function strategy and priorities, focusing on areas that drive customer experience and business performance. Coordinate and communicate effectively and efficiently with colleagues and executive leadership across a range of geographies and cultures. Establish and maintain reciprocal relationships throughout the organization. Continuously learn from external leaders in data science and machine learning, to ensure that Spencer Stuart is bringing to bear outstanding techniques, algorithms and technologies. Partner with IT to deliver analytical outputs to production. Demonstrate commitment to continuous technical education and personal development and share knowledge with team members and business partners. Ideal Education and Experience Bachelor's degree in mathematics, statistics, computer science or a related technical field is required. Advanced degree preferred. Must have 3-5 years of experience in the field of data science Validated ability to analyze business problems and identify appropriate analytical solutions. Experience using advanced analytics techniques in a business context. Experience managing and manipulating complex structured and unstructured data. Technical Depth Demonstrated ability to appropriately select and execute analytical methods based on the business problem. Processing, cleansing, and verifying the integrity of data used for analysis. Enhancing data collection procedures and extending company's data with third party sources of information when needed. Applying Data mining techniques. Proficient in analytical programming, including Python, R and SQL. Experience applying statistical modeling, machine learning algorithms, including, but not limited to, classification models and recommender systems, NLP, and other quantitative techniques. Practical experience with version control. Experience in AWS as an analytical computing platform preferred. Assists in the documentation of requirements, use cases, user stories, test plans, and test scripts required to ensure data science solutions are developed and tested to meet fit intended purpose, meet business needs and are operationally sustainable. Critical Capabilities Acts to meet and exceed goals, seizing opportunities to innovate. Translates broad data strategies into clear, specific objectives and plans for our corporate and executive search professionals. Thinks ahead from a strategic perspective, while focusing on an iterative approach to data capabilities development. Builds outstanding solutions across Spencer Stuart, with attention to detail and accuracy. Ability to thrive in an environment that requires flexibility and multi-tasking, takes initiative, and works with a high level of independence.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-05T08:22:39.000Z"
    },
    "company": {
        "name": "Saxon Global, Inc.",
        "link": "https://www.linkedin.com/company/saxonglobal"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Irving",
        "region": "TX",
        "postal_code": "75063",
        "street_address": null,
        "latitude": 32.813877,
        "longitude": -96.949936
    }
}