{
    "job": {
        "title": "Entry- Level Developer/Software Test Engineer",
        "industry": "Information Technology and Services,Computer Software,Internet",
        "description": "Company Description Who We Are: RTTS is the premier pure-play Quality Assurance and testing organization that specializes in Test Automation. Based in midtown Manhattan and serving Fortune 500 companies throughout the world since 1996, RTTS has assisted 700+ companies reach their continuous testing goals. RTTS also developed Query Surge , QuerySurge is the smart Data Testing solution that automates the data validation & testing of Big Data, Data Warehouses, and Business Intelligence Reports. In forging strategic partnerships with leading software vendors IBM, Microsoft, Oracle, Cloudera, Teradata, SAP and other best-of-breed software providers, RTTS offers the foremost end-to-end solution that ensures application functionality, performance, and data validation and verification. For more information visit us at www.rttsweb.com. Job Description What You’ll Be Doing: Other Responsibilities Include Using your strong analytical and coding skills, you’ll be responsible for implementing custom solutions using cutting edge automated functional and performance quality assurance tools to support complex software applications. Work alongside development teams to verify application functionality, usability and scalability. Assist application owners with regression testing, script testing, user acceptance testing and test architecture support. Develop and maintain reusable code libraries to help build streamlined and efficient development/testing processes. Evaluate and analyze automation metrics, providing feedback to developers, system architects and subject matter experts. Assignments vary in length depending on our clients’ needs, providing you with the opportunity to learn new technologies and gain valuable exposure to many areas of business while working with client teams and experienced RTTS mentors. Qualifications What You Need: Other Qualifications Include Must possess an undergraduate or graduate level degree with a concentration in Computer Science, Information Technology or a related field. Proficiency in any mainstream programming language; knowledge of Java, C++, C#, or C is a plus. Ambition to learn and utilize emerging technologies while working in a stimulating team environment. Professional appearance and the ability to communicate complex technical information in a clear and tactful manner. Additional Information What We Offer $60-70K, depending on experience. Excellent benefits package including medical, dental, 401K, paid vacation and holidays, continuous learning and more. You can expect: Ongoing development of your skills working with web technologies, server-side software and database platforms. The most comprehensive up-front training program in the industry. One-on-one mentoring is provided, an ideal fit for recent graduates and career changers. A challenging, supportive, educational and fun work environment. Our office culture encourages innovation and professional growth. All your information will be kept confidential according to EEO guidelines. What Are You Waiting For? If you’d like to start your IT career with RTTS, you should know that: The position is available at our Midtown Manhattan office. Applicants for employment must be authorized to work in the U.S. You may have to travel to client sites in and around the metro area. You must live within 40 miles of our office location and possess a valid driver’s license and have access to a car. Please enclose resume and cover letter. Applications without a cover letter will not be considered.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-13T00:00:00.000Z"
    },
    "company": {
        "name": "RTTS",
        "link": "https://www.linkedin.com/company/rtts"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "New York",
        "region": "NY",
        "postal_code": "10132",
        "street_address": null,
        "latitude": 40.713047,
        "longitude": -74.00723
    }
}