{
    "job": {
        "title": "Sr. Data Scientist, Healthcare &amp; Lifesciences",
        "industry": "Information Technology and Services,Computer Software,Financial Services",
        "description": "Fractal Analytics is a strategic AI partner to Fortune 500 companies with a vision to power every human decision in the enterprise. Fractal is building a world where individual choices, freedom, and diversity are the greatest assets. An ecosystem where human imagination is at the heart of every decision. Where no possibility is written off, only challenged to get better. We believe that a true Fractalite is one who empowers imagination with intelligence. The Artificial Intelligence and Machine Learning (AIML) group at Fractal is looking for a Sr. Data Scientist for our Healthcare practice who can, depending on the needs of the project, adapt to: 1) contributing as an individual technical specialist on complex problems; and 2) manage and mentor other data scientists to deliver projects. Key attractions of this opportunity: The opportunity to design & deploy cutting edge solutions for the some of the biggest names in the Insurance industry and consult their DS leadership. Learning about and consulting on the productionizing of AI/ML solutions using industry standard tools for cloud & ML engineering. Working with multi-cultural, cross-functional teams (Design, Engg., Consulting) distributed across the world. A culture that celebrates diversity, encourages initiative and agility, and enables continuous learning on the job. Job Responsibilities: Project Delivery (70 - 85%) Consult clients to define and refine business objectives towards data-driven decision problems Research internal & external tools & methodologies to develop AIML solution concepts for client problem briefs.. Work with client & Fractal teams to rapidly prototype innovative AIML solutions including: data & requirements gathering, technological scoping and architecture, code implementation, insights delivery and recommendations. Work with cross-functional client & Fractal teams to scale AIML solutions to production systems. Strong communication skills to effectively translate complex analytical models into recommendations for business partners. Org building (15 - 30%) Mentoring junior Data Scientists on technical skills & career progression. Building & teaching an AIML skill specialization for the Healthcare practice. Gathering project learnings and developing them into repeatable / reusable assets & IP for the AIML & Healthcare team Supporting AIML team growth through interviewing, networking, and industry representation. Technical skills: Strong programing skills in at least one numerical computing language: R/Python. Strong experience in building Machine learning (ML) models and experience in deploying solutions in big data production systems on premise or cloud. Working understanding in areas of machine learning methods and traditional statistical analysis, Bayesian modeling, traditional ML, Deep Learning, RL and optimization Working knowledge of coding best practices – version control, code linting, unit testing, etc. Working knowledge of AWS Cloud environments. Ability to understand and work with large disparate data sets and transform the information into clear insights for the business. Behavioral skills: Intellectual agility & stamina – ability to learn adjacent technical skills quickly and continuously, ability to give and use constructive feedback effectively. Scientific temperament – ability to research, build & verify hypotheses / mental models about technical & organizational problems that need to be solved. Ambition and flexibility – ability to start by oneself, own outcomes, and doing what it takes. Empathetic collaboration – ability to empathize with clients & teams across functional roles, geographies, and cultures. Specific skills – great to have: Prior knowledge and experience in the Medical Device and MedTech industry will be a strong plus in this role. Previous experience in the consulting industry in client facing roles. Experience in deploying AI/ML solutions in big data production systems on premise or AWS Cloud. Experience & Education: 5 or more years of demonstrated experience in driving real-world value by solving problems requiring complex quantitative reasoning using data & modeling techniques. Graduate/under-graduate degree in any of the quantitatively rich disciplines such as Computer Science / Mathematics / Physics / Operations Research [experience trumps degree]. Mandatory Skills: AWS, Machine Learning, Neural Network, SQL, Python, Linux OS Deep Learning Traditional Statistical analysis, Bayesian modeling Individuals seeking employment at Fractal.ai are considered without regards to race, color, religion, national origin, age, sex, marital status, ancestry, physical or mental disability, veteran status, gender identity, or sexual orientation.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-10T05:22:09.000Z"
    },
    "company": {
        "name": "Fractal",
        "link": "https://www.linkedin.com/company/fractal-analytics"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "New York",
        "region": "NY",
        "postal_code": "10132",
        "street_address": null,
        "latitude": 40.713047,
        "longitude": -74.00723
    }
}