{
    "job": {
        "title": "Data Scientist",
        "industry": "Biotechnology,Hospital &amp; Health Care,Pharmaceuticals",
        "description": "Responsibilities : - Implement and maintain the effectiveness of the data quality system. - Review Draft Protocols and provide comments on aspects of study that impact study set up, data collection and transmission, and workflow and implications for external client groups Sponsor/vendor). - Ensure the design of clinical data collection and management systems used by the ACPRU in the conduct of clinical research trials accurately reflect the protocol requirements and needs of external client groups (Sponsor/vendor). - Aligns DS study team with program- and study-level analytics strategies. For assigned studies, works with Data and Statistical Sciences (DSS), Data Warehouse Analyst, Statistical Programmer and Statistician to ensure the context, accuracy and timeliness of clinical data collection and management systems are optimized - Connects with cross-functional teams to design work product and as an analytics consultant - Contributes to study execution 'lessons learned' across functions - If assigned, assist in the alignment of data management systems used by the ACPRU with additional trial systems (e.g., EDC, IRT, ePRO). - Liaises with DSS, Monitors, Statistics or others involved to facilitate discrepancy management in clinical trials . Qualifications : - Bachelor's Degree - 2 years in Clinical Research - 2 years experience with Clinical research data systems - Electronic source systems experience preferred Location : Onsite role at North Chicago, IL research, Analytics,clinical",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-06T21:20:47.000Z"
    },
    "company": {
        "name": "Collabera Inc.",
        "link": "https://www.linkedin.com/company/collabera"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Chicago",
        "region": "IL",
        "postal_code": "60654",
        "street_address": null,
        "latitude": 41.88323,
        "longitude": -87.6324
    }
}