{
    "job": {
        "title": "Site Reliability Engineer (Remote)",
        "industry": "Information Technology and Services,Computer Software,Internet",
        "description": "Company Description Daxko powers health & wellness throughout the world. Every day our team members focus their passion and expertise in helping health & wellness facilities operate efficiently and engage their members. Whether a neighborhood yoga studio, a national franchise with locations in every city, a YMCA or JCC--and every type of organization in between--we build solutions that make every aspect of running and being a member of a health and wellness organization easier and delightful. Job Description The Site Reliability Engineer is a role for the motivated coder/hacker/engineer that wants to solve problems at the root cause, in an elegant and sustainable way. If that's you, then you will be an instrumental part of our TechOps team, which exists to build and support the foundational tools that our product teams use to build products our customers love and trust. We care deeply about our delivery pipeline being simple, reliable, consistent, and fast. You will be successful in this role if you have a deep love for automation, building scalable systems, embracing new technologies, and sharing with teammates. The Site Reliability Engineer reports to the Director, Technical Operations. You Will Also Apply cloud (AWS, VMWare) computing skills to deploy upgrades and fixes Design, develop, and implement software integrations based on user feedback Troubleshoot production issues and coordinate with the development team to streamline code deployment Implement automation tools and frameworks (CI/CD pipelines) Analyze code and communicate detailed reviews to development teams to ensure a marked improvement in applications and the timely completion of projects Collaborate with team members to improve the company’s engineering tools, systems and procedures, and data security Optimize current architecture Design and build highly available production systems Conduct systems tests for security, business continuity, performance, and availability Develop and maintain design and troubleshooting documentation Participate in rotating on-call responsibilities for the platform Qualifications Strong Knowledge AWS Public Cloud services and solutions Extensive experience with automation tools such as Terraform, Chef, or Ansible Ability to maintain .NET and Java web applications Strong Linux and Windows management background Experience in architecting solutions and a deep understanding of application-status monitoring Strong command of software-automation production systems (Jenkins and Selenium) Script writing abilities using Perl/Python/Java/Bash Expertise in software development methodologies Working knowledge DevOps tools like Git and GitLab Working knowledge of Microsoft SQL and MySQL Problem-solving skills and attitude Ability to work independently and as part of a team Bachelor’s degree in a technical discipline OR equivalent experience Two (2) to three (3) years of relevant experience Bonus Points For AWS Cloud Architect experience Automation with Terraform Worked with .NET SaaS solutions Maintaining high availability systems CI/CD process engineering Additional Information Daxko is dedicated to pursuing and hiring a diverse workforce. We are committed to diversity in the broadest sense, including thought and perspective, age, ability, nationality, ethnicity, orientation, and gender. The skills, perspectives, ideas, and experiences of all of our team members contribute to the vitality and success of our purpose and values. Some Of Our Favorites Include We truly care for our team members, and this is reflected through our offices, benefits, and great perks. Flexible paid time off Affordable health, dental, and vision insurance options Monthly fitness reimbursement 401(k) matching New-Parent Paid Leave 1-month paid sabbatical every 5 years Casual work environments All your information will be kept confidential according to EEO guidelines.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-23T00:00:00.000Z"
    },
    "company": {
        "name": "Daxko",
        "link": "https://www.linkedin.com/company/daxko"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Birmingham",
        "region": "AL",
        "postal_code": "35226",
        "street_address": null,
        "latitude": 33.522858,
        "longitude": -86.80771
    }
}