{
    "job": {
        "title": "Data Scientist/Machine Learning Engineer",
        "industry": "Food &amp; Beverages,Retail",
        "description": "TITLE: Data Scientist/Machine Learning Engineer LOCATION: Remote Duration: 6-12 month to perm MUST HAVES: 5+ Python software development for composition and modularity, debugging and following tracebacks Strong stats background and concepts including hypothesis testing, correlation, R squared, P-value Experience with Pandas, NumPy, SciPy, Pytorch Tensorflow functional API, deep learning Mathematics of machine learning- linear algebra, multivariable calculus SQL querying Hyperparameter optimization, regularizing regression models PLUSSES: Masters or PhD- HIGHLY preferred!! Ecommerce experience DAY TO DAY: A company is looking for a Data Scientist/Machine Learning Engineer to sit remotely within the US. We follow industry standard practices for managing, collaboration, deployment and testing. We deploy and interact with resources on AWS. Responsibilities include: • Analyze large data sets by quantifying the data quality, identifying particular patterns, and visualizing results • Understand business problems and identify the right data sets and ML/Statistical approach to produce the desired outcomes • Adapt to account for changes and be able to propose alternative approaches • Ideate and develop analytics and modeling solutions cross-functionally to build customized, long-term, and sustainable solutions • Provide critical thought leadership and enhance organizational capabilities • Own machine learning pipelines end-to-end • Write production-grade machine learning code using standard engineering practices and deploy models to production • Improve codebase and lead/participate in code reviews with Research Scientists and Data Scientists • Help non-engineers develop their engineering skills • Mentor junior team members and contribute to a culture where everyone is valued",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-16T23:55:25.000Z"
    },
    "company": {
        "name": "Insight Global",
        "link": "https://www.linkedin.com/company/insight-global"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Atlanta",
        "region": "GA",
        "postal_code": "30355",
        "street_address": null,
        "latitude": 33.748547,
        "longitude": -84.3915
    }
}