{
    "job": {
        "title": "Cloud Software Engineer",
        "industry": "Information Technology and Services,Computer Software,Financial Services",
        "description": "Who is Equifax? At Equifax, we believe knowledge drives progress. As a global data, analytics and technology company, we play an essential role in the global economy by helping employers, employees, financial institutions and government agencies make critical decisions with greater confidence. We work to help create seamless and positive experiences during life’s pivotal moments: applying for jobs or a mortgage, financing an education or buying a car. Our impact is real and to accomplish our goals we focus on nurturing our people for career advancement and their learning and development, supporting our next generation of leaders, maintaining an inclusive and diverse work environment, and regularly engaging and recognizing our employees. Regardless of location or role, the individual and collective work of our employees makes a difference and we are looking for talented team players to join us as we help people live their financial best. The Perks of being an Equifax Employee? We offer excellent compensation packages with market competitive pay, comprehensive healthcare packages, 401k matching, schedule flexibility, work from home opportunities, paid time off, and organizational growth potential. Grow at your own pace through online courses at Learning @ Equifax. What You’ll Do You will design, develop, test, deploy, maintain and improve software You will manage individual project priorities, deadlines and work you're doing Design and Develop highly scalable, always-on , secure and resilient cloud native applications in GCP using Java Qualification Master's or Bachelor’s degree in required Skills include object-oriented analysis, design, and programming experience 5 +experience with Java / J2EE design and development experience, Spring Framework, Spring Boot, Microservices, Response UI Frameworks like Angular 8 Has some knowledge of modern software development life cycles including CI / CD, Source code control management systems (e.g. SVN/Git, Subversion) and build tools like Maven, Design patterns, Agile environments (e.g. Scrum, XP) Extra Points for any of the Following Experience in Cloud services is preferred. Working knowledge in Google Cloud Platform is desirable Experience with developing for Linux environments Experience working in an agile environment Success Attributes of an Equifax employee; does this describe you? Accountability Bravery Curiosity Collaboration Think and act differently Trust Ownership Decide-Execute-Ship We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. If this sounds like somewhere you want to work, don’t delay, apply today - we’re looking for you! Primary Location: USA-Atlanta JV White USA-St. Louis-Lackland Function: Function - Tech Dev and Client Services Schedule: Full time",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-20T23:10:21.000Z"
    },
    "company": {
        "name": "Equifax",
        "link": "https://www.linkedin.com/company/equifax"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Alpharetta",
        "region": "GA",
        "postal_code": "30022",
        "street_address": null,
        "latitude": 34.075615,
        "longitude": -84.29455
    }
}