{
    "job": {
        "title": "Data Scientist - Applied AI",
        "industry": "Information Technology and Services,Computer Software,Financial Services",
        "description": "Candidate must be a U.S Citizen and have a Top Secret Clearance or Higher Multiple Locations (DC, VA, MD) Work you’ll do As an Applied AI Consultant, you will have opportunities to make an impact on a broad range of transformative projects for our clients. Applied AI Consultant will: Use human-centered design processes as a tool to produce effective communications and solutions throughout client engagements Strategize, architect, position, design, develop and deploy enterprise solutions which include components across the Artificial Int using the human-centered design process as a tool to produce effective communications throughout client engagements m such as Chatbots, Virtual Assistants, Machine Learning, and Cognitive Services (e.g. Vision/Image, Textual/Language processing). Perform data studies and data discovery routines for video, voice, weblog, sensor, machine and social media data sources or mash ups of new and existing data sources. You can capitalize on our cross-industry presence to find your niche and begin building your individual brand. This person should have strong analytical and critical thinking skills with the ability to solve complex problems and communicate findings. The team: Analytics & Cognitive In this age of disruption, organizations need to navigate the future with confidence, embracing decision making with clear, data-driven choices that deliver enterprise value in a dynamic business environment. The Analytics & Cognitive team leverages the power of data, analytics, robotics, science and cognitive technologies to uncover hidden relationships from vast troves of data, generate insights, and inform decision-making. Together with the Strategy practice, our Strategy & Analytics portfolio helps clients transform their business by architecting organizational intelligence programs and differentiated strategies to win in their chosen markets. Qualifications Required: Bachelors degree in Computer Science, Engineering, Mathematics, or other business-related field 4+ relevant experience within data science or analysis Experience leading teams within project spaces Experience with programming languages such as Python, R, and VBA; and query languages such as SQL Experience with data visualization tools, such as Tableau, Qlik, PowerBI, d3.js and other web application technologies, or equivalent Experience with SQL and NoSQL database technologies such as SQL Server, Oracle SQL Must be legally authorized to work in the United States without the need for employer sponsorship, now or at any time in the future Holds an Active Top Secret U.S. Government Security Clearance (or higher) Preferred: Familiarity with Agile project management principles Confidence to drive assignments to completion Proficiency with data extraction, transformation, and loading to support advanced analytics Experience with a wide range of analytics techniques, such as statistics, machine learning, natural language processing, optimization, simulation, or closely related techniques Strong strategic communication skills to include presenting quantitative concepts in easy to understand formats and actively listening to identify business problems and their causes Powered by JazzHR CUYi0PE9sA",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-06-09T08:10:39.000Z"
    },
    "company": {
        "name": "Hamdan Resources",
        "link": "https://www.linkedin.com/company/hamdan-resources"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "District of Columbia",
        "region": "United States",
        "postal_code": "20442",
        "street_address": null,
        "latitude": 38.90477,
        "longitude": -77.0163
    }
}