{
    "job": {
        "title": "Software Engineer",
        "industry": "",
        "description": "Position Description Are you a passionate, talented software engineer who has experience building innovation, mission-critical, high-impact solutions? Come build the future of rehabilitation with our team and make a positive impact by developing technology designed to help people recovering from paralysis walk again. We are now hiring a software developer to join our growing engineering team. You will play a pivotal role in shaping the definition, vision, design, and roadmap to invent and innovate new technologies, solve highly complex problems at scale, and deliver game-changing products and services. This position will have the opportunity to work at the intersection of electrical hardware to front-end development on a number of new technologies. You will design and implement critical features at the intersection of electrical hardware and software, front-end, back-end, and/or full-stack interfaces/systems for consumers depending on the project. Your standards of the software built will be high, since it has the potential to be extended for multiple use cases and, most importantly, will have interaction from individuals in a healthcare environment. Key Responsibilities and Duties Leading our software development effort Designing new systems Working closely with a multidisciplinary team Building complex software systems Managing and creating key quality documentation (i.e. - Design Controls) Basic Qualifications Experience 5+ Years of non-internship software development experience 1+ Years of experience contributing to the architecture and design (architecture, design patterns, reliability and scaling) of new and current systems Preferred Qualifications Skills Knowledge of professional software engineering practices and best practices for the full software development lifecycle, including coding standards, code reviews, source control management, build processes, testing, and operations Ability to take a project from scoping requirements through actual launch of the project Experience in communicating with users, other technical teams, and management to collect requirements, describe software product features, and technical designs. Experience with Mobile Development - Android & iOS Experience with Servers Experience working with HIPAA compliant databases Healthcare technology experience Experience working at the intersection of hardware and software Experience with B&R Automation Studio and Ladder Diagrams Attributes Self-starter and entrepreneurial spirit Team player High-energy Fast Learner Creative Competitive Who We Are Healing Innovations is a medical technology company focused on improving care within the rehabilitation continuum. Our mission is to increase access to rehabilitation through the development and commercialization of market-leading robotic technology that helps people improve health, mobility, and independence. Healing Innovations offers advanced robotic technology, software, and services to care settings throughout the rehabilitation continuum. Healing Innovations was named the 2021 Tech Startup of the Year by the Nashville Technology Council.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-18T14:48:03.000Z"
    },
    "company": {
        "name": "Healing Innovations",
        "link": "https://www.linkedin.com/company/healinginnovations"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Nashville",
        "region": "TN",
        "postal_code": "37221",
        "street_address": null,
        "latitude": 36.166344,
        "longitude": -86.77907
    }
}