{
    "job": {
        "title": "Data Scientist",
        "industry": "Information Technology and Services,Banking,Financial Services",
        "description": "Overview As a member of our banking client's Data Science team, you’ll be working on the machine learning pipelines that provide actionable intelligence that helps their bankers grow their books of business while working with an ever expanding number of clients. The team aims to accomplish this goal with effective use of technology and data science techniques coupled with genuine curiosity and hands-on understanding of the business that we strive to facilitate. Responsibilities - Produce intelligence (e.g., predictive models, reports, dashboards) to assist bankers with their clients' needs. You’ll illuminate these needs through in-depth study of the clients’ business with the bank and their interactions with the bankers. You will also apply your intuition and relevant statistical techniques to make inferences and predictions from data. - Promote your work and supporting its adoption. You'll be producing and interacting with a lot of artifacts communicated to bankers and executives on a regular basis, as well as collecting feedback and providing governance once they are in production. You will need to think critically about how your output is utilized by its audience. Communicating results to stakeholders in a way that makes them useful will be contingent on your ability to appreciate and assimilate the bankers’ perspective. Success in this regard means being a banker before being a data scientist. - Build out the bank's data pipelines. Much of the data is not big, but it is messy and the engineering pipelines are often built concurrently with analysis. Your data wrangling chops will be tested daily. Experience - Grit. - Curiosity. - Organization. - Thoughtfulness. - Strong statistical acumen. - Experience navigating tight deadlines. - Effective oral and written communication. - A portfolio of self-directed data projects. - A graduate degree in the physical sciences. - Several thousand hours of prior coding experience. - Ability to identify the key deliverables for initially vague problem statements. Hands-on experience with the following technologies would be very helpful: - Git - Command-line interface on Linux/MacOS - Databases (e.g., SQL Server, Snowflake, MongoDB) - Python (e.g., SciPy stack, Statsmodels, PySpark, Tensorflow)",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-20T18:13:41.000Z"
    },
    "company": {
        "name": "Addastaff Consulting Incorporated",
        "link": "https://www.linkedin.com/company/addastaff-consulting-inc"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "San Francisco",
        "region": "CA",
        "postal_code": "94121",
        "street_address": null,
        "latitude": 37.78008,
        "longitude": -122.42016
    }
}