{
    "job": {
        "title": "Site Reliability Engineer // Azure // Remote",
        "industry": "Staffing and Recruiting",
        "description": "A Software Development company that develops mobile threat defense software solutions is looking to bring on a talented Site Reliability Engineer. You'd be joining their Dallas-based team of unique problem solvers with a multitude of skills and perspectives. As an SRE, you'll be focused primarily on running better production application and systems, creating a strict engineering discipline, and utilizing software and systems to help find creative engineering solutions to operational problems. Skills & Experience 4+ years of experience in a DevOps/SRE environment Azure DevOps Experience working in both Azure and AWS environments is highly preferred Proficient in Java and/or Powershell scripting Working knowledge of Terraform and Ansible Docker/Kubernetes The Offer Competitive Salary: Up to $155K/year, DOE You Will Receive The Following Benefits Medical, Dental, Vision 401(k) Casual work environment Full remote work option Applicants must be currently authorized to work in the United States on a full-time basis now and in the future. Posted By: Carolyn Regimbal",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-03T01:25:04.000Z"
    },
    "company": {
        "name": "Motion Recruitment",
        "link": "https://www.linkedin.com/company/motion-recruitment-partners"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 48,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Dallas",
        "region": "TX",
        "postal_code": "75342",
        "street_address": null,
        "latitude": 32.777977,
        "longitude": -96.79621
    }
}