{
    "job": {
        "title": "Software Engineer",
        "industry": "Marketing and Advertising,Online Media,Internet",
        "description": "Job Summary: We have created one of the most powerful brands by bringing memorable, life-changing storytelling to the world. The foundation of this creativity starts with The Walt Disney Studios where we produce, acquire, and distribute live-action and animated motion pictures, video experiences, music, and live performances. Our brands include Marvel, Lucasfilm, Pixar, Disney Animation, 20th Century Studios, and Searchlight Pictures. No other Media & Entertainment company can rival the brands we have the honor of bringing to the world. As part of the Studio’s Technology team you’ll be joining a group of seasoned, dedicated technologists solving a range of interesting problems in innovative ways in an exciting and dynamic industry. We are looking for a Software Engineer who is dedicated to help us implement high-quality applications used in the development and production of film and direct-to-consumer content. We’re a casual shop that values passion, community involvement and exceptional software. If this is you, we want you to join our team. Responsibilities: You will be part of the team creating the next-generation internal systems for movie and direct-to-consumer creative development and production. You should be comfortable being part of a cross-functional team and working with a diverse group of business stakeholders and technologists. We expect you to have a deep understanding of Quality Assurance Testing. Your key responsibilities will be: Analysis and Design Conducts fact gathering sessions with customers. Consults with Business Analysts to identify and analyze technology needs and problems. Performs data flow diagramming and/or process modeling (code architecture). Writes technical specifications for application components. Prepares estimates for design, coding and testing. Designs complex software and database objects. Development and Testing Develops new complex features and functions for software applications. Expert in connecting Web interface to back-end services and functions using AJAX, SOAP and REST services. Strong understanding of complex cross-platform and cross-application integration techniques. Identifies complex integration and user acceptance test scenarios. Provides programming support through all testing phases and general releases of software. Adheres to department programming standards and methodology. Performs peer and lower level code reviews. Adheres to department programming standards and methodology. Experience working in an “Agile” environment is a plus. Delivery and Installation Prepares pre-release and release process documents including Change Control, contingency and fallback Plans. Assists the Infrastructure group with configuration and deployment of new systems. Production Support Conduct functional analysis for production support activities. Identify complex problems and analyze potential solutions including workarounds. Perform tuning, repairs and/or maintenance to production applications. Work with other IT departments on integrated system support, as required. Administrative Works as a member of a cross-functional, integrated development team. Communicates plans, status and issues to management on a regular basis. Adheres to department standards, policies, procedures and industry best practice Basic Qualifications: Knowledge: Expert in Java programming, Developing REST APIs Experience with Java 8, Git Expert developing REST services in Java. Strong experience with JPA libraries, querying and manipulating data using SQL Expert working with relational databases platforms. Strong experience working with Postgress. Strong experience with document storage in AWS (S3). Good understanding of deployment strategies for distributed and multi-tiered applications. Knowledge of Software Development Life Cycle methodologies. Knowledge of relational database concepts and database management systems. Knowledge of the UNIX operating system (especially Linux), and UNIX development tools and environments. Experience with CI/CD pipelines Experience with Spring Boot Experience developing/deploying application for cloud environment Strong experience and understanding of Kubernetes Experience with Elastic Search Knowledge of Entertainment industry business practices a plus. Skills: Capable of translating complex business needs into technical solutions. Capable of translating what the UX/UI Designer into technical solutions. Comfortable working on different databases, Oracle, SQL Server, Postgress. Must be able to understand what the “intent” of the requirements are. Must be able to understand specific use cases where technology must adapt to the ways and culture in which a business unit operates and not the other way around. Must be able to understand that a user-friendly front end is part of the requirements. Good verbal and written communication skills. Advanced skills in developing programs using Java. Advanced skills in SQL & Postgres Strong experience with Kubernetes Able to create an implement CI/CD strategy Experience: Minimum 4 years of experience developing multi-tier applications in a business environment. Minimum 4 years of experience developing applications using Java language and toolset. Minimum 4 years of experience developing modern, responsive and complex web-based Java applications in a business environment. Minimum 2 years of experience developing on Linux. Required Education Bachelor’s degree or higher in Computer Science or related field. 829922BR",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-02T13:52:03.000Z"
    },
    "company": {
        "name": "The Walt Disney Company",
        "link": "https://www.linkedin.com/company/the-walt-disney-company"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 48,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Burbank",
        "region": "CA",
        "postal_code": "91504",
        "street_address": null,
        "latitude": 34.182053,
        "longitude": -118.30747
    }
}