{
    "job": {
        "title": "Software Engineer, Test",
        "industry": "Information Technology and Services,Computer Software",
        "description": "At Genesys, we’ve built the best cloud-based Customer Experience (CX) service offerings, which handles millions of interactions a day. Our infrastructure involves hundreds of services deployed across 9 environments globally, and we push out dozens of product builds per day using a top-notch CI/CD pipeline. We are looking for a talented Software Engineer, Test to work with our Data Analytics team focusing on automated testing of big data processing and batch data actions. Responsibilities Help develop new features for our platform service with quality built in. Triage failed automated test executions and report defects when appropriate. Participating in code reviews, direct collaboration, and open discussion of ongoing work. Develop automation for new features and processes. Assist development teams on testing best practices. Determine whether to deploy new code to production regions. Requirements A Bachelor of Science degree in Computer Science or related degree or equivalent in work experience. Proficiency using Java. Previous experience using test frameworks like Selenium and TestNG. Understanding of cloud computing, ideally AWS. Nice To Have Agile/Scrum experience. Best practices for CI/CD. Proficiency using Python. Experience testing RESTful API’s Experience with big data tools like Apache Spark. Experience with Amazon Elastic MapReduce (EMR) Experience using version control systems like GitHub and BitBucket. Benefits Medical, Dental, and Vision Insurance Telehealth coverage Flexible work schedules and work from home opportunities Development and career growth opportunities Open Time Off 401(k) matching program Adoption Assistance Infertility treatments See more Genesys benefits information at https://mygenesysbenefits.com/",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-01T00:51:21.000Z"
    },
    "company": {
        "name": "Genesys",
        "link": "https://www.linkedin.com/company/genesys"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Greater Indianapolis",
        "region": null,
        "postal_code": "46201",
        "street_address": null,
        "latitude": 39.76474,
        "longitude": -86.16893
    }
}