{
    "job": {
        "title": "Machine Learning Engineer - Full time role -(Top Management Consulting)",
        "industry": "Information Technology and Services,Computer Software,Management Consulting",
        "description": "Levels Consultant and Sr. Consultant 2 - 6+ years of overall IT experience Management consulting or IT consulting experience will be preferred Experience with building and deploying ML-based solutions and proficiency in common machine learning frameworks such as TensorFlow, Keras, scikit-learn, Pytorch and ONNX Solid experience as a data engineer, with large-scale data ecosystems including data lake, data management, governance and the integration of structured and unstructured data to generate insights leveraging cloud-based platforms Experience with Big Data and programming languages Python, Scala, R, Java etc. Experience with AWS, Azure or GCP Should have valid work authorization Key Hiring Locations New York, San Jose, Los Angeles, Atlanta, Chicago, Boston, Detroit, Columbus, Cleveland, Cincinnati, Denver, Dallas, Austin, Houston, Minneapolis, Parsippany...some other metropolitan cities will also be considered Requirements Important considerations Up to 50% travel required post COVID Full Time/ Direct Hire role Remote till we have COVID restrictions Benefits Best in the class",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-14T02:37:22.000Z"
    },
    "company": {
        "name": "Arth Consulting - An Executive Search Firm",
        "link": "https://www.linkedin.com/company/arth-consulting"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "New York",
        "region": "United States",
        "postal_code": "13856",
        "street_address": null,
        "latitude": 42.93923,
        "longitude": -75.62005
    }
}