{
    "job": {
        "title": "Senior Software Test Engineer",
        "industry": "Information Technology and Services,Computer Software,Financial Services",
        "description": "Job Posting Title Senior Software Test Engineer Summary We are looking for a Sr. Software Test Engineer with at least 5 years’ experience in software testing to join our team, which is responsible for cutting-edge technology supporting Aristocrat's gaming platforms and Game Development Kits, which are used in casinos and venues around the world. The Sr. Software Test Engineer will work closely with a team of Development and Test Engineers to plan, perform, and guide quality assurance activities that ensure the delivery of a high-quality gaming experience. This involves testing and reporting defects, reviewing defects reported internally and externally, assisting with a post-testing review for all releases, and maintaining the accuracy of all test documentation. Furthermore, the Sr. Software Test Engineer will mentor new and junior Software Test Engineers and foster a strong relationship with key stakeholders and business partners. What You'll Do As a Senior Software Test Engineer, you will be responsible for owning quality assurance on our gaming platform. You will provide technical assessments on features and identify scope of work and dependencies to meet test requirements. You will design, implement, and maintain test plans, test cases, and test configurations, as well as provide hands-on hardware configuration and test execution. You will provide technical guidance in identifying automation targets and developing white box test scenarios. You will participate in design reviews and recommend improvements. You will work with cross functional stakeholders to ensure we deliver a high-quality gaming experience. You will promote established processes and seek opportunities to streamline and improve both our technologies and our processes. All other duties as assigned. What We're Looking For Excellent software testing skills with a strong understanding of software testing methodology. 5+ years of experience testing embedded software, SDK or commercial software product releases. Experience working with defect tracking and test management tools such as JIRA/Zephyr. Prior experience in the gaming industry is desirable. Strong knowledge of any scripting language (e.g., python) is desirable. Good verbal and written communication skills to effectively interact with global stakeholders. Software debugging and troubleshooting skills using industry standard tools. Ability to analyze information and use logic to perform task efficiently, within deadlines. Possesses good problem-solving skills to address work-related issues and problems. Experience with Agile Scrum methodologies is desirable. B.S. in Computer Science or equivalent is highly desirable. Why Aristocrat? World Leader in Gaming Entertainment Robust benefits package Global career opportunities Our Values All about the Player Talent Unleashed Collective Brilliance Good Business Good Citizen The US based roles may require registration with the Nevada Gaming Control Board (NGCB) and/or other gaming jurisdictions in which we operate.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-06-17T13:37:05.000Z"
    },
    "company": {
        "name": "Aristocrat",
        "link": "https://au.linkedin.com/company/aristocrat"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Franklin",
        "region": "TN",
        "postal_code": "37064",
        "street_address": null,
        "latitude": 35.923653,
        "longitude": -86.86783
    }
}