{
    "job": {
        "title": "Software Engineer",
        "industry": "Information Technology and Services,Computer Software,Hospital &amp; Health Care",
        "description": "Please apply on our Careers page at Extended Care Pro is a market-leading software solution that enables long-term care facilities to better care for their residents. Already used in over 2,000 facilities across the United States, Extended Care Pro is looking to further expand by increasing the number of customers that use our software and increasing the scope of how we serve our customers by developing and releasing new modules. This role will join our software engineering team on projects in React, Node.js, and TypeScript. They will contribute to both brand new projects, ike building a customer-facing billing product, and updates to our existing products. Long-term we are planning to replace all our existing code with this new tech stack. We expect you to be able to hit the ground running and be able to take the lead on small to medium-sized projects within six months. This full-stack software engineer will report to the head of technology and have access to the rest of the leadership team. Primary Responsibilities: Contribute to day-to-day development: contribute tested, documented code to solve business problems. Continually improve their knowledge of the core languages and frameworks that we are invested in, especially React and Node.js. Stay intellectually curious and up to date on technical best practices. Work collaboratively in a team. Understand how to work productively with others, strong communication skills, and ability to use collaboration software such as Git. Develop an understanding of our overall product and platform. Understand how the work you contribute will fit into our overall development pipeline. Required Qualifications 2-5 years of JavaScript development experience Proficiency with React, Node.js or both Experience with versioning systems (preferably git) Fluent English, grammatical skills Legally authorized to work in the United States without sponsorship Preferred Qualifications Experience with Cloud services such as AWS, Azure, or GCP Experience with a ticketing system such as Azure DevOps or Jira Perks Competitive salary Medical, Dental, and Vision insurance 401(k) with match Work from home Flexible work schedule Paid time off + Sick Leave Parental leave Casual attire On-site gym and exercise equipment Complimentary snacks and beverages Note: the entire company is currently working from home due to the pandemic. Equal Employment Opportunity ECP is an equal opportunity employer and welcomes applications from all qualified applicants. We do not discriminate on grounds of race, religion or belief, ethnic or national origin, disability, age, citizenship, marital, domestic or civil partnership status, sexual orientation, gender identity, or any other basis as protected by applicable law. Powered by JazzHR FX4qRzujvV",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-05T07:16:05.000Z"
    },
    "company": {
        "name": "ECP ",
        "link": "https://www.linkedin.com/company/extended-care-professional"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Milwaukee",
        "region": "WI",
        "postal_code": "53215",
        "street_address": null,
        "latitude": 43.041073,
        "longitude": -87.909424
    }
}