{
    "job": {
        "title": "VP Site Reliability Engineer",
        "industry": "Information Technology and Services,Computer Software,Financial Services",
        "description": "Site Reliability Engineering (SRE) is a discipline that combines software and systems engineering for building and running large-scale, distributed, fault-tolerant systems. SRE ensures that internal and external services meet or exceed reliability and performance expectations while adhering to Equifax engineering principles. Who is Equifax? At Equifax, we believe knowledge drives progress. As a global data, analytics and technology company, we play an essential role in the global economy by helping employers, employees, financial institutions and government agencies make critical decisions with greater confidence. We work to help create seamless and positive experiences during life’s pivotal moments: applying for jobs or a mortgage, financing an education or buying a car. Our impact is real and to accomplish our goals we focus on nurturing our people for career advancement and their learning and development, supporting our next generation of leaders, maintaining an inclusive and diverse work environment, and regularly engaging and recognizing our employees. Regardless of location or role, the individual and collective work of our employees makes a difference and we are looking for talented team players to join us as we help people live their financial best. Site Reliability Engineers (SRE) at Equifax are passionate about driving SRE best practices and applying software and systems engineering disciplines to build and run large-scale, distributed and fault-tolerant systems across the globe.   Our SREs ensure that internal and external services meet and exceed the reliability and performance expectations while following Equifax engineering best practices. The Perks of being an Equifax Employee? We offer excellent compensation packages with market competitive pay, comprehensive healthcare packages, 401k matching, schedule flexibility, work from home opportunities, paid time off, and organizational growth potential. Grow at your own pace through online courses at Learning @ Equifax. What you will do: Champion SRE standards for Equifax to ensure availability, scalability and performance of infrastructure services for an entire Business Unit Advise and influence SRE team members to provide stable, secure, and compliant infrastructure environments Lead the effort to transition the legacy team into the SRE discipline Foster a culture of ownership, collaboration and trust within and outside the team Develop, coach and manage a dotted-line team of talented engineers in support of the business and technology goals You will work with continuous integration and continuous delivery tooling and practices Qualifications: BS degree in Computer Science or related technical field involving coding (e.g., physics or mathematics), or equivalent job experience required 10+ years of progressive experience in Technology that includes Agile and DevOps practices. 3-5+ years of experience developing and/or administering software in public  cloud (GCP or AWS) Experience in languages such as Python, Bash, Java, Go, Perl System administration skills, including automation and orchestration of Linux/Windows using Terraform, Chef, Puppet, etc. Experience in operating system that leverage containerized compute platforms (Docker, Kubernetes, etc.) Extra Points For Any Of The Following: You have expertise designing, analyzing and troubleshooting large-scale distributed systems. You take a system problem-solving approach, coupled with strong communication skills and a sense of ownership and drive You are passionate for automation with a desire to eliminate toil whenever possible You’ve built software or maintained systems in a highly secure, regulated or compliant industry You thrive in and have experience and passion for working within a DevOps culture and as part of a team Success Attributes of an Equifax employee; does this describe you? Accountability Bravery Curiosity Collaboration Think and act differently Trust Ownership Decide-Execute-Ship We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. If this sounds like somewhere you want to work, don’t delay, apply today - we’re looking for you! Primary Location: USA-Atlanta JV White Function: Function - Tech Engineering and Service Ops Schedule: Full time",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-17T00:00:00.000Z"
    },
    "company": {
        "name": "Equifax",
        "link": "https://www.linkedin.com/company/equifax"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 120,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Alpharetta",
        "region": "GA",
        "postal_code": "30022",
        "street_address": null,
        "latitude": 34.075615,
        "longitude": -84.29455
    }
}