{
    "job": {
        "title": "Software Programmer",
        "industry": "Information Technology and Services,Computer Software,Financial Services",
        "description": "Senior Software Developer Direct Hire- 100% Remote ARC Group is currently looking for a Senior Software Developer with experience in Full-Stack & Cloud. This opportunity is with a client of ours that has impressive growth in the Digital Media industry. The department location for this opportunity is in New York City & Boston, MA but you can be located at your home office as this role is 100% Remote. Our client offers excellent benefits, a competitive salary, and a good work-life balance. This role is 100% remote even after the pandemic is over. This is a direct-hire (permanent hire): Being so, candidates must be eligible to work for any employer without sponsorship now or in the future. No third parties. Essential Duties: Collaborative design and implementation of modern user-friendly interfaces Creation of tests (Unit, UI, ...) and documentation Active participation in the implementation and operation (e.g. troubleshooting) of new cloud-based services Active participation in building and improving our continuous integration and deployment processes Participation (virtual or in-person) in planning meetings for coordination between the Scrum teams Required Experience : Bachelor's degree in computer science, MIS, or a related field required. Equivalent work experience in a similar position may be substituted for educational requirements. Minimum five years increasingly responsible software design and implementation experience using a standard coding language and/or platform required Expert (recognized authority) in developing and creating tests with Python (3.X) Advanced experience (practical application and applied theory) in at least one other programming language (PHP 7 and newer, C #, Golang) Practical experience in the application of agile methodologies (e.g. Scrum or XP) Intermediate experience (practical application) in developing online services and building APIs Intermediate experience (practical application) in using NoSQL and relational databases is desirable Intermediate experience (practical application) in application development in the FaaS / serverless environment is desirable Intermediate experience (practical application) in the area of development with / integration of authentication and authorization/solutions/protocols is desirable Powered by JazzHR 3hPQiyNl7n",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-31T07:11:24.000Z"
    },
    "company": {
        "name": "American Recruiting &amp; Consulting Group",
        "link": "https://www.linkedin.com/company/american-recruiting-&amp;-consulting-group"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "New York",
        "region": "NY",
        "postal_code": "10132",
        "street_address": null,
        "latitude": 40.713047,
        "longitude": -74.00723
    }
}