{
    "job": {
        "title": "Software Engineer",
        "industry": "Computer Software",
        "description": "Connected2Fiber is a B2B SaaS Go To Market platform for the connectivity industry. Launched in 2015, Connected2Fiber is a VC funded high growth SaaS company based in Milford, MA, and operating globally. The Connected World, the core platform of Connected2Fiber drives growth for our clients by increasing visibility to the market, managing location and driving engagement as the system of record for where connectivity providers connect and pass by in the commercial market. Connected2Fiber is one of the nation's fastest growing vertical SaaS companies. Job Description Connected2Fiber software engineers build state of the art products that improve human interactions with technology. We seek software engineers to be strong in computer science, solid in the fundamentals and ready to tackle new software patterns focused on maintainability, scalability, and security. Whether it’s finding new and innovative ways to advance our product quality or building apps that automatically synchronize information in a secure and convenient way, you will be developing solutions to some of the most challenging technical problems out there. There are no textbooks that can help you learn this, which is why we have some of the best and brightest engineers working with us. Responsibilities Design, write, test, deliver, maintain and improve software Help with supporting our products Manage priorities and deliverables Qualifications Bachelor of Science in Computer Science or related field Experience working with one or more from the following: web application development, mobile application development, security software development Experience with one or more general purpose programming languages including but not limited to: C/C++, Python, C#, Java, Node Proficient in English What’s In It For You: Competitive salary Generous benefits package includes health, dental, vision, unlimited PTO and 401(k). Opportunity to be part of a fun and enthusiastic team Awesome work environment and culture Learn more about us at https://www.connected2fiber.com. Check out our Glassdoor reviews, Inc Magazine 2021 Best Places to Work Award winner, 2020 Forbes Best Startup Employer.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-17T14:06:29.000Z"
    },
    "company": {
        "name": "Connected2Fiber",
        "link": "https://www.linkedin.com/company/connected2fiber"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Milford",
        "region": "MA",
        "postal_code": "01757",
        "street_address": null,
        "latitude": 42.14287,
        "longitude": -71.51683
    }
}