{
    "job": {
        "title": "Site Reliability Engineer",
        "industry": "Information Technology and Services",
        "description": "Local Seattle Area Candidates Only Please! The digital nexus where ESG and price signals merge. Xpansiv is the global market for ESG (Environmental, Social, and Governance)-inclusive commodities. These Intelligent Commodities™ bring transparency to markets, empowering participants to value energy, carbon, and water to meet the challenges of an information-rich, resource-constrained world. We’re the marketplace for an ever-expanding ecosystem of proven environmental commodities, like RECs (Renewable Energy Certificates), offsets, and differentiated fuels. We connect buyers and sellers of Intelligent Commodities in a global liquidity hub that accelerates the transition to a net-zero future. Job Description As a Site Reliability Engineer, you will design, implement, and support our core infrastructure. The SRE team is responsible for reliability, scalability, and automation while keeping an eye on latency, security, performance, and capacity. You will also mentor, share knowledge, and guide technical decisions toward long-term success. As a key hire on a growing engineering team, you’ll have a deep impact on engineering practices and culture. As an SRE you will: Deploy and maintain our infrastructure, and improve the process to make it as boring as possible. Document every action into repeatable actions – and then automation. Debug production issues across all services and levels of the stack. Own, maintain, and continuously improve all systems provided as a service, such as monitoring and datastores. Research and implement changes to increase reliability and operate more efficiently. Who We're Looking For Someone with intense curiosity and humility. Someone who can get challenging projects across the finish line. Someone who is empathetic, patient, and passionate about helping teammates grow. Someone who is collaborative, and who can influence diverse engineering teams. Someone with experience running applications in production. Someone who takes engineering best practices seriously, who cares about reliability and end-user trust, and who will advocate for all of these things. Technical Requirements Fluency in a programming language. (We use Python and Bash where possible.) Familiarity with command-line Linux. Familiarity with version control. (We use git.) Familiarity with some form of infrastructure as code. (We use Terraform where possible.) Familiarity and comfort with at least one cloud provider. (We use AWS where possible.) Three years of experience in some combination of software engineering, systems administration, backend automation, testing automation, data engineering, or similar work. This should include operational responsibility for business-critical systems in a collaborative environment. Bonus Points Six, ten, or more years of experience, in a diverse range of environments and architectures. Strong fluency in Python, and experience writing software. Strong fluency in Linux, and experience with medium-to-large scale environments. Familiarity with running systems with a microservice architecture. Familiarity with data persistence technologies (for example, Elastisearch, Kafka, or Redis). We encourage you to apply if this role excites you — We are always looking for outstanding individuals with diverse backgrounds and perspectives who embody trust, transparency, collaboration, and a can-do attitude. We’re excited to meet you!",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-15T15:32:38.000Z"
    },
    "company": {
        "name": "Xpansiv",
        "link": "https://www.linkedin.com/company/xpansiv-data-systems"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Seattle",
        "region": "WA",
        "postal_code": "98133",
        "street_address": null,
        "latitude": 47.60323,
        "longitude": -122.33028
    }
}