{
    "job": {
        "title": "System Engineer",
        "industry": "Staffing and Recruiting",
        "description": "Microsoft Systems Engineers and Systems Administrators teams can have a wide range of responsibilities. They are responsible for the systems and Infrastructure that run the IT department and organization, as well as serve as an escalation point to the Service Desk (aka Help Desk). Common Responsibilities Every member of Microsoft Systems Engineers will have Active Directory Experience. It houses all of our user and computer accounts, as well as service accounts. It is also the “bouncer” that checks your password when you attempt to sign into an app or device. It Systems Engineers often must build new servers for multiple environments, including the live one that users are using, which is called Production. Lower environments are for testing and they serve different purposes. Some examples of lower environments are Production, Stage, UAT, Dev. Some organizations have many environments, which means a lot of servers to build and maintain. Servers have to be maintained to remain functional and secure. We secure servers through multiple and many ways. Some examples are securing servers with Group Policy Objects (GPOs). GPOs are a native function of Active Directory and have broad reach of control of what they can do. Examples would be mapping a printer or file share. Others would be to secure the server. In addition, it is common to secure servers with antivirus. Another common way to secure servers and desktop operating systems is to keep up with the latest updates. These updates must be managed and tested before they can be deployed to Production. Other responsibilities include, but are not limited to: Monitor all systems both on premise and cloud through various monitoring tools. Prepare for and configure High Availability. High Availability means that even if one server for a cluster node becomes unresponsive, the application remains available. Prepare for and configure Disaster Recovery. Disaster Recovery means that if a system goes down in a larger outage, we can recover through our Disaster Recovery plan to a different site or location. Backups and Restores Maintain virtualization software. Virtualization software enables the ability to run multiple virtual servers on a single physical server or cluster of physical servers. Serve as an escalation point for Service Desk Common Tools Active Directory Azure Active Directory Exchange Intune Monitoring software, ex. Systems Center Operations Manager (SCOM) Office 365 SharePoint VMware",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-25T17:50:21.000Z"
    },
    "company": {
        "name": "Insight Global",
        "link": "https://www.linkedin.com/company/insight-global"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Atlanta Metropolitan Area",
        "region": null,
        "postal_code": "30317",
        "street_address": null,
        "latitude": 33.74975,
        "longitude": -84.38857
    }
}