{
    "job": {
        "title": "Machine Learning Engineer 1",
        "industry": "Information Technology and Services,Computer Software,Internet",
        "description": "Our Company Changing the world through digital experiences is what Adobe’s all about. We give everyone—from emerging artists to global brands—everything they need to design and deliver exceptional digital experiences! We’re passionate about empowering people to create beautiful and powerful images, videos, and apps, and transform how companies interact with customers across every screen. We’re on a mission to hire the very best and are committed to creating exceptional employee experiences where everyone is respected and has access to equal opportunity. We realize that new ideas can come from everywhere in the organization, and we know the next big idea could be yours! Job Description Adobe's messaging platform connects customers to chat support. Additionally, it enables customers to self-serve via chatbot automation and be routed to assisted support. It drives customer success by understanding and automatically resolving customer issues, engaging customers and by providing best in class assisted support experiences. Our team is looking for a machine learning engineer having 3 years of work experience to join our team and to work towards strengthening and enhancing of our services. The candidate should be self motivated, be keen to learn new technology and be able to work independently. She/he should also possess excellent communication skills, be methodical in development process and pay close attention to details. If you like to solve complex problems and challenges, that too in a fast-moving and dynamic environment, this is great opportunity for you. Minimum Qualifications What you’ll do and need to succeed Bachelor's degree in Computer Science, or related technical field, or equivalent work experience. 3 years of relevant work experience. Experience designing and implementing distributed software systems (e.g Java or Python). Research or Industry experience in Artificial Intelligence, Machine Learning (ML) models, ML infrastructure, Natural Language Processing and Deep Learning. Preferred Qualifications Master's degree or equivalent in Computer Science, Artificial Intelligence, Machine Learning or related technical field. 1-2 years of relevant work experience in machine learning software development and architectures for machine learning (with focus on Natural Language Processing). Experience with most of the following technologies: TensorFlow, pytorch, pandas, NumPy, SciPy, matplotlib, flask, Linux, Docker, AWS Experience in building, deploying, and improving Machine Learning models and algorithms in real-world products. Ability to work in a Unified Engineering model Excellent problem solving, troubleshooting, communication and presentation skills Able to thrive in a fast-paced environment, learn new skills proactively, support other team members and work independently At Adobe, you will be immersed in an exceptional work environment that is recognized throughout the world on Best Companies lists . You will also be surrounded by colleagues who are committed to helping each other grow through our unique Check-In approach where ongoing feedback flows freely. If you’re looking to grow your career, Adobe’s the place for you. Discover what our employees are saying about their career experiences through the Adobe Life magazine . Adobe is an equal opportunity employer. We welcome and encourage diversity in the workplace regardless of race, gender, sexual orientation, gender identity, disability or veteran status. We are investing strategically to enable the delivery of exceptional digital experiences. It’s an outstanding time to be here, especially if you’re an innovator and a leader! At Adobe, you will be immersed in an exceptional work environment that is recognized throughout the world on Best Companies lists ( http://www.adobe.com/careers/awards.html ). You will also be surrounded by colleagues who are committed to helping each other grow through our outstanding Check-In ( http://www.youtube.com/watch?v=hmL6uQZhYhw&list=UUlDSu3-Y4-BfI08784K-P4g&feature=share&index=1 ) approach where ongoing feedback flows freely. Looking to make an impact? Adobe's the place! Discover what our employees are saying about their career experiences on the Adobe Life blog ( http://blogs.adobe.com/adobelife/ ) and explore the meaningful benefits ( http://benefits.adobe.com/ ) we offer. Adobe is an equal opportunity employer. We welcome and encourage diversity in the workplace regardless of race, gender, religion, age, sexual orientation, gender identity, disability, or veteran status. We will ensure that individuals with disabilities are provided a reasonable accommodation to participate in the job application or interview process, to perform crucial job functions, and to receive other benefits and privileges of employment.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-16T22:00:02.000Z"
    },
    "company": {
        "name": "Adobe",
        "link": "https://www.linkedin.com/company/adobe"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "IN",
        "locality": "Noida",
        "region": null,
        "postal_code": "201306",
        "street_address": null,
        "latitude": 28.58467,
        "longitude": 77.352005
    }
}