{
    "job": {
        "title": "Marketing Sr Data Scientist",
        "industry": "Financial Services",
        "description": "Employee Applicant Privacy Notice Who We Are Shape a brighter financial future with us. Together with our members, we’re changing the way people think about and interact with personal finance. We’re a next-generation fintech company using innovative, mobile-first technology to help our 2+ million members reach their goals. The industry is going through an unprecedented transformation, and we’re at the forefront. We’re proud to come to work every day knowing that what we do has a direct impact on people’s lives, with our core values guiding us every step of the way. Join us to invest in yourself, your career, and the financial world. Description As a Marketing Data Scientist @ SoFi, you will be subject matter expert on the user journeys and flows as part of the onboarding experience in becoming a SoFi member, our internal data pipelines as well as our marketing datasets. You will also contribute to building machine learning (ML) models and solutions that touch on attribution, forecasting, and budget allocation across our marketing channels such as Programmatic, Social, Search, Lifecycle, Television and Out of Home that enable SoFi to grow at scale efficiently. Responsibilities The key goal for this person will be to apply modeling techniques relevant to media mix modeling (MMM) optimization and multi-touch attribution (MTA) to our marketing efforts to connect the impact of marketing activities on business outcomes. Build and deploy models that enable marketers to allocate budgets to various channels in order to drive cross-channel optimization by product and by business objectives. Continue to enhance models as additional data points become available through iterative improvements to instrumentation and Martech initiatives. Develop models that drive personalization for member interactions on owned and paid marketing channels. Contribute to defining a set of SoFi attributes that will enable marketers to create and activate audiences through paid and owned channels. Establish processes and champion tool development to enable building ML models at scale. Minimum Qualifications Master's Degree or Ph.D. in Computer Science, Statistics, Operations Research, Engineering, Mathematics, or a related quantitative field. At least 3 years of experience with a proven track record of end-to-end experience in model development, testing, implementation, and performance tracking Experience with machine learning and statistical modeling methods for supervised and unsupervised learning. These methods include (but not limited to) regression analysis, clustering, outlier detection, novelty detection, decision trees, collaborative filtering, nearest neighbors, support vector machines, ensemble methods and boosting, neural networks and deep learning, feature selection, and factorization methods and NLP. Write production-quality code in Python, Scala and/or R Strong knowledge of databases and related languages/tools such as SQL, NoSQL, Hive, etc Experience in deploying and operating machine-learned models on low latency, high-throughput systems such as DataBricks, AWS Sagemaker, Azure and GCP. Ability to work in a dynamic, cross-functional environment, with strong attention to detail Effective communication skills and ability to explain complex models to a diverse audience with varying technical backgrounds. Experience building models to optimize advertising performance and lifecycle marketing is preferred Familiarity with Google Marketing Platform (Adwords, Search Ads 360, DV360, Analytics), Facebook as well as other Social Media and Programmatic advertising platforms. #IB-1 Why You’ll Love Working Here Competitive salary packages and bonuses Comprehensive medical, dental, vision and life insurance benefits Generous vacation and holidays Paid parental leave for eligible employees 401(k) and education on retirement planning Tuition reimbursement on approved programs Monthly contribution up to $200 to help you pay off your student loans Great health & well-being benefits including: telehealth parental support, subsidized gym program Employer paid lunch program (except for remote employees) Fully stocked kitchen (snacks and drinks) These benefits are only applicable to full time employees SoFi provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion (including religious dress and grooming practices), sex (including pregnancy, childbirth and related medical conditions, breastfeeding, and conditions related to breastfeeding), gender, gender identity, gender expression, national origin, ancestry, age (40 or over), physical or medical disability, medical condition, marital status, registered domestic partner status, sexual orientation, genetic information, military and/or veteran status, or any other basis prohibited by applicable state or federal law. Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-14T17:01:21.000Z"
    },
    "company": {
        "name": "SoFi",
        "link": "https://www.linkedin.com/company/sofi"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "San Francisco",
        "region": "CA",
        "postal_code": "94121",
        "street_address": null,
        "latitude": 37.78008,
        "longitude": -122.42016
    }
}