{
    "job": {
        "title": "Software Developer / Software Engineer / Web API Developer",
        "industry": "",
        "description": "At SchoolPass, we're changing the way schools think about campus movement and wellness. Parents love using SchoolPass to communicate wellness, attendance, and dismissal changes to everyone at the school with the tap of a button, and schools love using SchoolPass to streamline their dismissal process and make sure every kid goes where they're supposed to at the end of the day. We're headquartered in the Greater DC Area, and we have customers in 36 states from California to New York. Our work is dynamic, responsive, and stimulating. We are looking for a remote, full-time Software Engineer with web API backend experience to join our API and Integrations team. We build and maintain web APIs and build integrations between our APIs and Third Party APIs. What you will do Work in a small, fully-remote, multi-functional team that maintains the systems at the core of our business Understand the full technology stack and how all the pieces fit together Deliver testable, maintainable, and high-quality code Share knowledge, promote best practices, and collaborate with other engineers Develop and deploy web APIs and integrations with web APIs Take operational responsibility for the services we deploy What we are looking for You have 3+ years of Object Oriented programming languages and best practices with experience in or a desire to learn C# You have experience building web APIs built on top of MVC Frameworks You are familiar with SQL based databases You are comfortable running your software in Windows environments You are interested in keeping up with current best practices in your areas of expertise Our Technology Stack We have a TypeScript/Angular web application and several Xamarin (C#) Mobile Apps for our Front End We use ASP.NET Core MVC (C#) back end communicating with a relational database through Entity Framework We also have a MVC Web App we are transitioning to the Angular site We use Amazon Web Services We use Microsoft's Azure Devops and custom solutions for integration, deployment, and project management Job Type: Full-time Pay: $106,000.00 - $126,000.00 per year Benefits: Dental insurance Health insurance Paid time off Vision insurance Schedule: Monday to Friday Supplemental Pay: Bonus pay Signing bonus Education: Bachelor's (Preferred) Experience: OOP: 3 years (Preferred) Web API: 3 years (Preferred) MVC: 3 years (Preferred) Work Location: Fully Remote This Job Is: Open to applicants who do not have a college diploma A job for which people with disabilities are encouraged to apply Company's website: https://schoolpass.com/ COVID-19 Precaution(s): Remote interview process",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-12T03:54:40.000Z"
    },
    "company": {
        "name": "SchoolPass",
        "link": "https://www.linkedin.com/company/school-pass"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Atlanta",
        "region": "GA",
        "postal_code": "30345",
        "street_address": null,
        "latitude": 33.85543,
        "longitude": -84.28748
    }
}