{
    "job": {
        "title": "Sr. Solutions Engineer Specialist – Network and Security - Healthcare - Opportunity for Working Remotely",
        "industry": "Information Technology and Services,Computer Software,Financial Services",
        "description": "Sr. Solutions Engineer Specialist – N etwork and Security - Healthcare Business Summary VMware is the leader in virtualization and cloud infrastructure solutions that enable our more than 350,000 enterprise and SMB customers to thrive in the Cloud Era/ A pioneer in the use of virtualization and automation technologies, VMware simplifies IT complexity across the entire data center to the virtual workplace, empowering customers with solutions in the software-defined data center and software defined wide area network to hybrid cloud computing and the mobile workspace. Our team of 31,000 people working in 50+ locations worldwide is committed to building a community where great people want to work long term by living our values of passion, innovation, execution, teamwork, active learning and giving back. If you are ready to accelerate and innovate, join us as we challenge constraints and problem solve for tomorrow today. Job Role And Responsibilities At VMware we are growing our Virtual Cloud Networking team and looking for an experienced Solutions Engineering Professional to join our team. Are you creative, motivated and passionate about changing the future of how technology is used? Do you love being part of a team with a strong identity, and a reputation for a high standard of work and achievement? If you answered yes, this job could be for you. The Charter of the VMware Virtual Cloud Networking organization is to be the dedicated Pre-Sales experts to grow sales and the adoption of VMware’s next generation network virtualization and security platform - VMware NSX, NSX Advanced Load Balancer and SDWAN by VeloCloud. We work directly with NSBU Product Management & Engineering, the VMware Virtual Cloud Networking Field Sales teams, and directly with customers to increase the footprint of VMware NSX, Velocloud and AVI products in cloud computing environments. As a VMware Virtual Cloud Networking Engineer, you will be accountable for driving the technical sales cycles to ensure customer success and revenue goals derived from VMware VCN product line. You will be focused on selling the value of VMware Virtual Cloud Networking into private, hybrid and public cloud environments. Enthusiastically and professionally present VMware vision and technologies, strategy, and product roadmaps to executives, technical management, operations management and technical engineers Maintain technical and business knowledge of cloud computing and networking applications, industry directions, and trends Maintain working knowledge of competitive architectures Assist sales in preparation of proposals, statement of work, and documents for prospects Work collaboratively with sales associates, product management, technical marketing and engineering during the development, launch and continuing refinement of Virtual Cloud Networking products (NSX, AVI, Velo Cloud) Maintain, grow, and use technical pre-sales relationships with key partner field organizations and VMware System Engineers Articulate the impact of Network Virtualization and Security to a customer’s physical network, operations and future network and networking security architectures Required Skills Diversity in career background with 4-6 years of experience in customer facing technical consulting roles, such as Sales/Systems Engineer, Technical Project Management, Technical Marketing Engineer, Consulting Engineer, Solution Architect, or senior level Customer or Application Support Experience with different products and technologies commonly seen in Enterprise networks, including but not limited to routers, switches, firewall, hypervisors, Windows, Linux, etc Industry experience with either SD-WAN, load balancing, software defined networking or cloud networking and network security Ability to effectively present technology and business information to customers, peers, and management Exceptional communication and listening skills, ability to build rapport and credibility, clearly articulate a value proposition and help customers understand complex topics in a clear manner Ability to interact and communicate with C level personnel, technical leaders and administrators Demonstrated Aptitude for learning Driven and organized – own your business, partnerships, and follow up Ability to support customers through product demonstrations, training, and PoCs Analytical abilities and problem-solving skills, coupled with a strong sense of ownership, urgency, and drive Support product development by translating customer requirements and quantify them to communicate information to product management Demonstrated start-up, hunter or enterprising mentality, and passion for what you are representing Preferred Skills Network industry certifications such as CCNA/AWS/Azure/GCP are preferred B.S. in Computer Science, Engineering or a related field, or relevant experience Can work independently, but also has a huge desire to give back to the team Passionate about technology and its impact on customers Driven and motivated by nature Social intelligence to see the political dynamics of any customer situation This job requisition is not eligible for employment-based immigration sponsored by VMware. Category : Sales Subcategory: Systems Engineering Experience: Manager and Professional Full Time/ Part Time: Full Time Posted Date: 2021-07-14 VMware Company Overview: At VMware, we believe that software has the power to unlock new opportunities for people and our planet. We look beyond the barriers of compromise to engineer new ways to make technologies work together seamlessly. Our cloud, mobility, and security software form a flexible, consistent digital foundation for securely delivering the apps, services and experiences that are transforming business innovation around the globe. At the core of what we do are our people who deeply value execution, passion, integrity, customers, and community. Shape what’s possible today at http://careers.vmware.com. Equal Employment Opportunity Statement: VMware is an Equal Opportunity Employer and Prohibits Discrimination and Harassment of Any Kind: VMware is committed to the principle of equal employment opportunity for all employees and to providing employees with a work environment free of discrimination and harassment. All employment decisions at VMware are based on business needs, job requirements and individual qualifications, without regard to race, color, religion or belief, national, social or ethnic origin, sex (including pregnancy), age, physical, mental or sensory disability, HIV Status, sexual orientation, gender identity and/or expression, marital, civil union or domestic partnership status, past or present military service, family medical history or genetic information, family or parental status, or any other status protected by the laws or regulations in the locations where we operate. VMware will not tolerate discrimination or harassment based on any of these characteristics. VMware encourages applicants of all ages. Vmware will provide reasonable accommodation to employees who have protected disabilities consistent with local law.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-24T01:13:50.000Z"
    },
    "company": {
        "name": "VMware",
        "link": "https://www.linkedin.com/company/vmware"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 48,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Nashville",
        "region": "TN",
        "postal_code": "37221",
        "street_address": null,
        "latitude": 36.166344,
        "longitude": -86.77907
    }
}