{
    "job": {
        "title": "Site Reliability Engineer",
        "industry": "Computer Software,Computer Hardware,Computer Networking",
        "description": "Position Details: Location: San Francisco, CA (100% Remote) Type : Full Time Must have TN Visa, GC, USC, H4 EAD, or H1B Referral Program: Not Interested but know someone!? We offer a $1000 Referral Bonus for anyone you refer that gets the project. You Want To automate infrastructure behind customer facing APIs with high availability, reliability, scalability. To build systems that: Look Elegant and reliable on the outside Deal with the complexities of rigorous business logic Transparently handle hardware failures To work in Go and other tools as necessary to build systems. To participate and thrive in a delivery-oriented, goal-centric culture. Successful candidates will Demonstrate the ability to be productive and independent in a remote environment Design, write, and maintain software to improve the availability, scalability, reliability, performance, and efficiency of our services, incorporating third-party open-source tools when available Create new designs for a growing number of distributed systems Design and implement the tools and processes used for deployment and change management Plan and execute configuration management Automate resource provisioning and allocation process Own, maintain, and continuously improve all systems provided as a service, such as monitoring and datastores Engage in service capacity planning and demand forecasting, anticipating performance bottlenecks Run software performance analysis Plan and execute disaster recovery drills Participate in rotating on-call duties You have A Love of systems engineering, APIs, and making applications secure. You enjoy collaborating and coming up with reliable solutions that solve business needs. You constantly seek ways to ensure your systems meet the objectives while improving performance. The ideal candidate doesn’t have all of the following, but is seeking to gain experience with them: Comfortable with languages such as Go and Python Minimum of 4 years of industry experience in engineering Familiarity with algorithms, data structures, and complexity analysis Experience with Grafana and Prometheus Experience working with Linux systems from kernel to shell including working with system libraries, file systems, and client-server protocols Experience with networking (TCP/IP, UDP, ICMP, ARP, DNS, load balancing, etc.) Experience with configuration management tools (Ansible) Systematic problem solving Elegant and simple solutions to complex problems Strong sense of ownership and drive Expertise in designing, analyzing, and troubleshooting large-scale distributed systems We offer An opportunity to build a cloud solution and scale it to meet the needs of the world’s largest cloud consumers A highly distributed, remote-friendly team (US preferred) An opportunity to shape product and business strategy and can grow into new roles as the organization grows Blackstone Talent Group is a division of Blackstone Technology Group, a global IT services and solutions firm that implements technological solutions across commercial industry verticals and the US Federal Government. Blackstone’s global talent augmentation practice was founded in 1998. Blackstone Talent Group has offices in San Francisco, Denver, Houston, Colorado Springs, and Washington, DC. We specialize in providing clients the best talent across a variety of industries and sectors. EOE of Minorities/Females/Veterans/Disabilities",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-02T20:24:07.000Z"
    },
    "company": {
        "name": "Blackstone Talent Group",
        "link": "https://www.linkedin.com/company/blackstonetalentgroup"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 48,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "San Francisco Bay Area",
        "region": null,
        "postal_code": "94112",
        "street_address": null,
        "latitude": 37.39271,
        "longitude": -122.042
    }
}