{
    "job": {
        "title": "Data Scientist",
        "industry": "",
        "description": "Location: This role is remote for the first six months. Then relocate to one of the cities below. ·      Roswell, GA ·      Dallas, TX ·      Knoxville, TN ·      Neenah, WI ·      San Francisco, CA Company: iCuro is pioneering artificial intelligence (AI) systems and products for accelerating enterprise growth outcomes. iCuro is a leading consulting partner and thought leader in the rapid development and deployment of enterprise AI solutions by fully integrating hardware and software, and data. We serve customers across multiple industry verticals including Consumer Packaged Goods (CPG), Retail, Manufacturing, Health Sciences, and Technology. www.icuro.com Job Description: The Data Scientist will apply his/her strong expertise in machine learning, data mining, and information retrieval to design, prototype and build next generation advanced analytics engine and services. The Data Scientist collaborates with translators to define technical problem statement and hypothesis to test; develops efficient and accurate analytical models that mimic business decisions. Role & Responsibilities •      Design, create, test and implement complex machine learning and deep learning models and algorithms that drive analytical solutions throughout the organization •      Work with business managers to frame a problem, both mathematically and within the business context. Perform exploratory data analysis to gain insights about the problem •      Experienced in proposing ROI based solutions to business driven by AI/ML; Be a storyteller to explain the ‘why & how’ of your data driven recommendations to cross-functional teams •      Leverage variety of machine learning techniques (clustering, decision tree learning, artificial neural networks, etc.) and their real-world advantages/drawbacks to achieve business outcomes •      Leverage advanced statistical techniques and concepts (regression, properties of distributions, statistical tests and proper usage, etc.) and experience with applications to improve model recommendations •      Conduct advanced statistical and other analysis to provide actionable insights, identify trends, and measure performance leveraging TensorFlow •      Use predictive modeling to increase and optimize customer experiences, revenue generation, ad targeting and other business outcomes •      Identify and develop long-term data science processes, frameworks, tools, and standards •      Comfortable working in programming languages like SQL, Python and R, as well as with frameworks like Azure ML Ops and Azure Machine Learning; experience designing solutions in distributed teams using Version Control tools like GIT •      Curate and connect external data sets for broad enterprise-wide analytic usage •      Develop company A/B testing framework and test model quality •      Collaborate with internal stakeholders to understand business challenges and develop analytical solutions to optimize business processes & monitor outcomes •      Have passion to advocate and educate on the value and importance of data driven decision making & analytical methods •      Mentor and guide data science team members as well as developers and QA engineers working on the products Qualifications •      5-10 years of experience in software development of large-scale data infrastructure and distributed systems •      4-8 years of experience in data extraction, transformation, statistical analysis and data modeling •      5+ years of experience developing enterprise software using Java or Python •      3-6 years of experience in applying Data Mining and Machine Learning techniques to solve business problems •      5-8 years of experience using major RDBMS, SAP, Hadoop, Spark, Elasticsearch, or similar technologies •      3+ years of experience with statistical modeling tools such as R, SAS, SciKit-learn, •      Bachelors degree in Computer Science, Computer Engineering, Machine Learning, or related field or equivalent experience. Technical Skills •      Experience with Azure and/or GCP cloud platform •      Experience in machine learning, statistics, optimization or related fields; deeper experience in working with large data sets, simulation/ optimization or distributed computing tools is a plus •      Experience working with Open CV, Deep learning experience and time series analysis •      Experience with Map/Reduce, SAP, Hadoop, Hive, Spark, etc. •      Experience using statistical computer languages (R, Python, SLQ, etc.) to manipulate data and draw insights from large data sets •      Coding knowledge and experience with several languages: Python, Go, Java, JavaScript, R, SQL etc. •      Knowledge and experience in statistical and data mining techniques: GLM/Regression, Random Forest, Boosting, Trees, text mining, social network analysis, etc. •      Experience creating and using advanced machine learning algorithms and statistics: regression, simulation, scenario analysis, modeling, clustering, decision trees, neural networks, etc. •      Experience visualizing/presenting data for stakeholders using: Tableau, PowerBI, Looker, Data Studio, Shiny, D3, ggplot etc.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-15T12:22:37.000Z"
    },
    "company": {
        "name": "ICURO",
        "link": "https://www.linkedin.com/company/icuro"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "United States",
        "region": null,
        "postal_code": "99999",
        "street_address": null,
        "latitude": 39.50355,
        "longitude": -99.0183
    }
}