{
    "job": {
        "title": "Data Scientist - Universal Content",
        "industry": "Information Technology and Services,Computer Software,Internet",
        "description": "Every day, tens of millions of people from around the world come to Roblox to play, learn, work, and socialize in immersive digital experiences created by the community. Our vision is to build a platform that enables shared experiences among billions of users. This is what’s known as the metaverse: a persistent space where anyone can do just about anything they can imagine, from anywhere in the world and on any device. The breadth of opportunities, and the evolving demands of this first-of-its-kind platform, ensure that your avenues for growth are always expanding and flexible. Join us and you’ll usher in a new category of human interaction while solving exceptional challenges that you won’t find anywhere else. WHY DATA SCIENCE & ANALYTICS? The Data Science & Analytics organization’s mission is to increase our speed, frequency and acumen of making decisions at scale by instilling a data-influenced approach to building products. We cover a wide area of the data spectrum including analytical data engineering, product analytics, experimentation, causal inference, statistical modeling and machine learning. Aligned and partnering with product verticals, we use this extensive tool belt to discover new opportunities and unmet use cases, influence and shape the product roadmap and prioritization, build data products and measure impact on our community of players and developers. WHY UNIVERSAL CONTENT? The Universal Content team’s mission is to assist our developers in reaching the widest audience possible. By working on broadly scoped problems such as content localization and suitability, you will be directly unlocking growth potential for our creator community. As a data scientist, you will be a key partner to our product and engineering teams to shape the future of Roblox. You’ll partner with data scientists, product managers, engineers and leaders across the company to better understand our players and builders, performing ad hoc analysis, creating dashboards, defining KPIs, applying models and designing A/B experiments. You will help Roblox innovate as a game creation and social coplaying platform, break new grounds for the gaming industry and data science. You Are Passionate about data. You have the curiosity and self-drive to continuously learn new techniques and tools to extract value from data. You have a degree in Statistics, Economics, Computer Science or other relevant field. A strong communicator. You understand that analysis must be presented in meaningful ways and engage in spirited discussions about the findings. You have the ability to explain technical concepts to non-technical audiences and discuss appropriate tradeoffs. A capable statistician. You understand the value of characterizing data by its distribution. Covariance, Bias, and Conditional Probability are concepts that you rely on every day. An expert transforming data with SQL and a scripting language such as Python or R. You’re experienced in automating efforts and crunching massive volumes of data using big data frameworks such as Spark, Hadoop or Flink. Experienced in developing models to draw insights from data. You use regression techniques, data mining, and statistical techniques to create new, scalable solutions to solve difficult business problems. You understand when to apply the appropriate methodology to maximize impact in a pragmatic fashion. You Will Accelerate product development through your understanding of the underlying data and your ability to partner with product and technical leaders to provide insights that drive growth. Access raw data, and then transform it, analyze it, and render it in a compelling way--all using a custom analytics tool kit built from state-of-the-art open-source libraries. Build dashboards to understand root causes to changes in metrics. Accelerate product development and decision-making through the application of models to drive growth and improve the product experience. Evaluate A/B experiments to determine success of product feature launches. Influence how Roblox interacts with its players and its platform developers to accelerate creator velocity. Basic Qualifications BA/BS in Computer Science, Applied Math, Physics, Engineering, Statistics, Economics, Financial Mathematics or other technical field 2+ years of industry experience in analytics 2+ years experience in scripting languages for DS like Python or R 6+ months of experience using big data query/processing languages and tools such as SQL, Hive, Spark and Airflow Experience with SQL flavors for data querying Preferred Qualifications 4+ years of prior industry experience in Product Analytics Knowledge of statistics fundamentals to support experimental design and analysis Experience with exploratory data analysis, statistical analysis and testing, and model development You'll Love Excellent medical, dental, and vision coverage A rewarding 401k program Flexible vacation policy Free catered lunches five times a week and several fully stocked kitchens with unlimited snacks Onsite fitness center and fitness program credit Annual CalTrain Go Pass A Roblox Admin badge for your avatar",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-03T04:00:14.000Z"
    },
    "company": {
        "name": "Roblox",
        "link": "https://www.linkedin.com/company/roblox"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 48,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "San Mateo",
        "region": "CA",
        "postal_code": "94406",
        "street_address": null,
        "latitude": 37.54715,
        "longitude": -122.3144
    }
}