{
    "job": {
        "title": "Associate Software Engineer",
        "industry": "Computer Software",
        "description": "About Us LogicMonitor is the leading SaaS-based performance monitoring platform for enterprise IT. We love going to work and think you should too. We are customer-obsessed, work as one team, and strive to be better every day . These are our core values. So it's no surprise that we work hard and genuinely have fun working with each other to achieve great things together. We are located in the busy, technical epicenter of Cambridge, MA. We are looking for you to bring your expertise, drive, and passion as we expand our global presence and achieve record-breaking success. LogicMonitor is an equal opportunity employer. We’re committed to creating an inclusive environment for all our employees, where different backgrounds and perspectives are valued and encouraged - regardless of race, color, religion, national origin, age, sex, marital status, ancestry, physical or mental disability, veteran status, gender identity, or sexual orientation. We encourage all people to come as they are . We operate with integrity, esteem diversity and treat each other fairly and with respect. We strive to find our own versions of personal and professional harmony through community building and holistic growth. We hear time and time again that our awesome people are a huge part of why LMers chose LogicMonitor, love their teams, and choose to stay. To learn more about life at LogicMonitor, check out our Careers Page . What You'll Do The Associate Backend Developer on the Engineering team is responsible for the implementation, design, architecture and quality control of business integrations/general development within the customer-facing product application and internal tools used by development technical operations. This includes troubleshooting bugs and implementing new features as required in existing backend applications; even building new components as needed. A successful Associate Backend Developer will produce all required functionality in a timely manner and will communicate and work with colleagues to solve problems and improve the systems they work with. Here's a Closer Look At This Key Role Prioritize and plan for deliverables in an iterative development strategy. Document, code, and test technical solutions and enhancements for existing systems, bringing a new perspective and a willingness to improve. Follow agile software development methodologies for implementation. Work with various teams in LogicMonitor to deliver software products that support LogicMonitor's business growth. Constantly work towards career growth and learning opportunities. There will be a lot of technologies to absorb and we want someone who is motivated and able to learn quickly. Troubleshoot and resolve product/application issues for escalated support cases. What You'll Need Project experience (~1 year) working in Java in a Linux environment BS or above degree in computer science or related field. Familiar with latest Java development framework and open-source tools. Strong understanding of web application architectures. Able to quickly develop competencies, in numerous technologies (learn fast!) Ability to work with a development team and develop strong, reliable, and effective relationships with team members",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-30T22:32:28.000Z"
    },
    "company": {
        "name": "LogicMonitor",
        "link": "https://www.linkedin.com/company/logicmonitor"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Boston",
        "region": "MA",
        "postal_code": "02118",
        "street_address": null,
        "latitude": 42.358994,
        "longitude": -71.05863
    }
}