{
    "job": {
        "title": "Graphics Software Engineer",
        "industry": "Information Technology and Services,Computer Software",
        "description": "We are looking for a highly motivated, passionate and energetic individual to join our Cloud development team in San Ramon CA. Here we are developing the next generation of high-performance 3D Reality Capture and Visualization Web applications and their associated deployments for a vibrant and wide customer base. What You Get To Do: Implement high performance rendering of Lidar and CAD model data Research, prototype, and evaluate emerging technologies Support existing products through defect investigation, resolution, and testing Desired Experience: Strong OpenGL / real-time rendering background Good C++ programming knowledge Experience with Software Architectural Patterns Experience maintaining end-user application programs Required Qualifications and Personality: BS and/or MS in Computer Science – or equivalent real-world experience. Authorized to work in the US. You can think in systems and work from first principles to design a solution and take action. Strong verbal & written English communication skills. Excellent technical communication skills Excellent problem solver. A life-long learner, committed to personal improvement and professional practice, with a restless intellect and genuine interest in working with cutting-edge technologies. You value inclusivity, collaboration and the freedom to tackle ambitious goals while having fun. About Leica Geosystems: With more than 5,000 employees in 33 countries Leica Geosystems is a well-established and highly respected global organization. Our collective philosophy is to strive to be the place where a diverse mix of talented people want to come, to stay and do their best work. We know our company runs on the hard work and dedication of our passionate and creative employees, and that diversity of thought makes us better each day. Hexagon is an Equal Employment Opportunity and Affirmative Action employer. We are committed to considering all qualified applicants for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or other characteristic protected by law.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-24T01:25:29.000Z"
    },
    "company": {
        "name": "Leica Geosystems part of Hexagon",
        "link": "https://ch.linkedin.com/company/leica-geosystems"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "San Ramon",
        "region": "CA",
        "postal_code": "94582",
        "street_address": null,
        "latitude": 37.777084,
        "longitude": -121.96752
    }
}