{
    "job": {
        "title": "Site Reliability Engineer at Client",
        "industry": "Computer Software,Internet,Retail",
        "description": "Location: Remote – Las Vegas At Mogul, we provide exclusive executive opportunities for top, diverse talent at the VP, SVP, EVP, President, C-Suite, or Board of Directors level across the Fortune 500 and more. Our client is a global leader in SaaS-based solutions for the Procurement industry. Our client is the nation's largest and most trusted community dedicated to sharing, rating, and reviewing deals and coupons. Think Reddit, but for deals and shopping. They are the leading social platform for shopping, where 12 million users interact to share the most up-to-date information on online shopping deals and coupons. Through the power of crowdsourcing, they have saved members more than $8.7 billion by providing a forum for communication and shopping tools such as free Android or iOS apps and browser extensions for Chrome and Edge. Summary Our client is looking for a Site Reliability Engineer (SRE) who can effectively fill a combined SysAdmin and DevOps role. The successful candidate will manage the company's Linux systems, which run predominantly open-source software and internally developed applications and tooling. The SRE team is responsible for production systems and the OS/applications running on them. This role will aid engineering and product teams by providing velocity and stability for development and product teams. As part of the SRE team, the successful candidate will be responsible for dealing with rare incidents and scheduled routine off-hours maintenance tasks. The role will be a significant contributor to the automated tooling that will help developers develop and the business do business. One of the first goals of the SRE will be to improve the company's monitoring platforms - moving the myriad of systems currently used into a \"single pane of glass,\" allowing the engineering and product teams to have a view more aligned to their needs. Secondarily this needs to be built in a way that will enable contribution from development teams since they are most familiar with their application. Essential Job Duties and Responsibilities The role combines aspects of cloud engineering, DevOps, and IT operations Ongoing development such as improving the automation of deploy workflows and tweaking server build cookbooks Contribute to systems that monitor servers and their logs Document and apply backup & restore procedures Keep systems up to date with software updates and patches to ensure the availability and quality of the company's online presence Serve as subject matter expert for infrastructure-related questions and issues that arise Integral in design and build of IaaS and ongoing improvements and maintenance to Kubernetes deployments Provisioning, maintaining, and improving our existing infrastructure Manage tools like Jenkins, Consul, Vault, and Git Work with Developers during the entire release process to improve release velocity Update, deploy and manage monitoring systems (Nagios, Cacti, Grafana, ELK) Manage, monitor, and improve HAProxy Load Balancers Participate in an on-call rotation Requirements 2+ years of experience in similar roles Well-versed in *nix Operating Systems (currently use CentOS and Ubuntu LTS) Good communication (and listening) skills Excellent reading comprehension and attention to detail Very comfortable with SSH, bash & sh, pipes, common UNIX tools Comfortable using software revision control (e.g. Git) Some experience administering Linux \"web\" servers at scale Working knowledge of DNS, HTTP, TLS, web security Experience with networking troubleshooting using tools such as tcpdump Preferred Experience: Scaling for a high traffic web/services environment Infrastructure as code (e.g. Chef/Puppet/Ansible/Terraform) Configuration management Continuous Integration and test automation frameworks MySQL in a high-performance distributed environment Containerization & virtualization Familiarity with interpreted languages Understanding of networking technologies, including design and troubleshooting Experience with on-premise cloud (IaaS) environments Testing & automation (CI/CD/Git hooks) Monitoring (e.g. ELK, Grafana) Email servers and their configuration (e.g. Postfix, SPF, DKIM, DMARC)",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-10T21:06:32.000Z"
    },
    "company": {
        "name": "Mogul",
        "link": "https://www.linkedin.com/company/onmogul"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Las Vegas",
        "region": "NV",
        "postal_code": "89159",
        "street_address": null,
        "latitude": 36.16909,
        "longitude": -115.14058
    }
}