{
    "job": {
        "title": "Data Scientist",
        "industry": "Information Technology and Services,Computer Software,Financial Services",
        "description": "Position We are looking for a talented Data Scientist to join our Data Science team . This team serves as the Center of Excellence for data science initiatives and is responsible for building and leveraging big data capabilities and advanced modeling techniques across the firm. Projects encompass all aspects of our organization, spanning research, portfolio management, trading, risk management, operations, sales and marketing. The Data Scientist will engage with stake-holders across AB to surface challenges and opportunities, and to lead the organization to pilot and develop solutions around algorithms, tools and infrastructure that can significantly impact our business. Initiatives include harnessing big data and machine learning methods to improve investment outcomes and to improve sales productivity and client interactions. Responsibilities The Data Scientist is responsible for executing on AB’s projects involving large datasets and advanced statistical techniques to solve business problems. In this role, (s)he will conduct research and create proto-types to address business challenges in research, investment management, sales and marketing, and operations. The individual will help develop AB’s capabilities in data science and leverage those learnings across the organization. (S)he will also help design and create an infrastructure that’s scalable and robust across the different business units. Ultimately, the Data Scientist will help the firm harness big data and advanced analytics to make better and faster decisions. Specific responsibilities may include: Conduct research to extract insights from “alternative” datasets Utilize advanced analytical techniques including machine learning to create models to improve investment outcomes and to enhance client interactions Partner with data engineers and technologists to harness modern technology and techniques to create a leading-edge infrastructure for the organization Create tools, dashboards and open-source code to facilitate adoption of research insights, models and recommendations from Data Science team Collaborate with investment and client-facing teams to develop solutions to address research and business challenges Leverage insights across the firm by sharing best practices and training colleagues Present research findings at leading finance and data science conferences Qualifications The ideal candidate should have some experience in finance, data science, quantitative research or business intelligence . Other qualifications include: Advanced degree in Mathematics, Finance, Computer Science, Engineering or related fields Experience in working with large structured and unstructured datasets and applying advanced statistical methods to drive decision-making Well-versed in big data technologies and analytical methods Proficiency in analysis (R, Matlab packages), programming languages (R, Python), and statistical modeling. Experience in the financial services industry preferred Strong project management skills Our employees have track records of outstanding professional performance and academic achievement, excellent analytical skills, and strong verbal communication skills. Candidates should have a strong ability to work in a collaborative environment and to present results to both expert and non-expert audiences. AllianceBernstein (AB) is a global investment-management firm providing industry-leading research and investment solutions through a combination of innovation, intellectual curiosity and relentless ingenuity. We offer high-quality research and diversified investment services to institutional and individual investors worldwide. Our clients include some of the world's top institutions as well as private-wealth clients and retail investors. Through close partnerships with our clients, we collaborate on investment strategies across regions and sectors to inspire innovative thinking and deliver superior outcomes. We invest in our people and in the communities in which we operate, and we celebrate our diversity to showcase what makes us unique. We offer our talent the opportunity to grow professionally while working on cutting-edge ideas and outcomes in a global culture that operates as a tight-knit community. If you're ready to innovate and grow your career, join us. People of color, women, and those who identify as LGBTQ people are encouraged to apply. AB does not discriminate against any employee or applicant for employment on the basis of race, color, religion, creed, ancestry, national origin, sex, age, disability, marital status, citizenship status, sexual orientation, gender identity, military or veteran status or any other basis that is prohibited by applicable law. AB’s policies, as well as practices, seek to ensure that employment opportunities are available to all employees and applicants, based solely on job-related criteria. New York City, New YorkNashville, Tennessee",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-25T20:44:00.000Z"
    },
    "company": {
        "name": "AllianceBernstein",
        "link": "https://www.linkedin.com/company/abglobal"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Nashville",
        "region": "TN",
        "postal_code": "37221",
        "street_address": null,
        "latitude": 36.166344,
        "longitude": -86.77907
    }
}