{
    "job": {
        "title": "Full Stack Software Engineer",
        "industry": "Internet,Computer Software,Real Estate",
        "description": "Knock is on a mission to empower people to move freely. The Knock Home Swap™ makes it easy for consumers to buy their new dream home before selling their old one, skipping the hassles of living through repairs and showings, paying only one mortgage at a time, and having home prep covered upfront, so their old house sells for the highest possible price. Knock currently offers the Home Swap in 50 markets and plans to be in over 100 markets by 2023. Launched in 2015 by founding team members of Trulia.com, Knock has raised more than $600 million in debt and equity from top-tier investors, including RRE Ventures, Foundry Group, Redpoint, Greycroft, Corazon Capital, Correlation Ventures, Great Oaks Venture Capital and FJ Labs. In 2021, Knock was one of eight companies selected by Second Century Ventures, the strategic investment arm of the National Association of Realtors®, for its REACH program, which helps technology companies scale across the real estate vertical and its adjacent markets. Enjoying Life & Making an Impact Knock is a 100% remote, work from home culture and has been since our inception in 2015 100% employee covered medical, dental, & vision premiums Unlimited PTO (2 week min. is highly encouraged) + flexible work schedules $1,000 each year for professional development Salary + Equity. We offer equitable compensation based on market data, your experience & geographic location Paid parental leave We believe in creating diverse, equitable, and inclusive practices and programs that will further Knock’s commitment to making an impact, learning, putting people first, being open, and courageous Software Engineer, Full Stack: We’d love you to bring: Full lifecycle software development experience in React or other frontend development stacks, including development, testing, troubleshooting, and deployment (we use Next.js). Full lifecycle software development experience in Node.js, including coding, testing, troubleshooting, and deployment. Strong desire to work at a rapidly growing startup and make it a success. Comfortable learning new technologies and tools. Experience with various Node.js frameworks and modules. Experience with AWS ecosystems such as Lambda, S3, SNS, SQS, and CloudWatch. SQL knowledge (Mysql or Postgres), familiarity with techniques to identify slow queries and debugging. Customer-first mindset and data-driven approach to your work. Believe in creating diverse, equitable, and inclusive practices and programs that will further Knock’s commitment to making an impact, learning, putting people first, being open, and courageous. Have proven success working 100% remote in prior positions & are experienced working with a distributed, national team. We encourage you to apply even if you don’t have every listed requirement. As a Full Stack Software Engineer you will: Build and maintain innovative new experiences for Knock’s internal and customer-facing web applications using ReactJS. Understand the data that powers our applications, and be able to propose appropriate data models for new features. Collaborate with our talented Design, Product, and Engineering teams as well as other parts of the Knock business to deliver great products Commit to best practices for testing, logging, and deployments. Refine and practice a strong sense of design and UX. Continually learn, grow, and expand your knowledge, while also supporting others learning experiences; act as a mentor and be a resource for others inside and outside of your team. Take on ad-hoc projects as they arise & always be willing to support your team where they need you. We are proud to be a distributed company from our founding with employees in 28 states and counting. This is an amazing opportunity to be an integral part of building a multi-billion dollar consumer brand in an industry that is long overdue for a new way of doing things. You will be working with a passionate team that is disrupting the status quo. Knock, and its subsidiaries, are committed to creating a diverse, inclusive, and equitable environment and are proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. Please no recruitment firm or agency inquiries, you will not receive a reply from us. This position is in the continental United States. PDF is our preferred format for resumes and any other attachments. Thank you!",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-27T05:02:18.000Z"
    },
    "company": {
        "name": "Knock",
        "link": "https://www.linkedin.com/company/knock.co"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "United States",
        "region": null,
        "postal_code": "99999",
        "street_address": null,
        "latitude": 39.50355,
        "longitude": -99.0183
    }
}