{
    "job": {
        "title": "Software Engineer",
        "industry": "",
        "description": "Software Engineer (Full Stack) - Pareto Portfolio Company What you’ll do Full stack web/mobile application development with a variety of coding languages. Work closely with Product Manager to define feature specifications and build products leveraging frameworks such as React & React Native. Create engaging UIs using performant and modern React. Required skills Bachelors in computer science or equivalent. You produce readable, high quality code. Highly technical with strong hands-on coding skills. Fluent in at least one backend web framework. Experience with React or a similar framework. Comfortable with SQL. You prize reliability, simplicity, and robustness in building out systems. You communicate clearly and listen well. You are a self-starter and comfortable taking on a variety of roles. Have a startup mentality: team player, self-motivated, high-integrity, pragmatic, resourceful, can execute under pressure. Preferred Qualifications Masters in computer science or equivalent. Prior knowledge of Graphql, Redis, Elasticsearch and React Native. Prior experience with distributed systems and high-throughput services. Knowledge of AWS or similar cloud services. Location San Francisco",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-05T17:48:41.000Z"
    },
    "company": {
        "name": "Pareto Holdings",
        "link": "https://www.linkedin.com/company/paretoholdings"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "San Francisco",
        "region": "CA",
        "postal_code": "94121",
        "street_address": null,
        "latitude": 37.78008,
        "longitude": -122.42016
    }
}