{
    "job": {
        "title": "Remote Software Engineer",
        "industry": "Insurance",
        "description": "If you are a Software Engineer with experience, please read on! What You Will Be Doing Build out fast, responsive websites that are optimized for frictionless user experience in a marketing & sales domain. Work closely with the product owner and software engineer manager to develop and enhance websites based on an agreed roadmap and execute using Agile SDLC. Incorporate inputs from marketing, UX team, SEO & optimization teams to A/B test and continuously evolve consumer facing websites. Monitor the performance of the applications with a focus on uptime & fast response time. Work in an Agile Scrum team to participate and deliver sprint objectives. What You Need for this Position Bachelor's degree with experience of 5+ years hands-on software development. Expertise in building consumer facing websites in marketing and sales domain using any of the javascript and typescript based web application frameworks, ideally, but not limited to a tech stack that includes React, Javascript, Redux, Next.JS. Proven ability to build web applications using Rest based microservices and content rich sites using a CMS. Familiar with Marketing concepts like A/B Testing, SEO, analytics, conversion rates, campaign monitoring, email marketing etc Proficiency in the following areas: OOP using .NET or Java, CSS, HTML5, AWS or Azure, CI/CD, MVC, RDBMS, NewRelic, Optimizely, Headless CMS like Prismic.io What's In It for You Full Benefits Bonus + Equity PTO So, if you are a Software Engineer with experience, please apply today! Email Your Resume In Word To Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also: Kendall.Moore@CyberCoders.com Please do NOT change the email subject line in any way. You must keep the JobID: linkedin : KM14-1643230 -- in the email subject line for your application to be considered.*** Kendall Moore - Recruiter - CyberCoders Applicants must be authorized to work in the U.S. CyberCoders, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-25T17:51:07.000Z"
    },
    "company": {
        "name": "CyberCoders",
        "link": "https://www.linkedin.com/company/cybercoders"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Orlando",
        "region": "FL",
        "postal_code": "32889",
        "street_address": null,
        "latitude": 28.53833,
        "longitude": -81.378876
    }
}