{
    "job": {
        "title": "Senior Software Engineer, Core Platform",
        "industry": "Online Media,Entertainment,Computer Software",
        "description": "As a key member of the Core Platform Engineering team, you will work directly with business and technical stakeholders to lead and execute a variety of projects including exploration of new languages, tools, and technologies (such as Go, .net-core, AWS Aurora, Elastic Search, etc), building new APIs and microservices, refactoring of existing services and data stores to fit well in our cloud-native distributed architecture, personalization and many more. While working on these projects you will hold responsibility for full life-cycle management, including requirements analysis, technical design, implementation, testing, documentation, deployment to production, and postproduction ownership. The Team The platform team is responsible for running API’s that serve catalog and enable UX not only for TuneIn’s own apps but also hundreds of different devices – from smart speakers to cars. The system that powers it consists of several dozens of services, built in a split between .net-core and Golang all running in Kubernetes. Other parts of our stack include AWS Aurora and Dynamo for persistent storage and Redis for caching and GRPC for cross-service interaction. Our current crew size is seven and growing, and we own the full cycle of development of our services from planning to deployment. What You'll Do Design and build services and applications for scale on the order of tens of millions of users, and optimize code for numerous platforms Profile and optimize browse and search algorithms over large datasets Contribute to architecture, design, and implementation of next-generation monetization and metadata delivery platform Contribute to the development of new web and mobile applications and services Create technical specifications for new products, executing from start to finish and owning the quality of the service in production Create and enhance integrations with external partners like Amazon, Microsoft, Sonos, Tesla, and Google Maintain and extend heterogeneous environment, including our core .NET codebase and our set of services written in Go, Java, and Node.js Maintain and extend API services, SDKs, and developer documentation What We Are Looking For 5+ years of relevant experience Expertise with object-oriented languages such as C#, Go, Java, or C++ Direct experience with modern server application stacks, design, development, and deployment of high volume web applications and APIs (millions of transactions per day) Working knowledge of both relational and NoSQL database design and management (here at TuneIn we are using MySQL, Redis, DynamoDB, Redshift, and more) History of building resilient, stateless, scalable, distributed, and observable systems Familiarity with microservices, knowledge of modern cloud services (such as AWS or similar) Experience working with CI/CD systems and infrastructure as code practices are a big plus Understanding of presentation technologies, including XHTML, CSS, and JavaScript is a plus A practical perspective on software engineering discipline, focus on learning and delivering, and passion for high quality Great energy and enthusiasm with a positive, collaborative working style, clear communication, and writing skills. Enthusiasm for audio content preferred Bachelors in Computer Science or equivalent experience Our Compensation & Benefits TuneIn offers competitive salary, bonus, and equity compensation packages We offer generous benefits, including 100% coverage of all health plans for employees and dependents regardless of which medical health plan you choose Dental and Vision plan coverage Flexible time off policy, plus 14 paid holidays (2021) 401k Plan Wellness stipend/Cell phone subsidy Trainings and educational spending, pet insurance, more About TuneIn TuneIn, the leading live streaming and on-demand audio service, brings together live sports, news, music, podcasts, and radio from around the globe. With 75 million monthly active users, TuneIn is one of the most widely used streaming audio platforms in the world. TuneIn broadcasts over 100,000 owned & operated and partner radio stations and boasts more than 5.7 million podcasts. With premiere distribution across 200 platforms and connected devices, TuneIn empowers listeners to ‘hear’ what they love wherever ‘here’ might be. TuneIn Premium subscribers also unlock exclusive access to commercial-free news from top networks like CNBC, CNN, FOX News Radio, and MSNBC, as well as commercial-free music channels for every mood and activity. For more information please visit us at www.tunein.com or follow us on Facebook, Instagram, or Twitter.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-20T00:28:05.000Z"
    },
    "company": {
        "name": "TuneIn",
        "link": "https://www.linkedin.com/company/tunein"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "United States",
        "region": null,
        "postal_code": "99999",
        "street_address": null,
        "latitude": 39.50355,
        "longitude": -99.0183
    }
}