{
    "job": {
        "title": "Software Engineer, CDA",
        "industry": "Marketing and Advertising,Nonprofit Organization Management,Insurance",
        "description": "Job Purpose CDA is searching for an experienced software engineer to help our transition to a cloud-based IT ecosystem. We are aggressively moving from older, siloed, on-premises solutions to Azure and AWS hosted systems that integrate with each other in real time. This position will be responsible for applying software development skills and methodology to fill gaps in our overall solution portfolio. Rather than performing extensive ground up development of systems, our efforts will center on creatively integrating disconnected systems while filling in functional gaps as needed. Examples of work that our Software Engineer may do: Writing Azure Functions to handle Azure Eventhub events Writing Azure B2C custom policies Development of automated employee onboarding and offboarding, including and O365 and Zoom license provisioning and recovery The primary development languages used at CDA are C#, Java, PowerShell, and bash. However, our software engineer should be comfortable with leaning on a solid understanding of core web technologies like HTML, CSS, JavaScript, HTTP, XML and Json to adapt their solution approach given a variety of runtime environments and components. The Software Engineer analyzes, designs, develops, modifies, writes, edits, and implements software programming applications. The primary responsibility of the position will be to execute on the design, development and delivery of technology that enables great customer experiences that deliver on desired functionality on behalf of the organization. This will include developing production grade code through vision, definition, planning, execution, deployment and sustainment as well as performing unit testing to ensure conformance to specifications. Essential competencies: Relationship Skills (Collaboration) Adaptation Skills (Innovation, Facilitation) Essential Functions – must be able to perform with or without a reasonable accommodation Active contributor to an agile team tasked with integrating siloed corporate applications and driving efficiency, supportability and maturity into the enterprise ecosystem. Develop and execute production grade code through definition, planning, execution, deployment, and sustainment. Proactively communicate and work to mitigate changes to project timelines, degradation in performance of applications, and concerns with project and/or product direction. Ensure assigned tasks are prioritized and executed within deadlines. Ability to break up larger projects into individual pieces and assess complexity of each piece for development. Help to establish consistency, reliability, supportability, and monitoring across our services. Participates in the development and delivery of client solutions by participating in the effort of estimating, planning, designing, implementing, and testing custom software applications. Leverage internally available tools and communicate with other internal development & product teams. Influence the organization via quality standards to enhance the technical design, development, deployment and maintenance of the product. Work with IT Leadership to identify and implement new technologies and techniques that can improve our overall platform performance and ultimate customer experience. Assist in technical audits and make sure to implement audit recommendations. Non-Essential Functions Familiar with analyzing and defining software requirements to determine specifications and standards. Assist in the testing and creating of automated tests for new development, ensuring every function, service, and object is compatible with the team’s work and with the many systems within the system portfolio. Performs other duties as assigned. Required Education, Licenses & Experience Bachelor's degree in technology-related field or equivalent experience. A minimum of 2-4 years of relevant software development experience. Familiar with software design & architecture. Familiar with all software layers including UI, service, data store and communication layers. Familiar with working with service-based application architectures and familiar with various API protocols. Organized and detail-oriented with ability to manage time effectively. Relationship Skills (Collaboration) - Participating as an active, contributive, and supportive member of a team to achieve shared goals; listening, sharing and trusting. Adaptation Skills (Innovation) - Using creativity, ingenuity, and insight to tackle issues; proactively addressing problems and seeking fresh solutions. Adaptation Skills (Facilitation) - Contributing to an environment that promotes and enables change; pursuing new and better ways of working. Preferred Education, Licenses & Experience At least 2 years’ experience in a technical lead role. Skilled with core web technologies (HTML, CSS, JavaScript, REST API’s, XML, Json). Skilled with multiple programming and scripting languages and tools (primarily C# or Java, PowerShell, and bash, likely some jQuery). Familiar with internet protocols and security patterns (e.g. HTTP, TLS, OAuth, SAML, Open ID Connect). Familiar with relational database technology (MS SQL Server in particular.) Familiar with the Docker containers and images (dockerfiles, build, run, connect). Familiar with AWS and/or Azure cloud hosting platforms. Strong communication skills with demonstrated ability to explain complex technical issues to both technical and non-technical audiences. Relevant industry (as applicable: Insurance, Supply, Non-profit, Membership) experience. Working Conditions Occasionally (1-33%) Frequently (34-66%) Constantly (67-100%) Constantly sitting and working on a computer. We Are CDA Over our 150-year history, the California Dental Association (CDA) has become a leader in oral health throughout California and the country. Today, we continue to support our community of over 27,000 dentists through our family of companies, which include The Dentists Insurance Company (TDIC), TDIC Insurance Solutions, Rotunda Partners and the CDA Foundation. At CDA, we value individual talents, encouraging a diverse, collaborative, and innovative work environment fueled by new ideas. As our organization continues to grow, we invite you to be a part of what’s next. CDA is an equal opportunity employer and is committed to the principle of equal employment opportunity for all employees and providing a safe work environment. CDA does not tolerate discrimination or harassment and all employment decisions are based on job requirements and individual qualifications, without regard to race, color, religion, national origin, age, gender, gender identity or expression, sex, ancestry, citizenship status, mental or physical disability, genetic information, sexual orientation, veteran or military status. If you have a disability or special need that requires accommodation, please contact us at humanresources@cda.org. Powered by JazzHR p7XadMKbyx",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-14T07:42:43.000Z"
    },
    "company": {
        "name": "California Dental Association",
        "link": "https://www.linkedin.com/company/california-dental-association"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Sacramento",
        "region": "CA",
        "postal_code": "95820",
        "street_address": null,
        "latitude": 38.576935,
        "longitude": -121.49495
    }
}