{
    "job": {
        "title": "Senior Software Development Engineer in Test",
        "industry": "Financial Services,Information Technology and Services,Internet",
        "description": "Our Purpose We work to connect and power an inclusive, digital economy that benefits everyone, everywhere by making transactions safe, simple, smart and accessible. Using secure data and networks, partnerships and passion, our innovations and solutions help individuals, financial institutions, governments and businesses realize their greatest potential. Our decency quotient, or DQ, drives our culture and everything we do inside and outside of our company. We cultivate a culture of inclusion for all employees that respects their individual strengths, views, and experiences. We believe that our differences enable us to be a better team – one that makes better decisions, drives innovation and delivers better business results. Job Title Senior Software Development Engineer in Test Who is Mastercard? Mastercard is a global technology company in the payments industry. Our mission is to connect and power an inclusive, digital economy that benefits everyone, everywhere by making transactions safe, simple, smart, and accessible. Using secure data and networks, partnerships and passion, our innovations and solutions help individuals, financial institutions, governments, and businesses realize their greatest potential. Our decency quotient, or DQ, drives our culture and everything we do inside and outside of our company. With connections across more than 210 countries and territories, we are building a sustainable world that unlocks priceless possibilities for all. Overview The Cyber & Intelligence Solutions team is looking for a Senior Software Engineer in Test to ensure quality solutions are delivered by consistently innovating and problem-solving. The ideal candidate is passionate about providing quality solutions and is highly motivated, intellectually curious, analytical, and possesses an entrepreneurial mindset. Role Possesses a strong knowledge of programming, tools, architecture patterns, and automation Ensures Performance and Scalability for applications and platforms Works closely with software engineers to build quality by ensuring proper test and code coverage, configuration quality, monitoring, early performance testing Develops and implements QA standards, processes, tools and methodologies; partners with other functions to establish testing requirements Documents test strategies and test plans; translates complex system requirements and specs into test requirements and testing methods Participates in requirements review and testing activities; monitors resolutions and retains documentation Identifies and implements complex automation efforts; replicates and resolves production issues Translates complex system requirements and specs into test requirements and testing methods Directs evaluation of manual testing tools for automation opportunities All About You Experience overseeing the coding, testing, and review process for unit and integration testing Successfully led multiple test paths simultaneously Successfully ensured quality of one or more application codebases and alignment with development standard Experience in building automation frameworks, acceptance and integration test automation scripts, integrating with other tools Knowledge of software development processes including agile processes and test driven development A wide breadth and depth of technical experience including Java/JEE, Linux/Solaris, Cloud architectures Must be high-energy and self-motivated to drive results Must be detail-oriented, proactive and have the ability to function in an independent environment Possesses strong communication skills -- both verbal and written – and strong relationship, collaborative skills and organizational skills Willingness and ability to learn and take on challenging opportunities and to work as a member of a diverse and geographically distributed project team Experience with complex, highly resilient, multi-tier architectures Due to COVID-19, most of our employees are working from home. We’ve implemented a virtual hiring process and continue to interview candidates by phone or video and are onboarding new hires remotely. We value the safety of each member of our community because we know we’re all in this together. Mastercard is an inclusive Equal Employment Opportunity employer that considers applicants without regard to gender, gender identity, sexual orientation, race, ethnicity, disabled or veteran status, or any other characteristic protected by law. If you require accommodations or assistance to complete the online application process, please contact reasonable.accommodation@mastercard.com and identify the type of accommodation or assistance you are requesting. Do not include any medical or health information in this email. The Reasonable Accommodations team will respond to your email promptly. Corporate Security Responsibility All Activities Involving Access To Mastercard Assets, Information, And Networks Comes With An Inherent Risk To The Organization And Therefore, It Is Expected That The Successful Candidate For This Position Must Every person working for, or on behalf of, Mastercard is responsible for information security. Abide by Mastercard’s security policies and practices; Ensure the confidentiality and integrity of the information being accessed; Report any suspected information security violation or breach, and Complete all periodic mandatory security trainings in accordance with Mastercard’s guidelines.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-23T06:23:35.000Z"
    },
    "company": {
        "name": "Mastercard",
        "link": "https://www.linkedin.com/company/mastercard"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "O'Fallon",
        "region": "MO",
        "postal_code": "63304",
        "street_address": null,
        "latitude": 38.808643,
        "longitude": -90.69996
    }
}