{
    "job": {
        "title": "Staff Software Engineer - Golang / AWS - Enterprise SaaS",
        "industry": "Computer Software",
        "description": "If you are a Senior-to-Staff level Software Engineer with proven experience building cloud-based Enterprise SaaS products at scale, please read on! This is a full-time/permanent position, direct-hire with my client. This is also a 100% REMOTE position! We are a leading cloud-native data protection SaaS company hiring for high-impact roles in our Engineering group, reporting to our Co-Founder/VP of Engineering! We are a post-Series C stage startup with significant revenue with ~$200M in funding, and are growing steadily hiring a remote-first workforce. Top Reasons to Work with Us We have an incredible company culture which is collaborative, supportive, focuses on helping teammates grow their careers, and with complete transparency from the C-Suite to the entire company. Solve Enterprise-scale engineering challenges processing metabytes of data. What You Will Be Doing Design and implement software components from the ground-up on a distributed, cloud-scale SaaS platform in a microservice-based architecture. Use public cloud technologies to solve hard problems with a security-first mindset to build high throughput, scalable data ingestion and processing pipelines. Work closely with product management and cross-functional teams such as UX, UI, and QE and Customer Success to deliver and maintain features and projects in a continuous integration and deployment manner. Analyze and monitor metrics to construct benchmarks and iterate towards optimal performance while keeping focus on cost-efficient usage of cloud resources. What You Need for this Position Proven experience designing, implementing and supporting large-scale cloud services Golang AWS Microservices Back End Kubernetes Enterprise SaaS C++ Java So, if you are a Senior-to-Staff level Software Engineer with proven experience building cloud-based Enterprise SaaS products at scale, please apply today! Email Your Resume In Word To Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also: Richard.Marion@CyberCoders.com Please do NOT change the email subject line in any way. You must keep the JobID: linkedin : RM2-1649129 -- in the email subject line for your application to be considered.*** Richard Marion - Recruiting Manager - CyberCoders Applicants must be authorized to work in the U.S. CyberCoders, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-09-02T05:30:43.000Z"
    },
    "company": {
        "name": "CyberCoders",
        "link": "https://www.linkedin.com/company/cybercoders"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "San Jose",
        "region": "CA",
        "postal_code": "95148",
        "street_address": null,
        "latitude": 37.334793,
        "longitude": -121.888145
    }
}