{
    "job": {
        "title": "Associate Data Scientist",
        "industry": "Health, Wellness and Fitness,Pharmaceuticals,Retail",
        "description": "Job Summary Applies data analysis resources and techniques to provide insights and actionable recommendations for the business. Uses statistical modeling to make predictions about future outcomes in multiple scenarios to improve products & processes. May explain findings to business audience. Job Responsibilities Responsible for applying data analysis resources and techniques to provide insights and actionable recommendations for the business. Uses statistical modeling to make predictions about future outcomes in multiple scenarios to improve products & processes. May explain findings to business audience. Assists in executing statistical and mathematical analyses to support business decision making for multiple business functions. Uses algorithms and statistical predictive models and participates in determining analytical approaches and modeling techniques to evaluate scenarios and potential future outcomes. Applies analytical rigor and statistical methods to analyze large amounts of data, using advanced statistical techniques such as predictive statistical models, customer profiling, segmentation analysis, survey design and analysis and data mining. Develops basic tests and validates hypotheses through the application of a range of advanced mathematical, statistical, scientific and/or computational techniques, such as probability models, machine learning, data mining, pattern recognition, data visualization, predictive analytics, data warehousing, artificial intelligence and/or other similarly complex methods. . Documents assigned aspects of projects including business objectives, data gathering and processing, leading approaches, final algorithm, detailed set of results and analytical metrics. Assists with developing materials to explain project findings. Escalates problems and roadblocks as they occur. Interacts with team members and peers and may interact with external peers to provide semi-routine information related to assigned tasks. May prepare and present interpretation of findings to internal clients. Basic Qualifications Bachelor's degree. Knowledge of analytics, statistical or mathematical concepts and techniques. Knowledge of analysis and data interpretation. Willing to travel up to 10% of the time for business purposes (within state and out of state). Preferred Qualifications N/A",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-29T04:38:53.000Z"
    },
    "company": {
        "name": "Walgreens",
        "link": "https://www.linkedin.com/company/walgreens"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Chicago",
        "region": "IL",
        "postal_code": "60654",
        "street_address": null,
        "latitude": 41.88323,
        "longitude": -87.6324
    }
}