{
    "job": {
        "title": "Machine Learning Engineer",
        "industry": "Biotechnology,Research,Pharmaceuticals",
        "description": "We're hiring Senior Machine Learning Engineers with expertise in data science and predictive statistics (analytics and modeling). Because you will be working with medical and biological datasets, some background in biomedical sciences is ideal. A deep background in Bayesian methods is highly desirable, as is fluency in R. Please notice that this is not a financial-sector job, thanks. However, if you're looking for a challenging, deeply rewarding position applying advanced machine learning to help solve some of humanity's toughest problems... then this job may be for you. With ICR, you'll get to: Apply cutting-edge machine learning techniques to detect human age-related diseases as early as possible Lead a team that is trying to redefine personalized preventive and regenerative medicine Use your creativity to solve challenging problems You'll also need: The ability to work in the United States without sponsorship A can-do attitude and a friendly, easygoing personality Position title and compensation are commensurate with experience. The compensation ranges listed below are starting ranges. Starting base pay range: $155,000/yr - $225,000/yr Starting additional compensation range: $15,000/yr - $30,000/yr",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-22T12:13:08.000Z"
    },
    "company": {
        "name": "InVitro Cell Research, LLC",
        "link": "https://www.linkedin.com/company/invitro-cell-research-llc"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "New York City Metropolitan Area",
        "region": null,
        "postal_code": "10021",
        "street_address": null,
        "latitude": 40.748295,
        "longitude": -73.98556
    }
}