{
    "job": {
        "title": "Full Stack Software Developer",
        "industry": "Staffing and Recruiting",
        "description": "Job Title: Full Stack Software Developer Duration: 6+ months Location: San Diego, CA Duties: Work closely with product and development teams to create an amazing user experience. Build integration and unit tests along with code. Work in agile development environment with short sprints and standups. Implement proof of concept, prototypes and production-grade software. Maintain and support existing software and hardware systems, infrastructure and production. Assist support staff and team members in trouble-shooting software issues and implementing bug fixes. Takes ownership of the code base. Work to continually improve code quality, and get bugs fixed and deployed rapidly Experience in or knowledge of Python, Celery, Go, Elasticsearch, PostgreSQL, SaltStack, Flask, Git, React, Elixir. Deep understanding and knowledge of virtualization (libvirt, KVM, Xenserver). Excellent communication and interpersonal skills. Strong programming skills including software engineering methodologies and best practices. REST/API development. Strong experience with Python or other scripting languages. Experience working in a Linux development environment. Strong experience with relational databases, and specifically MySQL, Elasticsearch, Redis. Excellent HTML, CSS and JavaScript skills. Experience in consuming RESTful APIs. Skills: Required Skills : Java, spring boot, Web services, AWS Education: EOE AA M/F/Vet/Disability.",
        "employment_type": "CONTRACTOR",
        "date_posted": "2021-08-25T17:40:22.000Z"
    },
    "company": {
        "name": "Russell Tobin",
        "link": "https://www.linkedin.com/company/russell-tobin-&amp;-associates-llc"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "San Diego",
        "region": "CA",
        "postal_code": "92161",
        "street_address": null,
        "latitude": 32.71576,
        "longitude": -117.16382
    }
}