{
    "job": {
        "title": "Data Scientist",
        "industry": "Information Technology and Services",
        "description": "Responsibilities Build and enhance media mix models to connect the impact of marketing drivers and business short-term and long-term outcomes. Develop optimization and simulation algorithms to guide the marketing investment and allocation recommendations to stakeholders. Scale current Python modeling algorithm through parallel processing or other efficiency enhancement. Design and execute A/B tests and other experiments. Explain complex modeling approaches in simple terms and develop compelling narratives that connect modeling results with business problems. Partner with cross-functional team to streamline data science solutions. Minimum Qualifications Ph.D. degree in Statistics, Engineering, Operations Research, Computer Science, Economics, Mathematics, Physics, or related field. Industry experience in building market mix and multi-touch attribution models. 8+ years of experience in MMM, measurement, A/B testing, marketing strategy & analytics. Experience with advertising, measurement, and/or digital marketing analytics. Experience with advertising technology platforms Ad servers, DSPs, DMPs. Proficient coding skills (Python/SQL) and database knowledge. Extensive experience with predictive modeling algorithms. Strong project management skills. Communicate technical material to a range of audiences and to ‘tell a story that provides insight into the business. You have a passion for working in a fast-paced agile environment. A collaborative mindset and a sense of curiosity.",
        "employment_type": "CONTRACTOR",
        "date_posted": "2021-08-05T23:00:25.000Z"
    },
    "company": {
        "name": "Sigmaways Inc",
        "link": "https://www.linkedin.com/company/sigmaways"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 96,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "San Bruno",
        "region": "CA",
        "postal_code": "94067",
        "street_address": null,
        "latitude": 37.627277,
        "longitude": -122.416145
    }
}