{
    "job": {
        "title": "Senior Full Stack Software Engineer",
        "industry": "Financial Services",
        "description": "Self Financial, Inc. helps consumers establish and build credit history. We are a venture-backed, financial services startup based in Austin, TX. At Self, our mission is to help millions of people build credit and save money on their journey toward financial security. There are about 100 million people in the US who have low credit scores or who have no access to credit at all. Sadly, there aren’t many options for these people. Most banks aren’t doing anything material to change the situation because it’s not profitable for them to do so. Bad credit or no credit history can be barriers to renting an apartment or getting certain jobs, let alone buying a car or house. And if you can get a loan with a low credit score, you’re very likely to pay a lot more in interest over the life of that loan. Our team is passionate about challenging the status quo of the credit industry by giving people accessible and affordable tools to take control of their credit. Executing on our mission requires deep collaboration across our teams to ensure our products reach the people who can most benefit from them. We're looking for people who share a passion for our mission and relate to why we do what we do. At Self, we want to work with people who are driven to tackle challenges, bring unique perspectives, find solutions and help make the financial space a better place for our consumers. We recognize that it takes different people and personalities to make our products – and our company – truly great. We only seek the best. If you are someone who is equally passionate as we are, we want to chat with you. About the Role You will implement a user experience that can be seamless for Android, iOS, and Web users. You will integrate the front-end elements with our Rest APIs and other 3rd-party services. You will develop the services and infrastructure needed to provide essential customer-facing solutions at a massive scale. You will work with designers, product managers and other team members in brainstorming new ideas, developing features, gathering feedback and iterating, thereby providing impactful improvement to our products. You will report to an engineering manager and work with our amazing team of professional engineers. Qualifications: 5+ years of software engineering experience. Bachelor’s degree in Computer Science or a related technical discipline. Fluency in HTML, CSS, JavaScript and related web technologies. Experience with the development of Python/Flask code in a production environment. Experience building and consuming APIs to work with other services using REST. Proficiency with SQL and relational databases such as PostgreSQL. Experience in the container orchestration space (Docker, Kubernetes). Experience with AWS and cloud architectures/services is a plus. Experience with common software engineering tools such as Git (or other VCS), JIRA, Confluence and similar platforms. Why Self? There are approximately 100 million people in the US who have low credit scores or who have no access to credit at all. Sadly, they have few options. Most banks and financial institutions don’t make any material effort to address this situation because it’s not profitable for them to do so. Poor credit or a lack of credit history can create major barriers to renting an apartment or getting certain jobs, let alone buying a car or house. Even if you can get a loan, with a low credit score you’re very likely to pay much more in interest and fees over the life of that loan. Self Financial, Inc. is a venture-backed, financial services startup based in Austin, TX. Our mission is to address this inequity by helping millions of traditionally-underserved people build credit and save money on their journey toward financial security. In addition to our positive mission, we also foster an open, welcoming, and fun culture, and take pride in being one of Austin’s best places to work. Benefits and Perks: We have the compensation and benefits you expect. But, there's one thing that Self Financial can offer that many startups cannot: we can positively change the world, while making a profit. Over 64 million adults in the U.S. do not have a credit score because of a lack of credit history. Self is solving this problem with creative technology solutions and partnerships. Our perks include: Competitive Pay Bonus Program Stock Options Self pays 100% of employee's monthly medical, dental and vision benefit costs and a portion of dependent insurance coverage Buy up options available, costs vary across benefit type 401(k) Plan available to full-time employees to save for retirement Self pays 100% of Life/AD&D/Short-Term and Long-Term Disability insurance premium costs for all full-time employees Enjoy our flexible vacation policy Company paid education and training programs Free at-home workout through Sworkit and gym membership Plenty of snacks and drinks provided at the office Casual dress code Team building, happy hours and events (Online now, due to pandemic) Downtown Austin office space (Our offices are partially open) Remote work arrangements (due to the pandemic) Monthly $100 COVID stipend for full time employees through 12/2021 How we act with each other is how we act with our customers. We are direct, transparent and respectful, and we hope you embrace that approach. Self Financial requires all employees hired to successfully pass a background check. We are an Equal Opportunity Employer.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-09T20:06:42.000Z"
    },
    "company": {
        "name": "Self Financial, Inc.",
        "link": "https://www.linkedin.com/company/self-financial"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Austin",
        "region": "TX",
        "postal_code": "78746",
        "street_address": null,
        "latitude": 30.264978,
        "longitude": -97.7466
    }
}