{
    "job": {
        "title": "Research Assistant - Max Nader Center for Research Technologies and Outcomes, Full-Time",
        "industry": "Nonprofit Organization Management,Health, Wellness and Fitness,Hospital &amp; Health Care",
        "description": "Job Description The Research Assistant is responsible for conducting literature searches, data management, recruiting participants, obtaining consents, maintaining files, scheduling and conducting interviews of patients and family members, maintaining data collection files, assisting with data analysis and generating correspondence, reports and graphics. The Research Assistant will consistently demonstrate support of the Shirley Ryan AbilityLab statement of Vision, Mission and Core Values by striving for excellence, contributing to the team efforts and showing respect and compassion for patients and their families, fellow employees, and all others with whom there is contact at or in the interest of the institute. The Research Assistant will demonstrate Shirley Ryan AbilityLab Core Attributes: Communication, Accountability, Flexibility/Adaptability, Judgment/Problem Solving, Customer Service and Core Values (Hope, Compassion, Discovery, Collaboration, and Commitment to Excellence) while fulfilling job duties. Principal Responsibilities Subject Recruitment Contacts hospital-site staff to identify potential participants; reviews medical records to determine appropriateness of patients for study. Explains study to patients and family members, requests participation and obtains informed consent Schedules and confirms participants for hospital and/or home interviews Data Collection Conducts on and off site interviews using a variety of structured and non-structured questionnaires Retrieves and records data from medical records and records data from interviews on appropriate forms Uses clinical judgment to alert supervisor in a timely manner that participant responses may indicate need for professional intervention Maintains interim contact with study participants to maintain current address and telephone information Dissemination Assists in development of data tables, graphs and charts and preparation of material for presentation Data Management Assists in the collection of new data; codes, cleans, transcribes, records, enters and stores all data collected; coordinates data collection with other research staff as appropriate Generates reports detailing data collected Conducts literature searches, copying and distributing articles as appropriate Transcribes and codes taped interviews Maintains an inventory of data collection forms to ensure ease of data retrieval Assists in analysis of qualitative and quantitative data by coding verbatim interviews Performs various record-keeping tasks such as filing consent forms and other data collection forms on all eligible participants to ensure ease of data retrieval and tracking of participants Supports Scholarly Activities Attends meetings; takes minutes as assigned6. Perform all other duties that may be assigned in the best interest of the Shirley Ryan AbilityLab. Reporting Relationships Reports directly to Lab Manager, Research Scientist, or Project Director Working Conditions Normal office/research laboratory environment with little or no exposure to dust or extreme temperature. May involve travel to other hospital/research sites and possibly to participants’ homes. Interviews/experiments may require flexible day, evening and/or weekend hours. Required Experience Work requires communication and mathematics skills normally acquired in four years of college, plus three to six months of related work experience. Prefer graduate of or student in graduate program in neurosciences, nursing, psychology, engineering, social work, public health or related field. Knowledge of basic computer hardware in addition to software such as Microsoft Office, statistical programs such as Stata or SPSS, and/or relevant engineering or mathematical programs such as Matlab, as appropriate. Familiarity with medical, engineering or health services research terminology and basic research/statistical methodology is required, as appropriate to the position. Ability to accurately review and enter project data and to concentrate and pay close attention to detail for up to 75% of work time is required. Analytical ability is required to prepare reports, maintain data inventory, code, transcribe interviews, develop graphs, perform literature searches, negotiate systems in several hospitals and/or human service organizations, and identify concerns/responses of participants that require termination of interview or possible intervention. Strong interpersonal skills are needed to interact effectively with patients/family member dyads, physicians, other human service professionals and a variety of supervisors for various research projects. Flexibility to coordinate scheduling with other project staff is needed. Proficient typing and administrative skills to transcribe data, prepare correspondence, and maintain files. Exercises independent judgment in assigned area of responsibility. May be expected to take leadership on certain project tasks. Click here to learn more about SRAlab Research Click here to learn more about the Max Näder Center for Rehabilitation Technologies and Outcomes Research Principal Investigator: Arun Jayaraman About Shirley Ryan AbilityLab Shirley Ryan AbilityLab is the global leader in physical medicine and rehabilitation for adults and children with the most severe, complex conditions. By joining our team, you will be part of our life-changing Mission and Vision. You’ll work in a truly inclusive environment where diversity and equity are championed through words and actions. You’ll contribute to an innovative culture that is second to none, one that embraces curiosity, discovery and compassion. You’ll play a role in something that’s never been done before as we integrate science and clinical care to help patients achieve better, faster outcomes — as we Advance Human Ability, together. The above statements are intended to describe the general nature and level of work being performed by people assigned to this classification. They are not intended to be construed as an exhaustive list of all responsibilities, duties and skills required of personnel so classified. Shirley Ryan AbilityLab is an equal opportunity/affirmative action employer. All qualified applicants will receive consideration for employment without regard to sex, gender identity, sexual orientation, race, color, religion, national origin, disability, protected Veteran status, age, or any other characteristic protected by law.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-24T01:43:23.000Z"
    },
    "company": {
        "name": "Shirley Ryan AbilityLab",
        "link": "https://www.linkedin.com/company/shirley-ryan-abilitylab"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 48,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Chicago",
        "region": "IL",
        "postal_code": "60654",
        "street_address": null,
        "latitude": 41.88323,
        "longitude": -87.6324
    }
}