{
    "job": {
        "title": "Senior Machine Learning Engineer",
        "industry": "Information Technology and Services,Computer Software",
        "description": "An AI engineering company that creates software solutions that go beyond conventional AI is looking for a Senior Machine Learning Engineer to join their team! This Jobot Job is hosted by Matt Mahoney Are you a fit? Easy Apply now by clicking the \"Apply\" button and sending us your resume. Salary $170,000 - $225,000 per year A Bit About Us This is a well-funded computer software company that was founded in 2014 and raised a $133M Series C last year. They are an AI/ML focused startup servicing the Energy, Healthcare and Finance sectors by building industrial AI MVPs and POCs for larger corporations. They are looking for a Senior ML Engineer to build modern ML models for their products and work with their software team to deploy and maintain the models in production. Why join us? Very competitive Base Salary Equity Yearly Bonus Generous PTO Full Healthcare Coverage (Medical, Dental, Vision) This is an opportunity to join a well-funded and growing Computer Software startup!! Job Details The ideal candidate has experience with Python Tensorflow PyTorch Keras Spark AWS or Azure (plus) Cubflow or MLflow (plus) Interested in hearing more? Easy Apply now by clicking the \"Apply\" button.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-19T00:00:00.000Z"
    },
    "company": {
        "name": "Jobot",
        "link": "https://www.linkedin.com/company/jobot"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Glendale",
        "region": "CA",
        "postal_code": "91205",
        "street_address": null,
        "latitude": 34.148136,
        "longitude": -118.24644
    }
}