{
    "job": {
        "title": "Software Engineer ",
        "industry": "Retail,Consumer Goods",
        "description": "Helix is an innovative direct-to-consumer brand platform, operating a portfolio of home goods brands. Helix Sleep, our flagship brand launched in 2015, aims to change the way people sleep by bringing customization to the category through individually personalized mattresses for you, based on how you sleep. Each mattress is designed to your body type, sleeping position, and feel preference using our proprietary sleep technology. Birch by Helix is our all-natural and sustainable sleep brand, with 100% organic certified products. Finally, we recently launched Allform by Helix, our first step outside of the bedroom into the living room. Allform brings high-end product quality and extreme modularity to sofa category. All our brands celebrate the power of personal preferences and individuality. We offer free shipping directly to your doorstep, a 100-night trial, and value-based pricing on all our products. Our top-rated customer experience team treats you like a person, not a commission. Since launching in August of 2015, the company has sold over a hundred thousand mattresses and has over 1 billion hours slept on our beds. We are growing rapidly. Helix is headquartered in New York City. We are seeking an ambitious full-time remote Laravel and PHP software engineer to join our small engineering team at Helix and help build our existing set of tools and websites, shape our product, engineering culture, and team. This high-impact role will be working on incredibly exciting projects involving our entire suite of products and will be an integral part of our team. This job is fully remote and highly adaptable to your work schedule, with the team already spread across three continents, although we have a preference for developers that can work during normal EDT hours. Role and Responsibilities This is an exciting time to join the Helix Engineering Team, as we experience rapid growth and expansion. Our engineering team is still quite small and you will play a significant role in shaping our platform. Implement solutions with concise, efficient, testable code. Explore requirements and recommend solutions to achieve those needs. Support teammates and end users with code fixes and day-to-day interactions. Provide feedback on code reviews and be willing to receive constructive feedback on your own code Communicate clearly and effectively with non-technical stakeholders to help them achieve their goals Take ownership of projects/features and fill in gaps in product as needed Background and Experience PHP — 1-3 years of experience working with PHP 7.0+. Laravel — 1-3 years of experience working with Laravel. Git — Basics and workflows. JavaScript — Basic understanding of vanilla JavaScript. Linux — Know the basics of navigation around via the command line. Ability to prioritize coding tasks and ship code quickly and regularly. Ability to work collaboratively and iteratively. Preference will be given to candidates with experience in any of the following: Alpine.js/Vue.js — Experience working with Alpine.js and/or Vue.js Livewire — Experience working with Laravel Livewire Shopify — Experience working with Shopify and their APIs. Strong communication skills. Have always had a passion to create stuff. Tech Stack Laravel (PHP) Livewire Alpine.js and Vue.js MySQL Redis Digital Ocean Laravel Vapor (Serverless) Perks: A free Helix mattress Wellness Package - subsidies for healthy initiatives Home office setup stipend Free coffee, snacks, and weekly team lunches Bi-weekly company-hosted happy hours / activities Dog-friendly office in NYC Friends and family discount on all Helix, Birch, and Allform brand products Compensation and Benefits: Competitive salary Full access to leadership team Fully covered medical, dental, and vision insurance (with options to opt into a premium plans) Commuter benefits Competitive parental leave policy for qualifying employees Stock options 401(k) program Employee Referral Program",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-15T16:11:35.000Z"
    },
    "company": {
        "name": "Helix",
        "link": "https://www.linkedin.com/company/helix-sleep"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 12,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "New York City Metropolitan Area",
        "region": null,
        "postal_code": "10021",
        "street_address": null,
        "latitude": 40.748295,
        "longitude": -73.98556
    }
}