{
    "job": {
        "title": "Site Reliability Engineer",
        "industry": "Internet",
        "description": "The Company CodeSignal is a fast-growing technology company helping the world #GoBeyondResumes in tech recruiting. Our state-of-the-art cloud integrated development environment and research-based assessments allow our customers to measure coding skills accurately and objectively. Some of our recent accomplishments include: Raising $50M in our Series C led by Index Ventures in 2021 Raising $25M in our Series B led by Menlo Ventures in late 2020 Coming in at #3 on SaaS Mag’s “SaaS 1000” list in 2020 Receiving G2 award for Best Software Company for 2020 Being named on CNBC’s 2019 Upstart 100 list Our Values Be helpful and empathetic. We believe that empathy is the foundation of building a great team, product, and service. We look at things from our users' perspective, and we always treat our users and each other with trust and respect. Take ownership. All of us are on this ship together. When you see a problem to fix or an area to improve, do it! Move quickly and make mistakes. We're not afraid to take risks. Be bold and try things; it's better to validate an idea quickly than to fall behind chasing perfection. Have a point of view and embrace debate. We value getting things right and don't stand on hierarchy. If you have an opinion, speak up, and you'll be heard. Day - to - Day Be an impactful part of a small, but growing team. Help design and iterate on our system for responsive monitoring of running service logs, alerts, and performance. Run performance profiling and load testing; analyze results to find the bottlenecks. Improve reliability, quality, and time-to-market of our suite of software solutions Brainstorm and research new ideas and tools to improve development delivery. Basic Qualifications Strong communication and cooperation skills. You are authorized to work where you plan to live. (We are sorry, but we can't sponsor visas for this position.) You're available to work full-time. At least 2 years of software engineering or site reliability engineering experience. Experience building and deploying Docker and Linux containers Demonstrated ability to use cloud services (AWS, DigitalOcean). Ability to program or script in at least one high level language, such as JavaScript, Python, Ruby. Preferred Qualifications Experience in containers, and container orchestration (e.g. Kubernetes) Familiarity with any part of our stack, including Node, JavaScript, Mongo, or Docker. Timezone overlap with one of our offices (SF or Yerevan) during regular business hours. Why You’ll Love It Here 💰 Competitive salary based on experience 🩺 Medical, dental, vision, and 401k 🥳 Team activity fund to connect with your fellow Signalites 🏝 Unlimited vacation policy 📚 Continuous learning with unlimited book reimbursement 💙 A challenging and fulfilling opportunity to join one of the fastest-growing SaaS companies We know that great work comes from great and inclusive teams. At CodeSignal, we specifically look for individuals of varying strengths, skills, backgrounds, and ideas. We believe this gives us a competitive advantage to better serve our customers and helps us all grow as Signalites and individuals. We hire candidates of any race, color, ancestry, religion, sex, national origin, sexual orientation, gender identity, age, marital or family status, disability, Veteran status, and any other status. CodeSignal is proud to be an Equal Opportunity Employer.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-10-15T16:55:11.000Z"
    },
    "company": {
        "name": "CodeSignal",
        "link": "https://www.linkedin.com/company/codesignal"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "San Francisco Bay Area",
        "region": null,
        "postal_code": "94112",
        "street_address": null,
        "latitude": 37.39271,
        "longitude": -122.042
    }
}