{
    "job": {
        "title": "Windows Engineer",
        "industry": "Computer Software",
        "description": "We are looking for a Windows Engineer to join our multi-tenant hosting team. You’ll be responsible for the design, implementation, and health of our domain architecture including but not limited to Active Directory, authentication technologies, and DNS. As part of Epic's hosting team, you'll enjoy opportunities to keep abreast of the latest technologies and work collaboratively with experts in a variety of knowledge areas to ensure a robust and secure environment that forms the foundation of our hosting service. Desired Skills And Knowledge Areas Expertise in Active Directory design and maintenance Expertise in automation using scripting tools like Powershell Experience with AD trusts and replication Experience administering Azure Active Directory and Azure Active Directory Connect Experience with deployment and troubleshooting of DNS & DHCP Knowledge of configuration management tools like Puppet, Chef, or Ansible Knowledge of Active Directory Federation Services Knowledge of authentication technologies Kerberos, LDAP, SAML More than just important work . Epic is located in Madison, Wisconsin, a city regularly ranked as one of America's best places to live. Epic's environment is one of continuous learning; you'll have access to opportunities to expand your skill set and share your knowledge with others. We offer comprehensive benefits to keep you healthy and happy as you grow in your life and career, and your merit-based compensation will reflect the impact your work has on the company and our customers. You'll also be eligible for annual raises and bonuses, as well as stock grants, which give you an even greater stake in the success of Epic and our customers. Epic is an Equal Opportunity employer. Please see our full non-discrimination statement at https //careers.epic.com/EEO. A history of academic and professional success Eligibility to work in the U.S. without visa sponsorship. Troubleshooting skills and good customer service are required Relocation to the Madison, WI, area (reimbursed) Available to work 1st, 2nd, or 3rd shift COVID-19 vaccination As a member of the Hosting team at Epic you'll be responsible for the confidentiality, integrity, and availability of Epic Hosting. Those responsibilities include: Following policies and procedures and escalating when policies or procedures are not followed Escalating potential security incidents and providing relevant information Meeting all security responsibilities defined in policies and procedures",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-20T00:26:56.000Z"
    },
    "company": {
        "name": "Epic",
        "link": "https://www.linkedin.com/company/epic1979"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Rockville",
        "region": "MD",
        "postal_code": "20850",
        "street_address": null,
        "latitude": 39.08418,
        "longitude": -77.1529
    }
}