{
    "job": {
        "title": "Software Engineer – New College Graduate",
        "industry": "Electrical/Electronic Manufacturing,Information Technology and Services,Computer Software",
        "description": "Description We are Silicon Labs . We are a leader in secure, intelligent wireless technology for a more connected world. Our integrated hardware and software platform, intuitive development tools, unmatched ecosystem and robust support make us the ideal long-term partner in building advanced industrial, commercial, home and life applications. We make it easy for developers to solve complex wireless challenges throughout the product lifecycle and get to market quickly with innovative solutions that transform industries, grow economies and improve lives. Why This Position Matters Our customers consider Silicon Labs as one of the most recognizable, well-respected, and innovative companies in the world of IoT. As a Software Engineer or Software Engineer in Test, you will be part of a highly skilled team in which every member is critical to the success of Silicon Lab’s Internet of Things product offerings. You will also work closely with cross functional teams to specify new designs, understand new product features, debug customer issues, and support customer needs. Silicon Labs has a track record of multiple industry firsts and of transforming and disrupting large and diversified markets. Our Software Engineers are at the forefront of that success! If you’re looking to make an impact, Silicon Labs is the place for you! Excited? See what it’s like to be a part of the Silicon Labs Team: http://bit.ly/WorkingInnovating http://bit.ly/WomenatSilabs http://bit.ly/SilabsGlassdoor What You’ll Do You will work closely with cross functional teams to specify new designs, understand new product features, debug customer issues, and support customer needs. You will build innovative applications that enable our customers to create products using Silicon Labs technology and reference application software to design and develop end products that incorporate our embedded wireless networking technology. Learn more about the IoT solutions you will work on. Who You Are Here’s What You Need You are an innovator, builder, and tinkerer. You have a curious mind and a drive to succeed. You want to work with a global team of technology enthusiasts and design pioneers. B.S. or M.S. in Computer Science, Computer Engineering, Electrical and Computer Engineering Experience in embedded software development with a working knowledge of C Any coursework or internship experience in the following areas will be considered a plus: Experience using both simulations and hardware testing Understanding of hardware vs. software tradeoffs Experience or interest in developing system level testing of Embedded SW Wireless Products Interest in highly constrained, real time, embedded environments Ability to quickly absorb new ideas in various domains Experience with software engineering processes such as requirements, design, implementation, and testing, and deployment Curious for more feedback? Check out our Glassdoor ( bit.ly/SilabsGlassdoor ) We are an equal opportunity employer and value diversity at our company.  We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-09-07T13:38:39.000Z"
    },
    "company": {
        "name": "Silicon Labs",
        "link": "https://www.linkedin.com/company/siliconlabs"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Austin",
        "region": "TX",
        "postal_code": "78746",
        "street_address": null,
        "latitude": 30.264978,
        "longitude": -97.7466
    }
}