{
    "job": {
        "title": "Data Scientist",
        "industry": "Information Technology and Services",
        "description": "Title: Data Scientist Why is this position open? Growth Pay/Salary/Benefits/Perks: $120k/yr - $140k/yr Work from Home Policy: Full Remote Skills Required: We're looking for highly skilled data scientist to bring your breadth of knowledge to our team. As part of our team, you'll work with other passionate data scientists in an exciting, dynamic environment working with a massive dataset utilizing machine learning and more. Best Personality Match for this Role: Someone knowledgeable with Data Science, Machine learning, and more Screening / Background checks Required: Criminal Required: - A few years of strong technical experience around data science and machine learning - Heavy with SQL and Python - Expert knowledge around machine learning, applied statistics, and A/B testing - Code optimization, deployment, and monitoring ML models - Strong collaborator Nice-to-have: - Master's or Ph.D. degree - Experience with two-sided marketplace - Experience with AWS (DynamoDB, SageMaker) or equivalent - Experience with Airflow - Experience with a deep learning framework Desired Skills and Experience We're looking for highly skilled data scientist to bring your breadth of knowledge to our team. As part of our team, you'll work with other passionate data scientists in an exciting, dynamic environment working with a massive dataset utilizing machine learning and more.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-27T23:02:41.000Z"
    },
    "company": {
        "name": "Vaco",
        "link": "https://www.linkedin.com/company/vaco"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Nashville",
        "region": "TN",
        "postal_code": "37221",
        "street_address": null,
        "latitude": 36.166344,
        "longitude": -86.77907
    }
}