{
    "job": {
        "title": "Senior Engineer/Principal Engineer, Machine Learning and Artificial Intelligence",
        "industry": "Research,Biotechnology,Pharmaceuticals",
        "description": "Company Description At Roivant, we are passionate about discovering and developing new drugs to impact patients' lives. Since its inception in 2014, Roivant has launched over 20 portfolio companies (Vants), overseen 5 successful IPOs, established a $3B partnership with a global pharma, built a pipeline of over 40 assets across various modalities and therapeutic areas, and delivered 8 successful phase 3 readouts. Roivant is currently building new capabilities in drug discovery and expanding its existing development engine to become the world's leading tech-enabled pharmaceutical company. Roivant's drug discovery capabilities are driven by our computational discovery platform, which combines preeminent physics-based tools with deep expertise in machine learning to generate unprecedented predictive power that can tackle previously intractable discovery challenges. The tight integration of this computational platform with our experimental capabilities enables the rapid design and optimization of new drugs to address a wide range of targets for diseases with high unmet need. We believe that the future of drug discovery lies in integrating predictive sciences, biology, and medicinal chemistry to accelerate the path to new medicines. This role is an opportunity to be an architect of this paradigm shift and generate transformative benefit for patients. Position Summary The candidate will apply state-of-the-art methods in machine learning, complemented by rigorous statistical analysis and other well-established methods in cheminformatics and bioinformatics, to substantially advance computation-enabled drug discovery. The candidate will work closely with an interdisciplinary team of computational chemists, biophysicists, scientific programmers, and software engineers to develop our computational platform that combines latest advances in machine learning and physics-based models. Competitive pay, equity, strong perks, and a fun working environment, along with the opportunity to do cutting edge science to design better medicines, are all good reasons to join us! Responsibilities Develop cutting-edge machine learning and statistical models that enable and accelerate drug discovery projects. Research areas include Develop protein structure prediction methods combining ML and physics-based models, achieving crystallographic accuracy and enabling prediction of effects of mutations and post-translational modifications Collaborate with quantum chemists to develop machine learning models that predict accurate molecular energies at a fraction of the computational cost of quantum chemistry Collaborate with the force field team to develop and train machine learning models to generate and improve force field parameters. Develop statistical models for predicting molecular properties based molecular structures Develop statistical models for assessing predictive accuracy of our physics models Develop generative models for designing drug-like molecules Required Qualifications Master or Ph. D. degree in computer science, applied math, or physical sciences. Experience developing machine (such as random forests, support vector machines, deep neural networks) models, familiar with latest developments in machine learning methods. Extensive experience with common machine learning tools, such as Scikit.learn, Tensorflow, Pytorch, etc.. Strong Python coding skills. Experiences working with large data sets. Additional Desirable Qualifications Experience with cheminformatic and bioinformatic tools, such as RDKit, OpenEye, Biopython, etc.. Research experience within computational physics or quantum chemistry Experience working within a collaborative team.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-01T07:33:44.000Z"
    },
    "company": {
        "name": "Roivant Sciences",
        "link": "https://www.linkedin.com/company/roivant-sciences-inc-"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "New York",
        "region": "NY",
        "postal_code": "10132",
        "street_address": null,
        "latitude": 40.713047,
        "longitude": -74.00723
    }
}