{
    "job": {
        "title": ".Net Developer - Senior",
        "industry": "Insurance",
        "description": "Ready to make an impact? If so, please read on! We know you know GEICO. But you should get to know us for great careers, too. And, right now, we’re looking for a Senior .NET Software Developer to start a GEICO career in Chevy Chase, MD. Our applications are undergoing rapid modernization efforts to develop new technologies, moving to new Cloud infrastructure, and rolling out DevOps processes. You’ll apply your .NET software development skills on a team with top honors in web and mobile development and innovate for over 15 million policyholders. At GEICO, it’s not just a job, it’s growth and opportunity. There's one thing our associates all have in common: they found a career they never expected. With coaching and mentoring, you will find your position as a Senior .NET Software Developer can become a career in the most unexpected and rewarding ways. With most of our programs and software being connected to the .NET platform, you have a tremendous opportunity to make an impact at GEICO You’ll be exposed to senior management while working on high profile, challenging projects “There are so many avenues of professional development at GEICO, including user groups, mentorship, technology classes, and development programs!” Jasmine J., GEICO Associate since 2015 Teaming Up With Programmers, Developers, Scrum Masters, Leads, Managers And Directors, You Will Get ready to join a company you can believe in and work alongside a team of associates who care. Deliver first-class software that solves real business problems Perform advanced-level application analysis, design, development, unit testing and implementation activities Provide input and feedback to others on topics of architecture design, code quality, and business solutions We are looking for people with results they are proud of, such as: Bachelor's degree in Computer Science or a technical field Four plus years of experience in full .NET software development, especially in the areas of: Visual Studio, TFS, C#, SQL Server, WCF, ASP.NET, MVC, Web API, LINQ, SOAP, and REST Four plus years of experience with application design, implementation, maintenance, diagnosing/correcting issues, managing security vulnerabilities, and maintaining compliance with industry security standards under minimal direction. Four plus years of development in a large-scale, multi-platform environment is required Experience in Agile Application Development & Scrum methodologies is preferred Research and evaluate new software, frameworks, and techniques to provide recommendations to the division Mentor less experienced .NET developers while providing training and performing code reviews. Passionate about software development and delivering high quality applications Excellent communication, problem solving and analytical skills is a must Must possess a strong sense of ownership, responsibility, and initiative Flexibility to balance multiple assignments in a fast-paced environment Ability to work independently, yet function as an integral part of a team #DI-DP Benefits As a full time associate, you’ll enjoy our Total Rewards Program* to help secure your financial future and preserve your health and well-being, including: Premier Medical, Dental and Vision Insurance with no waiting period** Paid Vacation, Sick and Parental Leave 401(k) Plan with Profit Sharing Tuition Reimbursement Paid Training and Licensures Benefits may be different by location. Benefit eligibility requirements vary and may include length of service. Coverage begins with the pay period after hire date. Must enroll in New Hire Benefits within 30 days of the date of hire for coverage to take effect. The safety of our associates, both current and future, is GEICO’s highest priority. At this time, most of our associates are working remotely due to the current COVID-19 pandemic. Candidates who are selected for this position will be trained remotely and must be able to work from home in a designated work area. Once GEICO determines it is safe for associates to return to the office, candidates may be required to work in our Chevy Chase, MD office. The equal employment opportunity policy of the GEICO Companies provides for a fair and equal employment opportunity for all associates and job applicants regardless of race, color, religious creed, national origin, ancestry, age, gender, pregnancy, sexual orientation, gender identity, marital status, familial status, disability or genetic information, in compliance with applicable federal, state and local law. GEICO hires and promotes individuals solely on the basis of their qualifications for the job to be filled. GEICO reasonably accommodates qualified individuals with disabilities to enable them to receive equal employment opportunity and/or perform the essential functions of the job, unless the accommodation would impose an undue hardship to the Company. This applies to all applicants and associates. GEICO also provides a work environment in which each associate is able to be productive and work to the best of their ability. We do not condone or tolerate an atmosphere of intimidation or harassment. We expect and require the cooperation of all associates in maintaining an atmosphere free from discrimination and harassment with mutual respect by and for all associates and applicants.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-03T03:15:58.000Z"
    },
    "company": {
        "name": "GEICO",
        "link": "https://www.linkedin.com/company/geico"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 48,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Chevy Chase",
        "region": "MD",
        "postal_code": "20861",
        "street_address": null,
        "latitude": 38.98284,
        "longitude": -77.08646
    }
}