{
    "job": {
        "title": "Data Scientist",
        "industry": "Information Technology and Services,Computer Software,Hospital &amp; Health Care",
        "description": "CitiusTech is a leader in HealthCare innovation. We work with over 120 medical technology, provider, payer and life sciences companies across the US. We are rated among top 100 Best Companies to Work For 8 years in a row and consistently achieved the highest NPS in the Industry Data Science team at CitiusTech is helping many of our clients transform customer experience, improve health outcomes and achieve business excellence through the power of AI/ML. We are growing rapidly by 2x year on year. As a team, we are focused on Deep Work in AI / ML as well as building a culture of openness and respect for each other. Job Responsibilities: Developing advanced algorithms that solve problems of large dimensionality in a computationally efficient and statistically effective manner Implementing statistical and data mining techniques e.g. hypothesis testing, machine learning, and retrieval processes on a large amount of data to identify trends, patterns and other relevant information Knowledge of databases, data modeling, data normalization etc. is a must Collaborating with clients and other stakeholders to effectively integrate and communicate analysis finding Working with OMICs, image, med device and RWE data to power various use cases in the areas of digital trials and personalised medicine Evaluating emerging datasets and technologies that may contribute to our existing analytical platforms Mandatory Skills: 3-7 years of experience in Data Science Postgraduate qualification in Statistics / Computer Science / Data Science from a premier institute Having hands-on experience on advanced analytics concepts and algorithms (e.g. Regression analysis Logistic Regression/Decision Tree, Monte Carlo methods, Survival Analysis, Simulation, Random Forest, Time series analysis etc.) Exposure to tools – Python, R and R Shiny Experience with a variety of data stores such as MongoDB, Cassandra, HBase, MySQL/Postgres Must have experience in Agile development methods. Experience with DevOps tools and workflows such as Git, GitHub, Jira, Phabricator, Jenkins, or equivalents Experience on cloud platforms, preferably in AWS or GCP or both Excellent communication skills Desired Skills : Docker, Kubernetes, Cloud experience would be a plus Health Care experience would be a significant advantage Experience in working with OMICs and imaging data is a plus Experience in TensorFlow, PyTorch and Keras is a plus Powered by JazzHR oASozlj8hj",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-06-21T09:47:38.000Z"
    },
    "company": {
        "name": "CitiusTech",
        "link": "https://www.linkedin.com/company/citiustech"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Rochester",
        "region": "MN",
        "postal_code": "55901",
        "street_address": null,
        "latitude": 44.019333,
        "longitude": -92.45887
    }
}