{
    "job": {
        "title": "Data Scientist - Artificial Intelligence/Machine Learning (100% Remote)",
        "industry": "Government Administration,Information Technology and Services",
        "description": "What You Will Do: This position supports performing the full systems and software architecture and life cycle for DevSecOps and full stack engineering tasks using Agile methodologies. As an AI / ML Specialist you will be responsible to design, implement, and maintain data architectures and services to be used for AI/ML. Candidate must be team-oriented, self-starting, and innovation-minded to individually and collectively contribute to the design and development of cutting-edge AI and Analytics solutions. Job Duties: •Work with functional analysts and product strategist to identify opportunities and leverage data to drive solutions. •Assess the effectiveness and accuracy of new data sources and data gathering techniques. •Develop custom data science models and algorithms •Work with DevSecOps engineers to create and utilize MLOPS pipeline •Actively seek and perform work, new approaches and elevate the team to higher standards •Conduct various data wrangling tasks to ensure the highest possible data quality •Communicate complex tasks in plain English so others can comprehend •Recommend and implement solutions after analyzing business needs to drive for positive outcomes •Facilitate engineering tasks and push for completion of epics •Develop user stories and define clear and achievable acceptance criteria •Conduct PRs to critique and encourage engineers to be their best •Collaborate with other technical leads to handle cross-team dependencies Required Skills: •Passion – Demonstrated ability to keep pushing for better results •Technology – Demonstrated experience using a variety of machine learning techniques and understanding of their real-world advantages and drawbacks. Knowledge of advanced statistical techniques and concepts. Experience with deploying models to production, ideally within an AWS ecosystem. Experience with Python (R and Spark a plus). •Systems – Demonstrated ability to proactively identify areas of technical improvement to improve efficiency, performance, scalability, security and maintainability of applications •Client Management- Ability to become client's trusted advisor and maximize their satisfaction •Expression –Ability to communicate in plain English to disseminate information that others comprehend •Situation – Ability to understand external and internal factors and how they may impact program, client and company and prepare mitigation approaches •Strategy – Ability to learn, listen and plan programs and tasks for the betterment of organization •Tactical – Ability to implement strategy and deliver measurable business values in iterative increments •Entrepreneur – Ability to identify, capture and implement opportunities tied to revenue streams •Education – Bachelor’s degree (or higher) in Computer Science, Mathematics, Engineering, or related field Desired Skills: •5+ years of experience implementing data science algorithms •5+ years of experience with AWS •Leadership experience •Experience supporting sales and business development •Experience using SageMaker, Databricks, MLFlow, or similar environment •Experience with large scale, high performance enterprise big data application deployment and solution architecture on complex heterogeneous environments in AWS Must Be Eligible to Obtain Government Clearance Due to federal client requirements, only US Citizens can be considered",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-24T21:42:16.000Z"
    },
    "company": {
        "name": "Maximus",
        "link": "https://www.linkedin.com/company/maximus"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "United States",
        "region": null,
        "postal_code": "99999",
        "street_address": null,
        "latitude": 39.50355,
        "longitude": -99.0183
    }
}