{
    "job": {
        "title": "Software Engineer",
        "industry": "Electrical/Electronic Manufacturing,Construction,Staffing and Recruiting",
        "description": "Cennox wants all employees to feel valued, appreciated, and free to be who they are at work. Our employee lifecycle processes are designed to prevent discrimination against our people regardless of gender identity or expression, sexual orientation, religion, ethnicity, age, neurodiversity, disability status, citizenship, or any other aspect which makes them unique. Therefore, everyone is encouraged to apply for employment with Cennox. Cennox is currently seeking a Software Engineer based in Missoula, Montana to design, develop, and support software solutions that are the backbone to our company’s success. This full-time position offers insurance and 401k benefits, and the chance to become part of a rapidly growing company. Our ideal candidate is a creative, knowledge-hungry, software guru who possesses the ability to wear many hats and actively contribute in a team environment. Your primary focus will be to design, develop, and support software solutions that are the backbone of our company’s success. We seek someone with a passion for technology and the ability to share their passion with both IT and non-IT professionals alike. We are searching for the candidate who is a great fit for our organization, therefore we will consider both new graduates and experienced applicants for this position. As a Software Engineer, you will work closely with IT professionals in our office, along with co-workers in other offices around the world via phone and internet. The position will be fast-paced, at times challenging, but also very rewarding. Responsibilities: Execute full lifecycle software development Develop well-designed, testable, efficient code Provide ongoing maintenance, support, and enhancements in existing systems and platforms Deploy software and evaluate user feedback Provide recommendations for continuous improvement Work alongside the IT team to elevate technology and consistently apply best practices Jump in and help others every chance you get Skills Required: Hands-on software development and database design Solid user interface design related to web and mobile development Creating software that works, is reliable, testable, and maintainable Understands bugs exist, but hates them and not happy until they are gone Desire to continue learning new technologies and apply the best solution to the problem Excellent verbal and written communication skills Ability to work in a team environment and take on various roles Ability to think creatively and contribute out-of-the-box solutions Strong organizational, multi-tasking, and time management abilities Self-motivated and proactive in the working environment Highly professional and reliable Experience and Education: Bachelor of Science degree in Computer Science, Engineering, or related field ­- or equivalent experience Experience with Java (or a similar programming language), required Experience in web development using web frameworks, required Experience with mobile development, preferred Experience with SQL database servers, preferred Experience with AWS or similar cloud environments, preferred Physical Requirements: Ability to sit and stay focused for long periods of time, with finger dexterity for keyboarding Vision correctable to 20/20 Perks: Eligible for 401k after one year of employment Eligible for health, dental, vision, and life insurance after an initial 90 days of employment Eligible for paid holidays and paid vacation after qualifying continuous employment Company Overview: Cennox is a global company that provides comprehensive, centrally managed field services for our clients across a range of industries. Visit us at www.cennox.com to learn more. Equal Employment Opportunity: Cennox provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws. Powered by JazzHR 4g6r5aarze",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-09T07:04:23.000Z"
    },
    "company": {
        "name": "Cennox",
        "link": "https://uk.linkedin.com/company/cennox"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Missoula",
        "region": "MT",
        "postal_code": "59812",
        "street_address": null,
        "latitude": 46.872128,
        "longitude": -113.99402
    }
}