{
    "job": {
        "title": "Process Engineer (Manufacturing/Polymers)",
        "industry": "Mechanical or Industrial Engineering",
        "description": "If you are a Process Engineer (Manufacturing/Polymers) with experience in industrial automation, please read on! Top Reasons to Work with Us We are a world-class, fast-growing, global company looking for people that have the passion to lead, the desire to grow, and the ability to create and deliver solutions for our customers. We offer an environment that is innovative, diverse, intellectually stimulating, and unique. We are a global producer of sustainable thermoplastics and are seeking a Process Engineer (with great interpersonal skills) to work with our Houston, TX facility. What You Will Be Doing Job Objective The role of the process engineer is to evaluate processes and to configure manufacturing systems to reduce cost, improve sustainability and develop best practices within the production process. The main focuses of the Process Engineers work is on maintaining reliable and safe manufacturing systems as well as manage capital equipment projects using both internal and external resources. Key Responsibilities Safety and Environmental Understand the importance of safety in manufacturing. Safety always comes first. Understand the importance of minimizing environmental impacts in the processing and manufacturing of plastic. Always strive to minimize wastes and spills when designing equipment. Process Design Facilitating all aspects of process engineering for new and existing products from feasibility testing to process automation. Developing chain of tasks for process, establishing method of production & process directives, resolving problems / bottlenecks. Providing analysis of data and generating required compliance documentation. Discovering, investigating and integrating new technologies in the processing area. Process engineering calculations - material and energy balances, strength of material, etc. Implementing statistical tools for process control & designing DOE (Design of Experiments). Preparing Process Flow Diagrams (PFD), Process and Instrumentation Diagrams (P&ID) etc. Optimizes Production Rate and Quality and Safety by eliminating bottlenecks in the grinding and extrusion process. Evaluates efficiency and capacity and safety of process equipment of extrusion and size reduction systems to identify limitations and bottlenecks. Minimize reliance on operator human skill and experience. Reviews processing performance with plant management team daily. Make recommendations to production department. What You Need for this Position Bachelors or higher degree engineering, preferably Mechanical or Chemical engineering. Strong background PLC controls, working knowledge on electrical schematics and automation design Experience in equipment troubleshooting, process optimization and production controls such as SPC and DCS. Strong mechanical aptitude with high interest in working in a manufacturing environment. Willingness to get involved in the production operation at all levels. Ability to work in a multitasking, multi-role and fast paced environment. Must be proficient in Microsoft Office including VBA and macros, AutoCAD, PLC controls and programming software, SolidWorks experience would be an asset. Strong customer/vendor interaction and interpersonal skills. Willing to occasionally, as needed, work outside of normal business hours to troubleshoot problems and facilitate projects. Experience in plastics manufacturing, especially extrusion, equipment design, process development, and polymer science is preferred. The successful candidate will be a skilled, energetic, and devoted engineer who is interested in being involved hands on in the day to day manufacturing process. They will be a key member of the facility management team reporting to the Plant Manager, providing support/direction of the manufacturing process and equipment decisions. What's In It for You Industry leading salary Medical Dental Vision Life 401(k) w/ company match ... and much, much more! So, if you are a Process Engineer with plastics experience, please apply today! Email Your Resume In Word To Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also: Danielle.Anderson@CyberCoders.com Please do NOT change the email subject line in any way. You must keep the JobID: linkedin : DA3-1628965 -- in the email subject line for your application to be considered.*** Danielle Anderson - Sr. Executive Recruiter - CyberCoders Applicants must be authorized to work in the U.S. CyberCoders, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-31T07:17:17.000Z"
    },
    "company": {
        "name": "CyberCoders",
        "link": "https://www.linkedin.com/company/cybercoders"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "La Porte",
        "region": "TX",
        "postal_code": "77572",
        "street_address": null,
        "latitude": 29.664164,
        "longitude": -95.01928
    }
}