{
    "job": {
        "title": "Data Scientist",
        "industry": "Biotechnology",
        "description": "Headquartered in South San Francisco, Calif., CareDx, Inc. is a leading precision medicine solutions company focused on the discovery, development and commercialization of clinically differentiated, high-value healthcare solutions for transplant patients and caregivers. CareDx offers products, testing services and digital healthcare solutions along the pre- and post-transplant patient journey, and is the leading provider of genomics-based information for transplant patients. Data Scientist As a member of Data Sciences & Bioinformatics group – you will bring your in-depth knowledge in statistics and probability theory for development of new analyses and algorithms. Currently, analytical frameworks are being developed on a Transplant Data Platform – a repository of large and complex data and AI engines - which provides the opportunity of RWD to RWE for clinical decision making in the transplant domain. You should have excellent working skills in multiple programming languages (R, Python, SQL) with in-depth understanding of applied statistics, probabilistic and dynamic modelling with an eye towards solving computational biology problems. Your contributions will be foundational to the company’s mission of improving the lives of organ transplant patients. Responsibilities Include But Are Not Limited To Design develop and support novel and reproducible analyses for RWD to RWE – driven by in-depth statistical knowledge. Provide analysis backbones based on strong fundamentals in(but not limited to) Bayesian probability, machine-based learning, logistic regression technique, multi-scalar dimensional models, iterative model development and hypothesis testing. Collaborate proficiently across functions from software engineers to clinical scientists. Develop visualization of complex experiments to derive biological insights – this is particularly desirable since all analyses is performed in the low-level Transplant Data Platform. Qualifications Ph.D in Applied Math, Statistics, BioStatistics or Epidemiology with significant training/experience in Statistics/Math/Computational Biology. 7+ years of experience developing/deploying scalable statistical/probabilistic models. Applied knowledge in the area of RWD to RWE Expertise in clinical data standards, controlled vocabularies and ontologies Experience in supporting pharmacoepidemiology studies with proven track record (eg. Publications) of advancing approaches with data science – highly desirable Applied knowledge with general Bioinformatics tools and database queries - preferred Experience using TensorFlow, PyTorch, Keras, NumPy, Scipy, MLib – preferred Familiarity with high-performance cluster computing infrastructures, especially PySpark programming - preferred Experience leveraging AWS-based services (e.g., EC2, S3) to speed analyses – preferred A self-driven approach with an ability and desire to communicate to a non-technical audience how complex systems work and can be applied to challenging data processing problems Additional Details Every individual at CareDx has a direct impact on our collective mission to improve the lives of organ transplant patients worldwide. We believe in taking great care of our people, so they take even greater care of our patients. Our Competitive Total Rewards Package Includes Competitive base salary and incentive compensation Health and welfare benefits including a gym reimbursement program 401(k) savings plan match Employee Stock Purchase Plan Pre-tax commuter benefits And more! In addition, we have a Living Donor Employee Recovery Policy that allows up to 30 days of paid leave annually to a full-time employee who makes the selfless act of donating an organ or bone marrow. With products that are making a difference in the lives of transplant patients today and a promising pipeline for the future, it’s an exciting time to be part of the CareDx team. Join us in partnering with transplant patients to transform our future together.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-25T16:05:59.000Z"
    },
    "company": {
        "name": "CareDx, Inc.",
        "link": "https://www.linkedin.com/company/care-dx-inc"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 84,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "South San Francisco",
        "region": "CA",
        "postal_code": "94083",
        "street_address": null,
        "latitude": 37.65568,
        "longitude": -122.41248
    }
}