{
    "job": {
        "title": "Site Reliability Engineer (SRE)",
        "industry": "Computer Hardware",
        "description": "Introduction Software Developers at IBM are the backbone of our strategic initiatives to design, code, test, and provide industry-leading solutions that make the world run today - planes and trains take off on time, bank transactions complete in the blink of an eye and the world remains safe because of the work our software developers do. Whether you are working on projects internally or for a client, software development is critical to the success of IBM and our clients worldwide. At IBM, you will use the latest software development tools, techniques and approaches and work with leading minds in the industry to build solutions you can be proud of. Your Role and Responsibilities IBM Cloud Network Services team is looking for a Site Reliability Engineer (SRE). The DNS Services team delivers the core DNS service to the VPC on IBM Cloud and its customers The SRE will be responsible for managing a mission critical IBM Cloud service. We're looking for an individual with an empathetic ear and an eye on the future. The ideal candidate will be someone looking for continual growth, can think strategically and perform tactically, and wants to make a positive difference that ripples through the organization. Job Duties IBM Cloud Network Services Site Reliability Engineers are responsible for the following: Maintaining high availability of the IBM Cloud service running on Kubernetes. Automating processes for repeatability, reliability, and auditability Staying current on best practices in the realm of large-scale distributed systems management and security, and actively applying those practices to our environments Identifying gaps in the automation and coming up with improvements Providing a support escalation path for end user problems that can't be resolved by our Customer Success Engineering squad Qualified Candidates Should Also Possess The Following Human Skills Creating and sustaining a healthy, collaborative team culture in which team members are engaged and empowered to provide input and challenge assumptions. Ability to work with cross-functional teams Self-directed and accountable Be flexible to make trade-off decisions based on business needs Keen client awareness drives your priorities Fearlessness in the face of the unknown Required Technical and Professional Expertise Demonstrated experience with Kubernetes Demonstrated experience with CI/CD tools like Travis and Jenkins Demonstrated experience with Agile Project Management Exposure to forming hypotheses about reported problems and validating these through experimentation and data feedback. Demonstrated experience using GitHub Exposure to software peer review using GitHub's collaboration features Preferred Technical And Professional Expertise Understanding of Site Reliability Engineering Experience in Server Administration Experience with Linux Writing software and tests using NodeJS, Python, or Golang (preferably Golang) Building and maintaining continuous delivery pipelines Managing capacity and performance problem determination by analyzing system metrics and logs Previous experience applying software engineering practices to hosting and managing large scale mission critical infrastructure. Understanding the latest techniques, practices, and technology from the industry, sharing these with team members, and applying them where appropriate. Experience planning for system problems by having a robust incident management practice. Continuously improving through retrospectives and post-incident investigations. About Business Unit Digitization is accelerating the ongoing evolution of business, and clouds - public, private, and hybrid - enable companies to extend their existing infrastructure and integrate across systems. IBM Cloud provides the security, control, and visibility that our clients have come to expect. We are working to provide the right tools and environment to combine all of our client’s data, no matter where it resides, to respond to changing market dynamics. Your Life @ IBM Are you craving to learn more? Prepared to solve some of the world's most unique challenges? And ready to shape the future for millions of people? If so, then it's time to join us, express your individuality, unleash your curiosity and discover new possibilities. Every IBMer, and potential ones like yourself, has a voice, carves their own path, and uses their expertise to help co-create and add to our story. Together, we have the power to make meaningful change – to alter the fabric of our clients, of society and IBM itself, to create a truly positive impact and make the world work better for everyone. It's time to define your career. About IBM IBM’s greatest invention is the IBMer. We believe that through the application of intelligence, reason and science, we can improve business, society and the human condition, bringing the power of an open hybrid cloud and AI strategy to life for our clients and partners around the world. Restlessly reinventing since 1911, we are not only one of the largest corporate organizations in the world, we’re also one of the biggest technology and consulting employers, with many of the Fortune 50 companies relying on the IBM Cloud to run their business. At IBM, we pride ourselves on being an early adopter of artificial intelligence, quantum computing and blockchain. Now it’s time for you to join us on our journey to being a responsible technology innovator and a force for good in the world. Location Statement Benefits In addition to a competitive benefits program consisting of medical and life insurance, retirement plans, and time off, eligible employees may also have access to IBM offers a wide range of resources for eligible IBMers to thrive both inside and outside of work. 12 weeks of paid parental bonding leave. Family care options are also available to support eligible employees during COVID-19. World-class training and educational resources on our personalized, AI-driven learning platform. IBM's learning culture supports your restless attitude to grow your skills and build the depth and scale of knowledge needed to achieve your career goals. Well-being programs to support mental and physical health. Financial programs that empower you to plan, save, and manage your money (including expert financial counseling, 401(k), IBM stock discount, etc.). Select educational reimbursement opportunities. Diverse and inclusive employee resource groups where you can network and connect with IBMers across the globe. Giving and volunteer programs to benefit charitable organizations and local communities. Discounts on retail products, services, and experiences. We consider qualified applicants with criminal histories, consistent with applicable law. Being You @ IBM IBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, pregnancy, disability, age, veteran status, or other characteristics. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-10-16T00:00:00.000Z"
    },
    "company": {
        "name": "IBM",
        "link": "https://www.linkedin.com/company/ibm"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Dallas",
        "region": "TX",
        "postal_code": "75342",
        "street_address": null,
        "latitude": 32.777977,
        "longitude": -96.79621
    }
}