{
    "job": {
        "title": "Senior Software Engineer, Full Stack ",
        "industry": "Information Technology and Services,Computer Software,Internet",
        "description": "Ekata, a Mastercard company, is the global standard in identity verification, providing businesses worldwide the ability to link any digital transaction to the human behind it. Our Ekata Identity Engine, the first and only of its kind, uses complex machine learning to combine features derived from the billions of transactions within our proprietary network and the data from our graph to deliver industry leading risk assessment solutions. We are looking for a Senior Full Stack Engineer based in Seattle that thrives on designing, coding, and maintaining web applications written in Ruby and JavaScript. Our ideal candidate would have the skills and desire to understand our entire stack, from Postgres to Redis to Rails, and the passion to champion new and exciting technologies to solve Ekata's unique and challenging problems. Your ideal job should be one where you work in a small team and are empowered to make yourself and your team more productive on a daily basis. You should want to be part of a team where your desire to grow and learn is valued and aptly rewarded; where using and contributing to open source are looked upon as an asset; where innovating and executing are core to your teams' beliefs. In the Senior Full Stack Engineer Role, you will: Build complex web applications in a web framework (Ruby on Rails and React) Design features where the business problem is defined but technical strategy is not Write a cross­-domain JavaScript application Follow and create best practices for clean code and architecture Deploy and operate apps in the cloud (Amazon, Rackspace, Heroku, etc.) Ensure code follows the design and insist on the highest coding standards Maintain sufficiently generic yet simple and economical solution Provide mentorship across teams and help to hire and grow the best Our ideal Senior Full Stack Engineer will have: Knowledge of REST, GraphQL, SSO, and client/server interaction Fluency in one or more languages like Ruby, Clojure, Scala, JavaScript, TypeScript, Java, Python Deep understanding of internet protocols and standards Proficiency with writing and optimizing cross­-browser CSS and HTML Knowledgeable of scaling techniques (caching, asynchronous/background job queues, etc.). Experience with SQL and NoSQL databases, and browser plugin development Aptitude to quickly learn new languages and technologies as necessary Experience with Agile development methodologies Proven experience building highly scalable and available production web apps, from glass to the database A philosophy of iteration and continuous improvement B.S. or M.S. in Computer Science or equivalent experience This position is located at our headquarters in Seattle, WA. Unwavering in our pursuit of standardizing global identity data, we are approachable, real people that genuinely care about the success of those we partner with. With a commitment to service, innovation, and ownership, Ekata is a dynamic place to work for folks who want to make an impact on a global scale. We provide learning & development opportunities for each employee and promote work-life flexibility through self-managed time off. Headquartered in downtown Seattle, Ekata is growing internationally with offices in Budapest, Hungary, Amsterdam, and Singapore. To learn more about the experience of working at Ekata visit https//ekata.com/careers/ Ekata prides itself on celebrating diversity, inclusivity, and being an equal-opportunity employer.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-18T22:11:32.000Z"
    },
    "company": {
        "name": "Ekata",
        "link": "https://www.linkedin.com/company/ekataglobal"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Seattle",
        "region": "WA",
        "postal_code": "98133",
        "street_address": null,
        "latitude": 47.60323,
        "longitude": -122.33028
    }
}