{
    "job": {
        "title": "Data Scientist",
        "industry": "Information Technology and Services,Computer Software,Hospital &amp; Health Care",
        "description": "Description Olive’s AI workforce is built to fix our broken healthcare system by addressing healthcare’s most burdensome issues -- delivering hospitals and health systems increased revenue, reduced costs, and increased capacity. People feel lost in the system today and healthcare employees are essentially working in the dark due to outdated technology that creates a lack of shared knowledge and siloed data. Olive is designed to drive connections, shining a new light on the broken healthcare processes that stand between providers and patient care. She uses AI to reveal life-changing insights that make healthcare more efficient, affordable and effective. Olive’s vision is to unleash a trillion dollars of hidden potential within healthcare by connecting its disconnected systems. Olive is improving healthcare operations today, so everyone can benefit from a healthier industry tomorrow. This Data Scientist opening will be work within our newest strategic maneuver, Olive Shares. This product was created to connect providers, payers, and patients to the Internet of Healthcare. At Olive, we build solutions to solve real-world problems, and that’s why we’re starting by addressing a huge pain point shared by providers, payers, and patients alike: prior authorization. Olive Shares will leverage the amazing AI toolkit and solutions we’ve developed for prior authorization, and bring them together to form the beginning of Olive Shares. Responsibilities Ability to collaborate with others and solve complex problem. Proficiency in solutions design and requirements. Employ machine learning and statistical modeling to create and enhance data driven products and solutions. Analyze and extract insights from internal and external data. Work with Big Data and transform complex datasets into more usable formats. Work with a variety of data science tools and programming languages Ensure data quality throughout all stages of acquisition and processing, including areas such as data sourcing/collection, ground truth generation, normalization and transformation. Outstanding verbal and written communication skills to technical and non-technical audiences of various levels in the organization, e.g., executive, management, individual contributors Excellent analytical, decision-making, problem-solving, team, and time management skills Ability to persuade and influence others on the best approach. Positive outlook, strong work ethic, and responsive to internal and external clients and contacts Ability to work as part of a team or alone making a strong contribution in either scenario. Delivery-oriented team player who takes responsibility for the team’s success and strives to continually learn and improve. Ability to interface with all levels of employees and effectively interact with various functional areas and facilities. Ability to establish and maintain effective working relationships with employees, management, and clients. Sense of ownership and pride in your performance and its impact on company success Critical thinking and problem-solving skills Requirements Masters or PhD in Statistics, Decision Sciences, Applied Mathematics, Economics or Computer Science or the equivalent combination of education, training, and work experience. Knowledge in machine learning, artificial intelligence, statistical modeling, data visualization, and data analysis Proficient in data science tools and programming languages such as (pull from existing requirements) Experience or knowledge of cloud-based technology 2+ years of hands-on experience with databases including MS-SQL, Mongo & Elasticsearch Knowledge of Java/JVM based languages. At Olive, we're committed to growing and empowering an inclusive community within our company and industry. This is why we hire and cultivate diverse teams of the best and brightest from all backgrounds, experiences, and perspectives across our organization. Research shows that oftentimes women and other minority groups only apply to open roles if they meet 100% of the listed criteria. Olive encourages everyone — including women, people of color, individuals with disabilities and those in the LGBTQIA+ community — to apply for our available positions, even if they don't necessarily check every box on the job description. Disclaimer This job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the employee. Duties, responsibilities and activities may change or new ones may be assigned. This job description does not constitute a contract of employment and Olive AI, Inc. may exercise its employment-at-will rights at any time. Benefits We take the health and happiness of our employees seriously and consistently evaluate new ways to provide an amazing place to work. From retirement planning, to a wellness program designed to actively incorporate mental and physical wellness into daily interactions amongst fellow Olivians, we make sure to take care of our own. Health, Dental, and Vision insurance that starts on your first day at Olive with 100% of premiums covered for team members and 75% covered for dependents Monthly Grid stipend to cover work related expenses Unlimited PTO Telemedicine EAP/Mental health resources Getaways by Marriott Bonvoy Family-building and fertility support via Kindbody 12 weeks of parental leave 401(K) match Wellness program Stock Options",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-10T08:45:04.000Z"
    },
    "company": {
        "name": "Olive",
        "link": "https://www.linkedin.com/company/oliveai"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Chicago",
        "region": "IL",
        "postal_code": "60654",
        "street_address": null,
        "latitude": 41.88323,
        "longitude": -87.6324
    }
}