{
    "job": {
        "title": "Software Engineer",
        "industry": "Information Technology and Services",
        "description": "We are a diversified, technology-led principal trading firm. We trade our own capital at our own risk, across a broad range of asset classes, instruments and strategies, in markets around the world. As the markets have evolved over the past 25 years, so have we – growing to include real estate, cryptocurrencies, venture capital and several industry acquisitions. With nearly 1,200 employees at our headquarters and six global offices, we work together to solve interesting problems and capture opportunities. It’s a place of high expectations, deep curiosity, and constant collaboration, with some of the smartest, most passionate people you will meet. As a Junior Software Developer, you will be an integral member of a small team of software and hardware developers. Your team will work closely with traders to solve challenging technological problems that directly impact our business. You will be mentored by experienced engineers, offered continuing education opportunities, and be expected to handle responsibility early on in your career. How you will make an impact… Work as part of a trading desk to develop, maintain, and support best-in-class software systems. Identify innovative solutions to complex problems and advocate for their implementation to your team by communicating your ideas in a clear and concise manner Design, develop, and test full-stack software systems including trading systems, research tools, and monitoring systems. Work on legacy code and greenfield development in multiple languages including Java, C++, Ruby, JavaScript, Clojure, and Python. Collaborate with traders, researchers, and software engineers in a close-knit team environment. You will be right at home if you have.... A passion for computer programming and a deep curiosity to learn and absorb new technologies quickly. Experience developing on Linux and familiarity with the command line and Bash. Experience doing both front and back-end development. Experience with test-driven development. A high level of ownership and accountability, reliability, and strong follow through. A strong interest and skills in computer programming and a desire for growth. We do not require familiarity with or prior experience in financial markets for this role.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-03T03:41:49.000Z"
    },
    "company": {
        "name": "Quantitative Systems",
        "link": "https://www.linkedin.com/company/quantitative-systems"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Austin",
        "region": "TX",
        "postal_code": "78746",
        "street_address": null,
        "latitude": 30.264978,
        "longitude": -97.7466
    }
}