{
    "job": {
        "title": "Software Engineer, Python",
        "industry": "Financial Services,Information Technology and Services",
        "description": "Software Engineer, Python HighPoint Digital, Inc. is seeking to hire a Software Engineer, Python capable of implementing, architecting, and administering server environments, preferably Python. The successful candidate will be relied upon to facilitate major machine learning projects, which requires a basic understanding of Machine Learning and methodologies. KNOWLEDGE AND SKILLS REQUIREMENTS: • 2+ years experience with Linux • 2+ years experience with scripting tools (Python, Bash or unix shell scripts) • 2+ years experience with big data platforms (Hadoop, Spark) • 2+ years experience with cloud service providers (AWS, Azure) • 2+ years experience with JupyterHub preferred • 2+ R languages, and/or scikit-learn preferred • Anaconda, SQL Server, RStudio, Spyder experience preferred • General knowledge of machine learning techniques and methodologies • Should be well organized, thorough, and able to handle competing priorities • Ability to start, manage and conclude projects independently • Ability to adjust to changes in requirements, scope and direction • Positive attitude, attention to detail and great problem-solving skills • Experience in financial industry a plus • Ability to obtain position of Public Trust designation JOB RESPONSIBILITIES: Implement, architect, and administer a Python server environment. Facilitate major machine learning projects from conception to conclusion. Collect requirements, plan implementations and integrate data sources in collaboration with stakeholders. Create understanding and build consensus with stakeholders to define project security, data architecture and operational requirements. Demonstrate strong oral and written communication skills, with the ability to communicate on technical and methodological matters with audiences of various expertise. Work onsite 100% EDUCATION AND YEARS OF EXPERIENCE REQUIREMENTS Bachelor’s degree in Computer Science, Statistics, related field or equivalent experience ABOUT HIGHPOINT: HighPoint is a growth-oriented firm that provides a unique, differentiated employee culture relative to our Federal market peers. We leverage this growth-oriented and employee-focused culture to attract and retain a higher grade of talent than our peers to be an employer of choice. HighPoint helps government agencies elevate the citizen experience (CX) by improving the touchpoints through which citizens interact with government. We were founded in 2006 by Ben Lanius with the spirit of transforming how agencies connect with and empower citizens to deliver on mission-critical objectives. At HighPoint, our focus is on delivering results that matter. We support and modernize our federal customer’s mission critical systems and functions. Agility is at our core: it is the mantra that drives us to succeed. We work quickly, analytically and deliver on agency priorities. HighPoint is privately held with 300 passionate employees across offices and locations in Indianapolis, Indiana; Baltimore, Maryland; and Herndon, Virginia. HighPoint Digital, Inc. is an equal opportunity employer. We do not discriminate on the basis of race, color, gender, sexual orientation, age, religion, national or ethnic origin, disability or veteran status. HighPoint Digital, Inc. will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with HighPoint’s legal duty to furnish information.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-16T21:56:52.000Z"
    },
    "company": {
        "name": "HighPoint Global",
        "link": "https://www.linkedin.com/company/highpoint-global-llc"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Washington DC-Baltimore Area",
        "region": null,
        "postal_code": "21201",
        "street_address": null,
        "latitude": 38.873062,
        "longitude": -77.007385
    }
}