{
    "job": {
        "title": "Quality Assurance Engineer",
        "industry": "Banking,Financial Services",
        "description": "When joining Elevations, you can expect to work for a company that: Has been in business serving the local community since 1953. Is a two-time Malcolm Baldridge National Quality Award winner, the only presidential award for performance excellence. Has been voted as the \"Best Bank\" by our members and community and \"Best Companies to Work for in Colorado\" by our employees. Promotes a safe and inclusive environment where people express themselves openly and have opportunities to grow. Recognizes and rewards people who make every person feel welcomed, valued, respected and heard. Has a highly-engaged workforce committed to innovation, continuous improvement, and collaboration. Understands when our employees thrive, our members and community thrive too. Is dedicated to consistently providing amazing experiences and creating raving fans. What's In It For You A leadership team that strives to make this the best place you've ever worked! Ample opportunity to learn, develop and grow. We offer access to LinkedIn Learning, career and leadership development programs, job shadowing, a mentor program, and tuition reimbursement. A highly-competitive total rewards package with 4 weeks paid time off, work anniversary paid time off, and 11 paid holidays. Support in giving back to our community with 16 hours of paid volunteer time off. A wellness-focused environment that encourages and empowers you to invest in your work-life balance, health and wellbeing. A strong Employee Assistance Program, offering a variety of personal and professional resources. A high-performance culture where you can be proud of your contributions and what we are able to achieve as a team. A place where your voice can be heard and your work will have an impact. Summary/Objective: Elevations is in the process of taking the foundation of its software development practice to the next level. We are looking for an individual with a passion for best practices across the QA and Agile and a strong passion for delivering quality products. The QA Engineer will be part of a growing QA organization. This position will be responsible for the design, development, and execution of test cases to ensure software products meet business needs. You will be responsible for catching bugs through manual testing processes. You will work closely with our Business, Product Managers and Developers to ensure that all code developed is properly tested. Essential Functions Include Participate in review sessions of business requirements, technical requirements and design documents to ensure the software changes are understood Coordinate with multiple business stakeholders to develop and ensure end to end test coverage Develop and manually execute test cases based on requirements Provide continuous updates on the state of testing and risk factors to schedules Work closely with other team members in the development, execution and tracking of corrective action plans that drive improved compliance, continuous improvement, increased performance and efficiencies Communicate effectively with both technical and non-technical colleagues at all levels in both verbal and written communications Contributes technical knowledge and understanding to training programs, support processes, and operating procedures Reports to: IT QA Manager Manages This role does not have supervisory responsibility Required Competencies Decision Making, Quality Orientation, Planning and Organizing, Continuous Improvement, Influencing, Building Networks Required Education And Experience B.S. in Computer Science, Information Systems, Engineering, or equivalent 3-6 years of similar or related experience Understanding of agile development processes Ability to effectively use troubleshooting and technical skills Intellectually curious & analytically minded Ability to clearly communicate about software defects, including steps to reproduce Ability to work independently as well as in teams Preferred Education and Experience: Preferred field of study: Computer Science or related field Developing automated test scripts with Selenium or related automation tool Experience with Python or Java Prefer knowledge of and experience with client and server side JavaScript, Azure or AWS cloud vendors, Linux and relational databases Prefer knowledge of and experience with IBM’s AIX operating system, Jack Henry & Associates (Symitar division) products including Episys and related (PowerOn) development Work Environment: Elevations uses multi-factor authentication to keep our data safe. As such, a personal smart phone is a requirement for employment with us. This job operates in an office setting and routinely uses standard office equipment. Physical Requirements Sitting frequently, walking occasionally, use of hands frequently, hearing constantly, talking frequently, exerting up to 10 lbs of force occasionally to lift, carry, push, pull, or move objects. Position Type/Expected Hours Of Work Full time / 40 hours per week Classification Exempt Location: Elevations Basecamp Location (1 Environmental Way, Broomfield, CO 80021) Compensation The minimum point of the budgeted range is $91,040 + an annual incentive. The candidate's starting salary will be adjusted based upon his, her, or their experience. Other Duties Please note this job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the employee for this job. Duties, responsibilities and activities may change at any time with or without notice. About Us: Elevations Credit Union is a member-owned not-for-profit financial institution serving Colorado’s Front Range. Founded in 1953, we’ve grown from 12 members and less than $100 in assets to an institution with 13 branches and more than 120,000 members that manages over $2 billion in assets and is the No. 1 credit union mortgage lender in Colorado. At Elevations, we’ve made a commitment to move away from a product-centered business model and focus instead on creating consumer solutions. Our objective is to provide our members, as well as the entire community, with unbiased consumer information. EEO Statement: Elevations Credit Union is an equal opportunity employer. We do not discriminate on the basis of race, color, religion, marital status, age, national origin, ancestry, physical or mental disability, medical condition, pregnancy, genetic information, gender, sexual orientation, gender identity or expression, veteran status, or any other status protected under federal, state, or local law. All aspects of employment including the decision to hire, promote, discipline, or discharge, will be based on merit, competence, performance, and business needs. Candidates for certain positions may be required to submit to a credit history report in determining qualification for employment with Elevations Credit Union. If the position you are applying for requires a credit history report, any information received in such a report will not be the sole factor in making an employment decision. A history of personal financial irresponsibility may be reason for disqualification insofar as it relates to your potential job duties. Elevations Credit Union is aware that occasionally there are extenuating circumstances that may affect an individual's credit history. We comply with the Fair Credit Reporting Act and the Colorado Employment Opportunity Act.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-30T05:12:18.000Z"
    },
    "company": {
        "name": "Elevations Credit Union",
        "link": "https://www.linkedin.com/company/elevations-credit-union"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Broomfield",
        "region": "CO",
        "postal_code": "80020",
        "street_address": null,
        "latitude": 39.923985,
        "longitude": -105.08166
    }
}