{
    "job": {
        "title": "Data Platform Engineer",
        "industry": "Hospitality",
        "description": "Avero Overview Created by hospitality operators for hospitality operators, Avero is the trusted technology partner for the hospitality industry. We empower 40,000+ hospitality professionals with the answers they need to transform their businesses and their lives, getting them out of the back office and into the kitchen with their staff, onto the floor with their guests, and at home with their families. We are a remote-first company with headquarters in New York City. Position Overview Avero is looking for a Data Platform Engineer who will be responsible for working within an engineering team to implement against Avero’s point-of-sale integrations and data ingestion infrastructure. You will help foster a highly collaborative and quality-focused engineering culture that addresses the complex technical challenges of a large-scale data ingestion platform. This is a 100% remote role. Who You Are An enthusiast of all things data: data modeling, data structures, data storage and retrieval, and ETL pipelines. An adaptable engineer is able to wear different hats other than that of a developer such as QA engineer, tech support, and DevOps. A software engineer who enjoys problem-solving in a collaborative environment. An outstanding communicator who can effectively share knowledge with technical and non-technical stakeholders. A motivated individual who isn’t afraid to dive into problems and contribute. What You’ll Do Contribute to Avero’s data ingestion architecture, including our point-of-sale integrations and the pipelines that load and transform that data into the Avero data standard for use in our reporting and analytics SaaS offering. Design, implement and maintain scalable data ingestion pipelines. Work within an agile engineering team to create and execute technical solutions to achieve business goals. Understand Avero’s software architecture and work with technical leadership to deliver solutions within that framework. Provide input into your team’s roadmap, milestones, and goals Follow and help refine best practices for your team and the broader engineering organization Foster a culture of accountability on your team as they deliver against their roadmap Work with technical leadership within your team and the broader organization to grow your technical expertise Occasionally share in on-call duties to support our production infrastructure What You’ll Need 3-5 years of software development experience. A strong commitment to collaboration in a remote-first engineering organization. Excellent verbal and written communication skills. Experience working within remote or geographically distributed teams is preferable. Experience designing, implementing, and maintaining data extraction, transformation, and load pipelines are preferable. You don’t need to be an expert in everything but should have significant overlap with our existing technology stack. We can help you ramp up where there are gaps. Our key technology areas include: SQL - we use Postgres and Oracle. NoSQL - we use MongoDB. Backend system technologies - we use Java, Node.js, GraphQL, gRPC, and more. Cloud infrastructure and containerization technologies - we use AWS, Terraform, and Docker. Why You’ll Love Working Here Competitive compensation, coupled with an emphasis on work/life balance. Employer-sponsored benefits package including Health, Dental, and Vision insurance. Health Savings Account with contributions from Avero quarterly! Medical and Dependent Care Flexible Spending Accounts. Company Paid Disability, Life Insurance, and AD&D. Commuter Benefits (for those in NYC!) 401k and Company Match. Parental Leave. ClassPass Discounts. Equity in the company – all employees have a stake in our growth! Disclaimer The above statements are intended to describe the general nature and level of work being performed by people assigned to this classification. They are not to be construed as an exhaustive list of all responsibilities, duties, and skills required of employees so classified. All employees may be required to perform duties outside of their normal responsibilities from time to time, as needed. Please note that we are only able to hire permanent residents (green card holders) or U.S. citizens at this time. Avero is an equal opportunity employer. We embrace humans of every background, appearance, race, religion, color, national origin, gender, gender identity, sexual orientation, age, marital status, veteran status, and disability status. If this role would make you excited to come to work every day, please apply! We look forward to connecting. About Averoinc.com Created by hospitality operators for hospitality operators, Avero is the trusted technology partner for the hospitality industry. We empower 40,000+ hospitality professionals with the answers they need to transform their businesses and their lives, getting them out of the back office and into the kitchen with their staff, onto the floor with their guests, and at home with their families. We are a remote-first company with headquarters in New York City.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-20T22:39:39.000Z"
    },
    "company": {
        "name": "Avero",
        "link": "https://www.linkedin.com/company/avero"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "New York",
        "region": "NY",
        "postal_code": "10132",
        "street_address": null,
        "latitude": 40.713047,
        "longitude": -74.00723
    }
}