{
    "job": {
        "title": "Site Reliability/Ansible Engineer",
        "industry": "Banking,Capital Markets,Financial Services",
        "description": "Company Federal Reserve Bank of Richmond What You Will Do: Provide thought leadership to the team in new technologies, identifying / implementing / leading improvements that will significantly improve time to market for our automation orchestration platform. Leverage SRE best practices - own responsibility for the availability and performance of on-prem environments. Lead the team through continuous improvement of production operations Performs resolution of complex hardware, environmental software operating systems and subsystems. Oversees problem avoidance actions. Performs change and problem management using standard tools. Ensures conformance and compliance with existing system standards. Measures performance to ensure proper operation. Define SLIs/SLOs Focus on solving problems through software Actively troubleshoot any issues that arise in production with the goal of providing permanent fixes - conduct root cause analysis of problems to prevent future occurrence Drive innovation and platform evolution - identify potential breakdowns and drive improvements Automate our operational processes as needed, with accuracy, and compliant with security standards. Provide rotational on-call support The Richmond Fed is the proud home of the Federal Reserve’s National IT organization—a nationwide team delivering technology solutions and support across the Federal Reserve System. Many National IT employees are located in Richmond, while others are based across the U.S. at other Federal locations. When you join our team, you’ll become part of a culture that welcomes differences, cares about our communities, and empowers each other to lead from where we are to make things better. Bring your passion and we’ll provide challenging and purposeful careers in a variety of fields, opportunities to grow and a wide range of benefits and perks that support your health and wealth. It’s all part of what makes #MyRichmondFed a great place to work! About The Opportunity The Solutions Engineering group has an immediate opening for a senior DevOps Automation Engineer, reporting to the manager in Automation and Orchestration group. The DevOps engineer will design and develop automation solutions to support infrastructure-as-code applications and will work collaboratively with product engineering, test automation, and operations to deliver these new capabilities and streamline current processes. Where design/coding activities will be the primary responsibilities, we own what we build so the DevOps engineer will also be responsible for maintaining automation tools used to provision, test, and deploy. Senior engineers are leaders in the organization and are responsible for setting technical direction, defining paths to accomplish target state, and working across organizational boundaries to achieve system goals. Qualifications - External Qualifications: Bachelor's Degree in Computer Science or equivalent with 3+ years of relevant work experience Required Skills 3+ years acting as a Site Reliability Engineer 3+ years of application development / scripting experience (Python, PowerShell, JavaScript, JSON, Unix Shell, Ruby) 2+ years developing/troubleshooting complex system integrations Experience supporting infrastructure for large multi-services applications and troubleshooting complex applications Experience with networking, database technologies, performance tools Experience working in Agile organizations Experience working with CI/CD pipelines Preferred Skills / Knowledge Knowledge of other Automation/Orchestration toolsets such as Chef, Puppet, Ansible, Terraform. Cloud architecture and engineering Knowledge of virtualized infrastructure design and administration Discover the Reason Why So Many People Love It Here! When you join Federal Reserve’s National IT organization, not only will you find a challenging and purposeful career, you’ll also have access to a wide range of benefits and perks that support your health and wealth, including: Great medical benefits Pension and 401(k) with employer match Generous paid time off Tuition reimbursement Employee resource networks Paid volunteer leave Flexible work options Onsite amenities that make working here fun Other Requirements and Considerations: Candidates should review the Bank’s Employee Code of Conduct to ensure compliance with conflict of interest rules and personal investment restrictions. The Code is available on the About Us, Careers webpage at www.richmondfed.org. Sponsorship is not available for this role. Selected candidate is subject to special background check procedures. Salary offered will be based on the job responsibilities and the individual’s knowledge, skills, and experience as The Federal Reserve Bank of Richmond  provides equal opportunity to all individuals without regard to race, sex, color, religion, gender identity or expression, sexual orientation, national origin, age, disability, or genetic information. Full Time / Part Time Full time Regular / Temporary Regular Job Exempt (Yes / No) Yes Job Category Information Technology Work Shift First (United States of America) The Federal Reserve Banks believe that diversity and inclusion among our employees is critical to our success as an organization, and we seek to recruit, develop and retain the most talented people from a diverse candidate pool. The Federal Reserve Banks are committed to equal employment opportunity for employees and job applicants in compliance with applicable law and to an environment where employees are valued for their differences. Privacy Notice",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-12T18:42:24.000Z"
    },
    "company": {
        "name": "Federal Reserve Bank of Richmond",
        "link": "https://www.linkedin.com/company/federal-reserve-bank-of-richmond"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Richmond",
        "region": "VA",
        "postal_code": "23284",
        "street_address": null,
        "latitude": 37.54076,
        "longitude": -77.43393
    }
}