{
    "job": {
        "title": "Lead Full Stack Engineer, Warehouse",
        "industry": "Apparel &amp; Fashion,Internet,Retail",
        "description": "Stitch Fix is transforming the way people find what they love. Our technology teams have created unique, innovative software for our customers as well as employees in merchandising, styling, warehouse systems, and inventory management. We leverage data and user research to personalize our service and make smart bets. The result is a delightful offering for our customers and a successful business serving millions of women, men, and kids. We're looking for outstanding people to contribute to our evolution. About The Role You will work within a distributed team of 4-8 software engineers and cross-functional partners including product, design, algorithms and operations.You're expected to have strong written communication skills and be able to develop strong working relationships with coworkers and business partners. You will be working on our customer facing systems, creating the future of how Stitch Fix’s clients browse and buy, or in our Merchandising, Styling or Warehouse Systems, creating the future of how Stitch Fix’s clients are styled, shown outfits and receive their purchases. This is a remote position available within the United States. We operate in an agile-inspired manner; collaborating across multiple time zones. We build modern software with modern techniques like TDD, continuous delivery, DevOps, and service-oriented architecture. We focus on high-value products that solve clearly identified problems but are designed in a sustainable way and deliver long term value. Responsibilities Include Operate as an engaged member of the engineering team - leading meetings, attending ceremonies, providing input on technical design documents & project plans, pairing with other engineers to work toward a solution, etc. Collaborating with stakeholders while leading the technical discovery, decision-making, and execution of complex and/or critical projects within the team. Model consistently delivering sustainable results against measurable goals. Proactively communicate status updates or changes to the scope or timeline of projects to stakeholders and leadership. Provide technical leadership, mentorship, pairing opportunities, and code reviews to encourage the growth of others Actively engage in the professional development and growth of your teammates. Finding new and better ways of doing things that align with business priorities. Influencing other engineers toward right-sized solutions. Participating in on-call rotations and improving the on-call experience for others. Writing and reviewing code in Ruby or Golang, JavaScript, and CSS used in applications built in React or Rails. Requirements 5+ years of experience as a software engineer. Hands-on experience with running modern web stacks (e.g. Node, React, Ruby on Rails, Golang, Postgres, GraphQL, Redis, Kafka). You are bright, kind, and motivated by challenge You have excellent analytical skills as well as communication skills both verbal and written. You take initiative and operate with accountability. You are motivated by solving problems and finding creative client-focused solutions. Might have experience working remotely alongside a distributed software engineering team. Might have experience with GraphQL schema design. Might have experience with evolving a resilient distributed service architecture. OUR TECH STACK INCLUDES... React, JavaScript, TypeScript, CSS, HTML GraphQL and Postgres Ruby,Rails,Golang and some Node.js RabbitMQ and Kafka YOU'LL LOVE WORKING AT STITCH FIX BECAUSE WE... Are a successful, vibrant, fast-growing company Are a technologically and data-driven business. Are at the forefront of tech and fashion, redefining shopping for the next generation. Are passionate about our clients and live/breathe the client experience. Get to be creative every day. Have a smart, experienced, and diverse leadership team that wants to do it right & is open to new ideas. Believe in autonomy & taking initiative. Full support for remote work—and you get to visit our SF office every few months to connect with your peers and partners. Offer transparent, equitable, and competitive compensation based on your level to help eliminate bias in salaries, as well as equity and comprehensive health benefits. Are serious about our commitment to life-work balance, and have generous parental leave policies.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-20T00:19:01.000Z"
    },
    "company": {
        "name": "Stitch Fix",
        "link": "https://www.linkedin.com/company/stitch-fix"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "United States",
        "region": null,
        "postal_code": "99999",
        "street_address": null,
        "latitude": 39.50355,
        "longitude": -99.0183
    }
}