{
    "job": {
        "title": "Senior Application Support Engineer",
        "industry": "Financial Services",
        "description": "Senior Applications Support Engineer. Direct Hire role. New York, NY. Onsite after Covid. The Senior Applications Support Engineer is accountable and responsible for performing application management services (administration, maintenance, and support) of financial applications. Key Activities include: • Administering and configuring software. • Adhering to change management best practices. • Triaging problems with applications - identifying known errors and problem trends and finding permanent solutions through root cause analysis. • Providing level 2 and 3 application support. The resource must also be able to communicate technical information accurately and imagine, conceptualize, and articulate current and future state environments. The applications engineer needs to be proficient in the application that he/she is administering to be able to facilitate strategic and tactical initiatives. Adaptability and flexibility in supporting evolving organizational needs is paramount. The resource will also be expected to engage and collaborate with business partners and lead and participate in initiatives both tactical and strategic. The role will be part of the application management team that maintains, administers, and supports the business applications in the Ebanking/Digital Banking domain within the organization. The engineer will collaborate with stakeholders from Service and Delivery, cash management, compliance and IT. Qualifications and Experience include: • Excellent troubleshooting and communication skills. • Adaptability and flexibility. • Ability to work independently. • Proven ability to assess problems and research solutions. • Proactively solve problems using automation where possible. • Strong analysis and problem-solving skills for financial system support. • Keen awareness of system vulnerabilities. • Knowledge of Windows Operating Systems, relational databases (Microsoft SQL and Oracle databases), WebSphere Application Server, Apache Tomcat, IIS, IBM MQ, Business Objects, .Net and Java applications, cloud platforms (such as VeriPark, Q2, Temenos, Backbase). • Good experience with sFTP technologies. • Ability to navigate and troubleshoot Microsoft 365 platform. • Experience with Azure, Office 365. • Familiarity with programming languages a plus (Java, C#.NET, APEX, PowerShell, PERL, Python, HTML, CSS, and JavaScript).",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-21T01:53:41.000Z"
    },
    "company": {
        "name": "TriSearch",
        "link": "https://www.linkedin.com/company/tri-search"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "New York",
        "region": "NY",
        "postal_code": "10132",
        "street_address": null,
        "latitude": 40.713047,
        "longitude": -74.00723
    }
}