{
    "job": {
        "title": "Junior Data Scientist",
        "industry": "Computer Software,Defense &amp; Space",
        "description": "Camgian is hiring a Junior Data Scientist to apply statistical theory and methods to collect, interpret, and summarize data as well as make predictions and recommended actions based on data. As a Junior Data Scientist, you will work with product managers and business stakeholders to gather and analyze large sets of structured and unstructured data in order to gain insights and drive decision making. Duties/Responsibilities Participates in data discover to detect patterns and outliers in customer data Builds predictive models and machine-learning algorithms Proposes solutions and strategies to business challenges Presents information using data visualization techniques Documents all processes and research Qualifications United States Citizenship Bachelor’s degree in Computer Science, Statistics, Mathematics, or related field required 1-3 years of experience with SQL and statistical software packages (Python, R, SAS) Experience using business intelligence tools and understanding of data frameworks Experience in data mining and statistical analysis Desired Skills Programming background in R, RStudio, TensorFlow, and/or MATLAB Knowledge of database design and set-up Able to multitask, prioritize, and manage time effectively Strong math skills Problem-solving aptitude Exceptional work ethic, willingness to learn, tenacity not to quit, aptitude to surpass, and strong desire to work in a fast-paced environment, with existing and new product lines, are necessary for success. As a growing business line this position offers an outstanding opportunity to work under the supervision, mentorship, and guidance of our CTO. Collaboration and cross pollination with other teams will be frequent, thus communication, openness, and willingness to share both success and failure is a must. We are a team-centric organization, there are no individuals, we win and lose together. Camgian offers a competitive salary, fun work environment, excellent benefits, and an equity opportunity. Camgian Culture and Core Value Traits Ability to work as part of a team while maintaining independent thinking Self-driven and self-starter in addition to excellent communication skills Great at thinking outside the box and have an aptitude for innovation and problem solving",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-24T19:08:14.000Z"
    },
    "company": {
        "name": "Camgian",
        "link": "https://www.linkedin.com/company/camgian"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 12,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Tuscaloosa",
        "region": "AL",
        "postal_code": "35401",
        "street_address": null,
        "latitude": 33.210682,
        "longitude": -87.56558
    }
}