{
    "job": {
        "title": "Senior Site Reliability Engineer",
        "industry": "Staffing and Recruiting",
        "description": "PreciseSource, a nationwide professional recruitment firm, is currently undertaking a search for a Sr. Site Reliability Engineer to run a large-scale, massively distributed, and fault-tolerant systems for an established an growing cloud services company. The Engineer will have the opportunity to manage the complex challenges of scale, while using expertise in coding, algorithms, complexity analysis, and large-scale system design. This is a new role as part of the company's East Coast expansion. This role will be located in Miami, FL, but will work remote for the foreseeable future. This is a full-time, direct hire role offering a great base salary, stock options, and great benefits including unlimited PTO. Candidate should: Have a strong foundation in developing, deploying and operating high performance distributed Web services. Have Automation first mindset. Have the ability to design systems from ground up providing detailed technical analysis or the pros and cons of each approach. Hands-on knowledge of Docker technologies. Have expertise in Azure technologies - Compute, Storage, Database. Good understanding of security practices while developing software will be helpful. Have a sound understanding of OS concepts especially *nix OSes, and tools especially those related to performance benchmarking, profiling, troubleshooting and measurement. Have the ability to work in a fast-paced, agile development environment with small, focused teams delivering product regularly. Be a solid team player. Excellent interpersonal and oral/written communication skills. Leads teams focused on quality and continuous improvement initiatives across business units within the company. Experience of operating in a Continuous delivery environment. Knowledge of Git, Jenkins, and CI/CD. Build, design and support cloud-based infrastructure. Support 24/7 operations of the company's SaaS service. Influence future product features and requirements. Contribute to existing documentation. Participate in on-call rotation. 5 to 10 years supporting large scale, distributed installations Your Past Experience & Future Success: Bachelor’s degree in Computer Science or closely related field. 5 to 10 years supporting large scale, distributed installations with cloud experience. Exposure to and experience with the following tools Ansible, Docker, Kubernetes, Python, Terraform / Terragrun. Participating in and contributing to agile methodologies and best practices. Articulate and personable with strong spoken and written language abilities. You engender a sense of mentoring and knowledge sharing amongst your team, creating a synergistic learning environment. Experience working and collaborate with a distributed SRE and Engineering team. Self motivated and sensitive about on-time delivery. We would be thrilled if you had experience with: -Jenkins and CI/CD pipeline -Apache Cassandra, Apache Kafka -Open Source Software Development -ElasticSearch / OpenDistro / OpenSearchHashiCorp Vault",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-18T19:23:18.000Z"
    },
    "company": {
        "name": "PreciseSource, LLC",
        "link": "https://www.linkedin.com/company/precisesource-llc"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Florida",
        "region": "United States",
        "postal_code": "33805",
        "street_address": null,
        "latitude": 28.595512,
        "longitude": -82.48734
    }
}