{
    "job": {
        "title": "Data Integration Engineer",
        "industry": "Information Technology and Services",
        "description": "Responsibilities Job Description for Data Integration Engineer To develop a global lab automation data architecture for the global quality laboratory enterprise, including information system (ELN, LIMS) integration with vendor-independent laboratory work cells. Additional support is needed from industry experts in GMP laboratory information technology, automation integration, and data architecture to achieve these goals. Global Quality Laboratories (GQL) would like to request 12-18 months of support to build a library of device drivers/edge devices for automation hardware to be able to publish/subscribe data to a message queue platform using MQTT protocol. Activities the role will take part to develop and implement our strategy include but are not limited to: Deliverables attributed to proof-of-concept testing/development Hardware requirements to satisfy process (if applicable) Develop/implement instrument/device connectors/drivers/edge devices Architectural data handling and transfer technologies/solutions Define process execution system requirements and scope Collaboration with cross-functional teams to implement end-to-end integration from device/instrument to lab system Technology Requested Java, Python Apache Kafka or other messaging queue platforms MQTT or other similar messaging protocol Git Basic Qualifications Highly motivated individual with 2-5 years experience working in a GMP-regulated environment BS in Engineering, Computer Science related technical field, or equivalent experience Excellent verbal and written communication skills Strong understanding of data architecture for message brokers (e.g. Apache Kafka, Azure Edgehub, MQTT Sparkplug B Protocol) Experience with equipment specific APIs or interfaces, and/or web APIs (e.g. RESTful) Knowledge/experience developing drivers, micro-services, and software interfaces Agile software development Additional Skills/Preferences Experience with Pharmaceutical or related regulated industries Experience in laboratory operations, LIMS and ELN, laboratory automation manufacturers including but not limited to; Biovia, Thermo Scientific, Hamilton Robotics, Biosero Green Button Go, Molecular Devices SoftMax Pro, Brooks SampleStores, Hamilton Work Cells, Biotek Gen5, Darwin LIMS, SmartLab, LabVantage) Experience with computer software validation requirements and qualification processes and documentation",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-09-12T03:52:52.000Z"
    },
    "company": {
        "name": "Centraprise",
        "link": "https://www.linkedin.com/company/centraprise"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Indianapolis",
        "region": "IN",
        "postal_code": "46203",
        "street_address": null,
        "latitude": 39.76845,
        "longitude": -86.15621
    }
}