{
    "job": {
        "title": "Computer Vision Algorithm Engineer",
        "industry": "Consumer Electronics",
        "description": "Summary The computer vision algorithm engineer will work in a small and dynamic team to design and implement cutting edge computer vision algorithms for Apple products. Key Qualifications Solid fundamental Computer Vision methods and concepts Experience on computer vision shipping product development Solid C/C++ development skills Experience/knowledge in 3D graphics modeling (preferred) Experience/knowledge in large scale Machine Learning and Pattern Recognition (preferred) Experience/knowledge in software development on embedded platform (preferred) Team player Passion on cutting edge computer vision/machine learning technologies and product delivery Self motivated Excellent problem solving skills Excellent communication skills Can work under stress and uncertainty Fast learner Description Video engineering group is looking for a computer vision algorithm engineer. In this position, you will work together with similar minds in a unique development team where your skills and expertise will be put into the Apple products. Education & Experience PhD in Computer Vision or similar, alternatively a comparable industry career, with significant experience in state-of-the-art Computer Vision, Machine Learning and Pattern Recognition fields. Role Number: 200171077",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-09T20:15:59.000Z"
    },
    "company": {
        "name": "Apple",
        "link": "https://www.linkedin.com/company/apple"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Cupertino",
        "region": "CA",
        "postal_code": "95014",
        "street_address": null,
        "latitude": 37.319313,
        "longitude": -122.02927
    }
}