{
    "job": {
        "title": "Software Engineer",
        "industry": "E-Learning",
        "description": "About Us Our mission is to make education accessible, and over the last two decades Study.com has become the leading online education platform delivering a personalized learning experience across a broad continuum of education for over 30 million students, instructors, and professionals every month. As a member of the Study.com team, you’ll help empower millions of learners to achieve their education and career goals. We focus on increasing access to education because we know information is the ultimate equalizer and that education is key to upward mobility. Every minute a learner enrolls in a course and our College Accelerator solution, Study.com has collectively saved students $132 million in college tuition. You’ll also be part of a company dedicated to contributing to society. Study.com has donated $23 million in-kind value across social impact programs, including matching employee contributions to non-profit organizations and millions to help schools during the pandemic. At Study.com, we know that strong communities are built on the power of our diversity and we respect and strive to understand for the diverse identities, race, ethnicities, backgrounds, and perspectives of our team members. And our work and company culture have been consistently recognized, including: Inc. Best Place to Work Fortune Great Places to Work – Best Workplaces in the Bay Area Golden Bridge Awards – Gold Winner, Corporate Social Responsibility San Francisco Business Times & Silicon Valley Business Journal – Best Places to Work At Study.com our Software Engineers help our cross-functional teams rally around common goals and deliver valuable features frequently – sometimes multiple times a day. Our Full Stack Engineers work on the front- and back-end, emphasizing collaboration, learning and fast feedback, including pair programming and regular (constructive!) code reviews. We invest in our engineers’ growth, which reflects and reinforces our mission to make education accessible. Come join us on our mission and make a difference. About the Software Engineer Position We are looking for a talented, flexible Software Engineer to join one of our cross-functional teams at Study.com. The ideal Software Engineer will have experience: Delivering end-to-end website features and solutions across the application stack in an iterative manner Collaborating on a cross-functional team to deliver against a product road map Participating in brainstorm-sessions, design discussions, code reviews, and automated test development Taking initiative to get questions answered, unblock on-going development, and make everyone on your team successful Requirements: 3+ years’ experience doing back-end development with Java 3+ years’ experience with front-end web application development using modern HTML, CSS, and JavaScript Have experience working with object-oriented design, relational databases, data structures and multi-threaded algorithms BS or MS in Computer Science or related field Self-motivated, detail-oriented and strong analytical / problem solving skills Desire to work in a collaborative, team-based environment built around Scrum Preferred Requirements: Professional experience with a modern front end javascript framework (i.e. React/Flux or Angular) Experience building and deploying mobile apps in a modern app development framework (i.e. Ionic, Flutter, or React Native) Professional experience with Machine learning, Data Analysis, SQL query optimization and tuning (MySQL preferred) Had exposure with online marketing, search engine optimization, and/or lead generation Please Note: Our primary concern is for the health and well-being of our employees, as well as candidates. Given ongoing COVID concerns, new employees are being onboarded and working remotely. Once we return to the office, this position will be located in our office in Mountain View, CA.  Study.com will be implementing a hybrid model that will include both in-office and remote work. In addition, Study.com will be requiring all employees be fully vaccinated as a condition of employment. If an accommodation is required, please speak with a member of the People Team. Life at Study.com At Study.com, you'll join an Agile team, making a big impact in a cross-functional, collaborative environment where team members wear different hats and regularly interact with senior leadership. We get things done and move quickly. Study.com’s team members, together with our Study Studio network of instructors, tutors, subject matter experts, video animators, and editors, have developed 1.5 million learning resources on our platform. This includes micro-lessons, videos, flashcards, lesson plans, worksheets and more, fueling 16 million hours of learning engagement a year. We are in the heart of downtown Mountain View, just a few steps from the Caltrain station. And regardless if we are in the office or sheltered at home, we have comprehensive health and wellness benefits. We offer ongoing education and professional growth opportunities, including a life-long membership to Study.com. You can also expect: 100% paid health, vision, and dental insurance for employees 401(k) with employer match 20 - 30 PTO days each year (increases with tenure) 10 paid holidays Work at home setup stipend Company-sponsored gym memberships Free Caltrain Pass Tuition reimbursement and gift matching programs Study.com provides equal employment opportunities to all employees and applicants for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, veteran or disability status. In addition to federal law requirements, Study.com complies with applicable state and local laws governing nondiscrimination in employment in every location in which the company has facilities. Additionally, qualified applicants with arrest and conviction records will be considered for the position in accordance with applicable state and local laws.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-17T17:33:48.000Z"
    },
    "company": {
        "name": "Study.com",
        "link": "https://www.linkedin.com/company/study-com"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Mountain View",
        "region": "CA",
        "postal_code": "94040",
        "street_address": null,
        "latitude": 37.39008,
        "longitude": -122.08139
    }
}