{
    "job": {
        "title": "Principal 3D Augmented Reality Engineer - C++ Mobile Engine",
        "industry": "Computer Software",
        "description": "If you are a Principal 3D Augmented Reality Engineer with experience, please read on! Headquartered in the San Francisco Bay Area, we're one of the largest and well-known technology companies in the world. Our world-renowned software has changed the world of design forever. We've recently launched a new product and are looking to bring on a talented senior-level engineer. This position will require someone with an expert level of knowledge of the C++ Engine. Ideally, the right candidate will have 3D Augmented Reality or Mobile Gaming experience. What You Will Be Doing Writing clean code that works across multiple platforms Working on the next great 3D AR App Create a cutting edge 3D Mobile Engine MUCH MORE> LETS TALK! What You Need for this Position 3D Engine Augmented Reality Mobile Game Development C++ C++11 game engine IOS Android 3D Mobile Engine Cross Platform Engineering What's In It for You Vacation/PTO Medical Dental Vision Relocation Bonus 401k So, if you are a Principal 3D Augmented Reality Engineer with experience, please apply today! Email Your Resume In Word To Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also: Cody.Friend@CyberCoders.com Please do NOT change the email subject line in any way. You must keep the JobID: linkedin : CF2-1649088 -- in the email subject line for your application to be considered.*** Cody Friend - Director of Recruiting - CyberCoders Applicants must be authorized to work in the U.S. CyberCoders, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-09-02T05:32:16.000Z"
    },
    "company": {
        "name": "CyberCoders",
        "link": "https://www.linkedin.com/company/cybercoders"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "San Francisco",
        "region": "CA",
        "postal_code": "94121",
        "street_address": null,
        "latitude": 37.78008,
        "longitude": -122.42016
    }
}