{
    "job": {
        "title": "Machine Learning Engineer",
        "industry": "Management Consulting,Market Research,Marketing and Advertising",
        "description": "Position: Machine Learning Engineer Location: 360 Lexington Avenue, New York, NY 10017 Company Overview Founded in 2000, Analytic Partners (AP) has grown to be the independent global leader in analytics consulting and technology. We help top-tier companies adapt to the rapidly evolving world of data, analytics, and strategic and tactical data-driven decisioning. We are fast growing with global operations across our full-service offices in New York City, Denver, Charlottesville, Dublin, Paris, Sydney, Hong Kong, Singapore, and Shanghai. We are the premier provider of integrated analytic technology and services, leveraging adaptive modeling techniques to help companies generate better business results, drive growth, and, ultimately, grow closer to their customers. We are the premier provider of integrated analytic technology and services, leveraging adaptive modeling techniques to help companies generate better business results, drive growth, and, ultimately, grow closer to their customers. Analytic Partners is a Certified Women-Owned Business, and a recognized leader in marketing measurement and optimization, and named a Leader in The Forrester Wave™ Marketing Measurement and Optimization Q1 2020, with top ranks in Strategy and Current Offering categories among all evaluated vendors. Our Values Our differentiator is - Our People! We hire the brightest talent and develop them into leaders. We foster a culture of PEOPLE, PASSION and GROWTH. People: We value our people, clients, and partners Passion: We love what we do Growth: Unlimited growth means unlimited potential AP is a client-focused, team-oriented organization where innovation and results are rewarded, and individuals can chart the course of their own careers. Team & Position Overview The position is an integral part of AP Product Group that builds science and technology applications that feed the analytical engines for AP! The team is comprised of motivated individuals that do exceptional work. They face challenges together and they win together. You will collaborate with a fun and agile team to architect, implement, test, and continuously deliver new features and products to our company and clients. The Machine Learning Engineering Team builds algorithmic models and web applications that feed the analytical engines for AP. The team is comprised of motivated full-stack machine learning engineers and covers from backend solution design, modeling, to frontend development. You will collaborate with a fun and agile team to architect, implement, test, and continuously deliver new features and products to our company and clients! You Will Own & Collaborate On Build modern web applications by leveraging Machine Learning algorithms and cutting-edge Deep Learning techniques Design and employ sophisticated analytic methodologies to help clients work through challenging marketing planning issues and business questions. Identify & help implement innovative ways to drive efficiency in our data and modeling processes Collaborate as part of a team to recommend methodology solutions that will lead to more informed decisions and improved business performance Qualifications & Experience You Will Need Advanced Degree in a quantitative field (e.g., data science, computer science) New graduates welcome to apply and 1 to 2 years working experience is preferred Deep knowledge with Machine Learning and Statistical Modeling Proficient with Python Prior experience with SQL Prior experience with ReactJS preferred Technical understanding of algorithm complexity, probability & statistics Obsessive attention to detail Strong verbal and written communication skills Great work ethic and intellectual curiosity Desire and ability to work well with others in a team environment",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-10-07T19:51:39.000Z"
    },
    "company": {
        "name": "Analytic Partners",
        "link": "https://www.linkedin.com/company/analytic-partners"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 12,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "New York",
        "region": "NY",
        "postal_code": "10132",
        "street_address": null,
        "latitude": 40.713047,
        "longitude": -74.00723
    }
}