{
    "job": {
        "title": "Data Scientist",
        "industry": "Marketing and Advertising,Information Technology and Services,Computer Software",
        "description": "We are looking for a Data Scientist to analyze large amounts of raw information to find patterns that will help improve our company. We will rely on you to build data products to extract valuable business insights. In this role, you should be highly analytical with a knack for analysis, math and statistics. Critical thinking and problem-solving skills are essential for interpreting data. We also want to see a passion for machine-learning and research. Your goal will be to help our company analyze trends to make better decisions. Responsibilities Identify valuable data sources and automate collection processes Undertake preprocessing of structured and unstructured data Analyze large amounts of information to discover trends and patterns Build predictive models and machine-learning algorithms Combine models through ensemble modeling Present information using data visualization techniques Propose solutions and strategies to business challenges Collaborate with engineering and product development teams Requirements Proven experience as a Data Scientist or Data Analyst Experience in data mining Understanding of machine-learning and operations research Knowledge of R, SQL and Python; familiarity with Scala, Java or C++ is an asset Experience using business intelligence tools (e.g. Tableau) and data frameworks (e.g. Hadoop) Analytical mind and business acumen Strong math skills (e.g. statistics, algebra) Problem-solving aptitude Excellent communication and presentation skills BSc/BA in Computer Science, Engineering or relevant field; graduate degree in Data Science or other quantitative field is preferred Benefits Health Care Plan (Medical, Dental & Vision) Paid Time Off (Vacation, Sick & Public Holidays) Training & Development Free Food & Snacks An amazing company that is GROWING QUICKLY! You get to work with a fun/interesting group of people. Real transparency into the rest of the company. Complete ownership and accountability over the role and function area.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-25T15:42:35.000Z"
    },
    "company": {
        "name": "WALTLabs.io",
        "link": "https://www.linkedin.com/company/waltlabs"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Spring",
        "region": "TX",
        "postal_code": "77387",
        "street_address": null,
        "latitude": 30.079731,
        "longitude": -95.41769
    }
}