{
    "job": {
        "title": "Site Reliability Engineer",
        "industry": "",
        "description": "Job Description for SRE As we expand our service offerings, we are currently seeking an experienced solutions architect to analyze and improve existing complex architecture. Specifically, we are searching for someone who brings fresh ideas, demonstrates a unique and informed viewpoint, and enjoys collaborating with a cross-functional team to develop real-world solutions and positive user experiences at every interaction. Objectives of this Role ●    Measure and optimize system performance, with an eye toward pushing our capabilities forward, getting ahead of customer needs, and innovating to continually improve our processes. ●    Communicate to the executive team on the architectural approach that has been taken in our GCP landscape. ●    Present architecture via presentations and clear diagrams depictions. ●    Breakdown the architecture into tangible tasks for a developer to execute in an Agile format. ●    Run the production environment by monitoring availability and taking a holistic view of system health. ●    Improve observability, reliability, and quality of our suite of software solutions. ●    Provide primary operational support and engineering for our rapidly growing new business units. Daily and Monthly Responsibilities ●    Gather and analyze metrics from both operating systems and applications to assist in performance tuning and fault finding ●    Participate in system design consulting, platform management, and capacity planning ●    Balance feature development speed and reliability with well-defined service level objectives Required Skills and Qualifications ●    Ability to program (structured and OO) with one or more high level languages, such as Golang, Python, or Java ●    Experience with Hyper Ledger blockchain technology ●    Strong understanding of Kubernetes, GKE a plus ●    Strong familiarity with Google Cloud Platform and related Google service offerings ●    GitHub, GitLab, Confluence and Jira experience a must. ●    Experience with Prometheus and Grafana. ●    A proactive approach to spotting problems, areas for improvement, and performance bottlenecks ●    A desire to take ownership of a new and growing production environment.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-17T17:16:52.000Z"
    },
    "company": {
        "name": "LPT2 LIMITED",
        "link": "https://www.linkedin.com/company/lpt2-limited"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Tampa",
        "region": "FL",
        "postal_code": "33675",
        "street_address": null,
        "latitude": 27.947424,
        "longitude": -82.45878
    }
}