{
    "job": {
        "title": "DevOps Engineer/Cloud Platform Engineer- Senior/Lead - GovCloud",
        "industry": "Computer Software,Information Technology and Services,Internet",
        "description": "To get the best candidate experience, please consider applying for a maximum of 3 roles within 12 months to ensure you are not duplicating efforts. Job Category Products and Technology Job Details Are you a DevOps Engineer with the passion to build reliable, scalable infrastructure? Do you love to work on Infrastructure automation? We are looking for you! We are looking for an experienced DevOps Engineer to join a team of highly motivated Engineers working on Infrastructure deployment at scale. Be part of the team that solves infrastructure deployment issues with software, delivers high velocity and high quality infrastructure in private and public data centers. Responsibilities You will be responsible for leading key projects in design, development, and post-release support of the tools that are used by teams internally and externally. You are part of the team which owns capacity builds, New microservice rollout, tools development to solve build issues You will get a chance to understand how things work with a large-scale production infrastructure with tons of servers across numerous data centers You will drive the automation efforts in Java, Python or Golang to eliminate manual work involved in building clusters, performing releases and other operational work You will develop plugins to monitor applications and implement self-healing mechanisms to auto-recover from outages You will automate infrastructure, configure and use Jenkins jobs, and tune systems for resiliency and performance You will get a chance to improve your communication and collaboration skills working with various other Infrastructure teams across Salesforce You will be interacting with a highly innovative and creative team of developers, open-source committers and architects You will evaluate new technologies to solve problems as needed, and also play a significant role in architectural direction Required Skills You are strong in solving Infrastructure related problems with code and you've mastered building compute capacity in a fast paced environment Strong working experience in any of the programming languages: Java, Perl, Python or GoLang. Strong working experience in Public cloud, AWS or GCP Experience in Containers and Kubernetes, EKS, GKE, AKS or On-Prem. Experience in Terraform or cloudFormation. Strong working experience with Linux internals and troubleshooting. Knowledge of Networking protocols and components: TCP/IP Stack, Switches, Routers, Load Balancers Experience or solid interest in maintaining a highly available service on production scale Experience with logging and monitoring workloads in public cloud Some experience in Orchestration tools, for example Puppet, Chef, or Ansible Experience working with any of: Java Applications (JVM), Apache, Mysql, PostgreSql, Kerberos, LDAP, Tomcat, Jetty, MongoDB etc., A continuous learner and a critical thinker A team player with great communication skills Preferred Skills AWS Cloud Security and IAM Experience in managing large scale web applications in production Experience in working with any of the build tools like Jenkins, ant, maven, git etc. Knowledge of big data technologies is considered a plus (not mandatory) U.S. citizen (U.S. born or naturalized) who does not hold dual citizenship. You agree to complete a Minimum Background Investigation (MBI) for a Moderate Public Trust position with the U.S. federal government or other clearances as deemed appropriate for the role .  This candidate must be a U.S. citizen (U.S. born or naturalized) who does not hold dual citizenship and agrees to complete a U.S. federal government Minimum Background Investigation (MBI) for a Moderate Public Trust position. Accommodations If you require assistance due to a disability applying for open positions please submit a request via this Accommodations Request Form. Posting Statement At Salesforce we believe that the business of business is to improve the state of our world. Each of us has a responsibility to drive Equality in our communities and workplaces. We are committed to creating a workforce that reflects society through inclusive programs and initiatives such as equal pay, employee resource groups, inclusive benefits, and more. Learn more about Equality at Salesforce and explore our benefits. Salesforce.com and Salesforce.org are Equal Employment Opportunity and Affirmative Action Employers. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender perception or identity, national origin, age, marital status, protected veteran status, or disability status. Salesforce.com and Salesforce.org do not accept unsolicited headhunter and agency resumes. Salesforce.com and Salesforce.org will not pay any third-party agency or company that does not have a signed agreement with Salesforce.com or Salesforce.org . Salesforce welcomes all. Pursuant to the San Francisco Fair Chance Ordinance and the Los Angeles Fair Chance Initiative for Hiring, Salesforce will consider for employment qualified applicants with arrest and conviction records.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-17T23:36:06.000Z"
    },
    "company": {
        "name": "Salesforce",
        "link": "https://www.linkedin.com/company/salesforce"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Bellevue",
        "region": "WA",
        "postal_code": "98007",
        "street_address": null,
        "latitude": 47.6137,
        "longitude": -122.19093
    }
}