{
    "job": {
        "title": "Software Engineer In Test",
        "industry": "Internet",
        "description": "About GameChanger: We believe sports are important because they encourage leadership, teamwork, responsibility, and confidence—critical life lessons that have the power to propel our youth toward meaningful futures. We recognize that without coaches, parents, and volunteers, organized youth sports could not exist. We celebrate those dedicated heroes and make it our mission to help them do what they do best. GameChanger provides teams across the country with team management and scorekeeping capabilities, as well as live fan experiences that keep parents, family, and friends engaged as games are announced, animated, and video streamed in real-time. With GameChanger, coaches and parents are able to organize and follow their athlete’s journey in a simple and powerful way. Based in downtown Manhattan, GameChanger is a cutting-edge technology company and a proud member of the DICK’S Sporting Goods family. The Position: As an SDET, you will work with our Platform team to ensure that iOS, Android, and web applications meet our high standards for quality. You will be responsible for building test automation frameworks and maintaining the test suites across our platforms. This is a full-time position within GameChanger’s Engineering Department and can be located either remotely throughout the US or at our headquarters in NYC. What You’ll Do: Lead quality assurance on our fast-paced Platform team Establish and maintain an automated test environment for UI testing for our Android, iOS, and Web apps Integrate with test case management, bug tracking, source control, and continuous integration platforms Educate team members on test automation Design, document, execute and troubleshoot automated test scenarios Estimate test efforts, analyze and communicate test results and participate in QA activities Identify required improvements in the test and development processes and make contributions to our automation tools Coordinate with Platform team and engineers to deliver stable product releases Learn and understand release processes while improving, and expanding our test coverage Contribute to planning sessions Document issues using a bug-tracking system Communicate issues found, concerns, and feedback back to the team Manage release processes Who You Are: 3+ years experience in building automated testing frameworks, including for iOS and Android native apps Experience in test automation scripting using Python, Espresso (Java), XCUI Test (Swift), and Selenium Experience in API testing, load testing, performance testing, and security testing Experience working in an Agile development process Experience testing iOS and Android native apps Positive energy and a friendly collaborative attitude Self-starter who has good attention to detail and quality Ability to trade-off getting tasks done with stepping back to see the big picture Precision in isolating issues and identifying steps to reproduce Sound judgment and problem-solving abilities Bachelor’s Degree in Computer Science Perks: Work remotely or from our well-furnished, modern office in NYC’s FiDi Unlimited vacation policy. Technology stipend - $3,500 every 2 years to purchase new technology. Full health benefits - medical, dental, vision, prescription, FSA/HRA, etc., as well as coverage for family/dependents. Life insurance - basic life, supplemental life, and dependent life. Disability leave - short-term disability and long-term disability. Retirement savings - 401K plan offered through Vanguard. Generous maternity/paternity leave. Commuter benefits. DICK’S Sporting Goods Teammate Discount. We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. In your cover letter, please tell us why you're interested in the SDET position and GameChanger.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-25T17:37:28.000Z"
    },
    "company": {
        "name": "GameChanger",
        "link": "https://www.linkedin.com/company/gamechangermedia"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "New York City Metropolitan Area",
        "region": null,
        "postal_code": "10021",
        "street_address": null,
        "latitude": 40.748295,
        "longitude": -73.98556
    }
}