{
    "job": {
        "title": "Software Engineer",
        "industry": "",
        "description": "Are you looking to join a ground-floor startup where your work makes an immediate impact? Do you want to be a part of a dynamic team with diverse backgrounds improving benefit offerings and the experience for employees? Do you want to be a part of the discussion and impact decisions that shape the future of the company you work for? Our ideal candidate is a self-motivated problem solver who thrives in an open and collaborative environment. You enjoy supporting and developing an application that will re-invent itself as and scale with market adaptation. Day to Day Responsibilities Writing clean, high-quality, high-performance, maintainable code Develop and support software including applications, database integration, interfaces, and new functionality enhancements Design robust, secure, and scalable features Coordinate cross-functionally to insure project meets business objectives and compliance standards Support, test, and deployment of new products and features Participate in code reviews Qualifications Bachelor's degree in Computer Science (or related field) Extensive Experience in software engineering considered in lieu of degree. 2+ years of Ruby on Rails development experience Experience working with relational databases, MySQL preferred Expertise in front end technologies (e.g., JavaScript, CSS, HTML, and JQuery) Experience with Agile or Scrum software development methodologies An analytical mind in addition to a problem-solving attitude Ability to multi-task, organize, and prioritize work",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-10-05T17:01:05.000Z"
    },
    "company": {
        "name": "benefitbay™",
        "link": "https://www.linkedin.com/company/benefitbay"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "United States",
        "region": null,
        "postal_code": "99999",
        "street_address": null,
        "latitude": 39.50355,
        "longitude": -99.0183
    }
}