{
    "job": {
        "title": "IP Network Engineer (Telecommunications)",
        "industry": "Telecommunications",
        "description": "Job Title: IP Network Engineer I & II Location: Bay Area, CA Fulltime/Permanent Employment. Must Have Skills: Provision network devices including software installations/updates and application of base configurations. Plan and design IP networks for the labs. Update IP plans and maintain documentation for lab networks. Troubleshoot layer 2/3 technologies such as VLANs, virtual router redundancy protocol (“VRRP”), link aggregation groups, and spanning-tree. Requires deep knowledge in IPv4/IPv6 Networking. Years of relevant experience – 3-6 years. Technical Skills: IPv4 and IPv6 planning and configuration. IP Network Planning and Design. Education: •   B.TECH / M.TECH BE/ BS Contact me at (571) 655-3891 | suvam.sarkar@techaxisinc.com About Us: Techaxis is a US-based firm that specializes in discovering, engaging, and placing top talent globally, for fulltime or contract positions in leadership and mid to senior-level positions for companies in technology, healthcare, energy, and education space. Equal Opportunities Employers : Our clients provide equal opportunities to all its employees and all qualified applicants for employment, without regard to their race, caste, religion, color, ancestry, marital status, sex, age, nationality, disability, and veteran status. Employees of our clients are treated with dignity and in accordance with their policy to maintain a work environment free of sexual harassment, whether physical, verbal, or psychological. Employee policies and practices are administered in a manner that would ensure that in all matters equal opportunity is provided to those eligible and the decisions are merit-based.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-15T21:47:02.000Z"
    },
    "company": {
        "name": "Techaxis, Inc",
        "link": "https://www.linkedin.com/company/techaxisinc"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "San Francisco Bay Area",
        "region": null,
        "postal_code": "94112",
        "street_address": null,
        "latitude": 37.39271,
        "longitude": -122.042
    }
}