{
    "job": {
        "title": "Data Center Engineer",
        "industry": "Financial Services,Information Services,Information Technology and Services",
        "description": "What We'll Bring A work environment that encourages collaboration and innovation. We consistently explore new technologies and tools to be agile. Flexible time off, workplace flexibility, an environment that welcomes continued professional growth through support of tuition reimbursement, conferences and seminars. Our culture encourages our people to hone current skills and build new capabilities, while discovering their genius. The chance to work within a challenge and engaging team, supporting some of TransUnion's most critical infrastructure. What You'll Bring Experience with Visio, Asset Management and BMS tools Practical knowledge and work experience with structured cabling and the layer 1 infrastructure Proficiency with basic operations of a PC, proficiency in MS Office and Outlook preferred Able to understand installation specifications A disciplined approach to managing task assignments and strong people skills; good judgement and flexibility are critical to this position A team-player attitude with the ability to work autonomously and responsibly in a mission- critical Data Center environment Must be flexible with work schedule as needed including nights, weekends, holidays and on-call schedule. Rack and Stack customer equipment The ability to easily lift up to 50 lbs. throughout the day What We'd Prefer To See A willingness to travel up to 5 – 10% Impact You'll Make Work with members of the data center team to schedule and preform all project and daily operations task within the data center sites. Provide support for remote site refresh work within the US states and Canada. Travel between data center sites within the Chicagoland area for hands-on support and data center consolidations. Cabling: Daily installation and oversight of all network and storage patching for new systems including maintenance of appropriate documentation for all pathways and labeling of all connections. Installation: Daily installation of all IT servers, network hardware and related components to manufacturer specification. Space assignment: Provision exact space assignments and maintain documentation for each IT device and all related components ensuring proper operation and appropriate expansion space. Power assignment: Provision exact power assignments and maintain documentation for all rack mounted and floor mounted devices maintaining appropriate power distribution and utilization. Cabinet Layout: Assign space, power, tile cuts and cable raceways for all new rows of server cabinets, floor mounted devices, storage frames, tape drives etc. Cable plant design: Work with hardware owners to understand project requirements and select, document and order appropriate solutions to meet connectivity and density needs. Daily operation and oversight: Manage relationships with facility support and IT manufacturer service providers to ensure appropriate daily operation and accurate installations. Onsite Support: Respond to incidents and work with other teams in the verification and recovery process of IT systems. Must have flexible schedule for afterhours support and on call. #DICE We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, age, disability status, veteran status, marital status, citizenship status, sexual orientation, gender identity or any other characteristic protected by law. TransUnion's Internal Job Title Sr Analyst, Data Center",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-09-02T05:20:25.000Z"
    },
    "company": {
        "name": "TransUnion",
        "link": "https://www.linkedin.com/company/transunion"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Chicago",
        "region": "IL",
        "postal_code": "60654",
        "street_address": null,
        "latitude": 41.88323,
        "longitude": -87.6324
    }
}