{
    "job": {
        "title": "Cloud DevOps Engineer",
        "industry": "Computer &amp; Network Security",
        "description": "The Cloud DevOps Engineer will be working with the engineering team and focusing on AWS/Azure/GCP/OCI infrastructure and automation. A key part of the role is championing and leading infrastructure as code. The other major role is developing and maintaining the Python scripts to support the automation jobs. The Engineer will work closely with Dev/QA team to support our SaaS product base upon the public cloud platform. Duties & Responsibilities: Design cloud infrastructure that is secure, scalable, and highly available on AWS Work collaboratively with software engineering to define infrastructure and deployment requirements Provision, configure and maintain AWS/Azure/GCP/OCI cloud infrastructure defined as code Ensure configuration and compliance with configuration management tools Administer and troubleshoot Linux based systems Troubleshoot problems across a wide array of services and functional areas Build and maintain operational tools for deployment, monitoring, and analysis of AWS/Azure/GCP/OCI infrastructure and systems Develop and maintain the infrastructure-related Python tools. Work with developers to develop business-level Python tools. Qualifications: At least 3-5 years of experience building and maintaining AWS infrastructure (VPC, EC2, Security Groups, IAM, ECS, CodeDeploy, CloudFront, S3) Strong understanding of how to secure AWS environments and meet compliance requirements Hands-on experience deploying and managing infrastructure with Terraform Hands-on experience developing with Python. Solid foundation of networking and Linux administration Experience with Docker, GitHub, Jenkins, ELK and deploying applications on AWS Ability to learn/use a wide variety of open source technologies and tools Strong bias for action and ownership",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-07T00:01:32.000Z"
    },
    "company": {
        "name": "Fortinet",
        "link": "https://www.linkedin.com/company/fortinet"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Sunnyvale",
        "region": "CA",
        "postal_code": "94089",
        "street_address": null,
        "latitude": 37.373676,
        "longitude": -122.036575
    }
}