{
    "job": {
        "title": "Campaign Manager",
        "industry": "Computer Software",
        "description": "Overview PicnicHealth is all about making medical records easy to access and using data to power the next frontier of medical research. We work directly with patients to give them the only tool anywhere that truly provides all of their medical records from any doctor or healthcare system in the US—in an easy-to-use, secure online dashboard. Patients can then choose to contribute their unique data to scientific research, which helps researchers accelerate breakthroughs in care for the diseases they care about. To date we’ve helped tens of thousands of patients, partnered with some of the world’s largest biopharma companies, and raised more than $35M including from Felicis Ventures, Amplify Partners, and Y Combinator. Post Series B, we’re growing quickly in revenue, partnerships, and people - it’s an exciting time to join the PicnicHealth team! The Opportunity PicnicHealth is seeking a Campaign Manager as we build out our direct to patient marketing team. As a Campaign Manager, you’ll be joining our small but growing Marketing team, with the huge opportunity to work on end-to-end patient recruitment campaigns to bring more patients to the PicnicHealth platform. You’ll understand our target patient population, and then create a plan for how to recruit them to join the platform. You’re excited to be creative and actively experiment with new and different ways of recruiting patients to see what sticks for each group. You love the nuts and bolts of marketing, from analyzing channel performance to creating projections that can be used for future programs. You have a great eye for detail and are an eager project manager capable of juggling the many requirements of a partner to get a new campaign up and running. You will collaborate closely with teams throughout the company and report directly to the Head of Growth and Recruitment with the opportunity to build your skillset and expand your impact over time. We are looking for an exceptional project and stakeholder manager who is ambitious, adaptable, and eager to learn, with a track record of taking initiative and thriving in a results-oriented, fast-paced environment. While we are looking for someone with empathy for our users, primarily patients with chronic illnesses, experience in healthcare is not required or even necessarily preferred. Our users are first and foremost people who want useful, compelling, product experiences just like any consumer. That’s what we give them. What you’ll do at PicnicHealth: Drive execution : Develop, execute and manage plans for achieving our patient recruitment goals. Own results: Evaluate efficacy of tactics, and develop standard reporting that can be shared throughout the organization. Optimize through rigorous testing. Support our recruitment channels: Come up with creative ways of identifying where our target audience is and how to reach them, using various platform tools and data sources. Create strong relationships with recruitment partners; Managing multiple partner interactions and deadlines simultaneously with high quality; Build structured execution plans from high-level objectives; Collaborate with our clinical data experts to guide partners to get the most value out of the Picnic Research data; and Manage collateral requirements, creation, and delivery to partners. Project and analyze performance: Track performance of channels and identify areas for improvement Create projections for new campaigns Develop frameworks for projecting future performance and feasibility based on past performance of related campaigns Represent and champion PicnicHealth in day-to-day partnership management and program management Boost the team : Collaborate effectively with teammates in marketing, sales, creative, operations, engineering, and partnerships to raise the bar in executing all of our campaigns. You are a strong candidate if: You have 3+ years of experience in business strategy, marketing and/or partnerships at leading SaaS software company or strategy consulting firm, and a Bachelor’s Degree in business-related field of study; You’re an exceptional project manager (researching, structuring and managing project plans, and communication with internal and external stakeholders); You’re comfortable in a fast-paced start-up environment and excited to flex into new areas of marketing and partnerships as the work evolves; You’re detail-oriented and highly organized, while flawlessly managing multiple projects simultaneously; You’re able to understand and analyze data with a high degree of comfort; You have strong interpersonal skills for patient success and engagement; You’re motivated to be amazing in your role and, ultimately, improve the lives of patients. Why join PicnicHealth? At PicnicHealth you get to solve real problems with real solutions, great tech, and great people. You also get: Competitive salary Comprehensive benefits including above market Health, Dental, Vision Family friendly Flexible time off 401k plan Free PicnicHealth account Equipment and internet funds for home office set up. For this role, PicnicHealth is open to full time or contract. Due to COVID-19, currently all roles are remote. As of October 2021, we will offer a hybrid set up: team members in the Bay Area will be able to work from the SF office on a flexible schedule; remote team members will be expected to travel to in-person meetings 4-6 times a year. Equal Opportunity Statement PicnicHealth is committed to promoting an inclusive work environment free of discrimination and harassment. We value a diverse and balanced team where everyone can belong.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-25T17:24:08.000Z"
    },
    "company": {
        "name": "PicnicHealth",
        "link": "https://www.linkedin.com/company/picnichealth"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "San Francisco Bay Area",
        "region": null,
        "postal_code": "94112",
        "street_address": null,
        "latitude": 37.39271,
        "longitude": -122.042
    }
}