{
    "job": {
        "title": "Optical Systems Engineer (R1518)",
        "industry": "Semiconductors,Electrical/Electronic Manufacturing",
        "description": "Spectra-Physics, Ophir and Newport are brands within the MKS Instruments Light & Motion division. We provide a full range of solutions including lasers for precision industrial and scientific research applications, laser and LED measurement, beam profiling, precision motion control, optical tables and vibration isolation systems, photonics instruments, opto-mechanical components and optical elements. MKS Light & Motion solutions enhance our customers’ capabilities and productivity in the semiconductor, industrial technologies, life and health sciences, research and defense markets. Are you naturally curious?  At MKS our collective curiosity drives us to be an innovation leader in many industries. Our products drive advancements in a wide range of technical fields like cloud computing, the generation of clean drinking water, self–driving cars, and space exploration.  We are a collaborative team that values fresh thinking and believes in mutual respect, constructive candor, diversity, and inclusion.  Our customers value us as a partner and trust us to continually push the boundaries of possibility. We believe in creating technology that transforms and improves our world and are looking for new team members who share our vision.  If this is appealing to you, we want to meet you. The Integrated Solution Business (ISB) Group of MKS Instruments is growing very rapidly with significant strategic investments in the development and fabrication of cutting-edge, high precision optics and opto-mechanical assemblies. To manufacture these products, ISB is seeking individuals like you to join our team as an Optical Systems Engineer. In this position, you will plan, conceptualize, design, test, and document complex, high-precision opto-mechanical / electro-optical products. If you have a passion for working with cutting-edge technology, this is the role for you! What you will do is: Perform product development activities that include new or modified designs for new or existing products and document changes of optical, opto-mechanical, electro-optical modules, systems and instruments. Interpret requirements from customer input and utilize industry best known methods. Participate in feasibility studies and develop cost estimates for systems, testing, development labor, etc. Develop and execute product verification tests. Troubleshoot optics, opto-mechanical assemblies and/or final systems. Have opportunities to work cross-functionally with Systems Engineers, Mechanical Engineers, Electrical Engineers, and with Reliability and Manufacturing to ensure successful phase gate transitions. What you will bring to the role and to our team are the following qualifications and engineering skills: BS in Optical Engineering, Optical Sciences, Physics or equivalent and 5+ years of experience. Strong relevant university experience will be considered in evaluating potential candidates. Hands-on experience in assembling, aligning and testing optical systems (component to device-level). Developing and implementing test procedures and evaluating and selecting appropriate test instrumentation. Understanding and experience with state-of-the-art manufacturing and metrology. If you have familiarity with any of the following, please let us know: Strong Engineering analytical skills: statics, dynamics, thermal loads, tolerance analysis and material selection. Working knowledge of fundamental mechanical, optical and electrical technology. Hands-on experience with advanced optical metrology methods, including interferometric testing using computer generated holograms. Experience with modern cost-effective manufacturing methods for high, medium and low volume production. Direct experience in architecture and design of complex opto-mechanical systems incorporating precision mechanisms, motorized actuation, thermo-elastic deformation control, and dynamic vibration isolation. Work experience in a commercial environment with companies developing and manufacturing systems and/or instruments in a volume-manufacturing environment. Fluency in Korean could be an advantage to support key customer projects. Globally, our policy is to recruit individuals from wide and diverse backgrounds. However, for positions requiring access to export-controlled goods and technical data that are subject to the International Traffic in Arms Regulations (ITAR) or Export Administration Regulations (EAR), MKS Instruments. Inc. may have to obtain an export license from the U.S. Government. As such, applicants for these positions, except “U.S. persons” (generally defined as U.S. citizens, noncitizen nationals (holder of a US Passport), lawful permanent residents (or, green card holders), individuals granted asylum, and individuals admitted as refugees), may be subject to an export license review process. Employment is contingent upon issuance of the license. MKS Instruments, Inc. is an equal opportunity employer. We solicit and hire applicants regardless of race, color, national origin, sex, religion, age, disability, veteran status, sexual orientation, gender identity, or any other protected category. Our policy is to employ the most qualified applicants. We conduct background checks and drug screens, in accordance with company policies and federal and state guidelines.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-20T00:21:07.000Z"
    },
    "company": {
        "name": "MKS Instruments",
        "link": "https://www.linkedin.com/company/mks-instruments"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Irvine",
        "region": "CA",
        "postal_code": "92717",
        "street_address": null,
        "latitude": 33.68591,
        "longitude": -117.82472
    }
}