{
    "job": {
        "title": "Software Engineer",
        "industry": "",
        "description": "DESCRIPTION: The Facebook Reality Labs team at Facebook is helping more people around the world come together and connect through world-class Augmented, Mixed and Virtual Reality hardware and software. With global departments dedicated to AR/VR research, computer vision, haptics, social interaction, and more, we are committed to driving the state-of-the-art forward through relentless innovation. AR and VR potential to change the world is immense -- and we're just getting started. Our XRTech team explores, develops, and delivers new cutting-edge technologies that serve as the foundation of current and future Facebook Reality Labs products. From mixed reality and human interaction to natural input and beyond, XRTech is focused on taking new technologies from early concept to the product level while iterating, prototyping, and realizing the human value and new experiences they open up. Job Responsibilities: • Modify existing databases and database management systems. • Write and code logical and physical database descriptions and specify identifiers of database to management system or direct others in coding descriptions. • Work as part of a project team to coordinate database development and determine project scope and limitations. • Review project requests describing database user needs to estimate time and cost required to accomplish project. Skills: • Knowledge of computer development software as it relates to systems • 3+ years of hands-on experience using C++ and Python • 1+ years of UI development experience • Verbal and written communication skills, problem solving skills, customer service and interpersonal skills. • Ability to work independently and manage one’s time. • Basic mentoring skills necessary to provide support and constructive performance feedback. • Knowledge of the full software development lifecycle: from business/systems analysis, through requirements gathering and functional specification authoring, to development, testing and delivery. • Ability to troubleshoot issues and make system changes as needed to resolve issue. • Knowledge of computer hardware and software. Education/Experience: • Bachelor's degree in computer science, software engineering or relevant field required.",
        "employment_type": "CONTRACTOR",
        "date_posted": "2021-10-05T15:20:44.000Z"
    },
    "company": {
        "name": "SGS Consulting",
        "link": "https://www.linkedin.com/company/sgs-consulting"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Seattle",
        "region": "WA",
        "postal_code": "98133",
        "street_address": null,
        "latitude": 47.60323,
        "longitude": -122.33028
    }
}