{
    "job": {
        "title": "Machine Learning Engineer, Proactive Intelligence",
        "industry": "Consumer Electronics",
        "description": "Summary Have you ever scheduled a virtual meeting and received a suggestion to call into it at the right moment? Have you connected your Bluetooth headphones and received a suggestion to listen to your favorite podcast? We add intelligence across the iOS platform, build state-of-the-art privacy preserving on-device personalized models, and need your help! You will work on features that accelerate and delight millions of Apple users! Key Qualifications Excellent skills in Python Ability and passion to deliver extraordinary results with a lot of initiative Experience building high quality models for classification, regression and ranking Experience with recommender systems or models for personalization Experience with shipping production software Experience with machine learning on resource-constrained embedded devices is a plus Passion for quality and privacy Understanding of software development Description You will bring your expertise and a real passion for extraordinary products into our growing team that operates like a startup within Apple. We are the team responsible for making iOS users more efficient by predicting and accelerating the user experience while respecting privacy. We collaborate with many different teams at Apple to create groundbreaking technology. You enjoy creating elegant and compelling solutions, applying innovative technology in the service of human-centered design. You will build prototypes and have a say in what features we build. You will touch various parts of our codebase, from researching and experimenting with new ideas to implementing and optimizing models to run on resource-constrained devices. You will have an opportunity to learn from others and grow. To succeed, you are a strong problem solver with proven agility to work across multiple codebases, teams, and organizations. You will be working in the Proactive Intelligence team at Apple. Your valuable work will impact the lives of millions of Apple users worldwide. Education & Experience M.S in Computer Science or equivalent practical experience. Additional Requirements Experience with machine learning on resource-constrained embedded devices is a plus Role Number: 200289810",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-09-26T03:09:50.000Z"
    },
    "company": {
        "name": "Apple",
        "link": "https://www.linkedin.com/company/apple"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Cupertino",
        "region": "CA",
        "postal_code": "95014",
        "street_address": null,
        "latitude": 37.319313,
        "longitude": -122.02927
    }
}