{
    "job": {
        "title": "Solutions Architect",
        "industry": "Computer Hardware",
        "description": "Getac is searching for a Solutions Architect to cover the Northwest Region of the United States. In this position, you will be responsible for actively driving and managing technology evaluations during the pre-sales process. You will work in conjunction with the regional sales team as the key technical adviser and advocate for our products. Customer retention through post sales interaction is required. Must be able to multi-task and manage several technical pre/post sales activities in a time sensitive manner to support customer's business needs Responsibilities: Development and deliver product demonstrations. Responsible for representing the product to the customers and at field events such as conferences, seminars, trades shows, etc.. Provides timely, accurate and detailed communication and tacking of projects via internal systems. Responds to functional and technical elements of RFQ's and RFP's. Able to travel throughout the regional sales territory and US. Communicates technical issues to our overseas engineering team. Identify all technical issues of assigned customer accounts to assure complete customer satisfaction through all stages of the sales process. Must be able to follow-up and use technical capabilities to support customer post-sales issues. Active participant in the retention of customers; including presenting product roadmaps and conducting Service Reviews. Attend weekly technical escalation and customization calls (meeting occurs in the evening). Convey customer requirements to the Product Management team. Understanding the customer market needs by industry vertical and feedback to the R & D engineering teams. Requires travel 50% to 75% of the time. Technical Skills: Hardware and software troubleshooting on laptops, tablets, handhelds and mobile devices. OS/Image builds – INF drivers, system drivers, BIOS, encryption, etc. Microsoft Certification a plus. Experience supporting end-user installation, configuration, upgrades and migration. Experience troubleshooting technology in vehicles to include interoperability of computers with mounts, docks and other third party devices. Gobi, 3G, 4G knowledge and wireless troubleshooting – familiar with wireless software: One Click, NetMotion, VZ Manager. Essential Skills and Experience: Requires 5-7 years of pre/post field support with a rugged mobile computer device company or similar industry; Excellent team work and prior experience in collaboration with field sales team, field sales engineers, R & D engineers, end-customers and 3rd party vendors is required. Ability to multi-task, prioritize and escalate trouble shooting issues in a time sensitive manner is expected; Excellent verbal , written, communication organizational skills are needed. Must be a self-starter with energy, initiative, and a strong work ethic and thrive in a fast paced detail oriented environment. Use of computer systems, MS office is required. Prior experience in a technical support role or project management role is a plus. Experience working with Public Safety and Enterprise customers is a plus. Education/Licenses/Certification: BS degree in electrical engineering or similar field is required. Certifications: A++, MSCE and graduate degree are a plus.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-24T01:16:39.000Z"
    },
    "company": {
        "name": "Getac",
        "link": "https://tw.linkedin.com/company/getactechnology"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Portland",
        "region": "Oregon Metropolitan Area",
        "postal_code": "97215",
        "street_address": null,
        "latitude": 45.553497,
        "longitude": -122.90853
    }
}