{
    "job": {
        "title": "Network Engineer",
        "industry": "Computer Hardware",
        "description": "Description: SEMCON provides a highly qualified, professional, and responsive technical and managerial workforce to satisfy customer requirements that support the Federal Aviation Administration (FAA)'s mission, vision, goals.  SEMCON's company culture aligns enriching career experiences, growth opportunities and collaborative engagement for all employees resulting in a company value being greater than the sum of our parts. We are currently searching for a Network Engineer to join our team. The Network Engineer should have advanced knowledge in the following areas: Cisco ASA, routers, and switches Networking in a virtual environment and with Dynamic Virtual Switches Configuring proxy servers and firewalls in secure enterprise networks The Network Engineer will provide remote support of branch offices ASA routers and monitoring of network equipment and remote upgrades and will support a tier-3 helpdesk including after-hours support as needed. Experience with Akamai Content Delivery Network and Cloud Architecture is  desired. Strong written and verbal communication skills are required, as well as the ability to collect, and analyze data and communicate technical information. Experience in using basic software packages such as MS Office suite is desired. A Bachelor's degree in Engineering, math, or science, and at least 15 years of related work experience is required. SEMCON offers a competitive salary and complete benefits package which includes health benefits (medical, dental, vision and life), 401K with a generous employer match, paid time off and paid holidays. . Requirements:",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-10-18T06:06:54.000Z"
    },
    "company": {
        "name": "Semcon",
        "link": "https://se.linkedin.com/company/semcon"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 180,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Egg Harbor Township",
        "region": "NJ",
        "postal_code": "08234",
        "street_address": null,
        "latitude": 39.38301,
        "longitude": -74.607956
    }
}