{
    "job": {
        "title": "Full Stack Software Engineer",
        "industry": "Financial Services",
        "description": "Who We Are TomoCredit is a fintech startup based in downtown San Francisco. We issue the smartest consumer credit card which does not require a credit score for approval. We are small, but nimble, and very passionate about opening credit markets to young generations and immigrants, with the aim to make it a cutting-edge and pleasant experience for all of our users. We value passionate, down to earth, “can do” people who enjoy fine-tuning small details, without losing sight of the big picture. We are looking for someone who is driven to get things done and views obstacles as an exciting challenge that demands a creative solution. You are a self-starter with a high degree of rigor, organization, and discipline to get things done. Above all else, this role requires someone who takes great pride in their work and is inspired and motivated by their role in improving the way millions of people build their financial future. The Role We're looking for an experienced Full Stack Software Engineer with strong system building skills to join our small and creative team. Being a member of a small team means you'll have many responsibilities and own multiple projects. Ideal candidate is comfortable working in a fast-paced, creative and collaborative environment. Plus, since you would be joining us early in our journey, you will be intimately involved in every aspect of the product with a significant say when it comes to technical decisions. You'll own projects from concept to completion and be working alongside talented software engineers in executing your projects. What You'll Be Doing Work with the design and product teams to launch new features Own a project from start to finish (we value responsible engineers with strong work ethic) Assist our support team with technical issues (we are small and want to make sure our users love us) Help QA our releases to ensure they’re ready to ship (to ensure we have a truly amazing product) Be happy! What You'll Need Several years of working experience in Node.js (minimum 3 years) Strong Javascript skills Experience with AWS services (EC2, EBS, RDS, Cloudwatch, Lambda) Experience working with Postgres (or any SQL database) Experience with building RESTful and GraphQL APIs. Natural ability to diagnose and debug complex technical issues Strong written and verbal communication skills Track record in building relationships and integrations with tech partners Yearning to learn new skills, tech, tools. Bonus: Experience with Apollo framework Bonus: Experience in fintech is highly valuable. Your creativity and ability to think out of the box. Your passion in building cool cutting-edge products. Why TomoCredit? Building a strong culture is extremely important to us. In order to do so, we strive to make every member of the team happy. That's why we offer a generous benefits package for a small startup. Competitive Salary Insurance: Medical, Dental and Vision benefits. Equity: We're growing rapidly, and we want to share our future success/ financial upside with you. We offer an above-average ownership stake in TomoCredit for all employees. Flexible vacation policy. We trust that you know how to manage your time wisely so you can finish your work on time without burnout. Within that trust, we offer a flexible vacation policy. Company-sponsored outings. This is the best outlet to get to know each other outside work. At Tomo diversity is important to us so all qualified applicants will receive consideration for employment without regards to race, color, religion, sex, age, national origin, protected veteran status, disability status, sexual orientation, gender identity or expression, marital status, genetic information, or any other characteristic protected by law. Powered by JazzHR vSUIT4ywO7",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-23T19:23:52.000Z"
    },
    "company": {
        "name": "TomoCredit",
        "link": "https://www.linkedin.com/company/tomocredit"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "San Francisco",
        "region": "CA",
        "postal_code": "94121",
        "street_address": null,
        "latitude": 37.78008,
        "longitude": -122.42016
    }
}