{
    "job": {
        "title": "Lead Software Engineer",
        "industry": "Marketing and Advertising,Computer Software,Internet",
        "description": "It's fun to work in a company where people truly BELIEVE in what they're doing! We're committed to bringing passion and customer focus to the business. Since launching in 2010, WP Engine has become the world’s leading WordPress Digital Experience Platform (DXP), now with over 100,000 customers in 140 countries. We’re proud of the technology and service we offer our customers that move their businesses forward faster. At WP Engine, we strive to do the best work of our careers, and feel empowered to do what is right for our customers. We love investing in employee success and uncovering opportunities for you, the best, to get better. 99 percent of employees believe you’re made to feel welcome at WP Engine. Be you. Be here. What's Cool About This Job. WP Engine is on a mission to help our customers win online! Whether that’s helping an aspiring entrepreneur to turn a hobby into an online business or a multinational corporation to launch a new campaign in weeks instead of months, our platform is there to help them win — whatever that means for them. We are searching for an experienced engineer to help shape the future of Headless WordPress. Leading our Headless Framework initiatives, you will have a direct impact on the way headless WordPress sites are built with modern tools like Node and React. Your work will fundamentally change the way front end developers work with WordPress. This software will be Open Source, so you’ll also be directly interacting with the community that you will help develop. Our culture is renowned; we believe it is meaningful to hire the best and ensure that we provide an environment where the best get better. If you are a hard worker with excellent interpersonal skills, great at solving problems, and enjoy working across different time zones and cultures, you may be the engineer that we are looking for! The day to day. Work closely with Product Management, Engineering Management, and business partners to design and build world class products Provide ongoing technical leadership and guidance to your teammates Collaborate to design, write, test, integrate, and maintain a frontend framework that is extensible, usable, and performant; meeting the needs of developers around the world Write clean, maintainable code; improve test coverage and build deployment pipelines to safely and rapidly push quality code to production Help build a positive and inclusive community around the software we build; representing yourself and WP Engine well in every interaction Your skills and expertise. Minimum qualifications: 7+ years of writing software using Agile practices to deliver high quality software addressing customer needs Expertise in Node, React, and WordPress Experience developing frameworks or libraries used by other developers Self starter with natural problem solving abilities, an inquisitive personality, a drive to continuously learn, and an eagerness to tackle big problems even with uncertain requirements Comfortable working in public; being an inclusive and positive contributor to Open Source Software communities Dedicated to developing others through teaching, mentoring, and coaching Excellent written and oral communication skills The perks and benefits: Stock Options (Every employee is an owner in the company) Health Benefits (100% Paid Employee Medical, Dental, and Vision) Fertility Benefits (IVF/Fertility drug coverage) 401(k) Retirement Savings Plan with a match Life and Disability Insurance Paid Family and Caregiver’s Leave Employee Assistance Program Generous Vacation Time (Who doesn’t like time off) One-time $500 Home Office Stipend Company Wellness Days Wellness Program At WP Engine, we strive to have the broadest possible view of diversity, going beyond visible differences to include the background, experiences, skills, and perspectives that make each person unique. WP Engine is proud to be an equal opportunity workplace and is committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity, Veteran status, or any other basis protected by federal, state, or local law.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-20T00:20:20.000Z"
    },
    "company": {
        "name": "WP Engine",
        "link": "https://www.linkedin.com/company/wpengine"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 84,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Chicago",
        "region": "IL",
        "postal_code": "60654",
        "street_address": null,
        "latitude": 41.88323,
        "longitude": -87.6324
    }
}