{
    "job": {
        "title": "Software Engineer ",
        "industry": "Computer &amp; Network Security",
        "description": "We are a leader in penetration testing and attack surface management. NetSPI is constantly growing and looking for innovative minds to join us in helping some of the largest organizations in the world protect their technology and data from cyber criminals. if you thrive in a collaborative setting and enjoy working with best-in-class technology - we want to meet you! The Software Engineer will be responsible for working on and supporting our Red Team Toolkit (Attack Simulation). Red Team Toolkit is an offensive security platform and tooling suite for red teamers and penetration testers. The toolkit enables teams to perform advanced network operations, collaborate on target exploitation, and better simulate sophisticated adversaries. Responsibilities: Design, code, test and deploy application in an iterative development environment Develop code that is scalable, robust, and bug-free Deliver high quality technical solutions to stakeholders in a fast-paced environment Development in accordance with industry standard and best practices Identify and analyze user requirements and convert them into a feasible technical document Work with a geographically distributed team of various experience levels Required Skills: 4+ years of hands-on experience with C#/.NET 2+ years of experience using ASP.NET Core 2+ years of experience in consuming REST/SOAP services 2+ years of experience using React 1+ years of experience with relational/NoSQL databases Bachelor’s degree in Computer Science Preferred Skills: Experience using Typescript Experience using C++ and/or Win32 APIs Experience using WPF/UWP/WinUI Open-source contribution Experience working in Agile team environment Effective communication skills, both verbal and written",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-09T17:42:38.000Z"
    },
    "company": {
        "name": "NetSPI",
        "link": "https://www.linkedin.com/company/netspi"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 48,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Lehi",
        "region": "UT",
        "postal_code": "84043",
        "street_address": null,
        "latitude": 40.387875,
        "longitude": -111.84917
    }
}