{
    "job": {
        "title": "Azure Data Engineer",
        "industry": "Staffing and Recruiting",
        "description": "Our Client is looking for an \"Azure Data Engineer\" for contract positions. Please review the Job descriptions below and let us know if you are interested and fit for any of the jobs. Please apply at ravinder@vsvwins.com, 510 560 4649 // raghav@vsvwins.com, 302 648 1257 Job Description: Project Duration : 12-month contract with a chance to extend Project Location: Richmond, VA (Can be Remote) It's a W2/1099 Position. Technical MUST haves: Pyspark/Python, writing streaming applications into a production Enterprise environment. Rest API Design and Development Azure Data Bricks, Configuration, Notebooks development, and Delta Tables processing SQL in Azure Microsoft Azure • Logic App • Function Apps • Resource Management • Agile Delivery Framework Proven experience with Agile and Waterfall SDLC methodologies. Excellent systems requirement documentation skills Proven ability to deliver results. Nice to Have Experience: Experience with Continuous Integration Continuous Development (CICD) is a plus Experience with Test-Driven Development (TDD) is a plus Roles and Responsibilities: Follows direction set by the ETL Development Lead when developing ETL solutions. Works with Systems Analysts in designing, testing, and implementing ETL solutions. Works as part of a larger development team that includes other internal and external ETL developers. Responsible for the development, testing, and maintenance of ETL solutions. Participates in unit testing and data quality efforts within assigned data domain. Creates and maintains appropriate documentation. Must be able to troubleshoot and identify the root cause of production issues. Demonstrate detailed knowledge of legacy systems, Atlas systems, data structures/usage and primary systems interfaces based on appropriately written system specifications. If you are interested or have references please apply at ravinder@vsvwins.com, 510 560 4649 // raghav@vsvwins.com, 302 648 1257. Regards, Ravi Chandel VSVWINS INC.",
        "employment_type": "CONTRACTOR",
        "date_posted": "2021-08-17T23:24:53.000Z"
    },
    "company": {
        "name": "VSV WINS, INC",
        "link": "https://www.linkedin.com/company/vsv-wins-inc"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Virginia",
        "region": "United States",
        "postal_code": "23038",
        "street_address": null,
        "latitude": 37.512905,
        "longitude": -78.697624
    }
}