{
    "job": {
        "title": "Site Reliability Engineer - 100% Remote",
        "industry": "Information Technology and Services",
        "description": "Our client is looking for a Site Reliability Engineer to help build and support the ultimate voice-based conversational AI. Title - Site Reliability Engineer Location - 100 % Remote Duration - Fulltime Responsibilities Be part of on-call rotation to respond to urgent bugs or production outages Proactively identify and fix infrastructure bottlenecks Choosing tooling for and understanding of CI / CD GCP knowledge Kubernetes (In a production environment) Docker Knowledge of working in an Agile environment Infrastructure As Code Develop, integrate and support features in the core server stack Develop and support data pipeline and infrastructure Desirable Skills Include : Microservices Architecture Go Python ML Ops Should be able to apply different tenants' configuration through code as well as tools. Experience 3-5 years of experience in working with infrastructure as code At least 1 year in Python or Golan g Comfortable developing, maintaining DevOps pipelines Strong experience working with cloud services - AWS or GCP preferred Exposure to NLP/AI/ML is a huge plus If interested please email me your resume at rahul@avestacs.com",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-06T21:26:41.000Z"
    },
    "company": {
        "name": "Avesta Computer Services",
        "link": "https://www.linkedin.com/company/avesta-computer-services"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "United States",
        "region": null,
        "postal_code": "99999",
        "street_address": null,
        "latitude": 39.50355,
        "longitude": -99.0183
    }
}