{
    "job": {
        "title": "Data Scientist (Research)",
        "industry": "",
        "description": "Position Overview: The Research Data Scientist primary responsibility will be in medical device safety and surveillance activities using real-world data from the NESTcc Research Network and data partners. This position will utilize their expertise to use novel data science tools to perform statistical analysis on large, complex datasets in order to uncover medical device safety signals or trends within the Active Surveillance environment. Objectives and Responsibilities: · Develop data analytic programs within active surveillance for medical device safety and reliability · Establish data analytics infrastructure to improve efficiency and to facilitate data-driven decisions. · Develop and implement machine learning algorithms and predictive models/analytics. · Create automated data analysis workflow and meaningful data visualization dashboards, in support of trend reporting and escalation. · Utilize various data science programming tools to include Python, Java, R and SQL. · Utilizes various statistical techniques and reliability tools such as Hadoop, Cloudera Data Science Workbench, Minitab, JMP, or Jupyter Notebook. · Utilize various data visualization tools such as Tableau, Power BI, or Spotfire. · Coordinate data quality, security, maintenance · Establish policies and procedures related to data collection and accuracy of data · Working with Network Collaborators to integrate their data into the cloud environment · Provide end-to-end data integration · Data intake, data quality assessment/evaluation, data curation, enrichment/preparation · Design and implement scalable data integration processes including ingestion, cleaning, curation, unification, etc. · Develop tools to support data profiling and data quality methodologies Requirements: Graduate Degree in Biostatistics, Bioinformatics, Data Science, Machine Learning, Epidemiology or similar quantitative discipline 5+ years working as a data scientist or biostatistician Proficiency in Python, R, SQL Experience with AI frameworks and MLOps principles Knowledge of big data analytics approaches using cloud services from Google Cloud Platform (preferred), AWS or Azure Familiarity with healthcare data and sources of real-world data for safety signal detection Other Skills/Abilities: Strong problem-solving and analytical skills. Ability to handle confidential and sensitive company information responsibly Working knowledge of 21 CFR 820, FDA QSR, ISO 13485 (preferred) Experience using RWD/RWE from multiple sources is a plus Experience with healthcare common data models such as, OMOP, i2b2 or PCORnet a plus Ability to translate technical jargon into layman’s terms for explanatory purposes Reporting Relationships : · The employee will report to the Director of Medical Device Safety, NESTcc To Apply, email your resume to careers@mdic.org with “Research Data Scientist, NESTcc” as the subject of the email. Please include a cover letter with your resume. NOTE: This scope of services is not intended to be all-inclusive. The Data Scientist may perform other related duties MDIC is an Equal Opportunity Employer.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-15T16:53:49.000Z"
    },
    "company": {
        "name": "Medical Device Innovation Consortium (MDIC)",
        "link": "https://www.linkedin.com/company/medical-device-innovation-consortium-mdic-"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Arlington",
        "region": "VA",
        "postal_code": "22210",
        "street_address": null,
        "latitude": 38.890762,
        "longitude": -77.084755
    }
}