{
    "job": {
        "title": "Machine Learning Infrastructure (MLOps) Engineer",
        "industry": "Information Technology and Services",
        "description": "Direct Client Position ML Infrastructure/ Platform Engineer 12+ Months Contract to Hire Main Skills required: MLops, Kubernetes, productionalization, etc. Client Notes: Hiring Manager is looking for candidates with Building the infrastructure to bring the models into production. Basically, building the infrastructure and doing the productionalization. We are seeking a creative Machine Learning (ML) Engineer with expertise in machine learning and software architecture to partner with Data Scientists to design, build and bring to production predictive models that directly benefit our customers. Our ML products delight our fans by helping them buy and sell the best tickets at the right price at the right time. Your work will have a direct impact on Client’s bottom line and on the efficiency of the ticket markets on our platform. You will have access to the rich data set of the world’s largest dynamically priced ticketing marketplace. You will uncover hidden signals in the data that predict trends in thousands of volatile markets, determine the preferences of millions of customers and provide tools to customers that help them see their favorite performers at the best price and sell their tickets effortlessly when they can’t go. Our Marketplace Intelligence Data Science team is a small team of outstanding scientists and engineers based in Client's San Francisco headquarters. We work closely with other teams in the company to establish business goals, to incorporate existing insights into our algorithms, to uncover new opportunities for optimizing the business and to establish rigorous methods for gauging performance. You Will •           Lead the design and implementation of all parts of the ML buildout: training pipelines, serving architecture and refresh automation. •           Lead a ground-up rebuild of critical models and services on a new platform. You will own the design of the rebuild and begin with no tech debt. •           Collaborate with and influence the broader organization to ensure the platform rebuild enables ML to best serve our customers. •           Partner with data scientists to create algorithms that can effectively manage and price perishable inventory across multiple dynamic marketplaces. •           Own your models from initial research all the way to production. •           Inspire your teammates with your knowledge of machine learning and your application of modern software development techniques. •           Frame complicated problems in simple terms and enjoy clarifying sophisticated solutions. •           Bring a passion for discovery, problem solving and groundbreaking technology. You Are •           Accomplished. Earned a graduate degree in Computer Science, Economics, Statistics, Physics or equivalent quantitative field. •           Creative. Known for coming up with different ways of looking at problems and for investigating the latest advancements in the field. •           Technical. Familiar with modern machine learning and software engineering techniques and are passionate about embracing new tools. •           Knowledgeable. Have significant experience with machine learning, algorithms and software development. •           Motivated. Want to help customers build a cherished memory of an amazing live event.",
        "employment_type": "CONTRACTOR",
        "date_posted": "2021-08-05T16:44:10.000Z"
    },
    "company": {
        "name": "Aditi Consulting",
        "link": "https://www.linkedin.com/company/aditiconsulting"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "San Francisco Bay Area",
        "region": null,
        "postal_code": "94112",
        "street_address": null,
        "latitude": 37.39271,
        "longitude": -122.042
    }
}