{
    "job": {
        "title": "Senior Frontend Software Engineer",
        "industry": "Computer Software",
        "description": "There is only one Data Cloud. Snowflake’s founders started from scratch and designed a data platform built for the cloud that is effective, affordable, and accessible to all data users. But it didn’t stop there. They engineered Snowflake to power the Data Cloud, where thousands of organizations unlock the value of their data with near-unlimited scale, concurrency, and performance. This is our vision: a world with endless insights to tackle the challenges and opportunities of today and reveal the possibilities of tomorrow. How do you make the world's most powerful Cloud Data Platform a delight to use? We are the fastest growing software company at this scale in history and looking to push that to new heights by building the single best visual user experience in the industry. The Snowflake Data Cloud is the first to realize the full potential of the massive New Data Economy. We were the first to introduce truly frictionless data sharing, have a rapidly growing data marketplace and monetization platform, and are powering the most complete Analytics platform with a seamless and intuitive visual experience, powerful data visualizations, and world class management interface. We are looking for talented frontend engineers to help us continue to grow and build compelling new experiences using a best-of-breed tech stack (React/Hooks, Typescript, Node.JS, Kubernetes, Go). Bring your passion for delighting customers and deep experience building cutting edge web apps and help us build the future of the Data Cloud. As a Senior Front End Engineer, You Will Lead and drive projects that span our stack, including go and node services hosted in Kubernetes and a UI written in typescript and react(hooks) Promote strong collaboration within a cross functional team, including design, product management. Deliver features requiring close coordination with several sister teams such as data sharing, cloud infrastructure, and cross-region replication. Be a strong contributor to the product vision and drive team planning. Mentor and coach junior team members. Build for scale and high performance. Our Ideal Senior Front End Engineer, Will Have Significant software development experience, including 5+ years of experience in product web UI application development. Experience contributing to interactive dashboards and visualization platforms and/or rich interactive GIS applications desirable. Distributed system development experience is a big plus. Deep understanding of modern web applications design architecture, good API design patterns, performance and scale. Demonstrated technical leadership experience, such as being an architect or tech lead for high impact customer facing projects. Experience in modern technologies such as javascript, typescript, react, angular, node. Experience with Canvas, SVG and other visualization tools/libraries a plus. WHY JOIN THE ENGINEERING TEAM AT SNOWFLAKE? As a Member Of Our Team, You Will Building cutting edge cloud technologies is complex, and our engineering team surmounts the obstacles. Build an industry-leading data platform that customers love. Create intuitive, elegant, and accessible user interfaces that make a powerful and highly technical product simple to use. Learn about and contribute to: Super-robust and secure enterprise SaaS platform that services hundreds of customers and millions of complex queries daily. Highly-scalable and reliable data processing platform that runs on hundreds and thousands of machines. User interfaces bridging the enterprise world with the consumer experience. Join a world-class team of both industry veterans and rising stars. Snowflake is growing fast, and we’re scaling our team to help enable and accelerate our growth. We are looking for people who share our values, challenge ordinary thinking, and push the pace of innovation while building a future for themselves and Snowflake. How do you want to make your impact?",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-24T01:10:52.000Z"
    },
    "company": {
        "name": "Snowflake",
        "link": "https://www.linkedin.com/company/snowflake-computing"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "San Mateo",
        "region": "CA",
        "postal_code": "94406",
        "street_address": null,
        "latitude": 37.54715,
        "longitude": -122.3144
    }
}