{
    "job": {
        "title": "Data Scientist",
        "industry": "Information Technology and Services",
        "description": "Data Scientist Location: Bellevue, WA (mostly remote work) Contract: 10 month contract with potential to extend Benefits: 3 weeks of PTO annually Pay Rate: $50/hr on W2 DRI tickets (10-25 a week) & Experimentation support Respond to tickets, flag if need to be raised to EXP or guide teams. Typical issues. Debug why scorecards aren’t running/ late, build interesting slices etc. How to analyze a scorecard (needs ramp up with DS/Dev) Experimentation health Build back P0 (auto shut down) reporting - no reports today to see scorecard delays. Metrics and templates clean up to reduce load on COSMOS where unnecessary Make sure metrics have updated descriptions Monitor and remove certain repeat scorecards as needed Triage new metric additions / MG changes to follow best practices (description, use cache) etc. (include DS/Dev) Dashboard Monitor platform experimentation health Ensure updates are done at least weekly for syncs Updates to dashboard for new data Experiment program Arrange and or share exp brownbags and remind / rally folks experiments Maintain a FAQs / Wiki Communication Share monthly updates on health, top changes, top asks, top questions (offline or office hrs) Share live sites via emails / banners Update banners in exp or tools etc. Update or follow up on tooling messages to give self-serve directions -> propose fixes/solutions. Office hours support - Host it, Pull experts, Gather questions and follow ups, answer frequent ones Required Qualification SQL, Python, basic coding/scripting skills Dashboarding - PowerBI or Tableau Excellent communication and partnerships skills Problem solving skills 6mo+ A/B Experimentation & Testing Data Science experience Preferred Qualification Operations or Technical support handling experience C family language programming experience MS data stack experience like Cosmos/SCOPE",
        "employment_type": "CONTRACTOR",
        "date_posted": "2021-08-26T17:01:46.000Z"
    },
    "company": {
        "name": "Apex Systems",
        "link": "https://www.linkedin.com/company/apex-systems"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Bellevue",
        "region": "WA",
        "postal_code": "98007",
        "street_address": null,
        "latitude": 47.6137,
        "longitude": -122.19093
    }
}