{
    "job": {
        "title": "Principal Software Engineer",
        "industry": "",
        "description": "The Principal Delivery Engineer is a critical member of the Information Management Services competency and will be responsible for the end-end engineering of solutions that are deployed into the Viewpointe managed services environment. Reporting to the Director of Service Delivery Engineering, this position will work across all competencies while leading Engineering and technical Implementation services and staff across all levels of the enterprise. Essential Duties and Responsibilities Duties include the following (other duties may be assigned): ·   Will support the creation and maintenance of the solution blueprints up/down the technology stack (server, database, telecom, network, storage, integration, security, access/authorization, MFT, compute, middleware, and applications). ·   Review and/or create the Solution and Implementation Documentation working across competencies to align requirements to engineered end-end designs with sufficient detail to create the installation runbooks and change requests. ·   Support the provisioning and maintenance of cloud-based services, Software, Enterprise Database and Database as a Service, Infrastructure as a Service, storage systems, and Windows or Linux based applications. ·   Work with vendors as required to support defect/incident resolution, and defined enhancements while supporting QA and Development life cycles. ·   Participate in architecture committees to support enterprise standardization within all solutioned and implemented managed services. ·   Support L3 problem escalation and resolution for all managed service(s): Monitor operational delivery to ensure a high level of availability and functionality to end users. Oversight of service performance and trending to proactively avoid service impacts. Provide documentation of troubleshooting procedures or problem resolution where required. ·   Support escalated service outage recovery efforts, while providing communication on technical issues to both internal and external groups. ·   Support the change management process and ensure the service maintains audit compliance and participate in internal and external audits. ·   Plan, Design, and participate when required in Disaster Recovery testing or support actual failover scenarios. ·   Ensure the operational readiness of new deployments and defined support-ability requirements leveraging tools and monitoring in test and production, while maintaining product serviceability and scale-ability. ·   Interface with Architecture and Development teams and participate in business requirement and technical specification design meetings both internally and customer facing. ·   Evaluate and make recommendations for technical and process improvements as they relate to the infrastructure, middleware, applications, and Cloud-based technologies, with the ability to provide alternative technical solutions or approach, if required. ·   Translate traditional on-prem datacenter technology concepts into cloud-based technology components and services. ·   Support development of build process, configuration, design, and procedure documentation. ·   Support design and implementation of Performance Management tools to ensure solutions meet Service Level Agreement (SLA) metrics. ·   Lead Engineering and operations team members and participate in customer support of software applications/middleware in Customer Test and Production environments. ·   Provide oversight and consult for new customer implementations and provide Level 3 technical support for Managed Services once they are deployed into production. ·   Translate Engineered Solutions into tasks and dependencies while managing timelines and Agile schedules with project management teams. ·   Keep leadership and project management team well informed on status of implementation efforts. ·   May be engaged during 7x24 on-call rotations to support Operational L3 escalations only.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-09T17:44:37.000Z"
    },
    "company": {
        "name": "Tekeinstein Software Solutions",
        "link": "https://in.linkedin.com/company/tekeinstein"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "United States",
        "region": null,
        "postal_code": "99999",
        "street_address": null,
        "latitude": 39.50355,
        "longitude": -99.0183
    }
}