{
    "job": {
        "title": "Site Reliability Engineer (JoinOCI)",
        "industry": "Information Technology and Services,Computer Software,Financial Services",
        "description": "Job Description Principal Member of Technical Staff – Data AI Services The Oracle Cloud Infrastructure (OCI) team can provide you the opportunity to operate a suite of massive scale, integrated cloud services in a broadly distributed, multi-tenant cloud environment. OCI is committed to providing the best in cloud product, that challenges some of the largest public cloud providers , and that meet the needs of our customers who are tackling some of the world’s biggest challenges. We offer unique opportunities for smart, hands-on engineers with the expertise and passion to solve difficult problems in distributed highly available services and virtualized infrastructure. At every level, our engineers have a significant technical and business impact designing and building innovative new systems to power our customer’s business critical applications. We currently have a number of roles available for the OCI Data & AI services. We are addressing exciting challenges at the intersection of data and AI and cutting-edge infrastructure. We are assembling a team of energetic, customer-focused site reliability engineers to build a world-first and best in class customer experience blending SRE, DevOps , incident commander, and NOC engineer disciplines. You’ll be part of a team that learns deeply how our cloud platform works so you can be the bridge between Engineering and Operations. This role is integral to the success of our customer relationships and is critical to the success of the platform. This role will support Oracle’s UK Government customers. Only US citizens or Green Card holders can be considered for this position. Responsibilities Of The Role Contribute to Design, Archtecture Decisions, and OCI optimization and Monitoring Deploy code and execute other changes within the region, with a strong focus on automation – including machine learning Operate and perform maintenance for services running within the region Troubleshoot operational issues on behalf of service teams Be the on-call point of escalation for incidents and other issues arising within the region Ensure timely resolution and documentation of incidents through bridges Ensure thorough documentation of incidents through company ‑ standard reporting methods Monitor the region for faults, alarms, and other errors Inform internal teams as required through processes and procedures Qualifications For The Role Bachelor’s degree, in Computer Science, MIS or another technical field, or equivalent work experience Expert with various Linux operating systems Proven experience with CI/CD and various tooling around this (K8s, Jenkins, GoCD, CircleCI etc.) Passionate about driving automation, ensuring everything we do is repeatable, reliable and performant Expert with orchestration/automation tools (Ansible, Terraform, Packer, Chef, etc.) Deep Knowledge of container technologies (Docker, Kubernetes, Docker Swarm etc.) Proven experience with version control services (Git, SVN etc.), and with this a solid understanding of branching strategies in line with CI/CD, as well as experience with code review Experience making changes within change management procedures, with a goal to automate where possible, and therefore reducing the burden of Change Management Experience participating in or running incident bridges and Post Incident Reviews Experience troubleshooting complex systems, software and/or networking issues Customer obsession, passion for delighting customers Strong understanding, and proven experience working with cloud concepts and platforms, including the support of Cloud Services (AWS, GCE, Azure, OpenStack, vSphere etc.) Experience in cloud technical support, operations, NOC or similar is preferred Experience Comprehensive scripting ability using at least two of Python, Golang, HCL, bash, YAML, XML etc. Experienced in developing and supporting API’s and using common API libraries. Deep security expertise at a systems, networks and applications level, including creating certificates. Experience with Penetration Testing is advantageous Experience with building multiple environments, from functional, integration and production environments. A deep understanding of the various testing requirements in order to transition code from development to production is advantageous Experience with Big data technologies is advantageous Proven experience working with SQL and NoSQL services (Oracle, MySQL, MariaDB, HBase, MongoDB, Redis etc.) Experience with caching within production environments is advantageous Experience working with government customers is preferred, but not required Proven ability to quickly learn new technical domains and then train others Great verbal and written communication skills Ability to work well within a team (excellent collaboration and communication skills), as well as being able to work independently. Design, develop, troubleshoot and debug software programs for databases, applications, tools, networks etc. As a member of the software engineering division, you will take an active role in the definition and evolution of standard practices and procedures. You will be responsible for defining and developing software for tasks associated with the developing, designing and debugging of software applications or operating systems. Work is non-routine and very complex, involving the application of advanced technical/business skills in area of specialization. Leading contributor individually and as a team member, providing direction and mentoring to others. BS or MS degree or equivalent experience relevant to functional area. 7 years of software engineering or related experience. About Us Innovation starts with inclusion at Oracle. We are committed to creating a workplace where all kinds of people can be themselves and do their best work. It’s when everyone’s voice is heard and valued, that we are inspired to go beyond what’s been done before. That’s why we need people with diverse backgrounds, beliefs, and abilities to help us create the future, and are proud to be an affirmative-action equal opportunity employer. Oracle is an Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability and protected veterans status, age, or any other characteristic protected by law. Oracle will consider for employment qualified applicants with arrest and conviction records pursuant to applicable law.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-10-16T09:28:36.000Z"
    },
    "company": {
        "name": "Oracle",
        "link": "https://www.linkedin.com/company/oracle"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 84,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Redwood City",
        "region": "CA",
        "postal_code": "94064",
        "street_address": null,
        "latitude": 37.4805,
        "longitude": -122.21528
    }
}