{
    "job": {
        "title": "Data Scientist",
        "industry": "Pharmaceuticals",
        "description": "About The Department The Clinical, Medical and Regulatory (CMR) department at Novo Nordisk is one of the most diverse and collaborative groups within the organization. From health-care-provider interactions and developing and implementing regulatory strategies with the Food & Drug Administration (FDA) to providing medical education and collecting data to support efficacy and new product development, CMR is involved. The one thing that keeps us all marching to the same beat is our patient-centered focus. At Novo Nordisk, you will help patients around the world. As their needs evolve, so does our challenge to find better and more innovative ways to improve their quality of life. We’re changing lives for a living. Are you ready to make a difference? The Position The Data Scientist identifies and delivers dynamic and reliable analytics products and services by leveraging internal and external data to enable faster decision making across Novo Nordisk; and contributes to the growth, competitiveness, and innovation of the company. Relationships This position reports the head of Scientific Analytics and functions as an analytics specialist in the Medical Information & Analytics department. Collaborates closely with teams in departments throughout the organization, including Medical Affairs, Health Economics & Outcomes Research (HEOR), Clinical Trial Management, Market Development & healthcare professional (HCP) Engagement, as well as with other data science units globally. May also mentor Analytics interns and oversee projects with external vendors. Essential Functions Leads the development and delivery of novel and innovative analytics solutions and services (text mining analysis, data visualization, data mining, statistical modelling) in response to client requests. Understands client needs and readily customizes deliverables to address key business needs Explores and introduces new data driven approaches to generate business insights in order to address unanswered business problems. Expertly understands and incorporates analytics best practices and keeps on top of emerging tools and practices Leads analytics projects; understands stakeholder needs; demonstrates thorough understanding of data and directs data preparation activities Validates, interprets and presents data findings to key stakeholders. Translates data analysis into a meaningful story that explains nuance and complexity, and inspires action Communicates to ensure efficient knowledge sharing and collaboration within Medical Operations and occasionally with other departments in CMR Presents existing work within department and with individual clients and/or client departments Collaborates with other Scientific Analytics team members to ensure overall integration of products and services. Contributes to completion of information analytics projects; participates in planning and coordination of projects Contributes to the development of new standards and/or practices Participates in development of Scientific Analytics strategy - develops specific tactics based on strategy. Makes and executes decisions within area of responsibility and impact within department, with some impact outside department Develops network of internal relationships. Participates in projects locally and/or globally, and across CMR Physical Requirements 0-10% overnight travel required. Qualifications B.Sc. level with 6 years of experience from relevant industry such as life sciences or technology research companies. Advanced degree may be substituted for experience as appropriate Advanced degree in Information Science (MIS), Mathematics, Engineering, Statistics (MS) or related field (MS) strongly preferred Excellent organizational, communication, and presentation skills Advanced skills in text mining, data mining, information visualization concepts and tools Experience with cloud analytics platforms & tools (AWS platform & services, R, Python, SQL, Plotly/Dash) Experience researching and implementing Machine Learning & Deep Learning models Deep expertise in interrupting and explaining data trends Subject matter familiarity in one or more disease areas of interest to Novo Nordisk Novo Nordisk is an equal opportunity employer. Qualified applicants will receive consideration for employment without regard to race, ethnicity, color, religion, sex, gender identity, sexual orientation, national origin, disability, protected veteran status or any other characteristic protected by local, state or federal laws, rules or regulations. If you are interested in applying to Novo Nordisk and need special assistance or an accommodation to apply, please call us at 1-855-411-5290. This contact is for accommodation requests only and cannot be used to inquire about the status of applications.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-05T03:06:04.000Z"
    },
    "company": {
        "name": "Novo Nordisk",
        "link": "https://dk.linkedin.com/company/novo-nordisk"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 72,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Princeton",
        "region": "NJ",
        "postal_code": "08540",
        "street_address": null,
        "latitude": 40.35198,
        "longitude": -74.66074
    }
}