{
    "job": {
        "title": "Software Engineer – Senior",
        "industry": "Nonprofit Organization Management,Health, Wellness and Fitness,Hospital &amp; Health Care",
        "description": "Description Job Description/Summary/Objectives : UPMC Presbyterian Shadyside seeks multiple Software Engineers - Senior to be responsible for development, maintenance and systems administration of UPMC Health Plan’s applications, including the MC400 software system. Design and develop the MC400 application system for new interfaces. Enhance and modify the MC400 application system so that it continues to meet the technology requirements of current users. Ensure that MC400 is communicating properly with end-user applications. Collaborate continuously with MC400 users from different departments of UPMC Health Plan such as Finance, Enrollment, and Claims to determine whether the coordination of information sharing can be improved through technical updates or advancements. Recommend the development of new code or recommend reusing existing code to accommodate business changes so that MC400 performance around membership enrollment, billing, and claims processing is efficient and reliable. Responsible for troubleshooting/debugging the existing application technology in the event of production issues. Job Responsibilities Responsible for development, maintenance and systems administration of UPMC Health Plan’s applications, including the MC400 software system. Design and develop the MC400 application system for new interfaces. Enhance and modify the MC400 application system so that it continues to meet the technology requirements of current users. Ensure that MC400 is communicating properly with end-user applications. Collaborate continuously with MC400 users from different departments of UPMC Health Plan such as Finance, Enrollment, and Claims to determine whether the coordination of information sharing can be improved through technical updates or advancements. Recommend the development of new code or recommend reusing existing code to accommodate business changes so that MC400 performance around membership enrollment, billing, and claims processing is efficient and reliable. Qualifications Master’s degree or equivalent in Computer Science, Software Engineering, Information Technology or related field, plus two (2) years of software development, software engineering, analysis, or related experience, including one (1) year of experience analyzing user needs and providing solutions/estimates; designing and developing applications; testing software applications; correcting errors and/or bugs; working with DB2 databases; and utilizing the following tools and technologies: AS/400, RPGLE/RPG ILE, CLLE, RPG-Free/Free Format, and X-Analysis. Telecommuting permissible. In lieu of Master’s degree plus two (2) years of experience, will accept Bachelor’s degree or equivalent in Computer Science, Software Engineering, Information Technology or related field, plus five (5) years of progressive software development, software engineering, analysis, or related experience, including one (1) year of experience analyzing user needs and providing solutions/estimates; designing and developing applications; testing software applications; correcting errors and/or bugs; working with DB2 databases; and utilizing the following tools and technologies: AS/400, RPGLE/RPG ILE, CLLE, RPG-Free/Free Format, and X-Analysis. Telecommuting permissible. UPMC is an Equal Opportunity Employer/Disability/Veteran Total Rewards More than just competitive pay and benefits, UPMC’s Total Rewards package cares for you in all areas of life — because we believe that you’re at your best when receiving the support you need: professional, personal, financial, and more. Our Values At UPMC, we’re driven by shared values that guide our work and keep us accountable to one another. Our Values of Quality & Safety, Dignity & Respect, Caring & Listening, Responsibility & Integrity, Excellence & Innovation play a vital role in creating a cohesive, positive experience for our employees, patients, health plan members, and community. Ready to join us? Apply today.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-25T17:36:13.000Z"
    },
    "company": {
        "name": "UPMC",
        "link": "https://www.linkedin.com/company/upmc"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Pittsburgh",
        "region": "PA",
        "postal_code": "15235",
        "street_address": null,
        "latitude": 40.44217,
        "longitude": -79.99496
    }
}