{
    "job": {
        "title": "Machine Learning Engineer",
        "industry": "Information Technology and Services,Computer Software,Telecommunications",
        "description": "As part of a high performing global team, the right candidate will play a hands-on role in the design and development for implementing Machine learning best practices in network traffic data collection, processing, analysis, and monitoring. Responsibilities :- Design, develop and maintain key frameworks, services and applications for network traffic data collection, processing, analysis, correlation, and monitoring in Cloud Products. Experience with applying statistical distribution analysis to data. Hands on experience in designing batch-based, real-time streaming and event-based data solutions (Spark, Storm, Flink etc. Kafka expertise highly desired) Proficient with microservices-based, API/Endpoint architectures Experience in network traffic data collection, processing, analysis, and monitoring, and solid understanding of protocols TCP/IP, IPv4/IPv6, NetFlow, sFlow, IPFix. Netconf/Yang Understanding of concepts of Radius, PPPoE IP, DHCP IP, SNMP. Highly proficient in Java, Go, Nodejs, Scala, or similar programming languages. Experience in building and productizing cloud-based/scale data ingestion (preferably in AWS) Experience in cloud data solutions like Elastic, Greenplum, Redshift or like technologies a plus. 5 -10 years of highly technical, hands-on software engineering experience. Independent and Self driven and works in a Team. Customer facing engineering role in debugging and resolving field issues. Participate and drive technical discussions within engineering group in all phases of the SDLC: review requirements, produce design documents, participate in Peer reviews, produce test plans, support QA team, provide internal training and support TAC team. Organized and goal-focused, ability to deliver in a fast-paced environment. Strong, creative problem-solving skills and ability to abstract and share details to create meaningful articulation. Implementation background in various data processing, consumption patterns, and pipelines.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-13T17:44:58.000Z"
    },
    "company": {
        "name": "HCL Technologies",
        "link": "https://in.linkedin.com/company/hcl-technologies"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "United States",
        "region": null,
        "postal_code": "99999",
        "street_address": null,
        "latitude": 39.50355,
        "longitude": -99.0183
    }
}