{
    "job": {
        "title": "Site Reliability Engineer",
        "industry": "Information Technology and Services,Computer Software,Computer &amp; Network Security",
        "description": "Site Reliability Engineer About The Role Imperva’s Infrastructure and Cloud team is looking for a highly technical Site Reliability Engineer to drive innovation, scale, and create operational excellence for the Imperva globally distributed network. As an SRE in the ICO organization, you approach solving, supporting, and optimizing the infrastructure programmatically. You will work to improve the overall availability, reliability, performance, and security of the infrastructure for Imperva’s customers. Responsibilities Establish metrics for data-driven decisions to help increase availability, reliability, and velocity Apply SRE core tenets of measurement (SLI/SLO/SLA), eliminate toil, and reliability modeling Provide go/no go preplanning, verification/validation, and review of existing and new product/services Proactively analyze data and test the integrity of systems to ensure production applications and services are operating optimally Work with internal and external customers as needed to troubleshoot and resolve business affecting issues Escalations, incident response, RCA, and blameless postmortem Participate in 24x7 on-call rotation Qualifications 5+ years of professional experience within a cloud/web/CDN scale infrastructure Experience programming in any combination of Python, Go, C/C++, Rust Expert-level knowledge of Linux systems, network programming and protocols TCP, UDP, DNS, TLS/SSL, HTTP Experience with BGP and anycast routing is a plus Experience with DevOps principles and concepts such as Infrastructure as Code (Ansible/Saltstack), CI/CD (Gitlab, Jenkins, Git), monitoring and visualization (Prometheus, Grafana) Experience with big data technologies such as NoSQL/RDBMS, Redis, ElasticSearch, Kafka Experience with containers and container management (Docker, Kubernetes) is a plus Experience analyzing and building data telemetry, modeling, pipelines, UI visualization Experience in developing software, troubleshooting, and monitoring large scale distributed systems Implement modern software engineering best practices/standards and adhere/maintain software development life cycle Working knowledge and experience of Agile software development methodologies Outstanding collaboration and communication, and documentation skills with a proven ability to work cross-functionally to establish and meet OKRs BS/MS in computer science, engineering, or a related technical discipline or equivalent experience Our Company Imperva is the cybersecurity leader whose mission is to help organizations protect their data and all paths to it. Customers around the world trust Imperva to protect their applications, data and websites from cyber attacks. With an integrated approach combining edge, application security and data security, Imperva protects companies through all stages of their digital journey. Imperva Research Labs and our global intelligence community enable Imperva to stay ahead of the threat landscape and seamlessly integrate the latest security, privacy and compliance expertise into our solutions. Learn more on the Imperva website or company blog , and follow Imperva on LinkedIn and Twitter . Benefits IImperva offers a competitive compensation package that includes base salary, medical, flexible time off and more. It’s an exciting time to work in cybersecurity. Learn about Imperva products and services at www.imperva.com and career opportunities at www.imperva.com/careers Legal Notice Imperva is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, ancestry, pregnancy, age, sexual orientation, gender identity, marital status, protected veteran status, medical condition or disability, or any other characteristic protected by law.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-19T21:52:04.000Z"
    },
    "company": {
        "name": "Imperva",
        "link": "https://www.linkedin.com/company/imperva"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Newark",
        "region": "NJ",
        "postal_code": "07112",
        "street_address": null,
        "latitude": 40.731506,
        "longitude": -74.174385
    }
}