{
    "job": {
        "title": "Machine Learning Engineer",
        "industry": "Retail,Apparel &amp; Fashion",
        "description": "Senior Machine Learning Engineer Global Ecommerce Retailer Fully Remote - Anywhere in US $190,000 - $210,000 + full benefits & bonus You will be working with a well-established fashion brand in the US. They are leaders in their industry and are at an exciting point in their growth, moving into a tech revolutionized future. They are looking for an experienced Machine Learning Engineer who will be responsible for collaborating with the data science team to operationalize Machine Learning Models to transform their standard business procedures. You will optimize already existing Machine learning systems to revolutionize consumer satisfaction. THE ROLE As the Senior Machine Learning Engineer, you will be required to: Apply end-to-end solutions for batch and real-time algorithms along with requisite tooling around Monitoring, logging, automated testing, performance testing, and A/B testing . Find fresh opportunities to improve business processes and consumer experiences, as well as Prototype solutions in order to create value with an evolutionary mindset. Collaborate with data scientists and analysts to create and employ new product features on eCommerce. Automate efficient processes for data analyses, model development, validation, and implementation using y Write software to ship products in a continual-release environment Contribute to and promote good software engineering practices throughout the team. Contribute to and re-use community best practices. YOUR SKILLS AND EXPERIENCE The successful Senior Machine Learning Engineer will have the following skills and experience: University or advanced degree in engineering, computer science, mathematics, or a related field Long-standing experience developing and deploying machine learning systems into production Commercial e xperience working with SQL and NoSQL databases Experience working with big data tools: Hadoop, Spark, Kafka, etc. in a commercial environment Experience with at least one cloud provider solution (AWS, GCP, Azure) Strong Experience with Python, Java, C++, Scala, etc – comfortable coding and working from scratch Experience working in a Linux environment Knowledge of data pipeline and workflow management tools Expertise in standard software engineering methodology integration, code reviews, design documentation Relevant working experience with Docker and Kubernetes is a big plus KEYWORDS NLP | Engineering | Natural Language Processing | Machine Learning | Deep Learning | Data Science | Fashion | Software Engineering | Natural Language Understanding | Natural Language Generation",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-03T21:45:50.000Z"
    },
    "company": {
        "name": "Harnham",
        "link": "https://uk.linkedin.com/company/harnham"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "San Francisco",
        "region": "CA",
        "postal_code": "94121",
        "street_address": null,
        "latitude": 37.78008,
        "longitude": -122.42016
    }
}