{
    "job": {
        "title": "Data Engineer",
        "industry": "Nonprofit Organization Management,Financial Services,Real Estate",
        "description": "Who We Are ICAST is a national non‐profit that delivers green upgrades in multifamily housing that tackles our affordable housing, climate change and social equity crisis. ICAST is the nation’s premier service provider to apartment communities that serve low-to-moderate income (LMI) residents. We value education that motivates people to act, leading to results that foster local economic development, environmental stewardship, and social responsibility in under‐served communities. By 2025, we aim to serve 100,000 LMI households annually by reducing their utility costs by $270 Million, reduce Carbon emission by 1.5 million tons, create 2,000 sustainable jobs and invest over $100 Million in local communities. We are looking for the smartest, entrepreneurial, and committed new team members who wish to make a difference. ICAST may be a fit for you if You consider yourself an overachiever. Are looking to leave your mark on society. Are an out-of-the-box thinker. Strive to be efficient and productive at all times. Are dedicated to saving the planet and helping others less fortunate than you. And are passionate about ICAST’s mission. This position might be a fit for you if You are a Data Engineer with solid technical and interpersonal skills responsible for developing and managing business intelligence and analytics solutions critical to running our business. This includes solution design and development, data acquisition and development of all queries and visuals to provide solutions that are intuitive, intelligent, and interactive. You will be responsible for writing advanced queries and developing reporting capabilities not limited to dashboards, reports or data extracts. The Data Engineer will be part of all phases of the development lifecycle including gathering and analyzing user/business requirements, system design, implementation, testing, and operational support. Your typical day might include the following activities Database, Data Warehouse, DataMart design and development Data extracts, queries, stored procedures and functions to manipulate and prepare data for analysis and reporting Designs, builds and deploys business intelligence solutions including dashboards, reports, custom analysis, and data extracts Documents solutions and maintains information libraries and data dictionaries Build alliances with Business Development, Engineering, Sales, Marketing and Accounting teams to solve problems and achieve objectives by sharing knowledge and information Location USA - Remote Reports to IT Manager Skill Level Mid-senior Compensation 70K-120K (DOE) Requirements Must Have Experience 1 year with design and development of data warehouses 1 year with any of the following Azure, MS Power Platform, MS-SQL, Python, Ruby, Spark, REST, JSON, DataVerse (Common Data Service) 1 Year using BI and Visualization tools (e.g., PowerBI, Qlik, Tableau, etc.) Demonstrated ability to develop advanced MS-SQL solutions to fully automate data-driven dashboards, reports and workflows Understands the software development life cycle process and Agile methodologies Strong written and verbal communication skills; can articulate complex concepts to non-technical audiences Able to create intuitive and interactive reporting solutions that enable users to perform ad hoc analysis and drill to details Skilled at optimizing queries and reports Capable of troubleshooting reports and query issues Ability to work independently and effectively manage multiple priorities Possesses advanced SQL development skills including writing complex queries/views, creating functions, stored procedures and table value functions in SQL Server Excellent query and data manipulation skills using SQL Able to read and understand data models and entity-relationship diagrams Experience with Analysis Services or Web technologies a strong plus Ability to work independently to research issues, gather information and prioritize tasks Experience with command-line scripting or familiarity with object-oriented programming for data retrieval is a plus Even Better If You Have Advanced knowledge of Microsoft PowerBI, DataFlows, DataLakes, and Power Platform Products Direct experience with more than one of the following Azure Synapse Analytics, Amazon Redshift, Snowflake, Google BigQuery, Azure Baseline understanding of advanced topics – Big Data, AI, Machine Learning, Predictive Analytics, etc. Benefits Company Health Insurance plan for the employee at no cost! ( charges will be added for spouse and family coverage) Available Vision and Dental Insurance and Life Insurance coverage 403b Retirement Savings Plan available on day 1 Up to $400 in annual gym/fitness membership reimbursement through our healthcare program! ICAST is transitioning to an Unlimited PTO policy and this position would be eligible for it once it is implemented.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-06-24T05:07:40.000Z"
    },
    "company": {
        "name": "ICAST (International Center for Appropriate &amp; Sustainable Technology)",
        "link": "https://www.linkedin.com/company/icast"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Denver",
        "region": "CO",
        "postal_code": "80247",
        "street_address": null,
        "latitude": 39.738453,
        "longitude": -104.984856
    }
}