{
    "job": {
        "title": "Principal Software Test Engineer",
        "industry": "Defense &amp; Space",
        "description": "EaglePicher Technologies is looking for a Software Test Leader in safety critical software systems. The leader has the ability to shape the future of software testing in the organization. Come join the team to ensure the safety of the software for cutting edge lithium ion battery management systems and integrated power solutions that are being used to power the next generation of spacecraft, jets, and ships. Responsibilities Hands-On Leader of the software test team(s) for customer software products. Establishes the Test Management Process for customer product deliverables in compliance with the EaglePicher software development process. Create software verification plans, software test plans, and software quality assurance plans. Perform software validation testing against user interface manuals. Perform software verification testing against software requirement specifications. Ensure all software tools are validated and tracked for changes. Review software requirements specifications for compliance with product requirements standard. Review software design documents for compliance with product design standard. Identify efficient, cost effective test tool solutions for robust test coverage. Supports and develops software engineers by providing test advice and coaching in technical reviews. Participate in safety and cybersecurity risk analysis. Part of the annual review/maintenance of the EaglePicher software development process. Protects customer and corporate operations by keeping information confidential. Ensures all software test team members maintain their tool training requirements. Updates job knowledge by studying state-of-the-art software test tools (automation), testing techniques, and efficient test processes by enrolling in educational opportunities, reading professional publications, and participating in professional organizations. Qualifications To succeed in this position, you must: Must be a US Citizen or Permanent Resident Prior hands on experience as a Senior or Principal Software Test Engineer Bachelor’s Degree in Engineering or Physics Experience in implementing a Software Test Management System Performed software test activities for both embedded systems and desktop applications Creation of software test traceability and test summary reports Working knowledge of C/C++ and RTOS Working knowledge of C# Working experience in a regulated environment Managed software tool validation Participated in definition and/or maintenance of corporate software development process Experience working with embedded software development engineers for test design hooks Experience using lab equipment such as oscilloscopes, logic analyzers, and power supplies HIRING PREFERENCES In addition to meeting the basic requirements, the most successful candidates will also have: Master’s Degree in Engineering or Physics Experience with an Application Lifecycle Management System Performed software test activities for web client and/or server applications Working experience with TestStand and/or Labview Working knowledge of Java Working knowledge of Python Implementation of an automated software test solution ABOUT EAGLEPICHER EaglePicher Technologies, LLC is a leading producer of batteries and energetic devices for the defense, aerospace, medical, commercial, oil, and gas industries. The company provides the most experience and broadest capability in battery electrochemistry of any battery supplier in the United States. Battery technologies include lithium ion, thermal, silver zinc, lithium carbon monofluoride, lithium thionyl chloride, lithium manganese dioxide, lithium sulfur dioxide, and reserve lithium oxyhalide. EaglePicher also provides custom battery assemblies, battery management systems, pyrotechnic devices, and other power solutions. EaglePicher Technologies is headquartered in Joplin, MO. and is ISO9001:2008, ISO 13485, and AS9100C certified. For more information, visit www.eaglepicher.com. PERKS OF BEING AN EAGLEPICHER EMPLOYEE Some of the great things about being an EaglePicher employee include: Medical, dental, vision, life, and disability insurance; 10 paid holidays and PTO; Matching 401K; Tuition reimbursement; Dependent scholarship programs. EaglePicher is an equal opportunity employer. Qualified applicants will be considered without regard to age, race, creed, color, national origin, ancestry, marital status, affectional or sexual orientation, gender identity or expression, disability, nationality, sex, religion, or veteran status. For more information on applicable equal employment regulations, refer to the EEO is the Law poster. Please refer to the EEO is the Law Supplement Poster and the Pay Transparency Policy.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-14T15:33:55.000Z"
    },
    "company": {
        "name": "EaglePicher Technologies",
        "link": "https://www.linkedin.com/company/eaglepicher"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "East Greenwich",
        "region": "RI",
        "postal_code": "02818",
        "street_address": null,
        "latitude": 41.662262,
        "longitude": -71.45002
    }
}