{
    "job": {
        "title": "Software Engineer I",
        "industry": "Computer Software,Information Technology and Services",
        "description": "Innovation Lives Here You go all in no matter what you do, and so do we. You want to use your powers for good, and that’s exactly what we do at Lytx®. Our team is made up of hungry, humble, and capable people who are making a difference every day with technology that helps save lives each year. Why Lytx We are seeking a Software Engineer to help accelerate our industry leading Driver Safety/Fleet Management Programs. Our products manage massive amounts of data collected from over 700,000 vehicles worldwide. We use the data and video to derive intelligent insights using Machine Vision and AI. We also track real time telematics for all devices on the network. You’ll Get To Rapidly prototype, deploy, and test new solutions within our markets Provide state-of-the-art user experiences across mobile and desktop solutions Grow and build out your skills by participating in developing and operating scalable production services and user interface Develop and test new solutions that enhance our position within our markets What You’ll Need BS in Computer Science/Engineering, completion of a certified code camp or equivalent experience. Experience in creating multi-platform UI using Angular, preferred. Familiarity with development of REST services. SQL Database design and modeling experience. Experienced with object oriented design practices and patterns. Proficiency in C# or other objected-oriented languages. Ability to collaborate across numerous teams to achieve results. ___________ Lytx is powered by cutting-edge technology and Happy People. You want to use your powers for good, and that’s exactly what we do at Lytx. Our team is made up of hungry, humble, and capable people who are making a difference every day with technology that helps save lives each year. Lytx is powered by cutting-edge technology and Happy People. You want your work to make a positive impact in the world, and that’s what we do at Lytx. We’re a diverse team of hungry, humble and capable people united to make a difference. Together, we help save lives on our roadways. Find out how good it feels to be a part of an inclusive, collaborative team. We’re committed to delivering an environment where everyone feels valued, included and supported to do their best work and share their voices. Lytx, Inc. is proud to be an equal opportunity/affirmative action employer and maintains a drug-free workplace. We’re committed to attracting, retaining and maximizing the performance of a diverse and inclusive workforce. EOE/M/F/Disabled/Vet.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-10T23:03:53.000Z"
    },
    "company": {
        "name": "Lytx, Inc.",
        "link": "https://www.linkedin.com/company/lytxinc"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Carlsbad",
        "region": "CA",
        "postal_code": "92010",
        "street_address": null,
        "latitude": 33.16604,
        "longitude": -117.33793
    }
}