{
    "job": {
        "title": "Senior Java Software Engineer",
        "industry": "",
        "description": "Senior Java Developer with MicroServices 12+ Months Contract St. Louis, MO Open only for H1B , GC, USC ****Strictly No OPT / CPT / H4 / TN Visa**** Qualifications: Minimum 9+ years of IT software Development experience especially in Core Java concepts and Advanced Java, Multi-Threading collections/Exceptions. Development of applications using Java/J2EE, Microservices,Spring, Spring Boot, Hibernate, Pivotal cloud foundry Strong experience in Spring-boot, Microservices is required. Strong Java developer with very good understanding of micro services. Grasp of software engineering skills in modular design, data structures, algorithms Deep knowledge and hands on experience with modern applications like spring boot, Angular. Experience building and operating critical production systems Solid understanding of modern API design and Restful principles Fluent with git (preferred) or other SCM system Write well designed and testable code Strong Experience in automation and build tools like Maven, Ant and Gradle. Bachelor's degree in computer science engineering or a related discipline, or equivalent work experience. Experience in software development design and implementation of large scale distributed systems and web services building complex software that is testable and designed for extensibility. Good understanding of building, deploying, and maintaining critical applications in a cloud based environment. Work extensively with open source software capable to modify or extend code maintained as part of an open source project. Employ both Object Orientated development skills and Systems Engineering skills",
        "employment_type": "CONTRACTOR",
        "date_posted": "2021-08-25T17:20:06.000Z"
    },
    "company": {
        "name": "Confidential",
        "link": "https://www.linkedin.com/company/confidentialcompany"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "St Louis",
        "region": "MO",
        "postal_code": "63121",
        "street_address": null,
        "latitude": 38.635357,
        "longitude": -90.20099
    }
}