{
    "job": {
        "title": "Software Engineer ",
        "industry": "",
        "description": "Software Engineer I Job Description 8/16/2021 As a member of the Engineering organization, this individual will work with other engineers, sales and marketing professionals, as well as customers to develop Allagi Inc optical metrology and inspection products. These products are sold around the world within the semiconductor, flat panel, consumer electronics, automotive, and aerospace industries. A Software Engineer I is responsible for software development with guidance and oversight of their immediate manager, including system software design, data analysis, report writing and presentation of results to senior technical staff internal to Allagi and to customers. Work assignments will generally require this individual to understand sophisticated electrical, mechanical, optical instrumentation and physics in order to solve complex software tasks. The Software Engineer I will have, or acquire in the course of work, a technical understanding of our customer’s measurement problems and manufacturing processes so as to design and optimize the system software for use by the end customer. Assignments call for approximately 10% domestic and international travel. It is expected that personnel functioning as a Software Engineer I will propose, and implement solutions to, technical problems and make technical presentations at an appropriate level.  It is the responsibility of a Software Engineer I to work jointly with the Engineering, Sales and Marketing teams to insure product meets customer and market requirements; this individual will regularly report technical requirements to senior management. A Bachelor’s Degree in Software Engineering, Computer Science, or a related field is required. Candidates must have proficiency in using an object-oriented language and relevant code versioning tools. Candidate must have experience working with C#, .NET, Azure or equivalent tool; knowledge of WPF, WCF, OpenCV, OpenGL and industrial inspection or vision-based inspection desirable. Excellent written and verbal communications skills are required. Expectations and Deliverables for Software Engineer I: Individual will have the ability to be productive as an individual and work as part of a team. Individual is expected to produce high quality work with attention to detail. Individual will help respond to market requirement documents by specifying engineering architectural requirements. Individual will be support translation of application storyboards and use cases into functional applications. Individual will Design, build, and maintain efficient, reusable, and reliable C# code in coordination with larger software and engineering teams. Individual will identify bottlenecks and bugs, and devise solutions to these problems. Individual will help maintain code quality, organization, and automatization. Individual may participate in engineering development activities by proposing instrumentation design options, and may be assigned development task pending experience, capability, and schedule availability. Individual may support the training other individuals (customers or company employees) and will help develop training material as needed. Individual may support sales and marketing activities including, but not limited to, customer visits, trade shows, preparation of sales and marketing materials (such as specification responses, technical notes, training material, etc.).",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-16T14:20:10.000Z"
    },
    "company": {
        "name": "Allagi Inc.",
        "link": "https://www.linkedin.com/company/allagi-incorporated"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Portland",
        "region": "OR",
        "postal_code": "97268",
        "street_address": null,
        "latitude": 45.516018,
        "longitude": -122.68143
    }
}