{
    "job": {
        "title": "HRIS Security &amp; Data Maintenance Analyst",
        "industry": "Hospital &amp; Health Care",
        "description": "ABOUT US: As the leader of rehabilitative care, Encompass Health offers both facility-based and home-based patient care through its national network of rehabilitation hospitals, home health agencies, and hospice agencies that spans 42 states and Puerto Rico. Setting the standard for providing excellent care, Encompass Health has earned its place among Modern Healthcare’s “Best Places to Work in Healthcare” and the Fortune “World’s Most Admired Companies” for 2021. POSITION PURPOSE: The HRIS Security & Data Maintenance Analyst plays an integral role in HR Systems security definition and is responsible for defining, setting up, maintaining and accurately documenting security access for all HR systems. The HRIS Security & Data Maintenance Analyst also oversees application support including table setup and maintenance, data integrity, and auditing of data. Additionally, this role will assist with the overall administrative support of existing HR systems including upgrades, conversions, and problem resolution. RESPONSIBILITES & TASKS: SECURITY & AUDITS: Defines and sets up security roles and permissions for HR Systems. Defines and maintains dynamic role and permission assignment for auto provisioning and de-provisioning. Creates and maintains a crosswalk that outlines role permissions and assigned titles. Creates queries/reports that extract role definitions and permissions for auditing purposes. Acts as security administrator by processing access requests to HR applications and systems. Ensures appropriate approvals are received for any ad hoc requests. Serves as the SME that partners with various business areas to provide guidance on best practices and current HR security protocols. Performs periodic audits of HR system user security/access. Validates current company structure against employee job movement to maintain continuous access accuracy. Looks for opportunities to increase efficiencies for common requests. Supports employees/end users with HR system access issues. Adheres to department’s SLA for processing requests. TABLE MAINTENANCE, UPLOADS & DATA INTEGRITY AUDITS: Responsible for mass data uploads, coordinating with HR contacts to ensure accuracy in the process. Performs data structure and integrity audits on employee data mass upload requests. Seeks to minimize errors and determine impacts to downstream systems/processes, as well as impacts to employees due to requested changes/movement. Updates system fields and tables associated with business changes and operations. Maintains tables and security changes within HR Systems. Proactively utilizes PeopleSoft Query, OBI Reporting or SQL tools to identify data integrity issues. Determines the appropriate approach to ensure employee and company structure data elements are updated correctly. Conducts data audits to identify potential non-compliance. I.e. personal data audits…duplicate NID, DOB out of guidelines. Partners with internal audit to research and analyze potential data discrepancies. Partners with ITG to implement automated access audit processes. Participates in new projects through testing/implementation as it relates to access and security. Completes mandatory training and courses required by completion date. Reports questionable situations, concerns, complaints or harassment immediately. Conducts audits of system process completions and reports out to business owners. i.e. Onboarding not complete. Administers duplicate processing in ATS and other HR systems. Ensures compliance regarding HR information sharing, management, organization, hierarchy determination, retrieval, accessibility, dissemination, sharing, and quality control. Qualifications: Minimum Qualifications: Bachelor's degree preferred. Associate's degree with 4 years of related experience may be substituted for Bachelor's degree. Four or more years of experience required in related field (i.e. Human Resources Operations, HRIS, HR Technology, IT, etc.). Strong knowledge of Microsoft Word, Excel, and PowerPoint. Advanced Excel skills preferred. Strong analytic and diagnostic skills as well as a data-driven and metrics-driven approach. Minimum 3 years of experience with PeopleSoft version 9.2 or higher preferred. Experience with workflow analysis, business process analysis, finding improvement areas, and use of business modeling tools. Experience with security and auditing processes. Machines, Equipment Used: General office equipment such as computer/laptop, telephone, copy/fax machine, calculator, scanner, etc. Microsoft Office software, to include Outlook, Word, PowerPoint, and Excel. Physical Requirements: Visual acuity, speech recognition, speech clarity. Ability to lift, lower, push, pull, and retrieve objects weighing a minimum of 15 pounds. Reasonable assistance may be requested when lifting, pushing, and/or pulling exceeds these minimum requirements. Skills and Abilities: Oral communication, written communication, fluency in English, active listening. Information ordering, deductive reasoning, social perceptiveness, time management, critical thinking. Ability to coordinate, analyze, observe, make decisions, and meet deadlines in a detail-oriented manner. Ability to work independently without continuous supervision. Ability to understand and react quickly to changing priorities. Demonstrated accuracy and thoroughness while meeting customer needs in a timely manner. Environmental Conditions: Indoor, temperature controlled, smoke-free environment. Handicapped accessible. May work under stressful circumstances at times. Proficiency or Productivity Standards: Has regular, reliable, and predictable attendance and punctuality. Adheres to dress code including wearing ID badge. Adheres to Standards of Business Conduct. May be required to work weekdays and/or weekends, evenings and/or night shifts if needed to meet deadlines. May be required to work on religious and/or legal holidays on scheduled days/shifts. May be required to perform other duties as assigned by supervisor. This position will support cultural diversity by promoting and maintaining an inclusive work environment and culture that is respectful and accepting of diversity.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-25T17:45:15.000Z"
    },
    "company": {
        "name": "Encompass Health",
        "link": "https://www.linkedin.com/company/encompasshealth"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 48,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Birmingham",
        "region": "AL",
        "postal_code": "35226",
        "street_address": null,
        "latitude": 33.522858,
        "longitude": -86.80771
    }
}