{
    "job": {
        "title": "Data Scientist, Associate",
        "industry": "Pharmaceuticals",
        "description": "Role Summary The Data Scientist, Associate enables his or her customers to work more efficiently and effectively supported by data-driven insights that he or she embeds into day-to-day business processes. The team will partner with Pfizer Global Supply teams focused on improving manufacturing and quality processes through analytic insights. These teams include but are not limited to: COVID Vaccine executive visibility and throughput efficiency projects The Integrated Manufacturing Excellence and Investigation Excellence initiatives for data driven performance management within Pfizer’s 60+ plants The Global Technology Services team’s projects on Manufacturing Process Analytics and Control work, Knowledge Management, Artificial Intelligence, and the Industrial Internet of Things The PGS Strategy team’s tracking of metrics via the balanced scorecard project Role Responsibilities The Data Scientist, Associate colleague’s responsibilities include but are not limited to the following: Managing individuals and teams: Help people work together to achieve more than they could alone. Develop productive and harmonious working relationships with other data and analytics team members. Leverage knowledge from others related to overall objectives, strategy, critical issues, and policy matters. Collaborate with key stakeholders across PGS, D&T and Strategic Partners Act independently on self-initiated projects. Work across multiple concurrent activities with parallel objectives and successfully adapt to changing priorities as required. Manage solution vendor technical relationships. Apply strong process and procedure skills, particularly to stakeholder management. Leveraging business knowledge: Learn the jargon, processes, and culture of Pfizer Global Supply operations such as manufacturing, quality control and quality assurance. Understand business needs and document them with narratives, journey maps, flow charts and metrics definitions. Identify high-value operations use cases across Pfizer’s network of 60+ manufacturing sites. Define meaningful metrics that the business believes accurately represents the success or failure of their operations. With metrics and usage tracking, prove that solutions improve drug product quality, increase asset utilization/uptime, automate manual workflows, and streamline plant floor operations. Creating performant, reliable, relevant solutions: Perform root cause analysis on internal and external data and processes to answer specific business questions and identify opportunities for improvement. Build data and analytics tools that will offer deeper insight into the pipeline, allowing for critical discoveries surrounding key performance indicators. Interpret and distill requirements from stakeholders into technically feasible goals. Collaborate with (challenging) business owners. Design solutions to satisfy stakeholder requirements, often in collaboration with UX/UI experts. Supply solutions with pipelines of data, particularly through Pfizer’s Unifed Data Hub (UDH). Support integration of one's own solutions with other teams' solutions. Integrate multiple solutions to enable a seamless user experience. Applying broad and deep technical expertise: Please see QUALIFICATIONS section below… Basic Qualifications Education and experience: BS/BA Information Technology, Mathematics, Physics, Engineering, Data Science, or related discipline A minimum of 2 years related work or equivalent experience Agile methodologies: Track and manage tasks in agile tools (e.g. Jira, Confluence) Databases: Query (large) relational databases (e.g. PostgreSQL, Oracle, AWS Redshift) using SQL and (large) graph databases (e.g. using Neo4j’s cypher language). Diagram logical relational/graph data models. Program extract-transform-load (ETL) scripts (in Python) that automate local database refreshes. Visualization: Visualize insights with exploratory data anslysis tools (e.g. Tableau, Spotfire) Visualize data programmatically (Python, R, Javascript, D3.js) Programming / Tool Development: Manipulate data with programming languages (e.g. Python, R, JavaScript) Manage programming tasks with IDE tools (e.g. Jupyter Notebook) Collaborate on program code with a team of developers using versioned code repositories (e.g. GitHub) Analytics / Data Science: Perform mathematical calculations involving algebra and calculus, such as derivatives. Apply statistics to data to establish meaningful metrics. Analyze geospatial data to derive location-based business insights. Analyze (social/operational) network data for insights on clustering, influence, flow. Write optimization code for a SIMPLEX engine (e.g. Gurobi, CPLEX, COIN-OR, etc.) Business skills: Strong analytical and quantitative problem-solving and troubleshooting ability A strong team player with excellent oral and written communication skills Excellent relationship skills with a keen sense of customer service Process oriented with great documentation skills Experience with Agile methodologies Physical/Mental Requirements Complex problem solving using applied mathematics and data science practices Ability to manage many parallel objectives and changing priorities. Understanding complex interrelationships between system components and design/implementation decisions. Non-standard Work Schedule, Travel Or Environment Requirements Travel Requirements are project based. Estimated percentage of travel to support project and departmental activities is 20-60% depending upon the phase of any specific project (and pre-pandemic conditions). Other Job Details: Last Date to Apply for Job: 9/8/2021 Sunshine Act Pfizer reports payments and other transfers of value to health care providers as required by federal and state transparency laws and implementing regulations. These laws and regulations require Pfizer to provide government agencies with information such as a health care provider’s name, address and the type of payments or other value received, generally for public disclosure. Subject to further legal review and statutory or regulatory clarification, which Pfizer intends to pursue, reimbursement of recruiting expenses for licensed physicians may constitute a reportable transfer of value under the federal transparency law commonly known as the Sunshine Act. Therefore, if you are a licensed physician who incurs recruiting expenses as a result of interviewing with Pfizer that we pay or reimburse, your name, address and the amount of payments made currently will be reported to the government. If you have questions regarding this matter, please do not hesitate to contact your Talent Acquisition representative. EEO & Employment Eligibility Pfizer is committed to equal opportunity in the terms and conditions of employment for all employees and job applicants without regard to race, color, religion, sex, sexual orientation, age, gender identity or gender expression, national origin, disability or veteran status. Pfizer also complies with all applicable national, state and local laws governing nondiscrimination in employment as well as work authorization and employment eligibility verification requirements of the Immigration and Nationality Act and IRCA. Pfizer is an E-Verify employer. Information & Business Tech",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-26T23:52:32.000Z"
    },
    "company": {
        "name": "Pfizer",
        "link": "https://www.linkedin.com/company/pfizer"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Cambridge",
        "region": "MA",
        "postal_code": "02239",
        "street_address": null,
        "latitude": 42.36525,
        "longitude": -71.10502
    }
}