{
    "job": {
        "title": "Tenure Track Faculty position in Mathematics, Statistics or Data Science",
        "industry": "Nonprofit Organization Management,Higher Education,Education Management",
        "description": "Job location: San Diego - Point Loma Employment Type: Full-time Posted data: 2020-12-23 Req: R0002380 The Point Loma Nazarene University community is, and intends to be, a decidedly Christian community, as exhibited by our shared beliefs, corporate practices, and Christlike character. Job Summary The Department of Mathematical, Information and Computer Sciences is seeking candidates for a full-time tenure-track teaching position in mathematics, statistics or data science. The Department is seeking an individual capable of excellent teaching, committed to significant involvement with students both within and outside of the classroom, and interested in participating in the department’s service learning and undergraduate research programs. The Department of Mathematical, Information and Computer Sciences offers B.S. and B.A. degrees in Mathematics, Data Science, Computer Science and Information Systems. The department works in highly collaborative ways with the Department of Physics and Engineering and is committed to interdisciplinary collaboration. The department has a strong commitment to quality teaching, and passion for building community with students, a new data science program, and a tradition of undergraduate research. Responsibilities begin August 2021 and will include teaching a wide variety of mathematics courses. Academic rank will be based on degrees and experience. The compensation level also depends upon the education and experience of the appointee. Review of applications will begin immediately and continue until the position is filled. The University encourages applications from women and under-represented minorities. JOB STATUS Time Full time Responsibilities Teach in the area of mathematics and statistics including some general education and service courses. Engage in personal scholarship and scholarship with students Advise students academically, spiritually and socially Participate in departmental activities and governance Serve on university faculty committees and perform other normal faculty duties Qualifications Education: Ph.D. in Mathematics, Statistics or Data Science Experience: Evidence of a commitment to excellence in undergraduate teaching. Philosophical: Thorough commitment to the concept of Christian liberal arts education and a desire to work in a Christian university. Supportive of the religious and educational goals of the university and its sponsoring denomination. Personal: Evidence of Christian commitment and active church involvement. Selection Process: Applicants will be expected to submit a completed application, including a current CV, statement of faith, philosophy of teaching, and plans for ongoing scholarly activity. All applicants will be reviewed and evaluated. From this pool of applicants, a limited number will be selected for a phone interview and a final interview. The interview process will include: Dialogue with students and faculty in the Department of Mathematical, Information and Computer Sciences, and the Department of Physics and Engineering Lecture presented to faculty and students in the Department of Mathematical, Information and Computer Sciences Interview with the Department Chair Interview with the Dean of the Colleges Interview with the Provost Interview with the President of the University SPECIAL INSTRUCTIONS At the time of completing application, you will need the following documents to upload: Curriculum Vitae Cover Letter Statement of Personal Faith Philosophy of Teaching in Christian Higher Education 3 Letters of References (for confidential references, have letters sent to the Department Chair or humanresources@pointloma.edu) Unofficial Transcripts for highest degree completed 3 Teacher Evaluations (if available) If you have question about items for the application, please contact the department chair Dr. Maria Zack at mzack@pointloma.edu PLNU is a vibrant Christian liberal arts university in the evangelical, Wesleyan tradition with an undergraduate and graduate student body of around 4000 including over 40% students of color. PLNU seeks to attract an active, culturally and academically diverse faculty of the highest caliber, skilled in the practice of teaching and scholarship. In a continuing effort to enrich its academic environment and provide quality educational and employment opportunities, PLNU actively encourages applications from members of underrepresented groups in higher education. Point Loma Nazarene University does not discriminate on the basis of race, color, national origin, sex, age, disability or status as a veteran in any of its policies, practices or procedures. In a continuing effort to enrich its academic environment and provide quality educational and employment opportunities, PLNU actively encourages applications from members of underrepresented groups in higher education.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-21T02:00:17.000Z"
    },
    "company": {
        "name": "Point Loma Nazarene University",
        "link": "https://www.linkedin.com/company/point-loma-nazarene-university"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "San Diego",
        "region": "CA",
        "postal_code": "92161",
        "street_address": null,
        "latitude": 32.71576,
        "longitude": -117.16382
    }
}