{
    "job": {
        "title": "Manager, Statistical Programming (FTE/Remote)",
        "industry": "Pharmaceuticals",
        "description": "Clinical Resource Network (CRN) is working with a growing bi-coastal oncology pharma that has an immediate need for an FTE-based Manager of Statistical Programming. The selected candidate will generate TLGs/reports, create SDTM/ADaM datasets, develop macros, validate output, support ISSs/ISEs, and contribute to in house/outsourced studies. Our client prefers local or quasi local candidates but is open to the right 100% WFH candidate as well. Essential Duties and Responsibilities: Serve as Leader for all SAS Programming activities Manage resource allocation and budgeting for assigned projects Resolve issues for complex SAS programming duties Interact with global regulatory bodies Collaborate with CRO’s Develop Macros Key contributor in the development of new processes or revision of existing processes. Professional development to enhance knowledge, skills, communication, scientific methodology, operational efficiency, and compliance with policies, regulations, and corporate standards and processes Required Education and Experience: Bachelor’s degree in Computer Science, Math/Statistics, or related degree 5-7+ years of Clinical Statistical Programming experience in a CRO or sponsor environment Strong TLF, SDTM, and ADaM experience Experience working in a Lead Programming capacity Previous line management experience preferred Previous oncology and/or submissions experience is a major plus, but not required If this position sounds like a good fit for you, Apply Now!",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-25T17:24:28.000Z"
    },
    "company": {
        "name": "Solomon Page",
        "link": "https://www.linkedin.com/company/solomon-page-group"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "El Segundo",
        "region": "CA",
        "postal_code": "90245",
        "street_address": null,
        "latitude": 33.92086,
        "longitude": -118.41595
    }
}