{
    "job": {
        "title": "Software Engineer - 100% Remote",
        "industry": "Information Technology and Services",
        "description": "Job Title: Software Engineer Job Type: Permanent Location: 100% remote What You'll Do: As a Software Engineer, you'll develop the technical and business foundation to turn your passion for technology into real-world solutions. You'll architect and implement web applications using modern technology solutions. You'll drive the end-to-end experience, from the front-end to the backend systems running in the cloud. Strong candidates will have robust technical training and experience. You will be part of a team who works together to explore new boundaries and test new technologies and experiences. We maintain a tight loop between development, feedback and deployment, which allows us to build world-class solutions to our business, marketing and data quandaries Autonomy Aspiring entrepreneurs succeed here because you will have full-ownership over your work from beginning to end. Collaborate Better than making the dream work, teamwork makes the code work. Through open work-space, Slack and peer reviews, our teams work together to build amazing solutions. Innovate With the belief that \"Everything is Written in Pencil\", we encourage our teams to test new frameworks, learn new languages and challenge the \"status quo\" to make us better. What We're Looking For: Server side experience in technologies such as Node, Golang, PHP, or C# Experience with AWS/Azure cloud providers. Experience with serverless technologies. Experience in front-end technologies such as React, Angular and Vue Experience with OOP and software design practices. Experience with databases such as MySQL, Postgres, DynamoDB, etc. Experience with event driven architecture Strong ability to develop systems that meet architectural objectives including reusable, scalable code and SOLID principles. Knowledge of unit-testing (TDD/BDD tool i.e. Jasmine, Mocha, Protractor) Understanding of how to build and consume REST APIs Understanding of basic authentication protocols such as OAuth2 and SAML Analytical and detail-oriented minds with decisive judgement skills Knowledge of basic web security principles The ability to prioritize, strategize, execute and deliver projects on time Self-motivated and creative problem-solvers who love to challenge themselves Ideal team players: hungry, humble, and smart! We value those who are curious and strive to be great people to work with",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-15T11:15:48.000Z"
    },
    "company": {
        "name": "TriOptus ",
        "link": "https://www.linkedin.com/company/trioptus"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Paradise Valley",
        "region": "AZ",
        "postal_code": "85253",
        "street_address": null,
        "latitude": 33.53106,
        "longitude": -111.94313
    }
}