{
    "job": {
        "title": "Data Scientist",
        "industry": "",
        "description": "The role of a data scientist has evolved and expanded from that of a data analyst. As with an analyst, they organize and analyze data collected by an organization, such as sales figures, logistics or market research, etc. The difference is that data scientist will use their strong business sense along with an ability to communicate findings to both business and IT leaders in a way that can influence how an organization approaches a business challenge. Responsibilities Perform data-mining, modeling and hypothesis generation in support of high-level business goals. Stay current with emerging tools and techniques in machine learning, statistical modeling & analytics. Successful data scientists often have strong aptitudes for business, technology, mathematics & statistics. Need strong oral & written communication skills to present data as a concise story for diverse audiences. Big data scientists develop customized algorithms to solve analytical problems with incomplete data sets. Big data scientists often use data visualizations, e.g., heat maps, to analyze and present complex trends. Many data scientists use Hadoop - an open-source Apache framework - to analyze & mine big data sets. Some data scientists have computer programming skills – such as SQL, Python, Unix, PHP, R and Java – which they use to modify or develop custom analytical solutions. Data scientists often work in a team setting, with managers, IT administrators, programmers, statisticians, graphic designers, and experts in the company’s products or services. Requirements Bachelor’s degree in graphic design or related field. In-depth knowledge in R: R is used for data analysis, as a programming language, as an environment for statistical analysis, data visualization Python coding: Python is majorly preferred to implement mathematical models and concepts because python has rich libraries/packages to build and deploy models. MS Excel: Microsoft Excel is considered a basic requirement for all data entry jobs. It is of great use in data analysis, applying formulae, equations, diagrams out of a messy lot of data. Hadoop Platform: It is an open source distributed processing framework. It is used for managing the processing and storage of big data applications. SQL database/coding: It is mainly used for the preparation and extraction of datasets. It can also be used for problems like Graph and Network Analysis, Search behaviour, fraud detection etc. Technology: Since there is so much unstructured data out there, one also should know how to access that data. This can be done in a variety of ways, via APIs, or via web servers.",
        "employment_type": "PART_TIME",
        "date_posted": "2021-07-20T06:03:08.000Z"
    },
    "company": {
        "name": "Theax",
        "link": "https://in.linkedin.com/company/theax-webinars"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "United States",
        "region": null,
        "postal_code": "99999",
        "street_address": null,
        "latitude": 39.50355,
        "longitude": -99.0183
    }
}