{
    "job": {
        "title": "Senior Software Engineer",
        "industry": "Information Technology and Services",
        "description": "Our healthcare client is looking for a Senior Software Engineer to join their team! The Project: Working on a service layer that converts native API mostly built in JSON format to a HL7 FHIR API to interconnect health systems. Your Background: Experience developing software with Java. FHIR knowledge is a plus Job Responsibilities: Serve as a senior software developer for the software platform developing FHIR-based REST APIs. Allocated time, on average: 75% of the time coding 25% of the time collaborating with solution architects/BA/QA on overall software implantation design and best practices Provide input on software solution designs Work across all teams as a subject matter expect Mentor junior software developers on coding designs and best practices Required Skills: 6+ years of experience with hands on development with C# or Java 8+ years of experience dev 2+ years of experience EHR clinical integrations 2+ years of experience with integrating services into a cloud architecture 2+ years of experience working with Docker containers Experience working in Agile environment We cannot provide sponsorship upon conversion What skills/attributes are preferred (will set a candidate apart)? 2+ years of experience with good understanding on FHIR standard 2+ years of experience developing RESTFUL APIs The ability to execute existing queries as well as write SQL queries of varying complexity Experience with GIT for code repository Experience with Jenkins for deployment automation Understanding of software development processes and methodologies Collaborate in team environment",
        "employment_type": "CONTRACTOR",
        "date_posted": "2021-08-25T17:37:32.000Z"
    },
    "company": {
        "name": "Apex Systems",
        "link": "https://www.linkedin.com/company/apex-systems"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 96,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Raleigh",
        "region": "NC",
        "postal_code": "27699",
        "street_address": null,
        "latitude": 35.781303,
        "longitude": -78.64168
    }
}