{
    "job": {
        "title": "Site Reliability Engineer (Observability)",
        "industry": "Information Technology and Services,Computer Software,Internet",
        "description": "Observability (o11y) at MLB has a focus on providing tools and software to various technical teams throughout the organization to help keep eyes on our running systems (monitoring) and to aid software development teams understand the performance of their systems (APM) and to give them tools to help debug extant issues (logs, dashboards, etc.). The technical stack at MLB covers a large surface area covering everything from environmentals and UPS battery state in ballparks, to kubernetes cluster health in the cloud. We want to enable visibility into all important parts of the technical landscape at MLB. As an SRE focused on o11y at MLB you will: Write code in python, Golang, bash, Typescript, Javascript, HCL, and maybe C/C++. Use and administer Grafana Write and maintain plugins for Grafana (both open source and closed) Interface with technical teams to help drive good o11y practices and culture Help enhance the next generation of APM tooling Be on-call for o11y managed services Use Google Cloud Platform Use and understand statistics A Good Fit For This Role Will Have an eagerness to be a self-starter and get things done Have written code in a compiled language that runs in production somewhere Have written code in interpreted languages Have worked with time series data extensively Have worked with o11y tools extensively Have some experience with Terraform Be able to communicate effectively and asynchronously Understand the documentation is a product Have worked with and gained a solid understanding of Grafana and its ecosystem Projects You Will Almost Certainly Work On Help enhancing our in-house APM product to support RUM Exposing stackdriver logs in Grafana Exemplars for latency/error based alerts Supporting app release annotations What Is It Like to Work at MLB? Major League Baseball (MLB) is the most historic of the major professional sports leagues in the United States and Canada. Employees love working at MLB because of the culture of growth, teamwork, and professionalism. Employees who are most successful at MLB take initiative, know how to identify problems and provide solutions, and always put the Team first. For those ready to step up to the plate and join the Major Leagues, MLB takes the same approach as teams do with their players: empowering them to be at their best by engineering experiences that put employees in the best position to succeed. Major League Baseball is looking for candidates who are passionate about growing America’s pastime to best serve its fans for decades to come. MLB’s vision is to be the global sport of choice for youth to play, fans of all backgrounds to enjoy and a desired destination for employment. With a belief that the journey to growth and greatness is ongoing, MLB gives employees the opportunity to continue learning and honing their skills with programs such as: tuition reimbursement; mentorship programs; lunch and learns; online course subscriptions; paid industry certifications; business resource groups; and more. MLB provides its employees with exceptional medical, dental, and vision coverage. Premiums are 100% employer covered to help employees focus on being their best!",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-23T20:04:09.000Z"
    },
    "company": {
        "name": "Major League Baseball",
        "link": "https://www.linkedin.com/company/major-league-baseball"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "New York",
        "region": "NY",
        "postal_code": "10132",
        "street_address": null,
        "latitude": 40.713047,
        "longitude": -74.00723
    }
}