{
    "job": {
        "title": "Software Engineer, GQMA",
        "industry": "Information Technology and Services,Computer Software",
        "description": "Software Engineer, GQMA Austin, Texas Base Salary: $150,000- 250,000 Bonus: $50- 100k Our company is a technology-driven, diversified principal trading firm. We trade our own capital at our own risk, across a broad range of asset classes, instruments, and strategies, in financial markets around the world. As the markets have evolved over the past 25 years, so has our company – maximizing opportunities to include real estate, crypto assets, and venture capital. With over 1000 employees at our Chicago headquarters and offices around the world, we work together to solve complex problems, challenge consensus and deliver meaningful results. It’s a place of high expectations, deep curiosity, and thoughtful collaboration. Our company is looking for an exceptional Software Engineer with expertise in designing, building, and supporting financial applications and distributed services targeting Front Office users, Risk Management, and Operations. You will be joining a team responsible for providing models and analytics to the company’s businesses firm-wide and will be instrumental in helping define and implement the services and tools used for pricing, risk management, PnL, and scenario analysis. Your work will be used throughout the organization on a daily basis by traders, risk managers, and back-office analysts. Come join our fast-moving team as we build the next generation of firm-wide services. To qualify for this role, you: Have 3+ years of experience working in a software engineering role Can demonstrate hands-on proficiency with at least one of the following languages: C#, C++, Python, Java Have a strong educational background with a degree in Computer Science, Engineering, Physics or Mathematics Have experience defining API’s via HTTP or GRPC Have experience with database development, SQL or NoSQL Have experience developing, deploying, and supporting distributed services Are able to provide live support of distributed software solutions responsible for the generation of risk and PnL numbers for multiple businesses in different geographical locations Are comfortable with Windows and Linux (Red Hat, Ubuntu) environments Have strong communication and collaboration skills with the ability to work within a multidisciplinary team that includes traders, software engineers, and quants Have a proven track record of working independently with minimal oversight and driving projects and initiatives to completion Bonus points if you have: Experience working closely with Front Office (trading, research) at a major financial institution Knowledge of Fixed Income products and Interest Rate derivatives (including Risk, PnL attribution, scenario analysis, etc.) Working proficiency with C++, Python, JavaScript Familiarity with common IR derivatives models (Yield Curves, Option Pricing, SABR, etc.) Understanding of the fundamentals of financial derivatives and models used to price them Experience developing web-based UIs Experience with observability and debugging tools (Splunk, Grafana, gdb, windbg) Experience writing batch and shell scripts Experience with statistical analysis and working with large datasets provided in relational or key-value databases Experience with data presentation and visualization",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-03T03:40:59.000Z"
    },
    "company": {
        "name": "Quantitative Systems",
        "link": "https://www.linkedin.com/company/quantitative-systems"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Austin",
        "region": "TX",
        "postal_code": "78746",
        "street_address": null,
        "latitude": 30.264978,
        "longitude": -97.7466
    }
}