{
    "job": {
        "title": "Software Engineer I",
        "industry": "Information Technology and Services,Computer Software,Internet",
        "description": "From our founding until now, our mission has remained the same: to make access to data as simple and reliable as electricity. With Fivetran, your data just arrives in your warehouse, canonical and ready to query, no engineering or maintenance required. As we watch more and more companies leverage our technology to become truly data-driven, we're proud not only of our growth but also of the fact that we've grown without compromising our core values. Integrity. We do the right thing, even when it's harder in the short run. We challenge the status quo by reasoning from first principles. Initiative. Fivetran belongs to all of us. We take ownership and are accountable for getting things done. Through curiosity, learning, and coaching, we grow as individuals and teams. One team, one dream. We share the pains and successes of our customers, partners and colleagues. We seek, gather, and trust a diverse group of teammates with different perspectives to guide Fivetran's progress. If these values resonate with you, we'd love to hear from you. About the role: Fivetran is looking for a Senior Software Engineer enthusiastic in joining a fast-growing company. You'll help build new features of our data pipeline service, help improve our software architecture, and maintain reliable operation of the service. We're looking for people who want to learn the key values that make our product great, and implement those values in the many small decisions you make every day as a developer. Fivetran is the epitome of data-driven-development — our engineering team is focused on building a world class product that: Facilitates Data Analytics — join our mission is to reliably deliver best-in class schemas, and clean data, designed to be intuitively useful to analysts. Contributes to our Community — help develop tools like Data Lakes, SQL-based Transformations, and schema explorers to empower analysts to choose the best tools, and to make those tools more powerful. Is Absolutely Dependable — work to make Fivetran the most reliable and secure component of our customers' data infrastructure. We emphasize using no-nonsense tools, and take great pride in the simplicity and effectiveness of the systems we build. Our back-end is built on Java, Postgres, and Kubernetes, and our front-end is built on React and Typescript. As a Senior Software Engineer, you will: Create new data source connectors to be part of a product portfolio enjoyed by customers of all sizes- from startups to enterprises Develop, maintain, and test code Contribute to the efforts to the maintenance and improvement of existing connectors; call for improvement in all areas of Fivetran's codebase and infrastructure Participate in on-call rotation (8 AM to 8 PM) Contribute to hiring by participating in the interview process Requirements: Writes well-structured and performant code Able to define project requirements Proficient at designing software and infrastructure Works well in a team Mentors junior and senior developers Can identify design flaws in existing systems and come up with improvements Nice-to-haves: Java programming experience Experience in data processing (ETL, ELT) and/or cloud-based platforms Experience in designing and developing file, event, application, or database connectors Experienced working in a cloud environment utilizing AWS, GCP, Postgres, Kubernetes, Docker, CircleCI, or similar technologies Perks and Benefits: 100% paid Medical, Dental, Vision and Basic Life Insurance. Benefits begin on your first day! Option of Health Savings Account (HSA) or Flexible Savings Account (FSA) Generous paid time off (PTO) plus paid sick time, holidays, parental leave, and volunteer days off 401k match program Eligible donation match program Monthly cell phone stipend Work-from-home equipment reimbursement for your home office setup! Professional development and training opportunities Company virtual happy hours and fun team building activities Pet Insurance -- and yes, you can bring your well-behaved fur babies to work Commuter benefits to help with transit and parking costs Shaped by the real-world needs of data analysts, Fivetran technology is the smartest, fastest way to replicate your applications, databases, events and files into a high-performance cloud warehouse. Fivetran connectors deploy in minutes, require zero maintenance, and automatically adjust to source changes — so your data team can stop worrying about engineering and focus on driving insights. To learn more about Fivetran's culture and what it's like to be part of the team, click here and enjoy our video. To learn more about our candidate privacy policy, you can read our statement here.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-18T05:20:21.000Z"
    },
    "company": {
        "name": "Fivetran",
        "link": "https://www.linkedin.com/company/fivetran"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Oakland",
        "region": "CA",
        "postal_code": "94612",
        "street_address": null,
        "latitude": 37.80483,
        "longitude": -122.27248
    }
}