{
    "job": {
        "title": "Software Engineer",
        "industry": "",
        "description": "Ready to apply your skills and grow your career with a company that values your input where you have access to senior leadership, will be a foundational team member, have tons of flexibility, amazing benefits and work with a best-in-class team? We are seeking a Software Engineer to join our work family and support our high-performing team. Software Engineer – Your Opportunity You will be an integral part of a team that builds and maintains a platform that is revolutionizing payment facilitation. You’ll focus on mission critical applications and integrations that are the engine of our business. Work with large amounts of structured data and high volumes of transactional data that ensure our customers can board and manage merchants and the customer payments that they process. Software Engineer – What You’ll Use We are a Microsoft shop, hosted entirely in Azure, using C# and .NET CORE 3 to build our products. You’ll use SQL Server, Kubernetes, Azure DevOps, CosmoDB, and a host of scripting and automation technologies. You will use software libraries like NServiceBus, Entity Framework, and Swagger/Swashbuckle. Software Engineer – What You’ll Need (Required Skills, Experience & Personality Fit) Prior software engineering experience Experience with C#/.NET, SQL Server, Git, Azure and related technologies Innovative and self-directed – you enjoy providing input that will change the shape of our Flexibility – you are joining an early-stage company Thrive on learning new things – especially a complex domain ecosystem – payments is not a simple world! Software Engineer – Added Pluses (Not Required) Payments experience or experience in FinTech This role is as result of company growth. Salary range: $80,000 to $130,000 Company Perks Incentives—Comprehensive benefits, generous paid time off, 401(k) with company match and more. Flexibility—You can work out of the office or remotely from home. Our team works an average of 45 hours per week, you can choose your schedule and location you are working from. Community engagement—We are committed to the communities we work and play in. Our InfiniCares program provides financial support and coding classes for youth. Dog-friendly Denver HQ—Does your do go everywhere with you? Bring them into the office! As part of our dedication to maintaining an inclusive and diverse workforce, Infinicept provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, sexual orientation, national origin, age, disability, or genetics. *We are interested in every qualified candidate who is eligible to work in the United States. However, we are not able to sponsor visas currently.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-29T15:07:37.000Z"
    },
    "company": {
        "name": "Hire Education Consulting Group",
        "link": "https://www.linkedin.com/company/hire-education-consulting-group"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Denver",
        "region": "CO",
        "postal_code": "80247",
        "street_address": null,
        "latitude": 39.738453,
        "longitude": -104.984856
    }
}