{
    "job": {
        "title": "Software Engineer - Consumer Platform (New York, Austin)",
        "industry": "Food &amp; Beverages",
        "description": "THIS IS BLUE APRON Chefs around the world wear blue aprons when learning to cook, and for us it has become a symbol of lifelong learning. Our highly motivated group of food enthusiasts are inspired to work on complex business problems with creativity and passion, always looking to learn something new. We take preparation seriously, embrace a spirit of excellence, and put in the extra effort in everything we do. We are thrilled to be part of our customers’ lives, cooking and creating experiences in their home kitchens. WHO'S IN THE KITCHEN Blue Apron’s engineering team creates software that manages the forecasting, purchasing, preparation, and shipment of new fresh ingredients every week, delivering over 8 million meals nationwide each month. We’re faced with complex supply chain and logistical challenges that require purpose-built solutions and data analysis. As a Software Engineer at Blue Apron, you are responsible for the ongoing evolution of our software architecture, mentoring new engineers and providing technical leadership for strategic projects. We are looking for someone who is passionate about software development and enjoys both learning from and teaching others. WHAT'S ON THE MENU Design and implement APIs for our consumer facing applications. Collaborate with other engineers and internal stakeholders to apply engineering solutions to the unique challenges of our business. Find and address performance issues. Participate in design and code reviews. Identify and communicate best practices. Our stack: React, Redux, Webpack, Ruby on Rails, GraphQL, PostgreSQL NECESSARY INGREDIENTS Three or more years experience as a software engineer. Experience developing and implementing GraphQL APIs and REST APIs Solid knowledge of testing principles. Experience creating cloud services in frameworks like Ruby on Rails, Django, Node.js or similar technologies. Understanding of JavaScript, HTML, CSS, and related web technologies. A thirst for learning and a passion for new technologies, processes, and patterns. You write tests to improve the quality and reliability of your code. Track record of mentoring up-and-coming engineers. If you don’t meet these exact requirements but think you’d be a good fit, please apply! Blue Apron provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, genetics, marital status or veteran status. In addition to federal law requirements, Blue Apron complies with applicable state and local laws governing nondiscrimination in employment in every location in which the company has facilities. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-09T19:59:16.000Z"
    },
    "company": {
        "name": "Blue Apron",
        "link": "https://www.linkedin.com/company/blue-apron"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "New York",
        "region": "United States",
        "postal_code": "13856",
        "street_address": null,
        "latitude": 42.93923,
        "longitude": -75.62005
    }
}