{
    "job": {
        "title": ".NET Developer - .NET, C#, Azure",
        "industry": "Information Technology and Services,Computer Software,Financial Services",
        "description": "Title: .NET Developer Location: North Delaware (Partially Remote, 1-2 days in office a week) Salary: $80,000 - 100,000/year Requirements: .NET, C#, Azure Based in Delaware, our company is all about compound logistics. We are expanding our software capability and are currently looking to hire on a senior level .NET Developer. We have some of the most talented and driven .NET Developers working for us currently. We are looking for someone with experience in .NET Development, C#, and Azure. What You Will Be Doing Leading, Designing, and Maintaining business and operational applications Problem solving skills with complex solutions What You Need for this Position 3+ years of related experience: .NET C# Azure SQL NoSQL What's In It for You Competitive Salary: $80,000 - $100,000 401k Matching PTO So, If You Are a .NET Developer With Experience Apply directly to this job opening here! Or E-mail directly for more information to Ben.Shapiro@Optello.com Email Your Resume In Word To Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also: Ben.Shapiro@Optello.com Please do NOT change the email subject line in any way. You must keep the JobID: linkedin : BS11-1645583 -- in the email subject line for your application to be considered.*** Ben Shapiro - Recruiter - Optello Applicants must be authorized to work in the U.S. Optello is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-27T05:29:59.000Z"
    },
    "company": {
        "name": "Optello",
        "link": "https://www.linkedin.com/company/optello-us"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Newark",
        "region": "DE",
        "postal_code": "19702",
        "street_address": null,
        "latitude": 39.681656,
        "longitude": -75.75362
    }
}