{
    "job": {
        "title": "Sr. Software Engineer, Test",
        "industry": "Computer Software",
        "description": "It's fun to work in a company where people truly believe in what they're doing! At Blackline, we're committed to bringing passion and customer focus to the business of enterprise applications. Since being founded in 2001, BlackLine has become a leading provider of cloud software that automates and controls the entire financial close process. Our vision is to modernize the finance and accounting function to enable greater operational effectiveness and agility, and we are committed to delivering innovative solutions and services to empower accounting and finance leaders around the world to achieve Modern Finance. Being a best-in-class SaaS Company, we understand that bringing in new ideas and innovative technology is mission critical. At BlackLine we are always working with new, cutting edge technology that encourages our teams to learn something new and expand their creativity and technical skillset that will accelerate their careers. Work, Play and Grow at BlackLine! Make Your Mark: BlackLine empowers our team members to be change agents and are always seeking new and innovative ways to solve problems. We are experiencing explosive growth and looking for passionate and talented people to join our team. BlackLine SaaS is the system of interaction for finance and accounting teams and it integrates with numerous ERPs, CRMs, Payment systems, Point of Sale systems and other applications. As a Sr. Software Engineer in Test, you will play a crucial role in the success of our company by contributing to, as well as driving, high-quality releases and value-delivery to our customers. In this role, you will be automating tests for web-based and RESTful APIs to support our high-transaction and big-data SaaS applications. Your attention to detail, tenacity, creative problem-solving and forward thinking will directly impact the company's success, as well as the success of your peers across the organization. By following and evangelizing quality standards, as well as overall SDLC processes as they relate to quality, you will be able to affect meaningful change in the organization and help drive our culture to a quality and customer-first mentality. You’ll Get To: Create Web application and API automation utilizing tools and frameworks already in place to ensure future automation coverage of all features. Build and add to Automation Regression Test Harness. Drive improvements and provide recommendations by using or creating tools and contributing to the automation framework already in place. Strong working experience with microservices, data streaming and ETL that power complex, large scale distributed applications. Independently identify and assess risks and develop mitigation steps and processes to be put in place for projects, while collaborating on technical designs, management of dependencies, and efficacy of valid test data to ensure successful and high-quality deliverables. Execute Quality Engineering (QE) forensics and detailed root cause analysis of test failures, reported defects, and performance and scalability issues. Provide technical leadership to other QE staff as the QE discipline and team grows, acting as an agent of change for a quality-first culture within the organization. Execute on QE compliance objectives and appropriate metrics to measure success. Assist with defining and implementing quality standards, processes, and procedures that ensure the highest quality deliverables. Collaborate with QE, Product, and Engineering leadership, as well as other stakeholders, to ensure that all user stories, product definition, technical specifications, and acceptance criteria are clear and follow the established processes and standards. Author high-quality test plans, test cases, and supporting documentation. Identify gaps, issues, or other areas of concern, and proactively define, propose, and enact process and workflow improvements to mitigate such issues. Partner with leadership, peers, and sister-teams throughout the organization to support meaningful change and adaptation, with a constant focus on improving the what and how of Quality within BlackLine What You’ll Bring: Years of Experience in Related Field: 7+ Education: Master’s degree in Mathematics, Computer Science or related disciplines or equivalent work experience. Technical/Specialized Knowledge, Skills, and Abilities: 7+ years of hands-on experience in Web Application, ETL, SaaS, and RESTful API testing. 7 or more years of hands-on test automation development, with experience building a test automation suite from the ground up. 7 or more years of hands-on working experience in traditional OOP programming languages, specifically C# (with .NET core and NUnit / XUnit / MSTest). Hands on experience with Apache Spark. Knowledge and experience in ETL tools. Experience in testing integration solutions for batch, API and event driven architectures. Experience with testing various integration patterns, styles and technologies and API gateway. Deep understanding of both technical and non-technical requirements for enterprise SaaS at scale in the areas of system performance, scalability, latency, reliability and security. Strong testing experience with cloud native/cloud first applications in a cloud environment such as Google Cloud, AWS and Azure Experience with Performance test development and Continuous Integration (CI) tools Strong ownership, pride of work, and ability to take things across the finish line. Intermediate to advanced knowledge of SQL, including stored procedures, data models, and transactional flows is required FinTech or Financial services domain background. Thrive At BlackLine Because You Are Joining: A technology-based company with a sense of adventure and a vision for the future. Every door at BlackLine is open. Just bring your brains, your problem-solving skills, and be part of a winning team at the world's most trusted name in Finance Automation! A culture that is kind, open, and accepting. It’s a place where people can embrace what makes them unique, and the mix of cultural backgrounds and varying interests cultivates diverse thought and perspectives. A company who believes in providing the best possible service to its clients, and that starts with offering amazing perks to its employees. These perks include 100% coverage for healthcare, vision, and dental, 401(k) matching, ESPP, food, drinks, games, and so much more! A culture where BlackLiners’ continued growth and learning is empowered. BlackLine offers a wide variety of professional development seminars and inclusive affinity groups to celebrate and support our diversity. BlackLine is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to sex, gender identity or expression, race, age, religious creed, national origin, physical or mental disability, ancestry, color, marital status, sexual orientation, military or veteran status, status as a victim of domestic violence, sexual assault or stalking, medical condition, genetic information, or any other protected class or category recognized by applicable equal employment opportunity or other similar laws.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-18T21:56:58.000Z"
    },
    "company": {
        "name": "BlackLine",
        "link": "https://www.linkedin.com/company/blackline"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 84,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Pleasanton",
        "region": "CA",
        "postal_code": "94588",
        "street_address": null,
        "latitude": 37.658436,
        "longitude": -121.877
    }
}