{
    "job": {
        "title": "Senior ERP Application Specialist",
        "industry": "Construction",
        "description": "As a Senior ERP Application Specialist, you will will work in coordination with the ERP project manager, ERP technical lead, each department head, and business champions as our organization moves to replace our current ERP system. The primary responsibility will be to provide configuration documentation, assist with data migration and data validation, configuration and testing, technical support, training materials, and admin training for the various ERP modules. In addition, the Application Specialist will interface with 3rd party ERP consultants during and after the project to maintain, upgrade, and improve the system. Application Management and Support: Lead, coordinate, or work as part of a project team to execute, verify, and implement the project plan. Develop a comprehensive understanding of application features and capabilities. Develop training materials. Assist business stakeholders and PM during system evaluation. Evaluate factors such as reporting formats required, cost constraints, or need for security restrictions to determine app Configure system to meet business requirements. Collaborate with vendor to map and conduct data migration procedures and validate data integrity. Assist in creating testing scripts ,validating desired results, and tracking them. Assist with development, coordination, and delivering of training programs. Document and communicate inconsistencies, issues, and concerns. Address risks and issues by creating mitigation measures to ensure the success of app deployment and management. Recommend improvements in systems functionality. Train system admins by using the train the trainer approach. Assist as new systems and/or application modules are implemented. Stay up to date on any changes or upgrades to existing technology; develop and delivers training on new systems and processes. Assist business partners with imports/exports to accounting and or other systems. Perform software upgrades by working with internal members and/or external consultants and vendors. Conduct software maintenance activities (may require evening/weekend work). Perform application troubleshooting and support. What we're looking for in you 3+ years of understanding of business processes and ERP implementations and support experience 3+ years of familiarity with SQL server or other database platforms. 3+ years of familiarity with front end of back-end development. Knowledge of CMIC system a plus. Knowledge of Field Service Management (FSM) and CRM systems a plus e.g., Key2Act, Salesforce, etc. Your life at Harris As one of the country's leading mechanical contractors, Harris offers you the best of both worlds: the stability, resources and opportunities of a national company, and the team culture, creative spirit and customer loyalty of a local business. If you thrive on variety and new challenges, we want to meet you! From stadiums to manufacturing facilities, power plants to hospitals, concert halls to classrooms, we handle projects of all sizes and complexity from multiple regional locations across the country. Equal Opportunity Employer/Protected Veterans/Individuals with Disabilities The contractor will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with the contractor’s legal duty to furnish information. 41 CFR 60-1.35(c)",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-25T17:24:41.000Z"
    },
    "company": {
        "name": "Harris",
        "link": "https://www.linkedin.com/company/harriscompany"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "United States",
        "region": null,
        "postal_code": "99999",
        "street_address": null,
        "latitude": 39.50355,
        "longitude": -99.0183
    }
}