{
    "job": {
        "title": "Systems Engineer - MEMs Prototyping",
        "industry": "Information Technology and Services,Computer Software,Financial Services",
        "description": "If you are a Systems Engineer with experience of developing schematics and low level firmware programming, please read on! We are a global leader in micro-electronic machines industry. Our products have continued to impact the creativity and efficiency of electronics developed in the world. As electronics continue to become, thinner, smaller and more compact, our development teams will be right there with the right solution. Our timing solutions are second to none and our development teams continue to push the envelope on innovation. We hope our next hire will share the same desire and passion. What You Will Be Doing Design and implement test automation to characterize and release into production a variety of MEMS based, mixed-signal timing devices Plan and execute device verification and characterization Develop and carry out experiments to prototype new technologies and system architectures Work with team to design, develop and validate PCB test platform and firmware to enable automated testing Develop and transfer algorithms to final test and production environments Support the bring-up of specialized programming systems overseas What You Need for this Position MS in Electrical Engineering or Mechanical Engineering. PhD preferred. Exceptional candidates with other technical backgrounds will be considered Experience creating and executing verification and characterization plans Fundamental knowledge and understanding of mixed-signal circuits Excellent programming skills, including Python and MATLAB scripting Programming ability in micro-controllers, C or C++, SQL Ability to work well with others in a collaborative, fast-paced team environment So, if you are a Systems Engineer with a desire to impact technology please apply today! Email Your Resume In Word To Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also: Patrick.Tafua@Optello.com Please do NOT change the email subject line in any way. You must keep the JobID: linkedin : PT3-1629481 -- in the email subject line for your application to be considered.*** Patrick Tafua - Executive Recruiter - Optello Applicants must be authorized to work in the U.S. Optello is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-31T07:24:50.000Z"
    },
    "company": {
        "name": "Optello",
        "link": "https://www.linkedin.com/company/optello-us"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Santa Clara",
        "region": "CA",
        "postal_code": "95050",
        "street_address": null,
        "latitude": 37.352394,
        "longitude": -121.95308
    }
}