{
    "job": {
        "title": "Data Scientist",
        "industry": "Music,Computer Software,Entertainment",
        "description": "We’re looking for a Data Scientist for a music creation platform working to change the way we think about the ecosystem of music creation and production, making it easier and more affordable for anyone at any skill level to create music at the touch of a button. This role requires is a specific skillset focused on learning, scale, and agility in the music tech space, but we know you’re out there. We're open to candidates from all over the U.S. - ideally, you'd want to relocate to San Diego, but happy to have a conversation about the best scenario. Benefits: Industry-leading healthcare covering medical, dental, vision, and life paid by the company Health Savings and Flexible Spending accounts 401K Unlimited PTO with an employee-focused work approach Flexible work schedule and a remote-friendly environment Parental leave Participation in profit sharing 200% Pay on your Birthday Employee Referral Bonus Program Maternity Leave Program Company outings, retreats, and events (when permissible) Responsibilities Collect, analyze, and present processed and unprocessed data pertaining to music creation tech to make the business more powerful and increase enterprise opportunities. To be honest, the right person can probably better tell us how this role should work. And we'll happily empower you to do that Design accurate and scalable prediction algorithms in pertinence to business objectives Collaborate with the engineering team to bring analytical prototypes to production, make product adjustments, and geek out on product opportunities. GET FIRED UP. (sorry) Based on the insights you gather, make clear recommendations to improve and work with other department leads to execute Help design data team hiring roadmaps Produce regular analytics reports for internal and external stakeholder (board, investor, etc.) purposes. Requirements and some nice-to-haves: Bachelor's in statistics, comp sci, math, engineering Deep ML/AI experience (including machine learning modeling and ensemble methodology) Python expertise (NumPy, SciPy), SQL, MongoDB, C++ Understanding of digital signal processing techniques (filtering, spectral/FFT analysis, convolution, etc.) Experience with machine learning, especially as it applies to music analysis and/or generation Experience with the following technologies: Django, Heroku, AWS, S3 Familiarity with python audio processing libraries such as Librosa Passion for or experience in music - ML, production, and creation",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-10-12T00:42:42.000Z"
    },
    "company": {
        "name": "KTeam",
        "link": "https://www.linkedin.com/company/kteam-co"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "San Diego",
        "region": "CA",
        "postal_code": "92161",
        "street_address": null,
        "latitude": 32.71576,
        "longitude": -117.16382
    }
}