{
    "job": {
        "title": "Machine Learning Engineer",
        "industry": "Information Technology and Services,Computer Software",
        "description": "NLP (Natural Language Processing) Machine Learning Engineer needed for AI/Security Platform as a Service software company in Lehi, Utah - Full-time, full benefits, great compensation This Jobot Job is hosted by Patrick Murray Are you a fit? Easy Apply now by clicking the \"Apply\" button and sending us your resume. A Bit About Us Based in the Salt Lake City area, we are an established and ever-growing AI/Documentation Security Platform as a Service company that was established in 1999. We have grown to over 250+ employees Worldwide and are a recognized leader in in Cloud security and management. We are currently looking for a strong Machine Learning Engineer with NLP experience to join our growing AI team. The Machine Learning Developer / AI Engineer will design and implement Natural Language Processing algorithms and deploy them into production at scale. It is a pivotal role for our company and product! If this sounds interesting, please apply today! Why join us? Competitive Base Salary Extremely Competitive Benefits Package Flexible Work Schedules Accelerated Career Growth Excellent PTO Steady, Stable, Growing Company Modern Environment State of the Art Technology Job Details What you need to be successful PhD/MS in Computer Science, Information Retrieval, Machine Learning, Natural Language Processing or a related discipline 3-8+ years of experience A solid foundation in computer science, with strong competencies in data structures, algorithms, and software design. Industry experience of building and producing innovative end-to-end Machine Learning systems Excellent programming skills in Python, experience using API Flask (REST) in production environment Excellent written and spoken communication skills Ideally what you've done Experience in development of large-scale NLP systems in a large industrial or government environment Experience with developing microservices with Docker and Kubernetes to serve machine learning models Experience with Azure/Google Cloud Platform / Amazon Web Services Experience with Flask, Apache Spark, Apache Kafka, Redis is a plus Interested in hearing more? Easy Apply now by clicking the \"Apply\" button.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-07T00:00:00.000Z"
    },
    "company": {
        "name": "Jobot",
        "link": "https://www.linkedin.com/company/jobot"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Salt Lake City",
        "region": "UT",
        "postal_code": "84101",
        "street_address": null,
        "latitude": 40.758476,
        "longitude": -111.888145
    }
}