{
    "job": {
        "title": "Assoc Engineer, Software (RPA Developer)",
        "industry": "Information Technology and Services,Computer Software,Financial Services",
        "description": "Job Description Designs and develops internal Robotic Process Automation (RPA) bots for the automation of business processes and transactions. Robotic Process Automation is the automation of repetitive, time/resource-intensive digital processes using software to replace the need for human involvement. Using an RPA development platform, a developer configures a metaphorical software “robot” to capture and interpret applications for processing a transaction, manipulating data, triggering responses and communicating with other systems This position is an entry level developer position working under the direction of a Developer, Sr Developer, and/or Architect, with project complexity limited and commensurate with experience level. Functional Group Product and Technology Location TX208-TX-Frisco Bridges Building A (Duke Br I) Location Address 7668 Warren Pkwy City Frisco State Texas Zip 75034 Travel Required? No Responsibilities Translate business, and functional Robotic Process Automation requirements into documented technical specifications. Utilize development skills and development platforms to build (code) and test new RPA functionality per technical specifications, with deliverables to include code builds and documented test results. Partner with the requesting Business Unit on refining the RPA approach and delivery, including dependency identification and timing/delivery estimates Participate in code reviews (walkthroughs) of technical specifications and RPA code with other members of the technical team, communicating design, requirements, functionality and limitations of systems/applications to team and development lead. Utilize departmental Systems Development Lifecycle Methodology as a guide for development activities. Contribute to and work to meet project schedules by providing accurate estimates of effort required for development deliverables, by providing updates on project progress to development and project management, and by escalating issues that might affect project success to management. Maintain technical skills and expertise through continuing education and training. Also responsible for other Duties/Projects as assigned by business management as needed. Qualifications 2 years developing Robotic Process Automation solutions 2 years working with a wireless carrier Knowledge, Skills, and Abilities: Ability to identify RPA opportunities and lead/co-lead development RPA Development Platform experience Desktop/Mobile Application Development Software Development Expertise with Microsoft Office and similar business software Familiar with Software Development Lifecycle and project methodologies (Waterfall, Agile, etc.) Ability to work with non-technical and technical individuals Company Profile T-Mobile U.S. Inc. (NASDAQ: TMUS) is America’s supercharged Un-carrier, delivering an advanced 4G LTE and transformative nationwide 5G network that will offer reliable connectivity for all. T-Mobile’s customers benefit from its unmatched combination of value and quality, unwavering obsession with offering them the best possible service experience and undisputable drive for disruption that creates competition and innovation in wireless and beyond. Based in Bellevue, Wash., T-Mobile provides services through its subsidiaries and operates its flagship brands, T-Mobile, Metro by T-Mobile and Sprint. For more information please visit: http://www.t-mobile.com Applicant Privacy Policy We are committed to maintaining your trust by respecting and protecting your privacy. For more information about how T-Mobile processes the personal data of job applicants, please visit Applicant Privacy Policy . EOE Statement Equal Employment Opportunity We take equal opportunity seriously—by choice. T-Mobile USA, Inc. is an Equal Opportunity Employer. All decisions concerning the employment relationship will be made without regard to age, race, ethnicity, color, religion, creed, sex, sexual orientation, gender identity or expression, national origin, religious affiliation, marital status, citizenship status, veteran status, the presence of any physical or mental disability, or any other status or characteristic protected by federal, state, or local law. Discrimination, retaliation or harassment based upon any of these factors is wholly inconsistent with how we do business and will not be tolerated. Positions Remaining 1 Brand T-Mobile Schedule Full Time",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-09T20:03:28.000Z"
    },
    "company": {
        "name": "T-Mobile",
        "link": "https://www.linkedin.com/company/t-mobile"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Frisco",
        "region": "TX",
        "postal_code": "75034",
        "street_address": null,
        "latitude": 33.15066,
        "longitude": -96.82508
    }
}