{
    "job": {
        "title": "Data Scientist / Machine Learning SW Engineer",
        "industry": "Staffing and Recruiting",
        "description": "A global Conversational AI technology company is offering a solutions platform that is fueled by AI and automation technologies. The companies vision is to bridge the gap between people and machines through voice. They’re looking for a world class Data Scientist who is interested in working on the next generation of “goal driven conversational models”. The ideal candidate understands the fast pace of the start-up environment and is not intimidated to work on topics that are at the frontier of the research. The candidate will work as an individual contributor but it is expected to collaborate and sync up with the other members of the Data Science team. Required Skills & Experience 3+ years of experience in the field of machine learning with a focus in NLP/NLU Knowledge of Pytorch, Tensorflow, or any related deep learning technology PhD in Computer Science or related field What You Will Be Doing Tech Breakdown 50% Tensorflow 50% Pytorch Daily Responsibilities 70% Hands on Coding 30% Team Collaboration The Offer Competitive Salary: Up to $200-225K/year, DOE You Will Receive The Following Benefits Catered lunch everyday as well as snacks/drinks Full Medical, Dental, and Vision insurance Flexible Spending Account (FSA) 41k Matching Pre-tax commuter benefits Generous PTO Weekly team outings, happy hours, events Applicants must be currently authorized to work in the United States on a full-time basis now and in the future. *NO Visa Sponsorship or C2C at this time* A global Conversational AI technology company is offering a solutions platform that is fueled by AI and automation technologies. The companies vision is to bridge the gap between people and machines through voice. They’re looking for a world class Data Scientist who is interested in working on the next generation of “goal driven conversational models”. The ideal candidate understands the fast pace of the start-up environment and is not intimidated to work on topics that are at the frontier of the research. The candidate will work as an individual contributor but it is expected to collaborate and sync up with the other members of the Data Science team. You Will Receive The Following Benefits Catered lunch everyday as well as snacks/drinks Full Medical, Dental, and Vision insurance Flexible Spending Account (FSA) 41k Matching Pre-tax commuter benefits Generous PTO Weekly team outings, happy hours, events Applicants must be currently authorized to work in the United States on a full-time basis now and in the future. *NO Visa Sponsorship or C2C at this time* Posted By: Breann Gonzalez",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-06-13T12:02:25.000Z"
    },
    "company": {
        "name": "Motion Recruitment",
        "link": "https://www.linkedin.com/company/motion-recruitment-partners"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "San Jose",
        "region": "CA",
        "postal_code": "95148",
        "street_address": null,
        "latitude": 37.334793,
        "longitude": -121.888145
    }
}