{
    "job": {
        "title": "Site Reliability Engineer",
        "industry": "Information Technology and Services",
        "description": "Established in 1996, Nagarro began as a dream of a few friends who wanted to create a company with a difference – a company that focused on “strategic differentiation via technology” initiatives rather than routine IT operations. Today we are more than 6500 experts across more than 20 countries. At Nagarro, you can look forward to a work culture that is dynamic and non-hierarchical. You will be given opportunities to add value to challenging and complex assignments while collaborating with world-class technologists. The versatile environment here helps foster fresh perspectives and enables you to deliver high-quality code. There will be ample opportunities provided for skill up-gradation to accelerate your professional and personal development. Principal Site Reliability Engineer Nagarro Fulltime Remote 15+yrs experience and a strong background in areas like cloud operations and site reliability engineering Hands-on knowledge and experience with any of the major public cloud providers Experience in creating steady-state baselines for resiliency using chaos engineering concepts, orchestrating GameDays to run chaos experiments, knowledge of popular chaos engineering platforms (preferably Gremlin), and tools Strong understanding of end-to-end architecture and development frameworks; knowledge across tiers in a multi-tier cloud environment including multi-region, multi-zone configurations, load balancers, web servers, application containers, data stores, distributed caches, and content delivery networks In-depth knowledge of version control, Expert knowledge of Linux OS capabilities, Good understanding of DevOps concepts and best practices, CI/CD implementation expertise, Issue troubleshooting experience An Agile mindset and strong communication skills to collaborate on sales pitches with Presales Must be able to manage time between multiple opportunities Roles and responsibilities Work with our thought leaders from the technology practices team to identify and qualify business opportunities. Identify key customer technical objections and develop the strategy to resolve technical impediments to business transactions Continually researching current and emerging technologies in CloudOps and SRE to create new offerings Take responsibility for technical aspects of solutions, including activities such as supporting bid responses, solution briefings, proof-of-concept work, and the coordination of supporting technical resources Contribute to multiple client engagements by collaborating with account teams Gathering project requirements from stakeholders along with BAs and PMs Designing high-level schematics of the infrastructure, tools, and processes needed Performing an in-depth analysis of the possible risks and countermeasures for them, calculating the potential cost of outages and planning for contingency, monitoring the systems in production, analyzing their performance Preparing input for infrastructure/tooling/workflow updates across the organization Prepare and deliver product messaging to highlight Nagarro’s value proposition using techniques including whiteboard and slide presentations, frameworks, demonstrations, workshops, white papers, and RFI response documents Create frameworks, questionnaire toolkits, assessment tools that can help with the facilitation of workshops with customer Train and groom engineers in this area while creating assessments to support the Nagarro University training program. Benefits An exciting engineering career with a growing company Work in the latest technology areas and solve complex and challenging projects Competitive salary and incentive packages. Paid Time Off Parental Leave, family-friendly flexibility, and good work-life balance Competitive healthcare benefits Work from anywhere (yes, even after COVID!) We care about having a fantastic culture optimized for doing our best as a team and individuals (not just lip-service). No middle managers - we love non-pyramid-style management hierarchy Disclaimer: Nagarro is an equal opportunity employer. We celebrate diversity and are committed to creating an inclusive environment for all employees. All qualified applicants will be afforded equal employment opportunities without discrimination based on race, creed, color, national origin, sex, age, disability or marital status.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-19T13:46:57.000Z"
    },
    "company": {
        "name": "Nagarro",
        "link": "https://de.linkedin.com/company/nagarro"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 180,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "New York",
        "region": "United States",
        "postal_code": "13856",
        "street_address": null,
        "latitude": 42.93923,
        "longitude": -75.62005
    }
}