{
    "job": {
        "title": "UX Researcher",
        "industry": "Health, Wellness and Fitness",
        "description": "UX Researcher Palo Alto, CA, United States About Yo Labs: Technology has changed daily life in a way no one could have imagined. It’s made us more productive, capable and connected. But it has come at a cost. We’re productive, but overwhelmed. Capable but paralyzed by too many choices. Connected, but only if social media counts. Living this way creates a void in our daily lives. Yo Labs is here to change that. Our team is committed to alleviating the mental load that our modern world has created by putting human connection back into technology and caretaking at the heart of everything we create. About the Role: As a UX Researcher, you will work closely with designers, engineers, and product managers to build new mobile apps and services. In this role, you will create understanding and empathy around user needs, stated and unstated. Your research will help us create useful, usable, and delightful new products and features for our users. This role will start out mainly focused on usability testing across multiple products with multiple user types, but there will be opportunities to take on different types of research projects and collaborate with more experienced UXRs. Responsibilities Support the evaluative research (i.e., usability testing, heuristic evaluations, etc.) needs of multiple product teams Work with designers, engineers, and product managers to identify and prioritize research opportunities in a fast-paced, rapidly changing environment Plan and execute research studies end-to-end, including designing the study, recruiting participants, moderating interviews, analyzing data, and reporting results Advocate research findings to diverse audiences through written reports and in-person presentations Requirements BA/BS degree in Anthropology, Human-Computer Interaction (HCI), Human Factors, Psychology, Sociology, or a related field, or equivalent practical experience Preferred, but not required: Master's degree in a related field 1-3 years of relevant work experience in an applied research setting and/or product research and development Experience conducting evaluative research and ability to demonstrate the impact of their research insights Understanding of UI/UX best practices and user-centered design Understanding of the strengths and shortcomings of different research methods, including when and how to apply them during the product development process Nice to have Demonstrated experience with other research methods, including but not limited to ethnographic research, contextual inquiry, diary studies, surveys, etc. Familiarity with analytics, a/b tests, or statistical concepts Proficiency with Figma What We Offer: Competitive compensation package Comprehensive benefits Pet Insurance Paid Parental Care Leave Employee Referral Program Educational Assistance Flexible Work Program Volunteer time Off Total Well Being Program",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-22T01:26:42.000Z"
    },
    "company": {
        "name": "Yo Labs",
        "link": "https://www.linkedin.com/company/yo-labs"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 12,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Palo Alto",
        "region": "CA",
        "postal_code": "94310",
        "street_address": null,
        "latitude": 37.445103,
        "longitude": -122.16036
    }
}