{
    "job": {
        "title": "Data Scientist",
        "industry": "Information Technology and Services,Information Services,Research",
        "description": "What makes Gartner’s Global Product Management a GREAT fit for you? When you join Gartner, you’ll be part of a team with a no-limits mindset that develops new, transformational products using technology-based innovations. Gartner delivers tools and actionable insights which help our clients shape the future of their organizations. Our leading-edge team values collaboration, client-obsession and an entrepreneurial spirit. If you’re ready to fuel the future of business with creative technology solutions, Gartner is the place for you. Interested in learning more, view and register for any of our upcoming recruiting events here ! Title: Data Scientist About the role: This is a unique opportunity to join our fast-growing Data Products & Innovation team within the Global Product Management organization and work with a group of data scientists, engineers, and product managers to drive significant business impact. Your team focuses on leveraging Gartner’s proprietary data to innovatively bring better products to our clients across all industries. We are leveraging data science to define and implement new business models and build data-driven products. Your role specifically will be to apply data science with design thinking and lean product principles to define, design, and implement algorithms that are core to our business and set the foundation for new products. Ideal candidate should want to deeply understand our client’s needs and be a champion for applying data science to improve the client experience. Come join us building something great! What You Will Do Given the broad areas that we are responsible for, you will likely to start with a domain but may get involved in other domains. A few potential projects or products you may get involved with: Applying Natural Language Processing (NLP) to advise Chief Information Security Officers (CISOs) on emerging security threats Using machine learning and topic modeling to advise Chief Information Officers (CIOs) on recommended topic areas for engagement Using predictive modeling to develop forward-looking projections of emerging trends in venture capital investment to advice Tech CEOs Using statistical analysis to advise Chief Marketing Officers (CMOs) on the effectiveness of marketing campaigns Leveraging design thinking, client input, and a “data science mindset” to identify, prioritize, and assess opportunities to leverage data science to deliver value to our clients What You Will Need 1-3 years hands-on experience building predictive models, recommendation systems, and/or NLP/text mining tools. Familiar with the foundational approaches to the major data science disciplines, such as data preparation, advanced statistics, machine learning, simulation, and natural language processing Practical, intuitive problem solver with a demonstrated ability to translate business objectives into actionable data science tasks and translate quantitative analysis into actionable business strategies Connections to the recommendations and / or information retrieval academic community Experience and proficiency with various programming languages (e.g., Python), machine learning tools (e.g., scikit-learn), statistical packages (e.g., Scipy), SQL/relational databases (e.g., Oracle) and NoSQL databases (e.g., MongoDB, graph database), Linux and shell scripting Passion for new product development and product development lifecycle, including product strategy, development, and launch Bachelors in a quantitative research field (e.g., Computer Science, Electrical Engineering, Applied Mathematics, Physics, etc.). Benefits We offer a highly competitive rewards and benefits package including company benefits with full medical, dental, and vision starting on day one, 401(k) with company match, tuition reimbursement, wellness rewards, 20 days of paid time-off, and more. Gartner is a high growth company which will provide the right candidate with a wealth of career development opportunities. All Gartner associates strive to be high performers, problem solvers and team players with passion, integrity and effectiveness. We strive to attract exceptional people who really enjoy what they do. Are you ready to jump on board? Our Awards And Accolades Fortune World’s Most Admired Companies 2016, 2017, 2018, 2019, 2020 & 2021 Forbes America’s Best Employers 2018, 2019; Best Management Consulting Firms 2017, 2018, 2019 Human Rights Campaign Corporate Equality Index Best Places to Work for LBGTQ Equality 2018, 2019, 2020 & 2021 Careers & the disABLED Magazine Top 50 Employers 2021 The policy of Gartner is to provide equal employment opportunities to all applicants and employees without regard to race, color, creed, religion, sex, sexual orientation, gender identity, marital status, citizenship status, age, national origin, ancestry, disability, veteran status, or any other legally protected status and to affirmatively seek to advance the principles of equal employment opportunity. Gartner is committed to being an Equal Opportunity Employer and offers opportunities to all job seekers, including job seekers with disabilities. If you are a qualified individual with a disability or a disabled veteran, you may request a reasonable accommodation if you are unable or limited in your ability to use or access the Company’s career webpage as a result of your disability. You may request reasonable accommodations by calling Human Resources at 203-964-0096 or by sending an email to ApplicantAccommodations@gartner.com . Job Requisition ID:57861 By submitting your information and application, you confirm that you have read and agree to the country or regional recruitment notice linked below applicable to your place of residence. Gartner Applicant Privacy Link: https://jobs.gartner.com/applicant-privacy-policy For efficient navigation through the application, please only use the back button within the application, not the back arrow within your browser.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-19T13:45:30.000Z"
    },
    "company": {
        "name": "Gartner",
        "link": "https://www.linkedin.com/company/gartner"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 12,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Irving",
        "region": "TX",
        "postal_code": "75063",
        "street_address": null,
        "latitude": 32.813877,
        "longitude": -96.949936
    }
}