{
    "job": {
        "title": "Principal Software Engineer",
        "industry": "Banking",
        "description": "Description Your role as Principal of Software Engineering is to work with engineering teams and architecture to produce high-quality technology solutions. You will be given the autonomy to lead, design and develop innovative solutions to some of the biggest technical issues facing the banking industry. As Principal, you will serve as a peer-leader tasked with pursuing cutting-edge initiatives and solutions. The breadth of Citizens operations ensures a diversity of projects as the bank pivots towards innovation and customer experience. The Principal Software Engineer Will Be Responsible For Participating in an environment rapidly transforming to the Agile methodology, adhering to best practices and collaborating effectively with your team mates. Collaborating and contributing insight to solution design ideation, ensuring both the success of the product and adherence to enterprise architecture principles. Designing, modifying, developing and implementing software solutions. Building modern, architecturally sound components, tools and applications to meet mission-driven strategic business goals. Infusing quality of service characteristics, such as scalability, manageability and maintainability, into distributed service-based framework to create or expand business or technical capabilities. Employing industry best practices to evaluate, correct and prevent vulnerabilities during the software development process. Serving as a peer-leader, encouraging a culture of innovation and accountability while adhering to Agile best practices. Qualifications 8+ years of hands-on software development, with proven experience in developing and supporting commercial software products which were sold to non-technical customers in vertical markets Demonstrated ability to lead and mentor software engineers 5+ years of experience in technical lead role. Mastery of multiple programming languages, including at least one front end framework (Angular/React/Vue), such as Python3, Java, JavaScript and C++. AWS/AZURE/GCP/Private/Hybrid cloud experience, including managing sensitive assets Linux and open source architecture experience. Experience with CICD pipeline (CircleCI, Jenkins, or equivalent) Strong communication (both oral and written) and interpersonal skills Cloud certifications such as AWS Solutions Architect Experience with building applications and deployment in scalable environment using Docker and Kubernetes. Experience with building micro-services and deployment in containerized environment. Experience with dependency injection frameworks (Spring, CDI, Docker, etc). Understanding of security concepts and tooling including but not limited to PKI, Cryptography, along with how those apply to web concepts (HTTP(S), SSL/TLS, certificates etc) Desired Qualifications 3+ years of experience in the financial services industry, developing solutions for consumer banking, portfolio management, trading, compliance or wealth management Understanding of the banking industry, specifically the functions of custodial and consumer banking, debt collections, fraud prevention and loan servicing. Experience with Apache, Lucene, Memcache, RAbbitMQ and NoSQL Education and Certifications Required: Bachelor's degree in Software Engineering, Computer Science, Engineering, Mathematics or related discipline Preferred: Master's degree in Software Engineering, Computer Science or related discipline Why Work for Us At Citizens, you'll find a customer-centric culture built around helping our customers and giving back to our local communities. When you join our team, you are part of a supportive and collaborative workforce, with access to training and tools to accelerate your potential and maximize your career growth. Equal Employment Opportunity Citizens, its parent, subsidiaries, and related companies provide equal employment and advancement opportunities to all colleagues and applicants for employment without regard to age, ancestry, color, citizenship, physical or mental disability or perceived disability, ethnicity, gender, gender identity or expression, genetic information, genetic characteristic, marital or domestic partner status, victim of domestic violence, family status/parenthood, medical condition, military or veteran status, national origin, pregnancy/childbirth/lactation, colleague’s or a dependent’s reproductive health decision making, race, religion, sex, sexual orientation, or any other category protected by federal, state and/or local laws. Equal Employment and Opportunity Employer/Disabled/Veteran Citizens is a brand name of Citizens Bank, N.A. and each of its respective affiliates. 216187",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-27T05:32:44.000Z"
    },
    "company": {
        "name": "Citizens",
        "link": "https://www.linkedin.com/company/citizens-bank"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 96,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Johnston",
        "region": "RI",
        "postal_code": "02919",
        "street_address": null,
        "latitude": 41.829857,
        "longitude": -71.500694
    }
}