{
    "job": {
        "title": "Dripping Springs CFT - Cross Functional Rep - Part-Time",
        "industry": "Food &amp; Beverages,Food Production,Retail",
        "description": "Would you rather do something different every day? H-E-B needs energetic and motivated Partners willing to work hard and have fun while providing superior customer service. No matter what background you bring, or where you are in your career, we welcome you to join our community where People come first. As a Cross-Functional Representative, you'll provide general customer service, checking on the front end, and work across multiple departments in packaging, stocking, rotation, production, and sanitation duties. Once you're eligible, you'll become an Owner in the company, so we're looking for commitment, hard work, and focus on quality and Customer service. 'Partner-owned' means our most important resources--People--drive the innovation, growth, and success that make H-E-B The Greatest Omnichannel Retailing Company. Do You Have a HEART FOR PEOPLE... commitment to provide superior Customer Service? HEAD FOR BUSINESS... a strong sense of how what you do affects Customers and our success? PASSION FOR RESULTS... initiative to step up and do what needs doing, with an eye for detail? We Are Looking For a high school diploma; some H-E-B experience customer service and interpersonal skills What is the work? Customer Service / Sales / Stocking Provides excellent customer service; answers customer questions regarding products, take orders, assists with product selection Uses suggestive selling techniques to meet customer needs and build department sales May make regular product announcements to inform customers Works a flexible schedule to accommodate shifts of different departments Performs duties in multiple departments, to include technical or perishable areas such as bakery, floral, market, etc. Performs stocking and replenishment, product returns and rotation, product selection, service support, inventory accuracy, and additional duties across total Store, in multiple departments Builds, stocks, and maintains displays and fixtures Assists with inventory control; loads, unloads, and moves product Slices, packages, labels, rotates, merchandises, culls, and prices product Gains knowledge of multiple departments; applies understanding of processes / policies Complies with Store and department SOPs, policies, and applicable laws For the Service cross functional team, works as a Checker when not performing Cross Functional duties Food Safety / Sanitation Ensures compliance with departmental / Store SOPs for food safety and sanitation Properly operates and maintains all equipment Cleans / sanitizes sales floor, display cases, prep areas, and equipment What is your background? Minimum age 18 (mandatory) High school diploma, or equivalent 6+ months of experience in H-E-B Store operations Completion of Company Orientation and Safety Training Do you have what it takes to be a fit as an H-E-B Cross-Functional Representative? Knowledge of computer systems (Symbol, ACR, label machine) Customer service and interpersonal skills Verbal / written communication and reading skills Ability to adapt to performing a wide range of duties across multiple departments Ability to work autonomously Can you... Function in a fast-paced, retail environment, requiring detailed and precise tasks Work with Customers, staying attentive to their needs Work flexible schedules to accommodate differing department shifts Perform the following, based on your Department Bakery Constantly* reach at waist, grasp Frequently stand, walk, reach at shoulder, bend Occasionally sit, reach overhead, reach at knee, reach at floor, stoop, squat, crouch, kneel, stair climb, pivot, twist, push / pull with arms, pinch, perform fine motor movements, shoulder abduction Occasionally be exposed to wet, cold, hot conditions, loud noise Demonstrate the ability to lift 50 lbs, and manage in excess of 70 lbs** Dairy / Frozen / Grocery / Market Constantly* reach at waist, grasp Frequently stand, walk Occasionally reach overhead, reach at shoulder, reach at knee, reach at floor, bend, stoop, squat, crouch, kneel, stair climb, pivot, twist, push / pull with arms, pinch, perform fine motor movements Occasionally be exposed to wet, cold conditions, loud noise DAIRY: Demonstrate the ability to lift 40 lbs, and manage in excess of 85 lbs** FROZEN: Demonstrate the ability to lift 60 lbs, and manage in excess of 75 lbs** GROCERY: Demonstrate the ability to lift 50 lbs, and manage in excess of 80 lbs** MARKET: Demonstrate the ability to lift 40 lbs, and manage in excess of 40 lbs** Deli Constantly* reach at waist, grasp Frequently stand, walk, stoop Occasionally reach overhead, reach at shoulder, reach at knee, reach at floor, bend, squat, crouch, kneel, stair climb, pivot, twist, push / pull with arms, pinch, perform fine motor movements Occasionally be exposed to wet, cold, hot conditions, loud noise Demonstrate the ability to lift 55 lbs, and manage in excess of 65 lbs** Cosmetics / Drugstore / General Merchandise Constantly* reach at waist, grasp Frequently stand, walk Occasionally reach overhead, reach at shoulder, reach at knee, reach at floor, bend, stoop, squat, crouch, kneel, stair climb, pivot, twist, push / pull with arms, pinch, perform fine motor movements Occasionally be exposed to wet conditions, loud noise, ambient temperatures COSMETICS: Demonstrate the ability to lift 45 lbs, and manage in excess of 45 lbs** DRUGSTORE: Demonstrate the ability to lift 15 lbs, and manage in excess of 15 lbs** GM: Demonstrate the ability to lift 50 lbs, and manage in excess of 45 lbs** Floral Constantly* reach at waist, grasp Frequently stand, walk Frequently be exposed to cold conditions Occasionally reach overhead, reach at shoulder, reach at knee, reach at floor, bend, stoop, squat, crouch, kneel, stair climb, ladder climb, pivot, twist, push / pull with arms, pinch, perform fine motor movements Occasionally be exposed to wet, cold, hot conditions, loud noise Demonstrate the ability to lift 55 lbs, and manage in excess of 45 lbs** Gas Station Constantly* sit, reach at waist Frequently grasp Occasionally stand, walk, reach overhead, reach at shoulder, reach at knee, reach at floor, bend, stoop, squat, crouch, kneel, stair climb, pivot, twist, push / pull with arms, pinch, perform fine motor movements Demonstrate the ability to lift 40 lbs, and manage in excess of 40 lbs** Produce Constantly* reach overhead, reach at shoulder, reach at waist, pivot, grasps Frequently walk, reach at knee, reach at floor, stoop, squat, twist, push / pull with arms, pinch, perform fine motor movements Occasionally stand, bend, crouch, kneel, stair climb Occasionally be exposed to wet, cold, hot conditions, loud noise Demonstrate the ability to lift 60 lbs, and manage in excess of 75 lbs** Seafood Constantly* reach at waist Frequently stand, walk, pivot, push / pull with arms, grasp Frequently be exposed to wet and cold Occasionally reach overhead, reach at shoulder, reach at knee, reach at floor, bend, stoop, squat, crouch, kneel, stair climb, twist, pinch, perform fine motor movements, cervical flexion Occasionally be exposed to hot conditions, loud noise, ambient temperatures Demonstrate the ability to lift 50 lbs, and manage in excess of 25 lbs** Service Constantly* stand, walk, reach at waist, grasp Occasionally reach overhead, reach at shoulder, reach at knee, reach at floor, bend, stoop, squat, crouch, kneel, stair climb, pivot, twist, push / pull with arms, pinch, perform fine motor movements Occasionally be exposed to cold, hot, loud noises, ambient temperatures, wet conditions Demonstrate the ability to lift 50 lbs, and manage in excess of 30 lbs** Shelf Edge Constantly* reach at waist, grasp Frequently stand, walk Occasionally sit, reach overhead, reach at shoulder, reach at knee, reach at floor, bend, stoop, squat, crouch, kneel, stair climb H-E-B Job Title Cross Functional Rep Shift Variable Hours Schedule Part-time Primary Location US-TX-Dripping Springs Unposting Date Aug 11, 2021, 11:59:00 PM",
        "employment_type": "PART_TIME",
        "date_posted": "2021-08-03T03:25:29.000Z"
    },
    "company": {
        "name": "H-E-B",
        "link": "https://www.linkedin.com/company/heb"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 6,
        "seniority_level": "junior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Dripping Springs",
        "region": "TX",
        "postal_code": "78620",
        "street_address": null,
        "latitude": 30.190702,
        "longitude": -98.087494
    }
}