{
    "job": {
        "title": "Data Scientist",
        "industry": "Marketing and Advertising,Computer Software,Internet",
        "description": "Data scientists at Disney Streaming Services are the insights and modeling partners for the content, marketing, product, and engineering teams at Disney+, Hulu and ESPN+. They use data to empower decision-makers with information, predictions, and insights that ultimately influence the experiences of millions of users worldwide. Scientists on the team build models, perform statistical analysis, and create visualizations to provide scalable, persistent capability that is iteratively improved through direct interaction with cross-functional business partners. What You'll Do Modeling: Develop machine learning models for forecasting, opportunity sizing, and segmentation. Deep analysis: Analyze user behavioral data to identify patterns, uncover opportunities, and create common understanding of how people are interacting with the service and content. Visualization of Complex Data sets: Development of prototype solutions, mathematical models, algorithms, and robust analytics leading to actionable insights communicated clearly and visually. Partnership: Partner closely with business stakeholders to identify and unlock opportunities, and with other data teams to improve platform capabilities around data modeling, data visualization, experimentation and data architecture. What To Bring 5+ years of hands-on experience designing, building, and evaluating practical machine learning solutions to solve business problems 5+ years experience with statistical programming language (Python or R) 3+ years experience using SQL Deep understanding of machine learning concepts and statistical methods Strong communication skills, for both technical and non-technical audiences. Advanced degree, PhD or MS in an analytical field or equivalent experience Ability to convert modeling results into actionable insights A passion for data and technology Preferred Qualifications Experience thinking strategically to interpret market and consumer information, preferably about a subscription service. Familiarity with data exploration and data visualization tools like Tableau or Looker Advanced degree in an analytical field or equivalent experience oRXHffwu",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-02T16:40:03.000Z"
    },
    "company": {
        "name": "Hulu",
        "link": "https://www.linkedin.com/company/hulu"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "New York",
        "region": "NY",
        "postal_code": "10132",
        "street_address": null,
        "latitude": 40.713047,
        "longitude": -74.00723
    }
}