{
    "job": {
        "title": "Software Developer - Solutions Developer",
        "industry": "Computer Software,Insurance,Financial Services",
        "description": "Overview We are not just offering a job but a meaningful career! Come join our passionate team! As a Fortune 50 company, we hire the best employees to serve our customers, making us a leader in the insurance and financial services industry. State Farm embraces diversity and inclusion to ensure a workforce that is engaged, builds on the strengths and talents of all associates, and creates a Good Neighbor culture. We offer competitive benefits and pay with the potential for an annual financial award based on both individual and enterprise performance. Our employees have an opportunity to participate in volunteer events within the community and engage in a learning culture. We offer programs to assist with tuition reimbursement, professional designations, employee development, wellness initiatives, and more! Visit our Careers page for more information on our benefits, locations and the process of joining the State Farm team! OFFICE LOCATION: Richardson, TX, Dunwoody, GA, Tempe, AZ, Bloomington, IL **Hybrid Work Environment: Selected applicants should plan to spend time working from home and some time working in the office as part of our flexible work environment.** *Applicants for this position are required to be eligible to lawfully work in the U.S. immediately; employer will not sponsor applicants for U.S. work authorization (e.g. H-1B visa) for this opportunity.* Responsibilities Interested in a challenging position to design & build strategic Architecture on Public Cloud !!! Well, we have the right position for you ! Come join us… Claims Engineering, Architecture, & AAP Product Suite is seeking a Software Developer to join the Claims Cloud Eventing product team. This cloud-native product is part of the Engineering and Architecture product suite, wherein it provides a more advanced and futuristic Event consumption capabilities utilizing an Event Driven Architecture. This will be a critical foundational capability as part of the modernization of the P&C Claims experience, enabling Automation as well as ML driven flows for an upgraded customer experience. The individual selected will be a part of high performing and empowered product team to design, develop and implement new product functionalities along with troubleshooting application issues as they arise. Analyst will also be undertaking future challenging and innovative work leveraging ML/AI capabilities for building future strategic Claims solutions providing industry-leading benefits. Applies an expert understanding of development tools, processes, applications, programming languages and environments to assignments Designs and develops full-stack applications using industry-adopted languages and frameworks Enables solution modernization activities through design and development-related work items and architectural engagement Provides highest level of support for problem and issue resolution and provides technical consultation and direction to business and product team members May act as a product owner Leads strategic work across the product suite and utilizes application architecture to increase efficiency and effectiveness of complex issues Champion and provide guidance with an innovative mind set to deliver product solutions Influences and provides direction on product development practices, coding, data and testing standards code reviews and software architecture Conducts research and integrate industry best practices into processes and potential solutions Drives, coordinates and delegates work of other product team members Drives required product testing practices and solutions to ensure product quality Qualifications We Are Seeking Candidates With: Have a lean mindset to implement small, incremental changes and fail fast Avid Team player Focus on understanding requirements and building flexible and futuristic event-driven architecture that fail and scale independently using cloud technologies Ability to be a results-driven self-starter who enjoys researching and learning new tools/technologies to fully automate self-service and self-remediation solutions Ability to partner with other product teams within or outside the product suite Technical Skills Object oriented Software/Application Development background Infrastructure as Code: Terraform Development languages - Typescript, Javascript, Java, Python, Nodejs, Go DevOps and CI/CD Pipeline knowledge - GitLab CI, GitOps, Containerized solutions, Alerting and Monitoring solutions using CloudWatch, Chaos Testing AWS Technologies - Lambda, State Machines, API Gateway, DynamoDB, SNS, SQS, Kinesis, EventBridge, CloudWatch, AWS Pinpoint",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-20T00:09:34.000Z"
    },
    "company": {
        "name": "State Farm ®",
        "link": "https://www.linkedin.com/company/state_farm"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Bloomington",
        "region": "IL",
        "postal_code": "61732",
        "street_address": null,
        "latitude": 40.477093,
        "longitude": -88.99322
    }
}