{
    "job": {
        "title": "Android Software Engineer - Kotlin - Java",
        "industry": "Electrical/Electronic Manufacturing",
        "description": "If you are a Android Software Engineer with Kotlin experience, please read on! Top Reasons to Work with Us We are thrilled to announce we are looking for talented Software Android Application Engineer to help us in our continuous growth and goals of launching new and exciting electronic products! Seeking an Android Software Engineer mid level with at least 3 years experience. Base salary, $75K -$105K and DOE . . . . We are fast paced, innovative and like to hire the best talent we can find to join our elite team! If you are looking to work with hot technology, a great team and company, this is the giant leap in your career path! What You Will Be Doing In this key role, you will be responsible for designing and maintaining software for our State of the Art electronics products in a fun and collaborative software environment! Responsible for designing, creating, and maintaining software for multi-function electronics products with a focus on Android development in an AOSP framework. -Work with a globally distributed team environment. What You Need for this Position Experience developing Android applications Full software lifecycle in an agile environment Strong Kotlin and Java experience A desire to work with Kotlin as a primary language Android NDK and native code integration experience Familiarity with a DevOps environment, CI, unit & automated testing, TDD Experience with full system debugging Mid-level experience: 3+ years of real-world development experience Experience with modern C++ highly desired Excellent communication skills. Candidates must be self-motivated, able to work independently on complex systems, and adapt to new application areas. Big Pluses Experience with design patterns such as MVVM, MVP Experience with Android AOSP Qt framework experience What's In It for You Our location is beautiful, vibrant, and the cost of living is inexpensive! Great people are here! You will be part of hot technology with a top-notched engineering team and company! If you like to be mentally stimulated, then this is the place! Great products and a stable company that is growing! Vacation/PTO Medical Dental Vision Bonus 401(k) Competitive Base Salary and DOE Relocation assistance Please FULLY COMPLETE THE APPLICATION QUESTIONS INCLUDING THE SELF ASSESSMENT ASAP! Complete applications will receive priority! We'd like to get you set up for an interview ASAP if you'd like this opportunity and are a suitable candidate! There are 4 short questions. Should take you no more than 4-7 min max! Apply directly to this job opening here! Or E-mail directly for more information to Lynne.azkoul-polanis@cybercoders.com ph. 617-848-4420 Looking to set up interviews asap for suitable candidates asap! So, if you are a Android Software Engineer with Kotlin experience, please apply today! Email Your Resume In Word To Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also: Lynne.Azkoul-Polanis@cybercoders.com Please do NOT change the email subject line in any way. You must keep the JobID: linkedin : LP1-1630078 -- in the email subject line for your application to be considered.*** Lynne Azkoul-Polanis - Principal Recruiter - CyberCoders Applicants must be authorized to work in the U.S. CyberCoders, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire. CyberCoders will consider for Employment in the City of Los Angeles qualified Applicants with Criminal Histories in a manner consistent with the requirements of the Los Angeles Fair Chance Initiative for Hiring (Ban the Box) Ordinance.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-31T07:03:40.000Z"
    },
    "company": {
        "name": "CyberCoders",
        "link": "https://www.linkedin.com/company/cybercoders"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Oakhurst",
        "region": "OK",
        "postal_code": "74050",
        "street_address": null,
        "latitude": 36.076836,
        "longitude": -96.063225
    }
}