{
    "job": {
        "title": "Senior Software Engineer",
        "industry": "Staffing and Recruiting",
        "description": "Job Description A leading loan provider and engineering distribution center in Florida is looking to scale up, these guys are on the cutting edge of loan distrubiton. More specifically, provide loan engineering systems for mortgage lenders. A strong engineer will have experience in C#, Asp.netCore, Web API, Restful web services, Javascript, angular2+ , React, Azure, and SQL. You will be working on a core usage, analytics, and loaning web application. Required Skills & Experience C# Asp.net Core or MVC JavaScript Azure or SQL Desired Skills & Experience Web API Building, not consuming Restful web services BS in CS Angular2+ or React What You Will Be Doing Tech Breakdown 0% Red Hat Linux 100% Windows Server 2010 Daily Responsibilities 90% Hands On 0% Management Duties 10% Team Collaboration The Offer Competitive Salary: Up to $170K/year, DOE You Will Receive The Following Benefits Medical Insurance & Health Savings Account (HSA) 401(k) Paid Sick Time Leave Pre-tax Commuter Benefit Applicants must be currently authorized to work in the United States on a full-time basis now and in the future. This position does not offer sponsorship. Jobspring Partners, part of the Motion Recruitment network, provides IT Staffing Solutions (Contract, Contract-to-Hire, and Direct Hire) across 10 major North American markets. Our unique expertise in today’s highest demand tech skill sets, paired with our deep networks and knowledge of our local technology markets, results in an exemplary track record with candidates and clients. Posted By: Brendan McLean",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-09-08T03:21:44.000Z"
    },
    "company": {
        "name": "Motion Recruitment",
        "link": "https://www.linkedin.com/company/motion-recruitment-partners"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Wildwood",
        "region": "FL",
        "postal_code": "34785",
        "street_address": null,
        "latitude": 28.8609,
        "longitude": -82.041794
    }
}