{
    "job": {
        "title": "Java Software Engineer",
        "industry": "Financial Services",
        "description": "The primary role of the position is to design data transformation tools on Microsoft Azure using Java, Spark and Angular for one or more business functions of Societe Generale. This position is also related to ensuring integrity and quality in the technical development, security, and systems support practices. Functional skills: Proven experience in designing, developing, implementing, and maintaining data transformation processes and UI in Java , Angular and Spark on Microsoft Azure Extensive knowledge of /experience with analyzing large and multithread event driven applications Extensive experience with version control and continuous delivery Extensive knowledge of /experience with Big Data technology and public cloud Microsoft Azure Technical skills: ·        6+ years of experience in developing Java-based multithreaded applications ·        Experience using Java 8, Spring Boot, Spark, Spring framework, and Microservices ·        2+ years of experience working with Spark , Hadoop ·        2+ years of experience working with Microsoft Azure HDInsight , AKS Hands-on experience in SQL and No-SQL (preferably Oracle, Postgres) Experienced with various Java Web development tools, Angular 7, XML, JSON and HTML5. Extensive experience in building a Continuous Delivery pipeline with GIT, Maven, Jenkins, Nexus, Sonar, Checkmarx, and XL-Deploy Extensive experience in writing Unix/Linux Shell scripts Good knowledge with Perl and Python Good knowledge and experience with Tomcat server Good knowledge and experience with file transmission and network (DNS, TCP/IP) Strong troubleshooting skills Experience and able to work with Agile environment and drive projects forward within team setting Must be organized, detail-oriented, self-motivated, disciplined, professional, and a team player to multiple tasks at one time, in a fast pace environment handling multiple demands Desired/Plus: Self-managing in a fast-paced development environment. Extensive knowledge of software development life cycle and accepted practices. Strategic and analytical thinking skills with an ability to solve problems and make decisions. Understanding of financial services industry and associated products Experience in open source frameworks Experience working on streaming data applications (e.g., Kafka, Flink or Spark Steaming) Essential Functions: Uses expertise in appropriate techniques and tools to design, develop and maintain effective application software, reporting to technical lead. Participates to the development and implementation of standards related to the application development, security and system support activities. Performs formal and informal reviews of software development processes and products to ascertain quality and adherence to standards. Establishes and maintains control procedures for version control. Monitors and tracks quality related issues and problems through to resolution. Supervises: None Works With: Business Managers, Functional Project Managers, Technical Project Managers, Risk Business Analysts, Program Developers and Production Support",
        "employment_type": "CONTRACTOR",
        "date_posted": "2021-07-09T20:01:37.000Z"
    },
    "company": {
        "name": "LPX Group",
        "link": "https://www.linkedin.com/company/thelpxgroup"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 72,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Chicago",
        "region": "IL",
        "postal_code": "60654",
        "street_address": null,
        "latitude": 41.88323,
        "longitude": -87.6324
    }
}