{
    "job": {
        "title": "Software Engineer (Remote)",
        "industry": "Marketing and Advertising,Computer Software,Internet",
        "description": "We are looking for a full stack .NET Engineer to join the Broadlume team. You’ll take ownership for evolving and maintaining our C# ASP.NET codebase, including using best practices around style guides, frameworks, and automated unit and integration testing. You’ll work on applications used by our operations team and our customers to manage thousands of small businesses nationwide. This is a full time, remote position** What You’ll Do Find solutions for the most unique and challenging customer requests, integrating new products into our ecosystem of offerings Build out tools and applications that power a massive product inventory system. Provide technical leadership for our .NET codebases and act as a mentor for other engineers on the team. Partner with engineers on our distributed teams to help architect a unified experience for our customers to access multiple applications they rely on to run their businesses. Who You Are Requirements 3+ years with C# ASP.NET (including MVC, Web API, Entity Framework) Experience with optimizing SQL queries for performance; building stored procedures, database views, functions, and triggers You enjoy working with T-SQL. (Due to complexity in the database, complex database operations are written in T-SQL and not through Entity Framework) Strong HTML/CSS skills, and expertise with JavaScript/TypeScript and modernJavaScript frameworks such as React, Angular or VueJs A philosophy that investing time in code reviews, mentorship, and automated testing helps a team move faster You have experience with Microsoft SQL Server administration, maintaining IIS in production You are knowledgeable about .NET concepts like Lambda Expressions, LINQ queries NICE TO HAVES You have crossed paths with Microsoft Azure, particularly Azure Pipelines for CI/CD previously Familiarity with Google Cloud for CI/CD You want to learn more about or have experience in PHP, Ruby, or React Experience or interest in Docker/Kubernetes You are familiar with Rackspace architecture You are comfortable working with git and GitHub Experience or interest in MongoDB You can contribute to designing good APIs, understanding of ReST/JSON and GraphQL Benefits Health Care Plan (Medical, Dental & Vision) Retirement Plan (401k, 4% match) Life Insurance Unlimited Paid Time Off Family Leave Short Term & Long Term Disability Work From Home Wellness Resources Who We Are Our mission at Broadlume is pretty simple simplify the complicated world of digital marketing for the flooring industry. The opportunity is massive, and we have the team to execute the vision…except, well, for you. At Broadlume, we are committed to working with and providing reasonable accommodations to individuals with disabilities. If you need a reasonable accommodation because of a disability for any part of the employment process, please email us at careers@broadlume.com and let us know the nature of your request and your contact information. Broadlume is an equal opportunity employer. Qualified applicants will receive consideration for employment without regard to sex, gender identity, sexual orientation, race, color, religion, national origin, disability, protected veteran status, age, or any other characteristic protected by law.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-13T04:19:47.000Z"
    },
    "company": {
        "name": "Broadlume",
        "link": "https://www.linkedin.com/company/broadlume"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "New York",
        "region": "United States",
        "postal_code": "13856",
        "street_address": null,
        "latitude": 42.93923,
        "longitude": -75.62005
    }
}