{
    "job": {
        "title": "Data Scientist",
        "industry": "Computer Software,Hospital &amp; Health Care,Research",
        "description": "The Opportunity As a Data Scientist at LifeBell AI, you’ll develop and validate novel machine learning approaches for early prediction of sepsis and other clinical conditions. You'll work closely with our CTO, CSO, data science, and engineering teams. You’ll join a tight-knit group that values collaboration, continuous improvement, and solving challenging technical and product problems in an emerging space. Plus, we like to have fun along the way. About Us LifeBell AI creates intelligent software that saves lives by harnessing the latest advances in machine learning, analytics, and sensor technologies across healthcare. We’re a fast-growing, fully funded, Atlanta-based technology startup, with both local and remote employees. Join us as a data scientist in our mission to reduce morbidity and mortality from sepsis, a life-threatening condition that affects over 48 million people globally each year. Partners include top governmental, healthcare, and academic institutions. Leadership LifeBell AI is founded and led by Erez Goren and Gari Clifford, PhD . Erez was previously the founder & CEO of Radiant Systems (NASDAQ: RADS, acquired by NCR for $1.2B), BlueCube Software (acquired by RedPrairie), and Hi-Rez Studios (70M+ players worldwide). Gari is the Chair and Professor of Biomedical Informatics at Emory University, and a Professor of Biomedical Engineering at Georgia Tech. Gari was previously an Associate Professor at the University of Oxford and a Principal Research Scientist at MIT where he commercialized multiple biomedical innovations, and managed a project to collect and analyse the world's largest public database of hospital data. What You’ll Do Ask questions, connect the dots, and uncover opportunities to improve healthcare. Work on multiple initiatives to create and improve LifeBell AI’s models and analytics. Work across the entire machine learning pipeline, including data exploration, feature engineering, model training, deployment, monitoring, and calibration/retraining. What We’re Looking For Masters or PhD in Computer Science, Engineering, Statistics, or a related technical field. 3+ years of professional experience applying machine learning to real-world problems. Someone who has put models into production and monitored their effectiveness. A team player, who can work and communicate effectively with others. Self-motivated, with a genuine interest in the problems you’ll be solving. Preferred Domain knowledge in biomedical informatics, healthcare, or a related field. Prior publication of high quality peer-reviewed research articles. Benefits & Perks Competitive salary with health, dental, and vision insurance. Generous vacation, sick day, holiday, and leave policies. Equity incentive plan and 401K matching. Opportunity for meaningful impact in a team-based environment. Remote-friendly culture with daily stand-ups, virtual lunches, and a video-first attitude. Self-funded, stable technology startup with an approachable leadership team. Work-life balance and team activities. Core Values at LifeBell AI Save Lives : Improving patient health outcomes is our north star. Innovate : Our goal is to create industry defining moments, through technology & science. Be Human : We treat ourselves, and each other, with respect & understanding. Less is Better : Focus and simplicity matter - we aim to do a few things exceptionally well. Get it Done : Actions speak louder than words, and execution is key. Come As You Are : We aim to build an inclusive workforce. If you’re passionate about this role, but do not meet all of the qualifications listed above, we still encourage you to apply. We are an equal opportunity employer and celebrate diversity. We do not discriminate on the basis of age, ancestry, citizenship, color, ethnicity, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or invisible disability status, political affiliation, veteran status, race, religion, or sexual orientation. Remote Work: We are open to hiring remotely from anywhere in the United States. We know great talent is everywhere, and want to build the best team we can. COVID-19 : LifeBell AI is committed to hiring during the pandemic, with all interviewing and onboarding done virtually due to COVID-19. Everyone new to the team, along with our current staff, will temporarily work from home until it is safe to return to our office. In the meantime, we’ve implemented various practices to make remote working as enjoyable and practical as possible.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-19T19:41:58.000Z"
    },
    "company": {
        "name": "LifeBell AI",
        "link": "https://www.linkedin.com/company/lifebell-ai"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "United States",
        "region": null,
        "postal_code": "99999",
        "street_address": null,
        "latitude": 39.50355,
        "longitude": -99.0183
    }
}