{
    "job": {
        "title": "Software Engineer",
        "industry": "Medical Devices,Computer Software,Pharmaceuticals",
        "description": "The Software Engineer is part of the Software Applications Development Team and is responsible for analyzing component requirements, designing software solutions, and implementing Bigfoot software systems on mobile and cloud platforms. Bigfoot Software Engineers are also responsible for developing and maintaining automated software component tests and test frameworks. The right person for this role will be a detail-oriented, results-oriented self starter with the flexibility to adapt to change in a fast-paced startup environment. Essential Duties and Responsibilities Software Development: Design and Implement component software requirements; Write detailed design documentation; Implement automated tests for component requirements Test Frameworks: Implement and maintain testing frameworks and infrastructure DevOps: Implement and maintain CI and CD infrastructure Skills & Experience Requirements 2+ years recent hands-on software development experience in a lean/agile environment. Proficient in Java and Typescript or Javascript. Experience building Web Applications, Mobile Applications, and RESTful web services. Experience with writing tests and using test frameworks. Ability to rapidly learn and adopt new skills and technology. Strong written and verbal communication skills. Detail oriented, self-motivated, self-organizing, and committed to delivering high quality work. Additionally, the ideal candidate will possess the following: Experience with React and React Native Experience with iOS development (Swift) and Android development (Java/Kotlin) Experience with AWS including EC2, Kinesis, Redis, Elastic Search Strong technical and leadership skills: decisive, determined, strategic, and able to lead, motivate, and inspire others. Education Requirements BSc STEMs or higher",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-19T13:38:14.000Z"
    },
    "company": {
        "name": "Bigfoot Biomedical",
        "link": "https://www.linkedin.com/company/bigfoot-biomedical-inc-"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "San Francisco Bay Area",
        "region": null,
        "postal_code": "94112",
        "street_address": null,
        "latitude": 37.39271,
        "longitude": -122.042
    }
}