{
    "job": {
        "title": "Software Engineer - LT Workbench Backend",
        "industry": "Computer Hardware",
        "description": "At Lightelligence, our engineers have opportunities to grow and develop cutting-edge technology at the forefront of photonic computing. With a culture of internal mobility, there's opportunity to thrive in a variety of disciplines. This is a place for dreamers and doers to succeed. Become a part of the AI revolution at Lightelligence, where we’re building computational machines that are solving problems in ways that have never been done before! As a Backend Software Engineer on LT Workbench you will be an integral part of Lightelligence's growing engineering organization and will drive the adoption of our accelerators and ML model-deployment best practices. As part of the LT Workbench team, you will help build out a platform to allow other internal teams to quickly develop, experiment, iterate, and deploy new projects and ideas. The workbench will be a cloud-native web application and API that enables our scientists and engineers to... Perform driver and hardware benchmarks and compare and contrast results. Analyze AI workloads from theoretical, software, and hardware perspectives. Explore hardware architectures and provide performance estimates. Provide informative and flexible visualizations for both models and hardware. Provide easy access to an array of models and datasets for all of the above. What You’ll Do At Lightelligence Work with a team to build our cloud-native LT Workbench API and CLI Participate in all phases of development, from requirement gathering to deployment Write unit tests, integration tests, and documentation for your code Assist in building/optimizing our CI/CD pipelines Design and deploy AWS cloud infrastructure Shape the feature map of the LT Workbench project Requirements Preferred Qualifications If you meet 80% of the qualifications below or have other strengths that you think would benefit our team, we still encourage you to apply. Bachelor’s Degree in a relevant discipline, such as Computer Science (or 3+ years relevant experience) Excellent coding skills in at least one modern language (e.g., C#, Java, JavaScript, Python) Hands-on experience with cloud-based development (any major cloud provider) Hands-on experience with Database development (SQL and/or NoSQL) Experience using Agile and test-driven development Experience with PyTorch, TensorFlow, ONNX or other ML frameworks Bonus Hands-on experience developing with AWS Proficiency with Python Proficiency with Docker, Git, Unix, and/or Bash ML Infrastructure experience Modern front-end development experience (e.g., Javascript, HTML, CSS, React, Flask) Experience delivering and maintaining open-source packages Benefits We offer the following benefits Company subsidized health, vision and dental benefits 3 weeks PTO and 1 week of paid sick leave 401 (k) with an employer contribution 9 Paid holidays Flexibility - we offer a hybrid work environment A great place to work! Lightelligence is an Equal Opportunity Employer and does not discriminate against any employee or applicant for employment because of race, color, sex, age, national origin, religion, sexual orientation, gender identity and/or expression, status as a veteran, and basis of disability or any other federal, state or local protected class.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-06-24T15:22:38.000Z"
    },
    "company": {
        "name": "Lightelligence",
        "link": "https://www.linkedin.com/company/lightelligence-ai"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Boston",
        "region": "MA",
        "postal_code": "02118",
        "street_address": null,
        "latitude": 42.358994,
        "longitude": -71.05863
    }
}