{
    "job": {
        "title": "Software Engineer II",
        "industry": "Information Technology and Services,Defense &amp; Space,Aviation &amp; Aerospace",
        "description": "Position Summary MAG Aerospace has a great opportunity for a Software Engineer - II to support our customer in creating capabilities and providing technical services and subject matter expertise in Mission Command and C2 Maneuver systems. You will provide primary technical support to the Joint Automated Deep Operations Coordination System (JADOCS) and/or the Advanced Field Artillery Tactical Data Systems (AFATDS). Duties Include, But Not Limited To Essential Duties and Responsibilities Derive and maintain a cohesive program software architecture based on customer requirements, customer interactions, subject matter expert inputs, system architecture artifacts, and business objectives. Communicate development concepts to software developers, program management, and customer representatives during meetings Collaborate with system engineering personnel to assess requirements, and to ensure consistency between system architecture and software architecture Use Jira, Confluence, Git/Bitbucket collaboration and source control tools to communicate information Assist in identifying potential roadblocks and develop around them Support planning and estimation of development tasks and work to improve performance metrics Requirements Minimum Requirements Knowledge And Skills US Citizenship Required and must c urrently possess an active DoD SECRET security clearance 4-8 years prior relevant experience Experience in: Java/ J2EE technologies (Sockets, JPA, XML (DOM and SAX parsers); PostgresSQL (RDBMS, PL/SQL, Referential Integrity); Relational DB models and JPA Atlassian tools, including Jira, Confluence, and Bitbucket Ability to multi-task and function in a dynamic, fast-paced, development environment Excellent verbal and written skills Proficiency with MS Office Products (Word, Excel, Visio, & PowerPoint) Education BS in technical related degree Desired Requirements Experience with Service Oriented Architectures (SOAs) and specifically, OSGi Experience with AFATDS, Army Common Operating Environment (COE) or other PM MC systems Experience with Windows (Processes, IPC, caching, Windows Registry) Other Qualifications Security related certification or experience in the application of secure programming principals or security controls Ability to work in both office and lab environments. Company Policy MAG Aerospace (MAG) is an Equal Opportunity/Affirmative Action Employer and is committed to Diversity and Inclusion. We encourage diverse candidates to apply to our positions. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or veteran status. Click below for the “EEO is The Law” and “Pay Transparency Nondiscrimination” supplement posters. https://www.dol.gov/agencies/ofccp/posters MAG Aerospace (MAG) is committed to providing an online application process that is accessible to all, including individuals with a disability, by offering an alternative way to apply for job openings. This alternative method is available for those who cannot otherwise complete the online application due to a disability or need for accommodation. MAG provides reasonable accommodation to applicants under the guidance of the Americans with Disabilities Act (ADA), Section 503 of the Rehabilitation Act of 1973, the Vietnam-Era Veterans’ Readjustment Assistance Act of 1974, and certain state and/or local laws. If you need assistance due to a disability, please contact the MAG Aerospace Recruiting email: Applicant.Assist@magaero.com or call (703) 376-8993.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-03T03:29:39.000Z"
    },
    "company": {
        "name": "MAG Aerospace",
        "link": "https://www.linkedin.com/company/magaerospace"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 48,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Lawton",
        "region": "OK",
        "postal_code": "73502",
        "street_address": null,
        "latitude": 34.606377,
        "longitude": -98.39682
    }
}