{
    "job": {
        "title": "Site Reliability Engineer",
        "industry": "",
        "description": "GoFormz is a San Diego-based startup leading the mobile data capture industry. We empower businesses to replace paper forms with web and mobile-based digital forms that provide global access to the collected data. We are currently looking for a proactive and proven Site Reliability Engineer to add to our growing team. As Site Reliability Engineer , you will drive the optimization, efficiency, and reliability of our 100% cloud infrastructure and technologies. The successful candidate will be skilled at navigating and communicating through platform issues in order to calmly and systematically identify root cause and apply remediation steps. The Details: Work with multiple departments to identify, isolate, and resolve issues impacting the company’s platform performance and uptime Monitor, maintain, coordinate and extend the company’s existing production monitoring systems Manage on-call rotation schedule, procedures, and performance Collaborate on the development of after-incident post mortems Develop tools and playbooks to resolve production issues more efficiently and quickly Review performance metrics and identify opportunities to improve the end user experience The Must Haves: Azure Cloud technologies Kubernetes Azure automation and runbooks Azure Monitor & Log Analytics Adept with Powershell scripting, automation of complex administrative tasks, automated installation and configuration of software/roles Cloud VM management Incident problem management and trend analysis experience High degree of ownership and accountability The Nice to Haves: Azure Active Directory Raygun Error Logging Azure Security Center Azure Sentinel Experience managing and maintaining code repos, build systems, and CI/CD pipelines Can write tooling and code to interact with REST APIs SQL/Mongo Administration The Benefits : We pay well- at or above market!. Plus, you’ll get equity in the company. Employee medical and dental paid by the company; you just cover vision. 4 weeks (160 hours) accrued paid vacation in your first year. Options to work from home or from our vibrant office in downtown San Diego where we provide complimentary parking or a monthly MTS pass. We care about your physical health. Our office is equipped with automatic sit/stand desks, plus you’ll get a company-paid membership to the Broadway Athletic and Swim Club located in the same building. Everyone has the best hardware for doing their particular job. You tell us what that is. We have a fantastic team that gets stuff done and is fun to work with! The environment is fast-paced, so you will see the results of your work immediately. You will have plenty of opportunities to use and learn cutting-edge technologies.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-09-01T20:49:51.000Z"
    },
    "company": {
        "name": "GoFormz",
        "link": "https://www.linkedin.com/company/goformz"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "San Diego",
        "region": "CA",
        "postal_code": "92161",
        "street_address": null,
        "latitude": 32.71576,
        "longitude": -117.16382
    }
}