{
    "job": {
        "title": "Data Scientist",
        "industry": "Computer Software",
        "description": "Data Scientist We are looking for people who share our core values of heroism, audacity, curiosity, and excellence to join our team. We are a tight-knit group of engineers, analysts, and business professionals who have organically built a company that monitors more than 8% of the Internets public IP space and 40 trillion business communications per year. We've had a huge impact on the Fortune-50 and Government sectors over the past year, so we're looking to grow rapidly while maintaining our culture and diversity. As a cyber resilience company, we solve security, continuity, regulatory, and efficiency problems for our customers. Youll help protect the jobs and security of millions of people while working on and advancing novel techniques in computer science. Youll be connected to everything thats happening; every developer on the team is responsible for our products quality, everyone ships production code, and everyone directly supports the mission. As a Data Scientist at Redjack, youll be responsible for developing machine learning and data classification approaches to automate the understanding and protection of the worlds largest digital enterprises. Your data science skills will be translated into opportunities for customers through the use of algorithmic, statistical, machine learning, and visualization techniques. You will demonstrate initiative and creativity by proposing ways to address problems often with large or incomplete data sets and validate findings using an experimental and iterative approach. Your job Your job will be to analyze big data. Identify business trends and problems through complex streaming and big data analysis. Interpret results from multiple sources using a variety of techniques, ranging from data aggregation and normalization via statistical analysis to complex custom software approaches. Design, develop and implement novel detectors and classifiers of critical systems and activity through machine learning and other modern approaches. What you should have accomplished Well assess your skills and ensure your impact will scale with your ability. What were looking for to start: Bachelors degree, Masters degree, or Ph.D. in mathematics, statistics, engineering, or computer science. Knowledge of modern data science and machine learning approaches, big data analytics, and software development skills. Knowledge and ability to explain both the code and the underlying statistical or analysis approaches used by modern data science algorithms/models. Cross-functional collaboration skills. Analytical and problem-solving skills. Effective communication skills, critical thinking, and strategic thinking skills above and beyond the technical knowledge and implementation experience. PM20",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-05T07:35:08.000Z"
    },
    "company": {
        "name": "Redjack",
        "link": "https://www.linkedin.com/company/redjack"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Silver Spring",
        "region": "MD",
        "postal_code": "20993",
        "street_address": null,
        "latitude": 38.99766,
        "longitude": -77.02702
    }
}