{
    "job": {
        "title": "Cloud Engineer",
        "industry": "Telecommunications",
        "description": "If you are a Cloud Engineer with experience, please read on! What You Will Be Doing On-premise to Azure migrations Deploy Azure products (VMs, VPN, Backups, etc) Troubleshooting and Maintenance of Azure Environments Proper documentation (Manuals, KB Articles, Troubleshooting, etc) Manage ticketing system and escalations Technical support of local user programs (Windows, Office, etc) Support of Azure and VM user experiences What You Need for this Position Azure AWS Migrations Data Center Active Directory VPN Networking Network Administration What's In It for You Competitive Salary Medical Benefits Dental and Vision Benefits Life Insurance Short-Term Disability Insurance Flexible Spending Account (FSA) 401 (K) Program Paid Vacation Paid Holiday Paid Sick Time So, if you are a Cloud Engineer with experience, please apply today! Email Your Resume In Word To Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also: Clinton.Kertcher@CyberCoders.com Please do NOT change the email subject line in any way. You must keep the JobID: linkedin : CK8-1644892 -- in the email subject line for your application to be considered.*** Clinton Kertcher - Recruiter - CyberCoders Applicants must be authorized to work in the U.S. CyberCoders, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire. CyberCoders will consider for Employment in the City of Los Angeles qualified Applicants with Criminal Histories in a manner consistent with the requirements of the Los Angeles Fair Chance Initiative for Hiring (Ban the Box) Ordinance.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-25T17:46:31.000Z"
    },
    "company": {
        "name": "CyberCoders",
        "link": "https://www.linkedin.com/company/cybercoders"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Los Angeles",
        "region": "CA",
        "postal_code": "90101",
        "street_address": null,
        "latitude": 34.05224,
        "longitude": -118.24335
    }
}