{
    "job": {
        "title": "Data Scientist",
        "industry": "Defense &amp; Space",
        "description": "Tyto Athene GSI has an opening for a Data Scientist to support JADC2/ABMS concept and capability development. Position is located in Fairborn, OH and also assist with network planning for JADC2/ABMS related events and execution of network related task orders. GSI will compete to develop and field networks for JADC2/ABMS programs. Design cloud-based data repositories across domains that are discoverable, enabling publish subscribe approaches servicing various consumers across the DoD. These repositories contain data that consists of structured and unstructured data and where possible, this data will be meta tagged for further analytics and as well as fusion purposes. Propose machine learning and further enhance the artificial intelligence (AI) algorithms to provide previously unrealized military utility in decision aides Responsibilities: Performs technical sales support as the Data Scientist for the ABMS program team. Authors concept papers and technical proposals in response to JADC2/ABMS acquisition requests. Develops solutions for complex data sets across multiple security levels. Participates in JADC2/ABMS related planning activities. Proposes data integration solutions for lead DoD planners and executes upon approval. Collaborates within GSI ABMS team to create unique state of the art solutions across ABMS developmental categories. Collaborates within to translate and deliver commercial solutions to meet DoD use case demands. Coordinates within to evolve commercial solutions to meet unique DoD requirements. Collaborates with industry partners to broaden reach and, when necessary, leverage non- solutions to deliver the best available solutions for DoD. Designs and develops methods, processes, and systems to consolidate and analyze data, both structured and unstructured, and its sources, including big data. Develops and uses advanced software programs, algorithms, querying and automated processes to cleanse, integrate and evaluate datasets. Models complex DoD problems and is familiar with natural language processing, machine learning, predictive modeling, statistical analysis, and hypothesis testing. Works with cross-discipline teams to ensure connectivity between various databases and systems. Continual process improvement activities include data, processes, interfaces, tools, and technology insertion. Supports defining specific process improvement projects, identifies meaningful insights, interprets and communicates findings and makes recommendations including process improvement opportunities. May develop information tools, algorithms, dashboards, and queries to monitor and improve business performance. Maintains awareness of emerging analytics and big-data technologies. Support ABMS program manager with other duties, as required. Qualifications: Requires an active TS/SCI Clearance. Requires BS and 4-8 years of prior relevant experience or Master degree with 2-6 years of prior relevant experience. Excellent understanding of machine learning techniques and algorithms, such as k-NN, Naive Bayes, SVM, Decision Forests, etc. Experience with common data science toolkits, such as R, Weka, NumPy, MatLab, etc. Excellence in at least one of these is highly desirable Experience with data visualization tools, such as D3.js, GGplot, etc. Proficiency in using query languages such as SQL, Hive, Pig Experience with NoSQL databases, such as MongoDB, Cassandra, HBase Good applied statistics skills, such as distributions, statistical testing, regression. Good scripting and programming skills. Ability to work independently to achieve day-to-day objectives with significant impact on operational results or project deliverables. Record of leading teams to develop technical solutions requiring collaboration with internal experts, deep analyses and understanding of impact on end-product/solution. Strong written and verbal communication skills. Previous experience with Department of Defense innovation initiatives and organizations (DARPA/AFRL/AFWERX/KESSEL RUN). Equal Opportunity Employer: Disability/Veteran",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-16T21:01:08.000Z"
    },
    "company": {
        "name": "Tyto Athene, LLC",
        "link": "https://www.linkedin.com/company/gotyto"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 48,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Fairborn",
        "region": "OH",
        "postal_code": "45324",
        "street_address": null,
        "latitude": 39.80217,
        "longitude": -84.021324
    }
}