{
    "job": {
        "title": "Software Engineer Manager",
        "industry": "Information Technology and Services",
        "description": "Primary Responsibilities: ·      Responsible for Fullstack Application Development Management- .Net for the Managed Care LOB ·      Keep the current/upcoming projects on track/resourced appropriately. Manage, develop, lead personnel and provide documentation related to performance and delivery. ·      Cover all primary development activity across all technology functions that ensure we deliver code with high quality for our applications, products and services and to understand customer needs and to develop product roadmaps. These roles include, but are not limited to analysis, design, coding, engineering, testing, debugging, standards, methods, tools analysis, documentation, research and development, maintenance, new development, operations and delivery ·      Evaluate new tools, new techniques, strategies; Automation of common tasks; build of common utilities to drive organizational efficiency with a passion around technology and solutions and influence of thought and leadership on future capabilities and opportunities to apply technology in new and innovative ways Required Qualifications: ·      7+ years’ experience working with .NET Technologies: C#, ASP.NET and MVC ·      SQL experience: querying, table design, DB administration, stored procedures, etc. ·      Continuous Integration/Continuous Delivery ·      JavaScript, HTML, HTTP, CSS, and JQuery ·      Experience implementing API Webservices ·      Proven experience managing the full development life cycle including discovery, implementation, and delivery (on time and on budget) ·      Design and estimate leadership Preferred Qualifications: ·      Agile ·      Facets ·      CSS framework such as Bootstrap ·      Javascript frameworks such as Angular, Backbone, or React/Redux ·      MSBuild, Jenkins, JPAC, Containers ·      Test Driven Delivery (TDD) ·      TFS, Git, Powershell ·      MS Visual Studio Information and technology have amazing power to transform the health care industry and improve people's lives. This is where it's happening. This is where you'll help solve the problems that have never been solved. We're freeing information so it can be used safely and securely wherever it's needed. We're creating the very best ideas that can most easily be put into action to help our clients improve the quality of care and lower costs for millions. This is where the best and the brightest work together to make positive change a reality. This is the place to do your life's best work.(sm) Eight Eleven Group provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, national origin, age, sex, citizenship, disability, genetic information, gender, sexual orientation, gender identity, marital status, amnesty or status as a covered veteran in accordance with applicable federal, state, and local laws.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-20T22:54:33.000Z"
    },
    "company": {
        "name": "Brooksource",
        "link": "https://www.linkedin.com/company/brooksource"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 84,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Greater Phoenix Area",
        "region": null,
        "postal_code": "85003",
        "street_address": null,
        "latitude": 33.44547,
        "longitude": -112.06631
    }
}