{
    "job": {
        "title": "[Seattle] Machine Learning Engineer, NLP (Junior &amp; New Grad)",
        "industry": "Marketing and Advertising,Computer Software,Internet",
        "description": "About News Break Description News Break defines a new way for users to engage with local news. Since its founding in 2015, it has grown by leaps and bounds. We’re the nation's largest intelligent local news platform! News Break is ranked the #1 news app on both iOS and Android in 2020 with 45M+ monthly active users. We're a series-C startup headquartered at Mountain View, California. For more information, visit www.newsbreak.com/about About The Role Responsibilities Develop highly scalable tools leveraging machine learning models to solve problems such as text classification, document clustering, topic modeling, text generation and recommendation Develop in-house machine learning tools and pipelines to support fast experimentation of machine learning models Work with other engineers to identify and solve machine learning problems Minimum Qualifications Requirements Experience in one or more of the following areas: deep learning, natural language processing, recommendation systems, and data mining Experience with machine learning frameworks such as TensorFlow, PyTorch or MXNet Expert knowledge in C/C++ and Python Preferred Qualifications MS degree in Computer Science or related quantitative field with 3+ years of machine learning related work or research experience, or PhD degree in Computer Science or related quantitative field Contributions to research communities/efforts, including publishing papers in machine learning (AAAI, ICLR, NeurIPS, ICML, KDD, CVPR) Benefits We provide a highly competitive compensation package including base salary, bonuses, and stock options. Benefits include great Medical, Dental and Vision. A flat organization and family-like culture makes this a perfect environment to make huge impact on our product and grow your skill set.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-14T12:53:18.000Z"
    },
    "company": {
        "name": "NewsBreak",
        "link": "https://www.linkedin.com/company/particle-media-inc-"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Bellevue",
        "region": "WA",
        "postal_code": "98007",
        "street_address": null,
        "latitude": 47.6137,
        "longitude": -122.19093
    }
}