{
    "job": {
        "title": "Data Scientist - Entry Level",
        "industry": "Construction,Information Technology and Services,Mechanical or Industrial Engineering",
        "description": "Company Description Join us and make YOUR mark on the World! Are you interested in joining some of the brightest talent in the world to strengthen the United States’ security? Come join Lawrence Livermore National Laboratory (LLNL) where our employees apply their expertise to create solutions for BIG ideas that make our world a better place. We are committed to a diverse and equitable workforce with an inclusive culture that values and celebrates the diversity of our people, talents, ideas, experiences, and perspectives. This is essential to innovation and creativity for continued success of the Laboratory’s mission. Job Description We have openings for Data Scientists to provide solutions for various projects. You will work in a dynamic, multidisciplinary team of independent/entrepreneurial computer scientists and engineers who research, develop, and integrate state-of-the-art algorithms, software, hardware, and computer systems solutions to challenging research and development problems. This position is in the Global Security Computing Applications Division in the Computing Directorate. In this role you will Collaborate with scientists and researchers in one or more of the following areas: data intensive applications, text processing, graph analysis, machine learning, statistical learning, information visualization, low-level data management, data integration, data streaming, scientific data mining, data fusion, massive-scale knowledge fusion using semantic graphs, database technology, programming models for scalable parallel computing, application performance modeling and analysis, scalable tool development, novel architectures (e.g., FPGAs, GPUs and embedded systems), and HPC architecture simulation and evaluation. Work with other LLNL scientists and application developers to bring research results to practical use in LLNL programs. Assess the requirements for data sciences research from LLNL programs and external government sponsors. Carry out development of data analysis algorithms to address program and sponsor data sciences requirements. Engage other developers frequently to share relevant knowledge, opinions, and recommendations, working to fulfill deliverables as a team. Contribute to technical solutions, participate as a member of a multidisciplinary team to analyze sponsor requirements and designs, and implement software and perform analyses to address these requirements. Develop and integrate components-such as web-based user interfaces, access control mechanisms, and commercial indexing products-for creating an operational information and knowledge discovery system. Perform other duties as assigned. Security Clearance: This position requires a Department of Energy (DOE) Q-level clearance. If you are selected, we will initiate a Federal background investigation to determine if you meet eligibility requirements for access to classified information or matter. In addition, all L or Q cleared employees are subject to random drug testing. Q-level clearance requires U.S. citizenship. If you hold multiple citizenships (U.S. and another country), you may be required to renounce your non-U.S. citizenship before a DOE L or Q clearance will be processed/granted. Qualifications Bachelor’s degree in computer science, computer engineering, or related field, or the equivalent combination of education and related experience. Fundamental knowledge of one or more of the following: high performance computing, scientific data analysis, statistical analysis, knowledge discovery, computer security, systems programming, large-scale data management, and big data technologies. Skilled in all aspects of the software project life cycle: feasibility, requirements, design, implementation, integration, test and deployment. Fundamental experience developing software with C++, C, Java, Python, R, or Matlab, software applications in Linux, UNIX, Windows environments, data analysis algorithms, data management approaches, relational databases, or machine learning algorithms. Ability to effectively handle concurrent technical tasks with conflicting priorities, to approach difficult problems with enthusiasm and creativity and to change focus when necessary, and to work independently and implement research concepts in a multi-disciplinary team environment, where commitments and deadlines are important to project success. Sufficient interpersonal skills necessary to interact with all levels of personnel. Sufficient verbal and written communication skills necessary to effectively collaborate in a team environment and present and explain technical information. Additional Information Why Lawrence Livermore National Laboratory? Included in 2021 Best Places to Work by Glassdoor! Work for a premier innovative national Laboratory Comprehensive Benefits Package Flexible schedules (*depending on project needs) Collaborative, creative, inclusive, and fun team environment Learn more about our company, selection process, position types and security clearances by visiting our Career site. Security Clearance LLNL is a Department of Energy (DOE) and National Nuclear Security Administration (NNSA) Laboratory. Some positions will require a DOE L or Q clearance (please reference Security Clearance requirement above). If you are selected and a clearance is required, we will initiate a Federal background investigation to determine if you meet eligibility requirements for access to classified information or matter. In addition, all L or Q cleared employees are subject to random drug testing. An L or Q clearance requires U.S. citizenship. For additional information please see DOE Order 472.2. Equal Employment Opportunity LLNL is an affirmative action and equal opportunity employer that values and hires a diverse workforce. All qualified applicants will receive consideration for employment without regard to race, color, religion, marital status, national origin, ancestry, sex, sexual orientation, gender identity, disability, medical condition, pregnancy, protected veteran status, age, citizenship, or any other characteristic protected by applicable laws. If you need assistance and/or a reasonable accommodation during the application or the recruiting process, please submit a request via our online form. California Privacy Notice The California Consumer Privacy Act (CCPA) grants privacy rights to all California residents. The law also entitles job applicants, employees, and non-employee workers to be notified of what personal information LLNL collects and for what purpose. The Employee Privacy Notice can be accessed here.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-06T04:02:30.000Z"
    },
    "company": {
        "name": "Lawrence Livermore National Laboratory",
        "link": "https://www.linkedin.com/company/lawrence-livermore-national-laboratory"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Livermore",
        "region": "CA",
        "postal_code": "94551",
        "street_address": null,
        "latitude": 37.675915,
        "longitude": -121.758865
    }
}