{
    "job": {
        "title": "Machine Learning Engineer",
        "industry": "Marketing and Advertising,Computer Software,Internet",
        "description": "InCloudCounsel is seeking a Machine Learning Engineer to help our rapidly growing team deliver automatic negotiation with computable contracts. If you are a data or ML professional looking for a company that is financially-healthy, rapidly scaling, and impacting the trajectory of an industry, we would love to get to know you! InCloudCounsel is an industry leader in modernizing routine legal processes. Our global team works with many of the world's leading companies to offer robust end-to-end contract processing and obligation management solutions that combine cutting edge technology, deep industry expertise, and a world-class roster of legal professionals. The Machine Learning Engineer will report directly to our Director of Machine Learning and the package includes a competitive base salary, equity, and full benefits. The preferred locations for this role are San Francisco, Los Angeles, Seattle, Austin, New York, Denver, Philadelphia, Miami, Chicago, or Mexico City .* Until further notice, all InCloudCounsel employees are working remotely from home. What You'll Do Collaborate with our product team to build ML-enabled tools that help our end users work with increased accuracy while simultaneously driving down the cost associated with processing routine legal contracts Work cross-functionally to understand the structure and anatomy of critical legal documents and apply this anatomy to develop legal intelligence and automation Train and optimize machine learning models using a variety of tools and frameworks Build tools and frameworks to train, store, serve, and analyze machine learning models Work with our data infrastructure team to help build and maintain data systems (we run on Heroku and AWS) Basic Qualifications Experience: 4+ years of industry work experience Relevant programming experience: excellent knowledge of Python for data analysis, data processing, and server programming. We use numpy, pandas, spacy, NLTK, scikit-learn, pytorch, tensorflow, keras, and many other libraries. This is our preferred tech stack, but if you have comparable experience in a different stack that's fine too. Applied science skills: relevant experience with machine learning, natural language processing, neural networks, computational linguistics, knowledge graphs, or taxonomies Domain expertise: experience with text classification, key-phrase extraction, question answering, word embeddings, representation learning, neural machine translation, language modeling, text summarization, text generation, and/or knowledge graphs is a plus Proficiency with data technology: strong skill set and experience using modern data technologies (SQL, Snowflake, Postgres, Spark, Dask, Pandas) About the team: We're all about freedom. InCloudCounsel is on a mission to free companies from outdated legal processes and corporate lawyers from outdated work models. We're a group of former Big Law lawyers, business professionals, and engineers working together to modernize the legal industry. The people behind developing our product, servicing our customers and lawyer partners, and driving our business operations are dynamic individuals who have also achieved the freedom to do what's important to them - they're musicians, dancers, photographers, sailors, surfers, world travelers, home flippers, and animal lovers - and our freedom inspires us to free others. Benefits Medical, dental, and vision insurance 401K, pre-tax benefits Parental leave Generous vacation policy Annual professional development stipend Remote work flexibility In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification form upon hire. NOTE to External Agencies: We are not accepting any blind submissions or resumes from recruitment agencies. Any resumes sent to a member of InCloudCounsel will NOT be accepted or considered as a submission.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-25T11:39:59.000Z"
    },
    "company": {
        "name": "InCloudCounsel",
        "link": "https://www.linkedin.com/company/incloudcounsel"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 48,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Los Angeles",
        "region": "CA",
        "postal_code": "90101",
        "street_address": null,
        "latitude": 34.05224,
        "longitude": -118.24335
    }
}