{
    "job": {
        "title": "Data Scientist",
        "industry": "Information Technology and Services,Retail,Financial Services",
        "description": "Position Summary... What You'll Do... If you’re thinking ‘scale’, think bigger and don’t stop there. At Walmart Labs we don’t just innovate, we enable transformations across stores and different channels for the Walmart experience. Take a regular day at Walmart Labs and match that with 260 million customers a week, 11,695 stores, under 59 banners in 28 countries and e-commerce websites in 11 countries. That’s Walmart Labs for you. We innovate to deliver a simple and seamless experience for our customers. Our tech talent solves the biggest and most complex problems. They drive digital transformation where data and analytics are enabling us to better serve our customers and create a digital relationship with them. As our customers evolve and adapt, we are taking it a few notches further here. We’re changing what customers can expect from the experience of shopping, from the physical stores, to mobile, social, and even online; we’re not just ready for the future of shopping, we’re creating it. Our Ideal Candidate You have a deep interest and passion for technology. You love writing and owning codes and enjoy working with people who will keep challenging you at every stage. You have strong problem solving, analytic, decision-making, and excellent communication with interpersonal skills. You are self-driven and motivated with the desire to work in a fast-paced, results-driven agile environment with varied responsibilities. You’ll sweep us off our feet if… You have proficiency in machine learning algorithms such as multi-class classifications, decision trees, support vector machines, time series forecasting, deep learning, and anomaly detection You have a strong understanding of probability and statistical models (generative and descriptive models) Hands-on experience building large scale optimization models (Linear Programming, Integer Programming, etc.) Ability to run experiments scientifically and analyze results Ability to effectively communicate technical concepts and results to technical and business audiences in a comprehensive manner Ability to collaborate effectively across multiple teams and stakeholders, including analytics teams, development teams, product management and operations) Strong CS fundamentals in algorithms, data structures and functional programming. Strong Experience with Big Data processing (Spark/BigQuery) Productionize the developed Machine Learning solutions Hands on Experience with Azure Cloud and Databricks Strong background in ML algorithms for time series forecasting. Strong background in Statistics. Familiarity with Deep Learning algorithms. Expert knowledge and experience with Python Scripting skills in at least one of the following: Shell, Perl, Python, Bash, or Ruby Experience with Performance Engineering including testing, tuning, and monitoring tools. You’ll Make An Impact By Understands and translates business and functional needs into AI/ML problem statements. Build complex data sets from multiple data sources, both internally and externally. Develop custom data models to drive innovative business solutions to increase revenue and membership. Sift and analyze data from multiple angles, looking for trends that highlight problems or opportunities. Use strong business acumen, as well as an ability to communicate findings, and mine vast amounts of data for useful insights. Apply innovative and scientific/quantitative approaches to draw conclusions and make recommendations to answer business objectives. Design, coordinate, and implement data driven business and technology solutions to support innovation initiatives Communicate complex models, analysis, and recommendations in a clear and precise manner Provide thought leadership in statistical modeling and machine learning/ AI. NLP and Deep Learning are the two focus areas Deliver actionable insights to stakeholders through rich visualization and presentation Manage priorities between research and deliverables effectively Collaborate actively with topic owners to understand and develop advanced analytics / data science About The Team The Data Strategy & Insights organization at Walmart provides Data Foundation Infrastructure, Visualization Portal, Machine Learning Platform, Customer platform and Data Science products that form part of core platforms and services that drive Walmart business. The group also develops analytical products for several verticals like Marketing, Finance, Supply chain, Pricing, Customer, HR etc. Our team is responsible for creating and internalizing data science solutions for Walmart customers across the Globe and shopping in various ways like in Brick-and-Mortar Store, dot com, mobile etc. The team is responsible for time critical, business critical and highly reliable solutions and products that influence Walmart business. The team is spread over multiple locations, and we work towards providing the best experience to our customers. Benefits & Perks Beyond competitive pay, you can receive incentive awards for your performance. Other great perks include 401(k) match, stock purchase plan, paid maternity and parental leave, PTO, multiple health plans, and much more. About Walmart Join Walmart and your work could help over 265 million global customers live better every week. Yes, we are the Fortune #1 company. But you’ll quickly find we’re a company who wants you to feel comfortable bringing your whole self to work. A career at Walmart is where the world’s most complex challenges meet a kinder way of life. Our mission spreads far beyond the walls of our stores. Join us and you'll discover why we are a world leader in diversity and inclusion, sustainability, and community involvement. From day one, you’ll be empowered and equipped to do the best work of your life. Minimum Qualifications... Outlined below are the required minimum qualifications for this position. If none are listed, there are no minimum qualifications. Option 1: Bachelors degree in Statistics, Economics, Analytics, Mathematics, Computer Science, Information Technology or related field and 2 years' experience in an analytics or related field. Option 2: Masters degree in Statistics, Economics, Analytics, Mathematics, Computer Science, Information Technology or related field. Option 3: 4 years' experience in an analytics or related field. Preferred Qualifications... Outlined below are the optional preferred qualifications for this position. If none are listed, there are no preferred qualifications. Data science, machine learning, optimization models, Master’s degree in Machine Learning, Computer Science, Information Technology, Operations Research, Statistics, Applied Mathematics, Econometrics, Successful completion of one or more assessments in Python, Spark, Scala, or R, Using open source frameworks (for example, scikit learn, tensorflow, torch) Primary Location...350 N SAINT PAUL ST, DALLAS, TX 75201-4240, United States of America",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-12T22:18:47.000Z"
    },
    "company": {
        "name": "Walmart",
        "link": "https://www.linkedin.com/company/walmart"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 48,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Dallas",
        "region": "TX",
        "postal_code": "75342",
        "street_address": null,
        "latitude": 32.777977,
        "longitude": -96.79621
    }
}