{
    "job": {
        "title": "Software Engineer I",
        "industry": "Medical Devices,Hospital &amp; Health Care,Pharmaceuticals",
        "description": "Careers that Change Lives In this exciting role you will provide services to support the Software Development and Information Technology Operations of safety critical software for medical devices which over 400,000 people depend on each day. A career at Medtronic is like no other. We’re purposeful. We’re committed. And we’re driven by our Mission to alleviate pain, restore health and extend life for millions of people worldwide. A Day in the Life Partners with development teams to establish the file structure of the project Source Control libraries Ensures all project source materials are maintained in the Source Control library including software source code and project documentation Administers the Source Control tool providing maintenance and troubleshooting Partners with development teams and System Administrators in the establishment of project environments, including, define and document project environment requirements, project servers set up, and deployment of project & 3rd party software Document, schedule, and executes project software builds. Document SCM Plans, Release and Build Procedures Prepares, reviews, submits, maintains and provides status on project/product documentation Performs and documents software builds using existing build procedures and scripts Supports analysis of build data to report and communicate software build results (status, errors. etc.) Writes basic scripts (e.g., support build, test, static analysis) and maintain more complex scripts Performs validation activities of software development tools Gathers required metrics and generates/provides reports as directed Integrates verification tools into build process under direction of engineers Responsibilities may include the following and other duties may be assigned Designs, develops, tests, debugs and implements operating systems components, software tools and utilities. Determines systems software design requirements. Ensures that system improvements are successfully implemented and monitored to increase efficiency. Generates systems software engineering policies, standards and procedures. Must Have: Minimum Requirements Bachelor’s degree in Engineering or Sciences Nice to Have Experience on a variety of DevOps toolsets (IAR, Surround, GIT, Integrity PLM, etc) Strong knowledge of configuration management industry standards and best practices Knowledge of Software Development Life Cycle (SDLC) Experience in specifying and implementing DevOps solutions with IT to support distributed software teams Significant experience and success in development of scripts and applications to facilitate automation of software builds and releases Expert knowledge of the underlying concepts of Branching, Merging, and Archiving software throughout the development lifecycle In depth knowledge of software configuration management processes and practices. Applies knowledge of the software development environment (from end user perspective) to ensure usability of SCM processes Experience creating application specific documentation and ensure dependencies and compatibilities through appropriate verification Solution orientated, generates multiple innovative solutions to complex or critical About Medtronic Together, we can change healthcare worldwide. At Medtronic, we push the limits of what technology, therapies and services can do to help alleviate pain, restore health and extend life. We challenge ourselves and each other to make tomorrow better than yesterday. It is what makes this an exciting and rewarding place to be. We want to accelerate and advance our ability to create meaningful innovations - but we will only succeed with the right people on our team. Let’s work together to address universal healthcare needs and improve patients’ lives. Help us shape the future. Physical Job Requirements The physical demands described within the Responsibilities section of this job description are representative of those that must be met by an employee to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. For Office Roles: While performing the duties of this job, the employee is regularly required to be independently mobile. The employee is also required to interact with a computer, and communicate with peers and co-workers. Contact your manager or local HR to understand the Work Conditions and Physical requirements that may be specific to each role. (ADA-United States of America) Additional Information Posting Date: Sep 2, 2021 Travel: No",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-09-03T14:40:36.000Z"
    },
    "company": {
        "name": "Medtronic",
        "link": "https://www.linkedin.com/company/medtronic"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Northridge",
        "region": "CA",
        "postal_code": "91330",
        "street_address": null,
        "latitude": 34.24326,
        "longitude": -118.532364
    }
}