{
    "job": {
        "title": "Software Engineer",
        "industry": "Information Technology and Services",
        "description": "Check is a payroll-as-a-service API that lets you embed payroll directly in your vertical SaaS, HR, or time-tracking platform. Our API abstracts away the complexities of running payroll: tax calculation, remittance, and filing, plus the movement of money between companies and employees. This enables companies to easily build fully integrated payroll products to offer to their customers. Engineering is the core of Check. We believe payroll can and should be easy-to-use financial software, but getting there requires serious and sustained engineering effort. For our efforts, there is the deep satisfaction that comes from delivering people's paychecks. We are excited to bring on a new software engineer who will have an outsized impact on our systems and business along multiple fronts. For this role, we are seeking an individual with strong, full-stack software engineering skills, but also with a curiosity for systems, an entrepreneurial mindset, and high integrity. We believe that someone with this combination will unlock new ideas and solutions for our product and thrive in our team. In this role, you will: Ship code that calculates, transfers, and files taxes accurately and on time on a daily basis Distill the complexities of payroll into simple APIs for developers to use to build payroll Build frontend and backend components that improve customer integrations Influence the culture, values, and processes of a growing engineering team Communicate ideas and specifications through detailed, precise writing Work with our payroll ops, design, sales, and legal functions Commit on your first day, and deploy code continuously Support developers at customer companies Teach and learn from other engineers Interview prospective candidates Many backgrounds could fit this role, but ideal candidates will have: 3+ years of experience Built and scaled production web applications on the frontend and/or backend Production relational database experience Demonstrated product and design sensibilities Strong software development fundamentals Excellent verbal and written communication We use: Python (type-annotated) and Django for our API React and TypeScript for our frontends Postgres for our database AWS for our cloud infrastructure GitLab for issue tracking and CI/CD Our team is distributed across the US, with hubs in New York City and San Francisco. Don't see a role that fits your interests? If you're passionate about working at Check email us at hello@checkhq.com and tell us how you'd like to help. Check is proud to be an Equal Opportunity and Affirmative Action employer. We do not discriminate based upon race, religion, color, national origin, sex (including pregnancy, childbirth, or related medical conditions), sexual orientation, gender, gender identity, gender expression, transgender status, sexual stereotypes, age, status as a protected veteran, status as an individual with a disability, or other applicable legally protected characteristics. We also consider qualified applicants with criminal histories, consistent with applicable federal, state and local law. Check is committed to providing reasonable accommodations for candidates with disabilities in our recruiting process. If you need any assistance or accommodations due to a disability, please let us know at hello@checkhq.com with \"accommodations\" in the subject line.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-20T05:16:08.000Z"
    },
    "company": {
        "name": "Check",
        "link": "https://www.linkedin.com/company/check-technologies"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "San Francisco",
        "region": "CA",
        "postal_code": "94121",
        "street_address": null,
        "latitude": 37.78008,
        "longitude": -122.42016
    }
}