{
    "job": {
        "title": "Machine Learning Research Engineer",
        "industry": "Information Technology and Services",
        "description": "About Company: Quantiphi is an award-winning Applied AI and Big Data software and services company, driven by a deep desire to solve transformational problems at the heart of businesses. Our signature approach combines groundbreaking machine-learning research with disciplined cloud and data-engineering practices to create breakthrough impact at unprecedented speed. About the Unit: Applied-Research is an R&D practice at Quantiphi, focused on unraveling the frontiers of AI technologies with Applied ML at its core. With a multifaceted R&D strategy, we tackle ideating and building innovative solutions to cutting edge challenges, with advanced prototyping and scalable proofs of concept. Strengthened by the strategic partnerships working towards a generalized goal, we strive to leverage and demonstrate the major advances in AI to understand and transform the way humans collaborate with AI-systems in the near future. Note: If you have relevant experience as per the below job description, please register your details on the link provided. We would need you to go through an online ML test (30 mins) for screening. The ML test would contain multiple sections including Traditional ML algorithms, NNs, CNNs and Computer-Vision, RNNs, LSTMs and Sequential Learning, and Miscellaneous. While registering, please select a date* and a suitable slot** for the test as per your availability. You will receive an email with the test-link 5 mins before the selected time slot. Min work experience required - 2+ yrs (in ML and/or ML-Research) * For administrative purposes, please select a date that is at least 48 hrs away from the time of registration. For taking the test on a weekend, please register on/before Thursday end of day. Public Holidays exempted. ** Please pick one of the available 30-mins slots in the form Link to Register- https://forms.gle/tHyQuSEjFBSr2R8W7 Update on location: Currently remote, due to pandemic. Post pandemic, candidates should be willing to be relocated to Quantiphi office based out of either Mumbai / Bangalore, India. Responsibilities: Working with structured and unstructured data to build Traditional and Deep-Learning based models Explore multiple areas of AI research, old and new, and develop end-to-end ML pipelines to solve use cases Build rapid prototypes and conduct detailed experimental studies to prove concepts in multiple ML domains like Computer-Vision, NLP, Reinforcement Learning etc., in a well defined time-bound environment Work with Solution-Architects to build cutting edge solutions, benchmark various baselines and techniques Document the knowledge gained and disseminate to broader audience in multiple formats, working on technical content creation and publication, in conjunction with content-team and program managers Requirements: The position involves working with a diverse, lively, and proactive group of nerds who are constantly raising the bar on translating the latest AI research into tangible reusable assets for the community. Hence this would require a high level of conceptual understanding, attention to detail and agility in terms of adaptation to new technologies. Excellent in-depth understanding of ML concepts and the respective underlying mathematical know-how Hands-on experience in developing and deploying models in multiple ML areas like Computer-Vision, NLP etc Knowledge of Cloud-environments like GCP/AWS and ML frameworks like TensorFlow/PyTorch, with good experience in large scale distributed training Excellent coding skills and flexible mindset, with ability to quickly switch between & adapt to newer concepts Ability to translate abstract highlights into understandable insights in multiple knowledge-dissemination formats like Blogs, Presentations, Paper-Publications, Tutorials and Webinars Prior R&D experience, and/or publications at top-tier ML conferences will be a huge advantage",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-16T04:31:52.000Z"
    },
    "company": {
        "name": "Quantiphi",
        "link": "https://www.linkedin.com/company/quantiphi"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "IN",
        "locality": "Mumbai",
        "region": null,
        "postal_code": "400021",
        "street_address": null,
        "latitude": 18.969048,
        "longitude": 72.82118
    }
}