{
    "job": {
        "title": "Software Developer I",
        "industry": "Health, Wellness and Fitness,Hospital &amp; Health Care,Medical Practice",
        "description": "Position Summary The Development Group at Phoenix Childrens develops leading edge solutions for healthcare problems using a wide range of technologies. We provide a wide variety of outcome-focused, innovative and cost-saving applications that allow Phoenix Childrens to provide unsurpassed quality of care to patients no matter how complicated or difficult their problem. Utilizing Microsoft Visual Studio and the .NET Framework (VB.NET/C#), successful developers in this position will produce cutting edge, robust, enterprise level web applications, web services, Windows forms, and mobile applications (iOS/Windows Store) on a variety of platforms and devices. This position requires a self-motivated individual with excellent written and communication skills, and exposure to a broad range of technologies, including web applications (ASP.NET, HTML5, JavaScript, CSS, responsive web design), client applications (Windows Forms), mobile applications (iOS, Xcode, Cocoa Touch, Objective-C, WinJS, XAML/C#), and other technologies (MS SQL Server, SSIS, Powershell, Reporting Services). Key responsibilities will require collaboration with Healthcare professionals and Development team members to analyze business situations, determine the appropriate technologies needed, and produce working solutions. Significant emphasis is placed upon developer creativity, adherence to established Development coding standards, and ability to overcome difficulties. PCH Values Family-Centered care that focuses on the need of the child first and values the family as an important member of the care team Excellence in clinical care, service and communication Collaborative within our institution and with others who share our mission and goals Leadership that set the standard for pediatric health care today and innovations of the future Accountability to our patients, community and each other for providing the best in the most cost-effective way. Position Duties Develop software applications to meet the needs of the business. Work with users, Solution Architect, and other members of the group to determine a project specification, system design and architecture. Help define and ensure understanding of business logic and process flow. Ensure comprehension of the business purpose through observation, discussion and evaluation of the end user process. Demonstrate comprehension of the business process and purpose of systems developed. Balance the risk of new programming approaches with the need for a fast, effective outcome. Focus on the business purpose and effectiveness of the solution in meeting the need in a timely way. Provide on-going support for custom developed applications. Provide support for custom developed applications, including assessment of issues, documentation of resolution on support tickets, and completion of tickets with designated priority time frames. Help to maintain back-office applications and processes as needed. Provide professional, friendly, and supportive customer service to all end users. Follow development guidelines and standards. Follow established department processes for system deployment, testing and revisions. Follow the development programming guidelines and standards Communicate regularly with project team. Participate in project review meetings during the development life cycle with team members and end users. Prepare prototypes and written documentation to communicate ideas and vision to project team Maintain knowledge of current and future technologies. Participate in training initiatives for developers and users. Attend and participate in regular developer group meetings. Highlight new technologies that have a potential to impact PCH and educate other members of the group, through online training (e.g. PluralSight), developer conferences, and experimentation with new workplace technologies. Be a team player. Work to reduce duplication in systems and reports through experience and exposure to business needs and system implementation. Actively participate in providing advantages to the user that will encourage use of development for all in-house software. Undertake projects for the Director, CIO, and Administration team on an as needed basis. Develop creative and innovative initiatives to improve the services offered by the department. Meet with the leadership on weekly basis to review current issues/projects. Manage and continue to build existing relationships with key business, IT, vendors, and other stakeholders to support common goals of the department and organization. Performs miscellaneous job related duties as requested.",
        "employment_type": "OTHER",
        "date_posted": "2021-09-02T05:48:06.000Z"
    },
    "company": {
        "name": "Phoenix Children's Hospital",
        "link": "https://www.linkedin.com/company/phoenix-childrens-hospital"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Phoenix",
        "region": "AZ",
        "postal_code": "85009",
        "street_address": null,
        "latitude": 33.448204,
        "longitude": -112.072586
    }
}