{
    "job": {
        "title": "Entry Level Software Engineer",
        "industry": "Airlines/Aviation,Aviation &amp; Aerospace,Defense &amp; Space",
        "description": "Job Description At Boeing, we innovate and collaborate to make the world a better place. From the seabed to outer space, you can contribute to work that matters with a company where diversity, equity and inclusion are shared values. We’re committed to fostering an environment for every teammate that’s welcoming, respectful and inclusive, with great opportunity for professional growth. Find your future with us. The Boeing Company is currently seeking an Entry Level Software Engineer to join the C-17/CAS/BFMS Laboratory Operations Team located in Long Beach, CA . The selected candidate will work with senior engineers to design and develop test equipment and operate test equipment in a laboratory environment. Position overview is as follows: Assists with the documentation and maintenance of architectures, requirements, algorithms, interfaces and designs for software systems. Develops and maintains code and integrates software components into a fully functional software system. Assists with test procedures and documenting test results to ensure software system requirements are met. Gathers information to support software project management. Documents deployed processes and tools and collect metrics. Supports software research and development projects. Troubleshoots basic software issues. Works under close supervision. Primary Responsibilities: Participates in gathering and analyzing requirements for test measurement systems Assists in the development of test procedures, and instrumentation and configuration definition to perform the test within the constraints of the test plan Performs data analysis, develops and utilizes data processing tools Designs simple component level hardware or software Uses analytical tools to verify the design Verifies collection of complete data set Maintains test logs, prepares simple test reports and archives data Works under direct supervision This position must meet Export Control compliance requirements, therefore a “US Person” as defined by 22 C.F.R. 120.15 is required. “US Person” includes US Citizen, lawful permanent resident, refugee, or asylee. Basic Qualifications (Required Skill/Experience): Bachelor of Science degree in Engineering, Computer Science, Mathematics, Physics Programming experience in at least one or more of the following languages: C, C++, Java, Ada, C#, Python Preferred Qualifications (Desired Skills/Experience): Experience using common software version control tools such as Git Experience with Real-time software Experience debugging and troubleshooting technical problems involving computer memory or timing considerations A positive attitude towards learning, software quality, and teamwork Typical Education/Experience: Education/experience typically acquired through advanced technical education from an accredited course of study in engineering, computer science, mathematics, physics or chemistry (e.g. Bachelor) or an equivalent combination of technical education and experience. In the USA, ABET accreditation is the preferred, although not required, accreditation standard. Relocation: Relocation assistance is not a negotiable benefit for this position. Candidates must live in the immediate area or relocate at their own expense. Drug Free Workplace: Boeing is a Drug Free Workplace where post offer applicants and employees are subject to testing for marijuana, cocaine, opioids, amphetamines, PCP, and alcohol when criteria is met as outlined in our policies. Additional Job Description At Boeing, we strive to deliver a Total Rewards package that will attract, engage and retain the top talent. Elements of the Total Rewards package include competitive base pay and variable compensation opportunities. The Boeing Company also provides eligible employees with an opportunity to enroll in a variety of benefit programs, generally including health insurance, flexible spending accounts, health savings accounts, retirement savings plans, life and disability insurance programs, and a number of programs that provide for both paid and unpaid time away from work. The specific programs and options available to any given employee may vary depending on eligibility factors such as geographic location, date of hire, and the applicability of collective bargaining agreements.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-17T05:14:53.000Z"
    },
    "company": {
        "name": "Boeing",
        "link": "https://www.linkedin.com/company/boeing"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Long Beach",
        "region": "CA",
        "postal_code": "90808",
        "street_address": null,
        "latitude": 33.771713,
        "longitude": -118.18131
    }
}