{
    "job": {
        "title": "Software Test Engineer",
        "industry": "Electrical/Electronic Manufacturing,Construction,Computer Software",
        "description": "Aeroseal is hiring a Software Test Engineer! The Software Test Engineer will be primarily responsible for testing of, and developing test tools for, new and existing Aeroseal software applications on Windows, Linux, and web platforms. Secondarily, this role will be responsible for supporting and/or developing products and business processes; providing IT support to users of various Aeroseal technologies; writing software manuals, training material, and other software and support documentation. What You'll Do Work within a defined Product Development Process to: Develop DFMEA and DVP documents for the design. Assist Manufacturing and Quality Engineering as they develop Process, Process FMEA, Production test tools, Control Plans, Quality plan and metrics Test as per the design DVP and document results with clear, concise reports. Work within a defined Product Development Process to: Contribute to Product/System Requirements Documents Document all product-related specifications in an executable and testable format. Design software according to these requirements and document for later maintenance. Recognize, analyze, and document risks associated with executed design. Test software under revision control. Actively participate in distribution of software to customers and support, as necessary. Research new tools, methods, techniques, etc., to advance the state of the art. Experience You'll Need Minimum 4-year degree in Computer Science, or equivalent demonstrated experience Graduate or Postgraduate degree in Software Engineering, Computer Science, or Computer Engineering Proficiency in object-oriented software design and implementation (experience with VB.net, C#, C++ and/or Java a plus) Proficiency in web design a plus (Web frameworks e.g.React, Angular, jQuery, HTTP & Python) Linux experience a plus Experience with both MongoDB & relational databases a plus Experience with communications protocols a plus Technical Writing Who are we? A fast-growing company with award-winning technology that has created new products that are disrupting the HVAC industry. Yes, we have fun company amenities including a ping pong table, popcorn machine and company happy hours. Our team members play as hard as they work. But it takes more than amenities to be a great place to work. How is Aeroseal different? We Are Restless with curiosity and always asking if there's a better way Passionate about serving our dealers and customers Constantly learning, because we understand we must try new approaches to get new and better outcomes. There is more to our culture of innovation. But we also have a sense of urgency, so we won't list them all here. What's the rush? Well, our company has an ambitious mission. Aeroseal wants to make a lasting impact on people and the world around us, improving people's lives and making the world a better place in which to live. And we need your help to make it happen. Job Posted by ApplicantPro",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-14T00:00:00.000Z"
    },
    "company": {
        "name": "Aeroseal",
        "link": "https://www.linkedin.com/company/aeroseal-llc"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Miamisburg",
        "region": "OH",
        "postal_code": "45342",
        "street_address": null,
        "latitude": 39.641254,
        "longitude": -84.27778
    }
}