{
    "job": {
        "title": "Salesforce Sr. Software Engineer",
        "industry": "Sports",
        "description": "Parsons Xtreme Golf (PXG) was founded by American entrepreneur and philanthropist Bob Parsons with the sole intent to design and develop the world’s finest golf clubs – and we believe we have done just that! With no cost or time constraints, PXG is committed to the long process of researching various alloys, exploring new technologies, and identifying the unique properties that make PXG clubs perform unlike anything else. With no set product release cycles, the company takes its time and pours every ounce of innovation into each new club design. PXG offers a full lineup of right and left-handed golf clubs, including drivers, fairway woods, hybrids, irons, wedges, and putters, as well as a complete line of high-performance, fashion-forward apparel. Ready to join the PXG team? Description: The Senior Software Engineer is responsible for developing Salesforce Commerce Cloud e-commerce websites and applications through the entire development lifecycle, from gathering requirements to quality assurance, deployment, and maintenance phases. Responsibilities include implementing assigned development tasks and ensuring quality deliverables. Responsibilities: Gathering requirements from internal stakeholders Planning and developing websites and web applications Effectively presenting engineering decisions Working with team members to ensure quality code and deliverables Mentoring team members Improving processes to evolve change based on technological advances Keeping up with current technology and industry best practices Other responsibilities as requested Experience and Education: Experience with Salesforce Commerce Cloud (SFCC) 7+ years developing web applications 7+ years working with JavaScript and/or NodeJS 7+ years working with SQL databases Working knowledge of source control systems such as Git Familiar with developing cloud-based applications using NodeJS Familiar with client-side frameworks such as React and VueJs Familiar with service-oriented applications, deployment strategies, continuous integration, Gitflow, and test-driven development Familiar with web-based content management systems Skills Required: Salesforce Commerce Cloud development skills Excellent understanding of object-oriented languages and design patterns Excellent understanding of relational database design and SQL Excellent interpersonal skills for communicating effectively with internal and external teams Ability to prioritize and organize workflow to ensure quality and timeliness Thrive in a fast-paced multi-project environment Working Conditions: This position is located in an office environment and will be required to sit or stand for long periods of time working on a computer and talking on the phone. This position will be required to attend events and meetings outside of the office. PXG is a drug-free, smoke-free, and fragrance-free work environment. PXG believes in a diverse environment and is committed to equal employment opportunity and non-discrimination for all employees and qualified applicants without regard to a person's race, color, religion, creed, national origin or ancestry, ethnicity, sex, sexual orientation, gender (and gender identity or gender nonconformity), age, physical or mental disability, citizenship, past, current or prospective service in the uniformed services, genetic information or any other characteristic protected under applicable laws. PXG will make reasonable accommodations for qualified individuals with known disabilities, in accordance with applicable laws.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-18T22:08:51.000Z"
    },
    "company": {
        "name": "PXG (PARSONS XTREME GOLF)",
        "link": "https://www.linkedin.com/company/parsons-xtreme-golf"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 84,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Scottsdale",
        "region": "AZ",
        "postal_code": "85266",
        "street_address": null,
        "latitude": 33.494907,
        "longitude": -111.92606
    }
}