{
    "job": {
        "title": "Site Reliability Engineer",
        "industry": "Staffing and Recruiting",
        "description": "Job Title : Site Reliability Engineer (AWS or Azure certified) Location: Alpharetta, GA Type : Long term Contract Remote : Till Covid-19 MUST Have : AIX and Windows system administration Strong DB administration skills AWS / Azure certified Understanding of SRE concepts (Google SRE practice) Job Description : Build holistic visibility into SLIs, SLOs, and SLAs, dependency graphs, past performance of software, network, and system to ensure that we can continue to scale without increasing operational burden or toil., Assess the current state of the environment and drive initiatives in collaboration with the rest of the Organization to ensure transparency, resiliency, stability, reliability etc... Across both Applications & Infrastructure stack, initiatives for future state can vary from Incident Analysis leveraging ML & AI/ Assisting with Datacenter Stability & Consolidation effort to Application Transformation [Monolithic to Microservices, PaaS etc.], Enables the adoption and implementation of cloud-based application reliability, resiliency, and observability /deployment best practices for production & non-prod environments including public cloud migration of our mission critical applications from the onprem data-centers., Build infrastructure and drive projects that break things with the aim to improve the robustness of production systems. Due to the current scenario globally (COVID 19) as we are working remotely. If I miss to answer over the phone The BEST way to communicate is through an EMAIL. Best Regards, Syed Rizvi Delivery Lead Quantum World Technologies Inc. 199 West Hillcrest Dr Suite # 0112, Thousand Oaks CA – 91360 www.quantumworld.us Office: 805-222-0532 Ext-139 Fax : 805-834-0532 E: syed@quantumworld.us",
        "employment_type": "CONTRACTOR",
        "date_posted": "2021-08-24T23:24:31.000Z"
    },
    "company": {
        "name": "Quantum World Technologies Inc",
        "link": "https://www.linkedin.com/company/quantumworldtechnologies"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Alpharetta",
        "region": "GA",
        "postal_code": "30022",
        "street_address": null,
        "latitude": 34.075615,
        "longitude": -84.29455
    }
}