{
    "job": {
        "title": "Machine Learning Deployment Engineer",
        "industry": "Information Technology and Services,Computer Software,Internet",
        "description": "About The Company Clarifai is a leading, full-lifecycle deep learning AI platform for computer vision and natural language processing. We help organizations transform unstructured images, video, and text data into structured data at a significantly faster and more accurate rate than humans would be able to do on their own. Founded in 2013 by Matt Zeiler, Ph.D. Clarifai has been a market leader in AI since winning the top five places in image classification at the 2013 ImageNet Challenge. Clarifai continues to grow with employees remotely based throughout the United States and in Tallinn, Estonia. We have secured $40M in funding up to date, backed by Menlo Ventures, Google Ventures, USV, NVIDIA, Qualcomm, Osage, Lux Capital, LDV Capital, and Corazon Capital. Clarifai is proud to be an equal opportunity workplace dedicated to pursuing, hiring, and retaining a diverse workforce. Note: We are interested in every qualified candidate who is eligible to work in the United States. However, we are not able to sponsor visas for this particular opportunity, as we are looking for someone who is eligible to obtain a TS or Secret Clearance. Your Impact You will help address the advanced needs of public sector and commercial clients. You will help customers identify how Clarifai's tools can help address their business problem, and work with them on building this solution. You will be a front-line resource for machine learning/data science expertise. Responsibilities Deploy cutting edge complex technical solutions to solve our customers' most challenging problems You will build and maintain intuitive applications that will give users hands-on access to our machine learning platform and custom training, which allows users to train their own models without using any code. You will develop reusable modules, components, and build tools for both internal and external use cases. You will work with data annotation teams to wrangle data and generate cutting edge models, sometimes on the Company platform but sometimes in code. Requirements A minimum of 2 years of professional ML development experience Educational or work experience with machine learning or data science Strong Python (or other equivalent language) Command of computer vision techniques and practice Experience fielding/debugging complex systems - i.e. why is a model returning results that are unexpected? Great to Have Experience working directly with clients and customer Experience with public sector work Experience with Docker + Kubernetes Security Clearance",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-28T05:03:55.000Z"
    },
    "company": {
        "name": "Clarifai",
        "link": "https://www.linkedin.com/company/clarifai"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Washington",
        "region": "DC",
        "postal_code": "20398",
        "street_address": null,
        "latitude": 38.892063,
        "longitude": -77.01991
    }
}