{
    "job": {
        "title": "Data Scientist/Machine Learning Engineer",
        "industry": "",
        "description": "About the Role Come join our creative team that is on a mission to making Data Analysts and Engineers more productive, by drastically reducing the time required to build pipelines and wrangle the log data for further analysis. As a Machine Learning Engineer, your responsibility will be to develop novel approaches to analyzing data from log files generated by Networking devices, applications, databases, and other infrastructure. Roles and Responsibilities Optimize machine learning models to scale in real-time streaming applications. Develop ML models to support anomaly detection from IT infrastructure environments Design, develop and evaluate state-of-the-art machine learning models for complex, large-scale data sets Embrace a fast-paced, collaborative environment dedicated to building cutting-edge technology solutions using machine learning. What you will need 2-4 years of programming experience in Python, Scala, C, C++ At least 2 years of experience with the PyData ecosystem (NumPy, Pandas, and Scikit-learn) Experience in analyzing machine-generated data from applications, networking devices, other infrastructure Bachelor’s degree in STEM field or equivalent work experience in related field Ability to work in a fast-paced startup environment with quick turnaround time security clearance is a plus Sliceup is an equal opportunity employer, dedicated to diversity, equality, and inclusion, and provides equal employment opportunities to all employees and applicants for employment. Sliceup prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-09-01T02:40:35.000Z"
    },
    "company": {
        "name": "Sliceup",
        "link": "https://www.linkedin.com/company/sliceup"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Boston",
        "region": "MA",
        "postal_code": "02118",
        "street_address": null,
        "latitude": 42.358994,
        "longitude": -71.05863
    }
}