{
    "job": {
        "title": "Data Scientist (Research - Biology)",
        "industry": "Biotechnology,Hospital &amp; Health Care,Pharmaceuticals",
        "description": "The Role Moderna is seeking a talented and motivated data scientist with a background in applying machine learning techniques to problems in research and development to join our Data Science and Artificial Intelligence (DSAI) team. As part of our mission to “ Build The Digital Biotech Company ”, we see a central role for DSAI in accelerating the science and engineering at the heart of our innovative culture. As a data scientist within the DSAI team, this role will support and execute on research collaborations with an initial specialist focus on sequence-function learning for biological data. The role will be involved in building machine learning systems that power Moderna’s research engine, accelerating the scientific discovery that we engage in, scaling up our existing capabilities, and opening new avenues of research capabilities. We are looking for someone who is deeply curious, exhibits an excellent work ethic, and has a desire to bring novel mRNA therapeutics and vaccines to the market that will improve the lives of patients worldwide. Here’s What You’ll Do Support and execute on research projects that leverage internal and external biological sequence data to impact teams, processes, and colleagues’ projects in Platform Research, Technical Development, and a variety of Therapeutic Areas, via data analysis and visualization, algorithm development, machine learning, and experimental design. Keep abreast of and, where appropriate, apply recent advances in machine learning and optimization, and their application to biological sequence-function learning problems Lead the development and maintenance of machine learning-powered production systems that leverage our biological sequence data to accelerate our science Collaborate with data scientists, research scientists, and engineers across Moderna Employ data science and software engineering best practices in day-to-day work Communicate findings internally and externally Here’s What You’ll Bring To The Table Ph.D. in Computer Science, Computational Biology, Applied Math, Biological Engineering, or related discipline 2+ years of experience delivering data science projects, preferably in an industry setting Demonstrated understanding of biotech research and engineering processes including one or more of molecular biology, bioinformatics, etc. Demonstrated prior experience in modeling biological sequence-function relationships and partnering with experimentalists for validation. Experience in identifying, procuring, and integrating external data sources as needed Working knowledge of relational databases (e.g., PostgreSQL) Ability to manage multiple projects and effectively collaborate in a dynamic, cross-functional environment Outstanding communication skills (verbal, written, and virtual/remote). Success in communicating effectively at multiple levels of stakeholdership Demonstrated experience building research collaborations and executing complex and interdisciplinary research projects to completion Fluency in Python, especially the scientific Python stack (Jupyter/Pandas/scikit-learn/PyTorch) (Preferred) Demonstrated experience and/or specialization in one of neural vision models, neural language models, or graph neural networks. (Preferred) Track record of publishing scientific research and/or method development, preferably in the computational biology or computer science research fields (Preferred) Familiarity with best practices in software development, including Amazon Web Services, Docker, version control (Git), and documentation Here’s What We’ll Bring To The Table On-site subsidized cafeteria or catered lunches Company-provided iPhone Free parking, monthly subway pass or a subsidized commuter rail pass Free annual corporate membership to Bluebikes Highly competitive healthcare coverage including: medical offered through BCBS (HMO/PPO), dental, and vision offered through VSP Flexible Spending Accounts for medical expenses and dependent care expenses 16 weeks of 100% paid parental leave for all new parents 16 weeks 100% paid family caregiver leave 20 weeks 100% paid medical leave Eligible for “Moderna Month” (one month paid sabbatical after five years of service and eligible for additional one month paid sabbatical every 3 years thereafter) Adoption assistance and discounts to local childcare centers, as well as access to care.com 401k (traditional and Roth offered) with 50% match on first 6% deferred. Match is vested immediately A suite of Moderna paid insurance coverage, including: life insurance, short-term and long-term disability Voluntary legal assistance plan 15 days’ vacation and 7 sick days per year, in addition to a discretionary winter shut down and 11 company paid holidays (includes 2 floating holidays) About Moderna In 10 years since its inception, Moderna has transformed from a science research-stage company advancing programs in the promising-but-still-unproven field of messenger RNA (mRNA), to an enterprise with its first medicine having treated millions of people, a diverse clinical portfolio of vaccines and therapeutics across six modalities, a broad intellectual property portfolio in areas including mRNA and lipid nanoparticle formulation, and an integrated manufacturing plant that allows for both clinical and commercial production at scale and at unprecedented speed. Moderna maintains alliances with a broad range of domestic and overseas government and commercial collaborators, which has allowed for the pursuit of both groundbreaking science and rapid scaling of manufacturing. Most recently, Moderna’s capabilities have come together to allow the authorized use of one of the earliest and most-effective vaccines against the COVID-19 pandemic. Moderna’s mRNA platform builds on continuous advances in basic and applied mRNA science, delivery technology and manufacturing, and has allowed the development of therapeutics and vaccines for infectious diseases, immuno-oncology, rare diseases, cardiovascular diseases and auto-immune diseases. Today, 24 development programs are underway across these therapeutic areas, with 13 programs having entered the clinic. Moderna has been named a top biopharmaceutical employer by Science for the past six years. To learn more, visit www.modernatx.com . Moderna is a smoke-free, alcohol-free and drug-free work environment. Moderna is committed to equal employment opportunity and non-discrimination for all employees and qualified applicants without regard to a person’s race, color, gender, age, religion, national origin, ancestry, disability, veteran status, genetic information, sexual orientation or any characteristic protected under applicable law. Moderna will make reasonable accommodations for qualified individuals with known disabilities, in accordance with applicable law.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-16T23:10:20.000Z"
    },
    "company": {
        "name": "Moderna",
        "link": "https://www.linkedin.com/company/modernatx"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Cambridge",
        "region": "MA",
        "postal_code": "02239",
        "street_address": null,
        "latitude": 42.36525,
        "longitude": -71.10502
    }
}