{
    "job": {
        "title": "Site Reliability Engineer (Remote)",
        "industry": "Computer Software,Internet,Information Technology and Services",
        "description": "Our client is one of the largest crypto exchanges and they are growing quickly! Our client is a crypto exchange and custodian that allows customers to buy, sell, store, and earn more than 30 cryptocurrencies like bitcoin, bitcoin cash, ether, litecoin, and Zcash. Our client is a New York trust company that is subject to the capital reserve requirements, cybersecurity requirements, and banking compliance standards set forth by the New York State Department of Financial Services and the New York Banking Law. Our client was founded in 2014 by twin brothers Cameron and Tyler Winklevoss to empower the individual through crypto. Crypto is about giving you greater choice, independence, and opportunity. We are here to help you on your journey. We build crypto products that are simple, elegant, and secure. Whether you are an individual or an institution, we want to help you buy, sell, and store your bitcoin and cryptocurrency. Crypto is not just a technology, it's a movement. The Role Site Reliability Engineers (SREs) are responsible for keeping all user-facing services and other production systems running smoothly. SREs are a blend of pragmatic operators and software craftspeople that apply sound engineering principles, operational discipline, and mature automation to our environments and the codebase. We specialize in systems, whether it be networking, the Linux kernel, or some more specific interest in scaling, algorithms, or distributed systems. As An SRE You Will Be on a PagerDuty rotation to respond to availability incidents and provide support for service engineers with customer incidents. Use your on-call shift to prevent incidents from ever happening. Run our infrastructure with Chef, Terraform and Kubernetes. Make monitoring and alerting alert on symptoms and not on outages. Document so your findings turn into repeatable actions-and then into automation. Improve the deployment process to make it as boring as possible. Design, build and maintain core infrastructure pieces that allow scaling to support hundreds of thousands of concurrent users. Debug production issues across services and levels of the stack. Plan the growth of our client's infrastructure. You may be a fit to this role if you have some of these inclinations: Think about systems - edge cases, failure modes, behaviors, specific implementations. Know your way around Linux and the Unix Shell. Know what is the use of config management systems like Chef (the one we use) Have strong programming skills - Ruby and/or Go Have an urge to collaborate and communicate asynchronously. Have an urge to document all the things so you don't need to learn the same thing twice. Have an enthusiastic, go-for-it attitude. When you see something broken, you can't help but fix it. Have an urge for delivering quickly and iterating fast. Share our values, and work in accordance with those values. Have experience with Nginx, HAProxy, Docker, Kubernetes, Terraform, or similar technologies",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-04T01:57:23.000Z"
    },
    "company": {
        "name": "Recruiting from Scratch",
        "link": "https://www.linkedin.com/company/recruiting-from-scratch"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Palo Alto",
        "region": "CA",
        "postal_code": "94310",
        "street_address": null,
        "latitude": 37.445103,
        "longitude": -122.16036
    }
}