{
    "job": {
        "title": "Platform Engineer",
        "industry": "Information Technology and Services,Computer Software,Financial Services",
        "description": "With a mix of software product knowledge, functional expertise and industry focus, create a strategy and build future-proof Software Product that can be implemented at multiple clients through extensions, APIs & customization capabilities. Excel in delivering market-leading commercial software platforms, products, offerings for Accenture or clients. Oversee cross-functional teams that design, develop, enhance and maintain assets that provide value for their industry and its clients What you need: Minimum 5 years of experience with more than one technology stack Minimum 3 years of Software development background using server side technologies (Java/Spring or similar frameworks regardless of language). Minimum 3 years of experience in building cloud applications, Software as a Service (SaaS), Platform as a Service (PaaS) using at least one of the following platforms: AWS,MS Azure, GCP, Openshift, Cloud Foundry. Bachelor's degree or equivalent (minimum 12 years) work experience. (If Associate’s Degree, must have minimum 6 years work experience) Bonus points if you have: API Gateways experience is a plus. Strong fundamental understanding building REST APIs. Experience working in continuous delivery environment. Comfortable learning and applying new technologies Very familiar with auto scaling, High Availability deployments Experience in deploying applications for high availability, scaling and resiliency. Experience in messaging and integration technologies and components. Event driven architecture, Messaging technologies. (e.g. JMS, rabbitMQ, SQS, AMQP etc). Familiarity with large data storage & processing technologies As required by the Colorado Equal Pay Transparency Act, Accenture provides a reasonable range of minimum compensation for roles that may be hired in Colorado. Actual compensation is influenced by a wide array of factors including but not limited to skill set, level of experience, and specific office location. For the state of Colorado only , the range of starting pay for this role is $72,400-$114,499 and information on benefits offered is here. What We Believe We have an unwavering commitment to diversity with the aim that every one of our people has a full sense of belonging within our organization. As a business imperative, every person at Accenture has the responsibility to create and sustain an inclusive environment. Inclusion and diversity are fundamental to our culture and core values. Our rich diversity makes us more innovative and more creative, which helps us better serve our clients and our communities. Read more here Equal Employment Opportunity Statement Accenture is an Equal Opportunity Employer. We believe that no one should be discriminated against because of their differences, such as age, disability, ethnicity, gender, gender identity and expression, religion or sexual orientation. All employment decisions shall be made without regard to age, race, creed, color, religion, sex, national origin, ancestry, disability status, veteran status, sexual orientation, gender identity or expression, genetic information, marital status, citizenship status or any other basis as protected by federal, state, or local law. Accenture is committed to providing veteran employment opportunities to our service men and women. For details, view a copy of the Accenture Equal Opportunity and Affirmative Action Policy Statement. Requesting An Accommodation Accenture is committed to providing equal employment opportunities for persons with disabilities or religious observances, including reasonable accommodation when needed. If you are hired by Accenture and require accommodation to perform the essential functions of your role, you will be asked to participate in our reasonable accommodation process. Accommodations made to facilitate the recruiting process are not a guarantee of future or continued accommodations once hired. If you would like to be considered for employment opportunities with Accenture and have accommodation needs for a disability or religious observance, please call us toll free at 1 (877) 889-9009, send us an email or speak with your recruiter. Other Employment Statements Applicants for employment in the US must have work authorization that does not now or in the future require sponsorship of a visa for employment authorization in the United States. Candidates who are currently employed by a client of Accenture or an affiliated Accenture business may not be eligible for consideration. Job candidates will not be obligated to disclose sealed or expunged records of conviction or arrest as part of the hiring process. The Company will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. Additionally, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with the Company's legal duty to furnish information.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-25T17:49:44.000Z"
    },
    "company": {
        "name": "Accenture",
        "link": "https://ie.linkedin.com/company/accenture"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 144,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "San Jose",
        "region": "CA",
        "postal_code": "95148",
        "street_address": null,
        "latitude": 37.334793,
        "longitude": -121.888145
    }
}