{
    "job": {
        "title": "Associate Electrical Engineer - New York",
        "industry": "Construction,Information Technology and Services,Staffing and Recruiting",
        "description": "Type of contract Permanent Grade Associate, Senior Area of Expertise Building Environment Region US Office / Project Location New York Ref No 5017 The Associate Electrical Engineer will work closely with clients, architects and other Buro Happold Engineers and/or design team members as part of a dedicated and skilled team. Duties include the production of coordinated detailed design drawings, electronic models, specifications, written reports, site observation reports, schedules etc. on a variety of projects within the electrical discipline, as well as the coordination with utility companies and obtaining the necessary electrical permit approvals from Plan Check. What will I be doing? Input to the projects is likely to be varied but will include the requirement to: Act as Job Leader. Service to the group acting as a proactive Project Leader on projects, as required. Communicate directly with Clients. Organize technical and financial proposals for new work. Manage workload of Project Discipline Engineers and Technicians (including verification of quality). Take responsibility for concept and preliminary engineering solutions for detail design. Prepare Technical Specifications. Monitor financial performance of jobs. Set up and manage job/project administrative systems, including planning and monitoring job resourcing/expenditure (adjusting these as necessary). Keep senior staff informed of important and relevant service/design decisions and the objectives of the client are achieved. Mentor junior Electrical Engineers Continually ensure practices, policies, strategy and services represent the client’s best interests and that BH policy is in keeping with current legislation and the relevant building codes for the relevant state etc. Responsible for planning, organizing and managing personal workload in order to meet deadlines in line with client commitments. Proactively raising concerns regarding workload and ability to meet deadlines. Maintain an overview of the project team’s workload and commitments in order to successfully meet deadlines and balance resource utilization. Actively contribute towards delivering profitable projects in the context of project finances. Monitor financial performance of jobs, with the setting up and managing of job/project administrative systems, including planning and monitoring job resourcing/expenditure (adjusting these as necessary). What can I bring to the role? As an experienced Associate Electrical Engineer, it is expected that you will be able to demonstrate: Typically, 10-12 years’ experience of electrical engineering design in the building services and construction industry. Ability to accept a high degree of responsibility in a team-based organization, combined with ability to work independently. Registered Professional Engineer or Chartered membership of a professional institution. Thorough knowledge and understanding of the building codes Broad electrical design knowledge, from working on a wide range of projects. AutoCAD, REVIT and lighting design software, such as AGI or DIALux. Excel (a detailed understanding including the use of macros). The applicant will need to have strong interpersonal and organizational skills. Professional Engineer (PE) or Chartered Engineer (CEng). LEED AP accredited preferred. In return… Solve some of the most interesting challenges on world-class projects in collaboration with top architects Work within a truly multidisciplinary environment, capitalizing on Buro Happold’s extensive knowledge base in CFD, building physics, micro-climate analysis, climate change mitigation and energy masterplanning to inform truly environmentally responsive MEP designs Advance your career within a forward-thinking, global community of engineering professionals. Buro Happold is proud to be a practice of a diverse range of professionals that reflects the countries in which we operate. In order to truly benefit from this diversity we must create an environment in which employees feel they can be themselves. Buro Happold actively promotes inclusivity across the practice to enable every individual to reach their full potential, feeling included is good for all of us. This begins with a fair and inclusive recruitment process which focuses on your skills, competencies and experiences in relation to the role. We recognise and are committed to change the lack of representation of minority groups in our industry, and particularly welcome applications from Black, Asian and minority ethnic individuals, disabled people and women across all our offices. We understand that through collaboration, diverse people with different experiences develop the most innovative and elegant solutions.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-03T03:16:34.000Z"
    },
    "company": {
        "name": "Buro Happold",
        "link": "https://uk.linkedin.com/company/buro-happold"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 120,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "New York",
        "region": "NY",
        "postal_code": "10132",
        "street_address": null,
        "latitude": 40.713047,
        "longitude": -74.00723
    }
}