{
    "job": {
        "title": "Data Science - Project Manager",
        "industry": "Accounting,Financial Services,Information Technology and Services",
        "description": "Your Journey At Crowe Starts Here At Crowe, you have the opportunity to deliver innovative solutions to today’s complex business issues. Crowe’s accounting, consulting, and technology personnel are widely recognized for their in-depth expertise and understanding of sophisticated process frameworks and enabling technologies, along with their commitment to delivering measurable results that help clients build business value. Our focus on emerging technology solutions along with our commitment to internal career growth and exceptional client value has resulted in a firm that is routinely recognized as a “Best Place to Work.” We are 75 years strong and still growing. Come grow with us! Job Description About Crowe Data Science “Everything we do is about making the future of human work more purposeful. We do this by leveraging state-of-the-art machine learning, modern architectures, and industry experts to create AI-powered software-as-a-service.” About Crowe DS Project Management “DS project management is human-first – we are partners and collaborators. We bridge teams, set clear expectations, and facilitate the shared understanding needed to deliver on those expectations. Machine learning may be ambiguous; project management isn’t.” About The Role You will manage multiple ongoing projects, coordinating efforts across multi-skilled/multi-functional teams. DS projects typically intersect several business units and support the needs to improve and/or transform the subject business(es). Projects may compete for resources or prioritization, requiring cross-project coordination and robust communication. This Includes, But Is Not Limited To, The Following Activities As Required Based On Project Size And Complexity You will work closely with the DS Project Management and Operations Leads, as well as applicable Stakeholders, to shepherd projects through Ongoing Development phases (including new feature scoping), through Release, into Support, and – as applicable – project close-out in the Pasture phase. Ongoing Development Maintain project collaboration tools (i.e. Team SharePoint site and Gitlab project documentation) Monitor project execution, proactively surfacing risks to delivery; facilitate schedule adjustments, risk mitigation steps, and project change requests Monitor issue tracking and resolution within and around the project; attend sprint planning, retrospectives, and other development team ceremonies Prepare project status reports and other project update communications requested Foster and promote cross-team collaboration, teamwork, and individual and team growth opportunities Facilitate ethics reviews, documentation creation, and ongoing monitoring New Feature Development Work with project sponsor(s) and other stakeholders to finalize new feature objectives, update business case, solicit effort estimates, and facilitate creation of/signoff on project scope documentation Work with Product Owner and Advanced Data Science technical team leaders to articulate and finalize feature requirements, establish initial product backlog items, and complete final baseline estimate; work with this team to develop and schedule phase milestones (as applicable) Update associated risk mitigation, change control, communication, and quality assurance plans Facilitate regular milestone review meetings, creation of phase milestone reports Coordinate with Operations Lead to ensure features meet InfoSec requirements; coordinate with Machine Learning Engineer Group Lead to ensure features align to development best practices Release Coordinate internal and external team schedules to manage recurring release timelines and plan ad hoc releases Maintain shared calendars (Outlook) and generate release tickets (Gitlab) to track release schedules Coordinate/monitor to ensure releases meet Change Management standards and compliance/risk requirements Own the release checklist and delivery notification, including obtaining stakeholder signoff Determine when to delay release delivery; update relevant stakeholders and impacted tickets, calendars Report release blockers to impacted team(s), along with expected timeline to resolution Maintain and share client-facing documentation (i.e. release notes) written by technical teams; facilitate translation of deliverables such that they are clear to both technical and non-technical readers Track releases against Key Performance Indicators; report progress/pursue improvements relative to KPIs Required Technical project management experience. You have managed project execution to ensure adherence to schedule, and scope. You know how a software product is built from the ground up, as you have previously worked on data science, machine learning, or software projects. You have (or are willing to pursue) Project Management Professional (PMP) Certification. Strong communication skills. You are comfortable writing and speaking to both technical and non-technical audiences, with an empathetic and patient approach to building productive cross-team relationships. You can solicit business requirements and then concisely summarize that information in writing. Organized flexibility. Maintaining multiple detailed project documents, requirements, and plans is your bread-and-butter, but you remain agile and can re-prioritize in the face of ambiguity and dynamic business needs. Preferred Process orientation. You seek opportunities for improved project delivery processes to make the team more efficient and able to continuously deliver results. Natural curiosity. You dive deep into any available information to better understand concepts or tasks at hand. You’re not afraid to ask questions and can also figure things out independently. Results-driven people skills. You establish trust with your teams and can deftly negotiate, manage conflict, and influence others to meet goals. Our Benefits At Crowe, we know that great people is what makes a great firm. We value our people and offer employees a comprehensive benefits package. Learn more about what working at Crowe can mean for you! How You Can Grow We will nurture your talent in an inclusive culture that values diversity. You will have the chance to meet on a consistent basis with your Career Coach that will guide you in your career goals and aspirations. Learn more about where talent can prosper! More About Crowe Crowe (www.crowe.com) is one of the largest public accounting, consulting and technology firms in the United States. Crowe uses its deep industry expertise to provide audit services to public and private entities while also helping clients reach their goals with tax, advisory, risk and performance services. Crowe is recognized by many organizations as one of the country's best places to work. Crowe serves clients worldwide as an independent member of Crowe Global, one of the largest global accounting networks in the world. The network consists of more than 200 independent accounting and advisory services firms in more than 130 countries around the world. Crowe LLP provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-03T03:21:56.000Z"
    },
    "company": {
        "name": "Crowe",
        "link": "https://www.linkedin.com/company/crowe"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Chicago",
        "region": "IL",
        "postal_code": "60654",
        "street_address": null,
        "latitude": 41.88323,
        "longitude": -87.6324
    }
}