{
    "job": {
        "title": "Software Engineer - Atlanta (Multiple Positions)",
        "industry": "Information Technology and Services,Computer Software,Financial Services",
        "description": "Job Description The Technology Software Engineer will work with a team of other software developers and network and systems engineers to design, implement, and deploy software which meet customer’s requirements, scales easily, removes the limitations of traditional networking solutions, and supports deployment in highly available environments The engineer will participate in architecture and design of various software components focused on creating applications that leverage technologies such as virtualization, micro services, SDN, NFV, and Big Data platforms and technologies. Works on technical assignments that are semi routine in nature but recognizes that need for occasional deviation from accepted practice. Normally follows established procedures on routine work, requires instructions only on new assignments. Functional Group Enterprise Technology Solutions Location GA127-GA-Ravinia Admin Office Location Address One Ravinia Dr City Atlanta State Georgia Zip 30346 Travel Required? Yes Travel Percentage Yes, 10% of the time Responsibilities Requires competency in customer focus, change & innovation, strategic thinking, relationship building & influencing, talent management, results focus and inspirational leadership. Technical System Expertise: Understands system protocols, how systems operate and data flows. Aware of current technology benefits. Expected to independently develop a full software stack. Understands the building blocks, interactions, dependencies, and tools required to complete software and automation work. Independent study of current technology is expected. Interact with system engineers to define system requirement and/or necessary requirements for automation. Technical Engineering Services: Supports engineering projects by developing software solutions; conducting tests and inspections; preparing reports and calculations. Expected to supervise associate engineers on occasion. Innovation: Presents new ideas which improve an existing system/process/service. Presents new ideas which utilize new frameworks to improve an existing system/process/service. Express new perspectives based on independent study of the industry. Review current company processes to highlight questions that may drive process refinement. Technical Writing: Maintains knowledge of existing technology documents. Writes basic documentation on how technology works. Contributes clear documentation for new code and systems used. Documenting systems designs, presentations, and business requirements for consumption at the engineer level. Technical Leadership: Collaborates with technical teams and utilizes system expertise to deliver technical solutions. Continuously learns new technologies. Technology Strategy: Understands current technology that supports business goals. Qualifications Minimum required 2+ Years Technical engineering experience Focus: Able to communicate goals in support of the business' mission. Drive: Self-motivated and able to work well under pressure. Teamwork: Ability and desire to work cooperatively with others on a team. Communication: The ability to ensure that information is passed on to others who should be kept informed. Express self clearly in conversations and interactions with others. Clear business and technical writing skills. Customer Focus: The ability to demonstrate concern and meet external and/or internal customers’ needs. Analytical: The ability to tackle a problem by using a logical, systematic, sequential approach. Technical Expertise: The ability to demonstrate depth of knowledge and skill in a technical area. Education Bachelor's degree in Computer Science or Engineering Travel requirements May require up to 20% of domestic overnight travel within the region, and occasional trips to the Bellevue Headquarters. Minimum Qualifications At least 18 years of age Legally authorized to work in the United States High School Diploma or GED Pre-employment background screen Company Profile T-Mobile U.S. Inc. (NASDAQ: TMUS) is America’s supercharged Un-carrier, delivering an advanced 4G LTE and transformative nationwide 5G network that will offer reliable connectivity for all. T-Mobile’s customers benefit from its unmatched combination of value and quality, unwavering obsession with offering them the best possible service experience and undisputable drive for disruption that creates competition and innovation in wireless and beyond. Based in Bellevue, Wash., T-Mobile provides services through its subsidiaries and operates its flagship brands, T-Mobile, Metro by T-Mobile and Sprint. For more information please visit: http://www.t-mobile.com Applicant Privacy Policy We are committed to maintaining your trust by respecting and protecting your privacy. For more information about how T-Mobile processes the personal data of job applicants, please visit Applicant Privacy Policy . EOE Statement Equal Employment Opportunity We take equal opportunity seriously—by choice. T-Mobile USA, Inc. is an Equal Opportunity Employer. All decisions concerning the employment relationship will be made without regard to age, race, ethnicity, color, religion, creed, sex, sexual orientation, gender identity or expression, national origin, religious affiliation, marital status, citizenship status, veteran status, the presence of any physical or mental disability, or any other status or characteristic protected by federal, state, or local law. Discrimination, retaliation or harassment based upon any of these factors is wholly inconsistent with how we do business and will not be tolerated. Positions Remaining 1 Brand T-Mobile Schedule Full Time",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-04T08:04:10.000Z"
    },
    "company": {
        "name": "T-Mobile",
        "link": "https://www.linkedin.com/company/t-mobile"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Atlanta",
        "region": "GA",
        "postal_code": "30355",
        "street_address": null,
        "latitude": 33.748547,
        "longitude": -84.3915
    }
}