{
    "job": {
        "title": "Principal Software Engineer for Cloud Native Development",
        "industry": "Computer Software",
        "description": "Principal Software Engineer for Cloud Native Development at CRIO Clinical Research IO (CRIO) aims to transform and streamline the process of clinical trials, replacing the traditional paper-based manual workflows with a SAAS solution that improves efficiency and reduces error. Our business operates at the intersection of healthcare and life-science research. Our customers include clinical research sites, hospitals, biotech and pharma. We have developed an enterprise solution for research investigators, and we are embarking on building a platform for biotech and pharma sponsors. We provide value to our customers in this highly regulated industry by capturing data that is clean and accurate, eliminating expensive human intervention, and making research data available in real-time. We’re looking to expand our engineering team! As the lead on an agile team and a senior member of the engineering organization, you’ll be working in an exciting environment where you’ll have the opportunity to work closely with our product delivery teams as we deliver enhancements and build new products in an industry with a mission to improve the quality of human life. You’ll be leading a technical team that owns the technical foundations that support our product delivery teams. Your team creates tooling, builds out infrastructure, assists with performance engineering, and keeps our platform secure. About Us We are a small, fast-growing company with a strong team of developers, a loyal customer base, and a highly regarded brand. Our company culture emphasizes trust, teamwork, collaboration, learning, career growth, and fun! In our streamlined environment, nobody is just a developer. Each of us wears many hats, gets to know our customers and business, and has opportunities to contribute broadly to the company mission. Our people are our most important asset, and we build our team carefully to maintain the values of our culture. About You You are an expert in building and delivering cloud native software. You are highly competent in DevOps, performance engineering, security concerns, and all aspects of modern cloud development. You write well designed and reusable code. You care deeply about your craft, and you are eager to provide technical leadership and mentorship to your junior team members. You aren’t bound by specific tools and technology, and you feel confident picking up whatever skills you’ll need to get the job done. You are a good communicator, and you support your position with facts while maintaining an ability to compromise when necessary. You are committed to best practices, and you take personal ownership of the quality of your product. You enjoy collaboration, and thrive in a team environment where everyone is working towards a common goal. You enjoy getting to know your team on a personal level, and you love finding ways to have fun while doing your job! Responsibilities Be a key contributor as well as a team and technical leader Work on a team that owns the technical foundations that support our product delivery teams Deliver new SAAS products and functionality hosted in the cloud Provide strong design and architectural influence to our infrastructure development Write code and work on tooling related to CI/CD and other areas Contribute to performance tuning and engineering of systems and code Mentor junior members of the team on best practices, design, architecture and development Lead design review sessions Stay current with industry trends, and bring the best of these into our engineering practices Technical Skills 7+ years delivering cloud-hosted SAAS applications Extensive experience with Docker and Kubernetes Extensive experience maintaining a CI/CD environment Understanding of scalability, performance and security concerns and strategies Comprehensive understanding of computer science concepts Proven ability to design extensible and maintainable software Leadership Skills Ability to lead while contributing as part of a collaborative agile team Excellent written and verbal communication skills Ability to influence team, stakeholders, and leadership as needed Strong focus on team effectiveness, results and customer success Self-motivated and proactive in terms of identifying and resolving problems Passionate about technology and staying current with industry trends Natural tendency towards continuous improvement for self and team Nice to Have Experience with Java web technologies including Spring Boot as well as older MVC frameworks Experience with healthcare or life science industries Experience with 21CFR11, HIPAA, and GDPR regulatory conformance Experience with open source technologies Locations Fully remote employment is an option. We also have offices located in: Boston, MA Seattle, WA",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-24T01:18:19.000Z"
    },
    "company": {
        "name": "Clinical Research IO",
        "link": "https://www.linkedin.com/company/clinical-research-io"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 84,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "United States",
        "region": null,
        "postal_code": "99999",
        "street_address": null,
        "latitude": 39.50355,
        "longitude": -99.0183
    }
}