{
    "job": {
        "title": "Data Scientist",
        "industry": "Public Safety,Judiciary,Law Enforcement",
        "description": "Please Note: United States Citizens, Green Card Holders and those authorized to work in the United States are encouraged to apply. We are unable to sponsor H1b candidates at this time. Our growth and client-centric vision has created a career opportunity for a self-motivated individual looking to establish a career with a fast-paced rapidly growing company. The purpose of the Data Scientist is to help us discover the information hidden in vast amounts of data both structured and unstructured. The position will help us to build and deliver products and services that utilize machine learning and analytics for public safety and criminal justice clients. The role requires a client-focused professional committed to success by embracing and living our core values of Persistence, Integrity, Trust, Accountability and Prudence . Expectations Apply and enable data mining techniques and statistical analysis to build high quality prediction and pattern matching systems integrated with our solutions Lead and/or aid in the implementation of data analytic solutions sold to end user clients Interpret customer requirements and information; speak with customers to understand their end user needs and relay this information to process flows and diagrams Perform technical presentations that demonstrate how data analysis information and process flow can benefit and meet customer needs Provide technical specifications and statements of work for a quote or proposal and aid in preparing accompanying materials Prepare technical reports by collecting, analyzing, and summarizing information and data trends Adept at using large data sets to find opportunities for product and process optimization and using models to test the effectiveness of different courses of action Assess the effectiveness and accuracy of new data sources and data gathering techniques Process, cleanse, and verify integrity of data used for analysis Provide pre-sale technical assistance and product education to the Growth Team and prospective clients Maintain customer confidence and protect operations by keeping information confidential Serve as liaison with other teams and divisions within the company to gather and share technical expertise for supporting growth Attend weekly service delivery meetings and ensure business development opportunities are compliant with company capabilities Contribute to team effort by accomplishing related results as needed Work with the Division management team for pricing an opportunity Basic Requirements, Knowledge, and Skills Bachelor’s Degree in Statistics, Mathematics, Computer Science, or another quantitative field. Master’s Degree preferred 5-7 years of experience manipulating large data sets from multiple sources and building statistical models Demonstrated experience using a variety of data mining/data analysis methods, building, and implementing models, using/creating algorithms, and creating/running simulations Proven background working with and creating machine learning data architectures to include selecting features, building, and optimizing classifiers Good applied statistics skills, such as distributions, statistical testing, regression, etc. Mastery experience with at least one common data science toolkits, such as R, Weka, NumPy, MATLAB, etc. Experience with data visualization tools, such as D3.js, GGplot, R, Python, Tableau, etc. Proficiency utilizing MapReduce techniques and frameworks such as Apache Hadoop Experience with advanced statistical techniques and concepts. Maintain in-depth knowledge of data mining and analysis tool capabilities Understanding of criminal justice data and predictive analytics Strong problem-solving skills.  Detailed-oriented, analytical, and inquisitive Have a passion for discovering solutions hidden in large data sets Effective organizational and time-management skills with the ability to work as part of a team and independently Exemplary Communications, both oral and written. Writing for presentations, and technical reports. Exceptional listener. Understanding client goals and how they measure success. Identify needs, present concepts, develop specifications and recommendations, and deliver solutions Estimated travel is 30% Valid Driver’s License with the ability to drive to client sites and MCP regional office locations About Us: Mission Critical Partners, LLC Mission Critical Partners (MCP) is a leading independent consulting and information technology (IT) support services firm that helps clients evolve their public safety systems and operations and improve emergency response through our extensive experience, knowledge, and resources. By providing insight and support every step of the way, our clients are able to transform their mission-critical operations, maximize the value of their investments and ensure optimal performance and success. Additional information and career opportunities are available at www.MissionCriticalPartners.careers As an Affirmative Action and Equal Opportunity Employer , Mission Critical Partners shall abide by the requirements of 41 CFR 60-1.4(a), 60-300.5(a) and 60-741.5(a). These regulations prohibit discrimination against qualified individuals based on their status as protected veterans or individuals with disabilities, and prohibit discrimination against all individuals based on their race, color, religion, age, sex, sexual orientation, gender identity or national origin. Moreover, these regulations require that covered prime contractors and subcontractors take affirmative action to employ and advance in employment individuals without regard to race, color, religion, age, sex, sexual orientation, gender identity, national origin, disability or veteran status.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-15T04:01:06.000Z"
    },
    "company": {
        "name": "Mission Critical Partners",
        "link": "https://www.linkedin.com/company/mission-critical-partners-llc"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "United States",
        "region": null,
        "postal_code": "99999",
        "street_address": null,
        "latitude": 39.50355,
        "longitude": -99.0183
    }
}