{
    "job": {
        "title": "Software Engineer",
        "industry": "Information Technology and Services,Management Consulting",
        "description": "Cognizant Digital Engineering If you’re like us, you’ve got big ideas. At Cognizant, we’re exploring new ideas every day. We help industry leading companies reinvent their business models and innovate products that create new value—by connecting people with things, insights and experiences. Cognizant digital engineering designs, engineers and delivers digital products and experiences that drive digital-first business models. We offer the most comprehensive digital engineering expertise and client-centric methodology for sustainable innovation. Job Summary Cognizant Technology Solutions is seeking a highly qualified Java engineer with experience in developing and in building high-performing, scalable, enterprise applications. You will be part of a talented software team that works on mission-critical applications. You have a passion for high-quality, reliable and maintainable code. You’re comfortable working side by side with product managers, designers, and clients, making decisions together in order to quickly deliver valuable working software to clients and their users. You are agile and retrospective, and not afraid to identify what we’re doing wrong so we can fix it, and what we’re doing right so we can improve on it. Above all, you judge your success by the success of your team and the happiness of our customers. Day-to-Day Responsibilities Java/Java EE/Spring microservice API development while providing expertise in the full software development lifecycle, from concept and design to testing. Designing, developing and delivering high-volume, low-latency applications for mission-critical systems Write well designed, testable, efficient code Ensure designs are in compliance with specifications Support continuous improvement by investigating alternatives and technologies and communicating these for architectural review Key Qualifications Strong understanding of Java 8, Microservices, & Springboot. Proficient in Core Java /J2EE technologies & Spring framework Hands-on experience in the development of RESTFUL web services & spring boot based microservices Should be aware of CICD tools like Jenkins, Docker etc Knowledge of commonly used IDEs like Eclipse etc and UNIX scripts. Excellent communication skill and participates actively in team meetings discussions and be a specialist in Object Oriented analysis and design using common design patterns Define site objectives by analyzing user requirements envisioning system features and functionality and enhance organization’s reputation by accepting ownership for accomplishing requests exploring opportunities to add value to job accomplishments Job Location : Irving, Texas, United States || Dallas, Texas, United States Employee Status : Full Time Employee Shift : Day Job Travel : No Job Posting : Jul 20 2021 About Cognizant Cognizant (Nasdaq-100: CTSH) is one of the world's leading professional services companies, transforming clients' business, operating and technology models for the digital era. Our unique industry-based, consultative approach helps clients envision, build and run more innovative and efficient businesses. Headquartered in the U.S., Cognizant is ranked 194 on the Fortune 500 and is consistently listed among the most admired companies in the world. Learn how Cognizant helps clients lead with digital at www.cognizant.com or follow us @USJobsCognizant. Cognizant is recognized as a Military Friendly Employer and is a coalition member of the Veteran Jobs Mission. Our Cognizant Veterans Network assists Veterans in building and growing a career at Cognizant that allows them to leverage the leadership, loyalty, integrity, and commitment to excellence instilled in them through participation in military service. Cognizant is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to sex, gender identity, sexual orientation, race, color, religion, national origin, disability, protected Veteran status, age, or any other characteristic protected by law. If you have a disability that requires a reasonable accommodation to search for a job opening or submit an application, please email CareersNA2@cognizant.com with your request and contact information.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-20T05:54:28.000Z"
    },
    "company": {
        "name": "Cognizant",
        "link": "https://www.linkedin.com/company/cognizant"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Irving",
        "region": "TX",
        "postal_code": "75063",
        "street_address": null,
        "latitude": 32.813877,
        "longitude": -96.949936
    }
}