{
    "job": {
        "title": "Junior Data Scientist",
        "industry": "Financial Services",
        "description": "Job Description The Global Servicing Network (GSN) organization delivers extraordinary customer care to Card Members, merchants, and commercial clients around the world, while providing world-class credit, collections and fraud services. The Big Data and Advanced Analytics team provided models to enhance and compliment the existing processes accross the organization. Purpose Of The Role Regularly engage with business teams to understand their needs and requirements and operationalize a framework for deploying Machine Learning and Natural Language Processing models Prototype and deploy use cases for Machine learning in the global Servicing Network (GSN) operating environment and ability to operationalize into workable algorithms & solutions. The role is expected to provide strategic guidance using Machine Learning and NLP across multiple operating areas within our GSN including structed and unstructured text mining to help business requirements. It is also expected that role brings to the table expertise in Machine Learning and how best advanced concepts can be applied into GSN operating areas Responsibilites Conceptualize, test and prototype beta versions of algorithms independently and working along with business counterparts in larger GSN organization Rigorous testing of algorithms as per business norms and delivering significant working leverage over status quo and generate value for the business be on top of trends Critical Factors To Success Able to explain technical terms to non-technical people Provide the business with the models that they need in a timely manner Bring innovation in Machine Learning technqiues to optimally deploy the ML architecture Drive structural improvement projects via Machine Learning and achieve the efficiency goals Business Outcomes Bring innovation in Machine Learning technqiues to optimally deploy the ML architecture Drive structural improvement projects via Machine Learning and achieve the efficiency goals Leadership Outcomes Put enterprise thinking first and always balance stakeholder agendas Continuously engage with the external Data Science world to track the new advancements Academic Background And Experience Bachelor's or Master's degree surroudning Data Science or relevant field OR 3+ years of applicable work experience Able to use both Deep learning and ML libaries Work in the financial space is a plus but not required Functional Skills/Capabilities Deep curiosity and questioning skills Ability to create innovative data solutions Knowledge of ML in areas like Fraud and Disputes modeling in a plus Technical Skills/Capabilities Complete grip on Python environment and libraries (scikit, nltk, pandas and numpy). Working knowledge of PySpark is a plus. Knowledge of the Hadoop Infrastructure and how it works Both Deep learning (keras/TF) and ML (scikit/xgboost) is required Knowledge Of Platforms Platforms primarily Python/HDFS Behavioral Skills/Capabilities American Express Leadership Behaviors Set The Agenda: Define What Winning Looks Like, Put Enterprise Thinking First, Lead with an External Perspective Bring Others With You: Build the Best Team, Seek & Provide Coaching Feedback, Make Collaboration Essential Do It The Right Way: Communicate Frequently, Candidly & Clearly, Make Decisions Quickly & Effectively American Express is an equal opportunity employer and makes employment decisions without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, disability status, age, or any other status protected by law. Employment eligibility to work with American Express in the U.S. is required as the company will not pursue visa sponsorship for these positions.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-19T07:25:20.000Z"
    },
    "company": {
        "name": "American Express",
        "link": "https://www.linkedin.com/company/american-express"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Phoenix",
        "region": "AZ",
        "postal_code": "85009",
        "street_address": null,
        "latitude": 33.448204,
        "longitude": -112.072586
    }
}