{
    "job": {
        "title": "Senior Software Engineer - Test",
        "industry": "Information Technology and Services,Computer Software,Hospital &amp; Health Care",
        "description": "Who we are: As our co-founders transitioned from military to civilian life, they encountered barriers and inefficiencies navigating the most basic health and social services. Together, they set out to improve that experience for others. Recognizing that social care is essential for better health outcomes, they embarked on a mission to connect people to the care they need, when they need it, in communities across the country. Unite Us has developed an intuitive and seamless technology solution that goes beyond the traditional referral method. We work side-by-side with local organizations, and track data and outcomes to build coordinated care networks that support all aspects of community health. Unite Us is boldly changing the nation’s care delivery system. If you want to do well and do good, join Unite Us– we can build healthier communities together. Description : Software Development Engineer in Test (SDET) at Unite Us are developers with a passion for quality. As an SDET, your role will be to act as the team’s subject matter expert in test engineering and contribute to code with a focus on testability. You will review designs and look closely at code quality and risk. On a day-to-day basis, you will work with cross functional team members to implement new automated testing solutions and diagnose problems with existing scripts, all running in Continuous Integration environment. The Software Development Engineer in Test plays an important part in our company’s product development process. Our ideal candidate will have demonstrated success in engineering test projects that are reliable and fast, supporting an efficient and effective testing cycle. If you have a passion for quality and engineer projects that are a joy to use and maintain, we’d like to meet you. What You ’ ll Do : Review requirements, specifications, and technical design documents for completion and testability Define testing strategies and scope for user stories and technical development tasks Provide estimates on testing efforts to Product and Engineering team members Create, update, review automated test cases to match product feature sets, execute manually as required. Engineer solutions to improve efficiency and effectiveness of testing cycles, including full-stack tests, integration tests, and CI Script, run, monitor, and analyze load tests to identify bottlenecks Perform regression testing appropriate to application and system changes Identify, investigate, report, and track defects Continuously learn new tools, technologies, and testing disciplines What ’ s Required : 6+ years of experience with development with tooling/test architecture Strong coding skills, proficient in at least one object-oriented programming or scripting language (e.g. Ruby, Java, C#, Python). Knowledge of professional software engineering best practices for the full software development life cycle, including code reviews, source control, build and release processes, containerization technologies, and test suite development and maintenance Strong working knowledge of AWS Cloud Services, Kubernetes, Linux, Docker. Proficient in a Continuous Integration environment (Jenkins, Spinnaker, CloudBees CodeShip) Performance / load testing experience preferred Experience working in Agile teams, particularly remotely Passionate about working with new technologies and sharing new discoveries",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-13T17:48:43.000Z"
    },
    "company": {
        "name": "Unite Us",
        "link": "https://www.linkedin.com/company/uniteus"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 72,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "United States",
        "region": null,
        "postal_code": "99999",
        "street_address": null,
        "latitude": 39.50355,
        "longitude": -99.0183
    }
}