{
    "job": {
        "title": "Data Scientist - Decisions",
        "industry": "Information Technology and Services,Computer Software,Internet",
        "description": "At Lyft, our mission is to improve people’s lives with the world’s best transportation. To do this, we start with our own community by creating an open, inclusive, and diverse organization. Data Science is at the heart of Lyft’s products and decision-making. As a member of the Science team, you will work in a dynamic environment, where we embrace moving quickly to build the world’s best transportation. Data Scientists take on a variety of problems ranging from shaping critical business decisions to building algorithms that power our internal and external products. We’re looking for passionate, driven Data Scientists to take on some of the most interesting and impactful problems in ridesharing. You will report to a Data Science Manager. Responsibilities Leverage data to build analytic frameworks to identify opportunities for growth and efficiency Partner with product managers, engineers, and operators to translate analytical insights into decisions and action Design and analyze experiments; communicate results and act on launch decisions Develop analytical frameworks to monitor business and product performance Establish metrics that measure the health of our products, as well as rider and driver experience Experience Degree in a quantitative field such as statistics, economics, applied math, operations research or engineering (advanced degrees preferred), or relevant work experience 3+ years of industry experience in a data science or analytics role Proficiency in SQL - able to write structured and efficient queries on large data sets Experience in programming, especially with data science and visualization libraries in Python or R Strong oral and written communication skills, and ability to collaborate with and influence cross-functional partners Benefits Great medical, dental, and vision insurance options Mental health benefits In addition to 12 observed holidays, salaried team members have unlimited paid time off, hourly team members have 15 days paid time off 401(k) plan to help save for your future 18 weeks of paid parental leave. Biological, adoptive, and foster parents are all eligible Pre-tax commuter benefits Lyft Pink - Lyft team members get an exclusive opportunity to test new benefits of our Ridership Program Lyft is an equal opportunity/affirmative action employer committed to an inclusive and diverse workplace. All qualified applicants will receive consideration for employment without regards to race, color, religion, sex, sexual orientation, gender identity, national origin, disability status, protected veteran status or any other basis prohibited by law. We also consider qualified applicants with criminal histories consistent with applicable federal, state and local law.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-03T23:04:02.000Z"
    },
    "company": {
        "name": "Lyft",
        "link": "https://www.linkedin.com/company/lyft"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "San Francisco",
        "region": "CA",
        "postal_code": "94121",
        "street_address": null,
        "latitude": 37.78008,
        "longitude": -122.42016
    }
}