{
    "job": {
        "title": "Data Scientist",
        "industry": "Hospital &amp; Health Care,Information Technology and Services",
        "description": "Data Scientist BETSOL is looking for a Data Scientist! We’re looking for someone with experience manipulating data sets and building statistical models. An ideal candidate should have excellent communication skills, solid programming and problem-solving skills, and a solid grasp of statistics and/or Machine Learning. What You'll Do As a Data Scientist you will support data-science and other analytics as needed. You will Develop SQL queries and data sets as well as develop business and client facing reports. Responsibilities: Understand business problems and suggest data and analytic solutions to support decision makers. Help develop and transform data sets using variety of programming languages. Develop and test analytic hypotheses using established methods. Create data visualizations that convey a clear story about what is observed in the data. Design, develop, and validate predictive and explanatory models using a wide variety of models. Communicate results to variety of audiences. Qualifications Bachelor’s degree with evidence of quantitative aptitude. 4-6 years of experience with agent-based, discrete event, or systems dynamics modeling methodologies; manipulating data sets and building statistical models, doing analysis, causal inference 4-6 years of experience programming in R, Python, or another programming language. 4-6 years of experience using analytical or statistical software technologies Experience with data cleaning, manipulation, discovery, analysis, and visualization of data Experience creating and using advanced machine learning algorithms and statistics: regression, simulation, scenario analysis, modeling, clustering, decision trees, neural networks, etc. Knowledge and experience in statistical and data mining techniques: GLM Regression, Random Forest, Boosting, Trees, text mining, social network analysis, etc. Experience visualizing/presenting data for stakeholders Preferred Experience Master’s degree or Ph.D. in computer science, statistics, data science, mathematics, engineering or other quantitative field Analytic or operational experience and / or education in Pharmacy, Nursing, Public Health, or other relevant medicine topics is appreciated. Experience using statistical computer languages (R, Python, SQL, etc.) Experience in Health care industry a plus; specifically working for a health-plan, data collection in Medicaid space.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-26T18:52:24.000Z"
    },
    "company": {
        "name": "BETSOL",
        "link": "https://www.linkedin.com/company/betsol"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Oakland",
        "region": "CA",
        "postal_code": "94612",
        "street_address": null,
        "latitude": 37.80483,
        "longitude": -122.27248
    }
}