{
    "job": {
        "title": "Software Engineer",
        "industry": "",
        "description": "Blockworks is a fast-growing financial media brand that delivers breaking news and premium insights about digital assets to millions of investors. Our editorial content, newsletters, podcasts and events provide investors with the critical analysis and information they need to make smarter decisions about digital assets. About the Role As our second engineering hire, you’ll have a unique opportunity to own several different projects and help us build the engineering team and tech stack. We’re looking for a Software Engineer who has a passion for building web experiences users will love, has strong design sensibilities, and is comfortable working with both frontend and backend code. This is a unique opportunity to influence the product and technical direction of a fast-paced, growing startup. We want to find the best person for the role regardless of where you are located. This role is open for candidates who are working remote as well as candidates who prefer to work from our New York City office. What You’ll Do Plan, shape, and build new product features from start to finish: through conception, research, implementation, and maintenance Examples of product features include: build data metrics into our website, build a referral campaign on top of our newsletter, increase site speed, integrate 3rd party services into our website and newsletter, build podcast pages that automatically update upon release of shows, create pages for crypto charts, and more. Help build both our tech stack and our engineering team Collaborate with our marketing and editorial teams to deliver and learn from experiments that move core business metrics Get to know the Blockworks reader to understand key points in their journey and uncover insights that will drive activation and engagement What We’re Looking For A couple of years of full stack experience Skilled in HTML, CSS and PHP Experience building custom WordPress themes Demonstrated ability to make beautiful websites and web apps Well-versed in modern frontend frameworks and best practices, including a robust knowledge of web application performance Comfortable making decisions in ambiguous situations with changing or unknown requirements Prior experience in a small startup or incubator environment Strong project scoping and project management skills Our current website is on WordPress but you’ll have the opportunity to expand off of WordPress Bonus: media or publisher experience, experience making product decisions based on data and A/B testing; SEO knowledge. Salary & Benefits A commitment to an open, inclusive, and diverse work culture Competitive pa 14 weeks of fully paid parental leave Medical, dental, and vision insurance 401(k) plan Remote work-station stipend Training & development Learning stipend Team happy hours and outings (even while remote!) Generous vacation and PTO policy Commuter benefits Next Steps The next step would be to complete a project-based assessment on the Hatchways platform. We know that diversity makes for the best problem-solving and creative thinking. We are dedicated to adding new perspectives to the team and encourage everyone to apply if your experience is close to what we are looking for. Blockworks is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-09-28T11:31:54.000Z"
    },
    "company": {
        "name": "Blockworks",
        "link": "https://www.linkedin.com/company/the-blockworks-group"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "United States",
        "region": null,
        "postal_code": "99999",
        "street_address": null,
        "latitude": 39.50355,
        "longitude": -99.0183
    }
}