{
    "job": {
        "title": "Color Management Software Engineer",
        "industry": "Consumer Electronics",
        "description": "Summary The Display and Color Technologies organization in Apple's Interactive Media Group is at the core of designing and implementing solutions for rendering visual media and enhancing visual experience. Examples of technologies that we’ve developed include High Dynamic Range Video and Images, Media Composition, and Pro Color features such as Display Presets. We are looking for candidates with strong engineering and mathematical intuition who are excited to solve new problems, working with a team from product conception to building production quality software. Key Qualifications Software development skills in C, C++ or equivalent languages Software debugging and optimization skills Comfort with describing problems using mathematics Interest in visual media technologies such as high dynamic range and wide color Interest in building algorithms & prototypes, and constructing visually compelling demos Description In your role as a color management software engineer, you will be responsible for developing software that renders visual media and performs display color management. Your responsibilities will include working with GPU, Pro Color Tools, Media Formats, and Display Hardware teams. Education & Experience BS/MS/PhD degree in Computer Science OR Electrical Engineering OR Equivalent Degree OR Equivalent Experience Additional Requirements - Strong problem solving and communication skills - Ability to stay focused and prioritize your work - Enjoy working in a collaborative environment Role Number: 200234097",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-01T07:39:30.000Z"
    },
    "company": {
        "name": "Apple",
        "link": "https://www.linkedin.com/company/apple"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Cupertino",
        "region": "CA",
        "postal_code": "95014",
        "street_address": null,
        "latitude": 37.319313,
        "longitude": -122.02927
    }
}