{
    "job": {
        "title": "Data Scientist",
        "industry": "Information Technology and Services",
        "description": "Senior Data Scientist Reply is looking for a Developer with experience in experience in Data Analytic, modelling techniques . Position is located at our office in Burr Ridge IL or ability to work remotely. The first project will be in the Energy Industry and it will consist in the migration, refactoring and upgrading of an existing application to model contracts with customers based on meters data and tariffs. Requirements: Degree in Computer Science, Mathematics, Physics, Engineering or another technical field (B.S. or higher) 3 or more years’ experience in software development (web applications, integration via web services). Experience working with tabular data in R and R packages (shiny, testthat, ggplot, lubridate, markdown, renv, devtools, data.table/dplyr ) Understanding of microservices and Java APIs Hands in experience with of AWS, Docker Bash/Unix fundamentals (scripting). Experience with time-series data (experience with time zones, DST) Excellent communication skills Main Responsibilities: Implement dynamic pricing and forecasting Enhance battery modeling Improve data cleaning techniques for meter and tariff data Support international calendars and measures Ensure test coverage for models Restructure existing libraries to work with new angular front end Preferred qualifications: Documentation in R Markdown, sphinx, or LaTeX Experience in Multyphysics and Linear Probability Modeling Experience with Python modeling Experience with optimization methods Experience with forecasting methods Experience with Energy storage and arbitrage Basic understanding of battery chemistry/physics/engineering Tools: GitHub Jira/Confluence Soft skills: Clear, concise communication + interpersonal skills Interest in improving grid resiliency and clean energy technology Test-driven, agile development mentality Fluency in English Ability to work in a highly autonomous environment and be highly self-directed. Ability to schedule communications with USA Pacific Standard Time Reply offers: Market competitive compensation (base salary and bonus). Health & Dental Insurance. Vision, Disability and Life Insurance (100% company paid). 401(k) company match Paid Time Off Vacation and Sick time. Company Paid holidays. Opportunities for training and certification in a skill area. Appropriate mentoring and training, to be successful in their position. Opportunities to learn and grow in a global environment Flexible schedule About Reply Reply US is part of Reply Group, a leading consulting company, specializing in innovative solutions based on new cutting-edge technologies. With more than 8000 employees globally, Reply is a center of excellence in a variety of technologies and practices. Reply provides to leading industrial groups, both in Europe and North America, with effective support in terms of the definition and development of business models enabled by the new technology and communication-based paradigms, such as Social Networking, Cloud Computing, and the Internet of Things, to optimize and integrate processes, applications, and devices. Industrie Reply is the Reply Group company focused on delivering innovative technology-based solutions to address Customers’ most complex Supply and Value Chain needs. Industrie Reply specializes in three major areas including Supply Chain Execution (SCE), Manufacturing/IoT, and Customer Experience (Cx). Industrie Reply’s focus on Industrie 4.0 methodologies, helps customers to achieve the highest levels of efficiency, through comprehensive consulting and technology solutions. Focusing on understanding the needs of our customers, and thanks to the potential offered by different technologies, we provide tailored solutions to fit client needs.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-18T21:09:40.000Z"
    },
    "company": {
        "name": "Industrie Reply US",
        "link": "https://www.linkedin.com/company/industry-reply-us"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Greater Chicago Area",
        "region": null,
        "postal_code": "60618",
        "street_address": null,
        "latitude": 41.948055,
        "longitude": -87.655754
    }
}