{
    "job": {
        "title": "Software Engineer",
        "industry": "Staffing and Recruiting",
        "description": "We are currently looking for Software Engineers to join our Product Capabilities team. If you are passionate about software development, sharing knowledge, growing your skills, and working with great people, then join us! Our engineering team is growing, and we are looking for extraordinary engineers who enjoy building as much as we do. You will have the opportunity to contribute to the evolution of a world class engineering team. The solutions you build will enable you the opportunity to positively change lives. What You’ll Gain You will get experience working with a cross-disciplinary team shipping real-world products to our customers around the nation. In the Product Capabilities team, you will work with the latest technologies such as Golang, Kafka, and GCP. Our team culture is autonomous yet collaborative and supportive. Your Responsibilities Design, develop, test (unit/integration/etc), deploy and maintain application code Develop multi-region, high performance services. Work with a variety of technologies: Go, Ruby, Postgres, Redis, Kafka and more Participate in the design process to build efficient, scalable and maintainable architecture Work cross-stack with other engineering teams to drive solutions Review and collaborate with other engineers on their code Engineers have a high degree of ownership for all aspects of their services Mentor and share knowledge with the team Interface with internal stakeholders to provide technical solutions and manage expectations Requirements Demonstrated working experience with common backend service languages such as Golang, Python, Ruby, Java, Rust, etc. Demonstrated understanding of the importance of testing discipline. Able to apply the SOLID principles Demonstrated experience in performance optimizations and trends. Working knowledge of best practices for the full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations. Comprehension of the principles of API design and web service integration. Experience with SOA, micro-services, and/or distributed architecture. Comfortable working with a distributed team. You are willing to monitor and own the production services team A passion for learning and development to invest in the betterment of self. Nice to Haves Experience with Golang. Caching and in-memory database technologies Asynchronous/Multi-threaded Programming Patterns Message queuing technologies/strategies Open source software and dependency management Working knowledge of agile and DevOps practices and principles",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-10-04T21:55:22.000Z"
    },
    "company": {
        "name": "High5",
        "link": "https://www.linkedin.com/company/high5hire"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "United States",
        "region": null,
        "postal_code": "99999",
        "street_address": null,
        "latitude": 39.50355,
        "longitude": -99.0183
    }
}