{
    "job": {
        "title": "Senior Software Development Engineer in Test",
        "industry": "Financial Services,Information Technology and Services,Internet",
        "description": "Our Purpose We work to connect and power an inclusive, digital economy that benefits everyone, everywhere by making transactions safe, simple, smart and accessible. Using secure data and networks, partnerships and passion, our innovations and solutions help individuals, financial institutions, governments and businesses realize their greatest potential. Our decency quotient, or DQ, drives our culture and everything we do inside and outside of our company. We cultivate a culture of inclusion for all employees that respects their individual strengths, views, and experiences. We believe that our differences enable us to be a better team – one that makes better decisions, drives innovation and delivers better business results. Job Title Senior Software Development Engineer in Test Overview Analyze code review reports and development quality to make sure best practices are being followed Develops/monitors quality gating and automation strategy for a given project looking at code coverage and API vs UI level functionality Possesses a strong knowledge of programming, tools, architecture patterns, and BDD Ensures Performance and Scalability for applications and platforms Responsibilities Works closely with software engineers to build quality by ensuring proper test and code coverage, configuration quality, monitoring, early performance testing Develops and implements QA standards, processes, tools and methodologies; partners with other functions to establish testing requirements Documents performance test strategies and test plans; translates complex system requirements and specs into test requirements and testing methods Participates in requirements review and performance testing activities; monitors resolutions and retains documentation Identifies and implements complex automation efforts; replicates and resolves production issues for single application Defines and implements best practices for end-to-end application performance management solutions; focuses on emerging technologies Assists in vendor assessment and evaluates and recommends software development tools May manage medium-sized project/initiatives as an individual contributor with advanced knowledge within discipline, leading a segment of several initiatives or a larger initiative and assigns day-to-day work Translates complex system requirements and specs into test requirements and testing methods Acts as first-review for project-level reviews, walkthroughs and inspections Directs evaluation of manual testing tools for automation opportunities Experiences Experience overseeing the coding, testing, and review process for unit and integration testing Successfully led multiple test paths simultaneously Successfully ensured quality of one or more application codebases and alignment with development standard Experience in building automation frameworks, acceptance and integration test automation scripts, integrating with other tools Due to COVID-19, most of our employees are working from home. We’ve implemented a virtual hiring process and continue to interview candidates by phone or video and are onboarding new hires remotely. We value the safety of each member of our community because we know we’re all in this together. Mastercard is an inclusive Equal Employment Opportunity employer that considers applicants without regard to gender, gender identity, sexual orientation, race, ethnicity, disabled or veteran status, or any other characteristic protected by law. If you require accommodations or assistance to complete the online application process, please contact reasonable.accommodation@mastercard.com and identify the type of accommodation or assistance you are requesting. Do not include any medical or health information in this email. The Reasonable Accommodations team will respond to your email promptly. Corporate Security Responsibility All Activities Involving Access To Mastercard Assets, Information, And Networks Comes With An Inherent Risk To The Organization And Therefore, It Is Expected That The Successful Candidate For This Position Must Every person working for, or on behalf of, Mastercard is responsible for information security. Abide by Mastercard’s security policies and practices; Ensure the confidentiality and integrity of the information being accessed; Report any suspected information security violation or breach, and Complete all periodic mandatory security trainings in accordance with Mastercard’s guidelines.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-23T06:22:35.000Z"
    },
    "company": {
        "name": "Mastercard",
        "link": "https://www.linkedin.com/company/mastercard"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "O'Fallon",
        "region": "MO",
        "postal_code": "63304",
        "street_address": null,
        "latitude": 38.808643,
        "longitude": -90.69996
    }
}