{
    "job": {
        "title": "Staff Software Engineer",
        "industry": "Marketing and Advertising,Information Technology and Services,Computer Software",
        "description": "Company Description ServiceNow is making the world of work, work better for people. Our cloud‑based platform and solutions deliver digital workflows that create great experiences and unlock productivity for employees and the enterprise. We're growing fast, innovating faster, and making an impact on our customers' and employees' lives in significant and important ways. With over 6,900 customers, we serve approximately 80% of the Fortune 500, and we're on the 2020 list of FORTUNE World's Most Admired Companies.® We're looking for people who are ready to roll up their sleeves and help us build on our incredible momentum, our diverse, engaged workforce, and our purpose to make the world of work, work better. Learn more on Life at Now blog and hear from our employees about their experiences working at ServiceNow. Job Description ServiceNow is seeking a Staff Software Development Engineer, to join our rapidly growing team, building highly scalable cloud services. The team is looking for a passionate senior developer/technical leader, with a strong track record, who is in search of an exciting environment and innovative technology. In this role, you will be a key member of a strong team of engineers working on some of the company’s core applications. What You Get To Do In This Role In this role, you will be a key member of a strong team of engineers working on some of the company’s core applications. You will focus on improving the performance, scalability and reliability of software and infrastructure that support thousands of ServiceNow customer instances across thousands of server farms globally distributed across the world. Working in an agile team, you will be responsible for identifying and solving issues and enhancements with the end goal of providing a better experience for our customers. Act as a mentor for colleagues and help drive knowledge-sharing. Qualifications To be successful in this role you have: Experience developing and operating enterprise scale, production, web. application software and infrastructure. Exceptional JavaScript and Java programming skills. Exceptional debugging, testing, and problem-solving skills. Solid understanding and experience with agile software development lifecycle. Proficiency in web technologies like HTML, REST, AJAX, XML. Strong written and verbal communications skills. Knowledge of scripting languages (like Perl, Python and bash). Strong understanding of relational database principles – queries, security, data types. Knowledge of cloud architectural components and distributed computing. High energy and is a self-starter with an aptitude and hunger for learning new technologies. 6+ or more years of development experience. Bachelor’s degree in SW Engineering or equivalent. The Following, While Not Essential, Are a Plus Working knowledge of Linux. Experience with open source technologies - Linux, MySQL, Apache/Tomcat, MariaDB. Experience with monitoring tools such as Splunk, Elk, and Xymon. ServiceNow Platform Experience. Experience with AWS or Azure deployments and support. Additional Information ServiceNow is an Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, creed, religion, sex, sexual orientation, national origin or nationality, ancestry, age, disability, gender identity or expression, marital status, veteran status or any other category protected by law. If you are an individual with a disability and require a reasonable accommodation to complete any part of the application process, or are limited in the ability or unable to access or use this online application process and need an alternative method for applying, you may contact us at +1 (408) 501-8550, or talent.acquisition@servicenow.com for assistance. For positions requiring access to technical data subject to export control regulations, including Export Administration Regulations (EAR), ServiceNow may have to obtain export licensing approval from the U.S. Government for certain individuals. All employment is contingent upon ServiceNow obtaining any export license or other approval that may be required by the U.S. Government.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-17T23:39:43.000Z"
    },
    "company": {
        "name": "ServiceNow",
        "link": "https://www.linkedin.com/company/servicenow"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "San Diego",
        "region": "CA",
        "postal_code": "92161",
        "street_address": null,
        "latitude": 32.71576,
        "longitude": -117.16382
    }
}