{
    "job": {
        "title": "Data Scientist",
        "industry": "",
        "description": "Ready to innovate? At VantageScore, we understand that we can’t prepare for tomorrow by focusing on today. We continuously invest in the future: investing in new skills, building better tools, and maintaining the highest standards for analytics and research to offer innovative products and solutions to help hundreds of millions of consumers improve their financial lives. About the Company VantageScore Solutions, LLC, develops innovative, market-leading consumer credit scoring models that feature groundbreaking solutions, leading to greater consistency, predictive power and inclusiveness to credit grantors, credit monitoring services, consumers and other users of credit scoring models. Its patented and patent-pending development methodologies enable institutions to rank order a consumer’s risk more accurately than other commercially available scoring models in the marketplace while at the same time expanding the universe of consumers who can have a fair and accurate credit score, enabling broader financial inclusion and access to credit. VantageScore was created to address the need for competition in a market that was historically dominated by a single brand of scoring model. VantageScore leverages the collective experience of the industry’s leading experts in consumer credit data, predictive sciences, credit risk modeling and analytics. By combining cutting-edge analytic techniques, VantageScore provides consumers and businesses with a highly consistent, predictive model that is easy to understand, implement and apply. Launched in 2006, VantageScore Solutions LLC is an independently managed joint venture of the nation’s three national consumer credit reporting companies (Equifax, Experian and TransUnion), offering the first and only tri-bureau generic credit scoring system that scores consumers consistently across all three companies. Based on an independent study conducted by the global management consulting and research firm Oliver Wyman, more than 12.3 billion VantageScore credit scores were used over a period of 12 months between July 2018 and June 2019, including use by 2,200 lending institutions of every size. About the Role We are seeking a motivated data scientist with high intellectual curiosity to join a talented and innovative team of analytics experts to support development of credit scoring models and other analytical solutions, develop data-driven insights, test new technologies and sources of data to pursue value propositions. This is an exciting role for someone looking to make an impact on consumer lending, developing innovative solutions to help millions of people gain access to credit products and improve their financial lives. Reporting to the Director of Data Science, the Data Scientist will work as part of a team. The role will seek to improve analytical performance and efficiency of models and other solutions by extracting information from various data sources with the use of sophisticated mathematical and statistical techniques, including AI and machine learning.  Towards that, the Data Scientist will leverage various open-source programming languages and technologies in the analysis of large, complex data and in developing insights and modeling solutions. This is a remote position with occasional travel to our Stamford, Connecticut office or for team or client meetings and off-sites. Specific responsibilities include: Analyze large data sets to derive analytic insights and solutions in support of product management and new product development Leverage programming skills, knowledge of machine learning tools and relevant technologies for data exploration and modeling Develop, validate and assess performance of models and other decisioning tools Interpret and present results to technical and non-technical audiences Support model adoption and the VantageScore brand through executing research and analysis related to products, consumer behavior, risk trends and timely topics related to consumer credit and the macro environment Collaborate within the Analytics team as well as across internal and external stakeholders Required Technical Skills Advanced degree in a quantitative discipline (data science, applied mathematics, statistics, computer science, engineering, econometrics or another related field) 2-3 years of experience in advanced analytics (statistics, machine learning,) in research and/or corporate environment Proficiency with machine learning techniques and ability to support predictive model builds and deployments Fluency in open-source programming languages and technologies (Python, R, Conda, AWS, Spark, SQL) that allows self-sufficiency in analyzing data, as well as interest in developing further skills Familiarity with the statistical/mathematical software SAS. Ability to write production level code Desired Skills Knowledge of financial industry and prior experience with consumer credit products is plus Strong analytical problem-solving skills and ability to assimilate complex information as well as experience in building and deploying innovative solutions Commitment to creating rigorous, high-quality insights from data Excellent communication skills to all levels of technical & non-technical audiences Team player with strong interpersonal skills, experience working in cross-functional teams. Self-motivated with the ability to work independently when needed",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-03T18:13:23.000Z"
    },
    "company": {
        "name": "VantageScore Solutions",
        "link": "https://www.linkedin.com/company/vantagescore-solutions"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "United States",
        "region": null,
        "postal_code": "99999",
        "street_address": null,
        "latitude": 39.50355,
        "longitude": -99.0183
    }
}