{
    "job": {
        "title": "Backend Software Engineer",
        "industry": "Computer Software",
        "description": "This position may work in the Lessonly office in Indianapolis, IN or remotely from any of the following states: Alabama, Florida, Georgia, Illinois, Indiana, Kentucky, Maine, Maryland, Massachusetts, Michigan, Missouri, Minnesota, Nevada, North Carolina, Ohio,Tennessee,Texas, Virginia or Washington. We are a tight-knit group with diverse backgrounds who value our culture. Individually, we strive to be humble, hungry, and people-smart. As a team we put learners first, we share before we are ready, we ask clarifying questions, we highlight what’s working, we have difficult conversations, we get agreements, and we make time for life. These aren’t just slogans we put on the wall…we love and live by our culture. So, if you are a hungry engineer who is looking to jump on a path of continuous learning, continuous improvement, and a team that values impacting real people in a real way… look no further, you may be a llama and just don’t know it yet. The candidate in this role will be most successful if they have a desire to grow in our entire stack but specialize immediately in the backend. Specifically, a love for SQL and APIs will take you a long way! Candidates for this role will typically have at least 2 years of experience building production software, but if you've gained equivalent experience in another way, we'd still love to talk. Roles & Responsibilities Backend Engineering (80%) Backend engineering at Lessonly includes the following server-side tech stack; Ruby, Rails, PostgreSQL, Redshift, Algolia, Redis, Memcached, and whatever comes next. This job will require the ability to write code according to our Ruby style guide and Rails style guide which will include fixing bugs, authoring and modifying gems, as well as authoring and modifying core and supporting application functionality. Code Reviewer (20%) A strong peer review culture is incredibly important to us. Everyone strives to improve every day, and the code review process is vital to this goal. Skills Essential Abilities You have experience building server-side tools, applications, APIs, or similar. You have experience writing and maintaining code with a team at scale. You have experience working closely with back-end engineers, designers, testers, and product managers. People skills, along with a desire to both learn and teach, are essential. You frequently ask clarifying questions about the intended impact of the work, weighing options, and devising creative solutions to complex problems. You take a big problem and decompose it into shippable chunks that can ensure all parties are aligned on the outcome. You are able to translate the non-technical business needs into a clear technical action plan and vice versa, seamlessly. You are known for the ability to make an estimate, establish a deadline collaboratively, and hit that mark. Server-side tech (especially Ruby, Rails, Postgres, Docker) Working Cross-Functionally Producing value, not work Showing progress through iteration Business and technical translation Promises delivered Nice-to-have Abilities As demonstrated by having written production-quality integrations that involve JSON, XML, and open protocols such as SAML or xAPI. Integration tech Lessonly Benefits A whole person approach to taking care of you with medical, vision, dental, disability, financial, mental, and life benefits Time for life with unlimited PTO, Summer Break (all-company week of vacation in July) and Winter Holiday (all-company time off in December) Paid parental leave for primary and secondary caregivers Giving back to our communities with dollars and volunteer time through our Brighter Indy program Flexibility to #dobetterwork in the location that works best for you –– the Indianapolis office, your home office or that local coffee shop you love Recognition for the work you do and the success of our team –– shout outs, weekly MVPly award, quarterly Golden Llama award, and a team that is always excited to celebrate meeting a challenge Lessonly is an Equal Opportunity Employer, we do not discriminate against any protected class including, race, color, religion, sex, national origin, sexual orientation, gender identity, genetic information, disability or protected veteran status. Lessonly will provide reasonable accommodation to qualified individuals with disabilities. Please contact careers@lessonly.com if you require a reasonable accommodation to apply for a job.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-25T17:25:33.000Z"
    },
    "company": {
        "name": "Lessonly",
        "link": "https://www.linkedin.com/company/lesson-ly"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Indianapolis",
        "region": "IN",
        "postal_code": "46203",
        "street_address": null,
        "latitude": 39.76845,
        "longitude": -86.15621
    }
}