{
    "job": {
        "title": "Software Engineer",
        "industry": "Information Technology and Services,Computer Software,Internet",
        "description": "Platform9 Systems, Inc. is the leading Managed Kubernetes provider for hybrid and edge clouds. With a mission to enable freedom in cloud computing, the company delivers cloud-native technologies with SaaS simplicity that are easy to operate and scale, while supporting broad cloud capabilities that run on any infrastructure. The company’s SaaS management model has been proven to eliminate management complexity and costs through automated cluster upgrades, security patches, and fully-managed monitoring and troubleshooting across multiple points of presence, edge sites, and data centers with guaranteed SLAs. Headquartered in Mountain View, CA, Platform9 clients include enterprises such as Starbucks, Redfin, Kingfisher Retail, Cloudera, Juniper Networks and Mavenir. We are looking for a Software Engineer. Requirements You can work as part of a team, and treat others with respect and kindness. You take pride in your craft, and hold yourself and others to high standards. You are a self-starter and can work fairly independently on your projects. You are good at spoken and written communication – this includes design documentation, APIs, comments and everything else that goes with building maintainable software You’re passionate about the exciting parts of the job, but recognize that not all of the necessary work will be fun. You’re willing to learn various new technologies. The “cloud native” field of software is rapidly evolving: you’ll need to stay aware of it and quickly learn new technologies whenever necessary or relevant. You are good at algorithms and data structures Our Technology Stack: We use the following technologies; we have no minimum experience required for any of them, but you will need to learn them relatively quickly on the job, if you’re not already familiar with them. Golang Python Linux, Bash scripting Kubernetes, with Docker containers Cloud technologies like AWS, GCP, Azure To succeed in this role you’ll need to be a team player with a strong sense of ownership for your work and a passion for working in a data driven organization. Platform9 Core Values i Innovation C Customer Obsession O Ownership with OKRs R Radical Candor Powered by JazzHR 26vUglG8DK",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-12T07:13:42.000Z"
    },
    "company": {
        "name": "Platform9 Systems",
        "link": "https://www.linkedin.com/company/platform9-systems"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Mountain View",
        "region": "CA",
        "postal_code": "94040",
        "street_address": null,
        "latitude": 37.39008,
        "longitude": -122.08139
    }
}