{
    "job": {
        "title": "SOFTWARE ENGINEER - Remote Opportunity",
        "industry": "Information Technology and Services,Computer Software,Financial Services",
        "description": "At Pitney Bowes, we do the right thing, the right way. As a Software Engineer for Pitney Bowes, you can too. We have amazing people who are the driving force, the inspiration and foundation of our company. Our thriving culture can be broken down into four components: Client. Team. Win. Innovate. We Actively Look For Prospects Who Are passionate about client success. Enjoy collaborating with others. Strive to exceed expectations. Move boldly in the quest for superior and best in market solutions. You Are A Self-motivated Contributor who can be part of a team that designs and develops cloud-based microservices that are consumed by customer facing applications. Also, collaborating across the organization with architects, UX experts, software engineers and product managers to deliver cloud solutions. You are a Performance-driven individual who wants a role that contributes to the success of all applications a business delivers to their customers, then this role is for you! You Will Full Stack development Designing and solving complex software engineering solutions Work with cross-functional teams to design and develop innovative solutions that meets the needs of our customers Evaluate and incorporate new technologies into new and existing frameworks as applicable Collaborate with and mentor members of the team and other coworkers. Be agile, embrace change and should be able to work independently. Your Background Qualifications - External As a Software Engineer You Have B.S. in Computer Science, Engineering or related discipline At least 4 years of experience in designing and developing large scale, mission critical and high available/scalable solutions Strong In Angular and Node.js CI/CD toolset: GitLab CI/CD, Jenkins, Ansible Proficient In Microservices Development Scripting: Python or JavaScript Core Java, Spring MVC, Spring Boot and Hibernate Databases and web storage AWS ecosystem, Docker, K8S Preferred Agile Methodology Experience Excellent interpersonal skills and the ability to work with diverse and distributed product teams Experience programming in Go Experience with Cloud Native Technologies We Will Provide the opportunity to grow and develop your career Offer an inclusive environment that encourages diverse perspectives and ideas Deliver challenging and unique opportunities to contribute to the success of a transforming organization Offer comprehensive benefits globally (pbprojectliving.com) Our Team Our Software team powers global commerce, processing billions of transactions every year. Our Software technology and solutions help businesses operate faster and more efficiently. How? By identifying trusted data and insights to create targeted, effective messaging, by providing accurate geographic data to make smarter business decisions, and by delivering relevant and engaging Pitney Bowes is an Equal Employment Opportunity/Affirmative Action Employer that values diversity and inclusiveness in the workplace. Women/Men/Veterans/Individuals with Disabilities/LGBTQ are encouraged to apply. All interested individuals must apply online. Individuals with disabilities who cannot apply via our online application should refer to the alternate application options via our Individuals with Disabilities link.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-20T05:46:35.000Z"
    },
    "company": {
        "name": "Pitney Bowes",
        "link": "https://www.linkedin.com/company/pitney-bowes"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 48,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Baltimore",
        "region": "MD",
        "postal_code": "21226",
        "street_address": null,
        "latitude": 39.290443,
        "longitude": -76.612335
    }
}