{
    "job": {
        "title": "Machine Learning Engineer",
        "industry": "Computer Software,Information Technology and Services,Internet",
        "description": "Description Do you have experience working with or building information retrieval, search or question answering systems? Are you passionate about functional and operational performance? Do you want a chance to use cutting-edge tools, technologies and work in close collaboration with machine learning scientist to deliver value to millions of customers? Amazon is looking for a Machine Learning Engineer for initiatives within Alexa Web Info which is part of our ongoing Alexa Information efforts focused on reinventing information extraction and retrieval for a voice-forward, multi-modal future. You will have an opportunity to directly impact the customer experience, design, architecture, and implementation of products that will be used every day by people you know. We're looking for someone passionate about innovating on behalf of customers, who demonstrates strong product ownership and is willing to think in new ways to solve difficult problems. Job responsibilities Collaborate closely with applied scientists on machine learning operations tasks ranging from ML data management to training and deployment of ML models. This work will be primarily based on Python and a distributed computing framework (e.g. Spark). Develop data collections, labeling pipelines and evaluation pipelines. Research and develop machine learning models for text training resources. Design and build text-based storage and indexing systems in a large distributed computing environment and ensure these systems are scalable, fault-tolerant, low cost, and easy to manage/use, etc. Amazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please visit https://www.amazon.jobs/en/disability/us. Basic Qualifications 1+ years of experience contributing to the architecture and design (architecture, design patterns, reliability and scaling) of new and current systems. 2+ years of non-internship professional software development experience Programming experience with at least one modern language such as Java, C++, or C# including object-oriented design 2+ years of non-internship professional software development experience Programming experience with at least one modern language such as Java, C++, or C# including object-oriented design 1+ years of experience contributing to the architecture and design (architecture, design patterns, reliability and scaling) of new and current systems. Experience in ML as listed in preferred qualifications Preferred Qualifications An ideal candidate will have experience or have demonstrated expertise in some of the following: MS or PhD in Computer Science or equivalent experience in ML ML data management (collect, store, manage data), creating training datasets (data labeling, feature engineering, data partitioning, sampling and slicing), building and training machine learning infrastructure, model deployment (inference constraints, model compression, server and client side ML, employment evaluation), ML infrastructure monitoring and maintenance, familiarity with architectural choices for ML systems. Prior experience with using or maintaining a NoSQL database (e.g. MongoDB) is a plus. Prior programming experience and expertise in Python (and basic ML libraries such as numpy, scipy) and a distributed computing framework (e.g. Spark) is a plus. Experience managing and running Mturk experiments Adept at handling ambiguous or undefined problems Prior experience working in collaboration with ML/data scientists Company - Amazon.com Services LLC Job ID: A1673578",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-12T09:39:25.000Z"
    },
    "company": {
        "name": "Amazon",
        "link": "https://www.linkedin.com/company/amazon"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Seattle",
        "region": "WA",
        "postal_code": "98133",
        "street_address": null,
        "latitude": 47.60323,
        "longitude": -122.33028
    }
}