{
    "job": {
        "title": "Software Engineer, Distributed Systems - Energy Software",
        "industry": "Automotive,Renewables &amp; Environment,Utilities",
        "description": "Role Want to work on IoT platforms that support Powerwall, Powerpack, Megapack, Tesla Solar, Solar Roof, Powerhub, Supercharger, Autobidder, Model S/3/X, and the Tesla App? Want to work with functional programming, streaming data, and distributed systems? Want to work with Scala, Akka, Reactive Streams, InfluxDB, PostgreSQL, and Kubernetes? Tesla is looking for a Software Engineer to build the cloud services that power these products, driving the worldwide transition to sustainable energy. This platform provides real-time monitoring, optimization, and control of distributed, renewable-energy assets, including generation, storage, grid services, and electric-vehicles. The platform incorporates reliable data collection and storage for millions of real-time data streams; services for publishing and subscribing to streaming data; support for real-time stream processing and aggregation; and reliable, low-latency messaging for the distributed command and control of energy assets. You must enjoy working on challenges related to the availability, reliability, scalability, and security of these distributed software systems. Responsibilities Design, develop, and maintain distributed software systems that incorporate real-time and streaming data for monitoring, aggregation, and control. Characterize complex problems related to the scalability, reliability, performance, and security of production systems. Test the performance, scalability, and reliability of software systems at scale, including developing the services to support this testing. Provide technical leadership and foster collaboration. Maintain the high quality standards of the team. Employee Benefits As a full time Tesla employee you will receive full benefits from day 1 for you and your dependents. Kaiser and UnitedHealthcare PPO and HSA plans (including infertility coverage) 3 medical plan choices with $0 paycheck contribution Vision & dental plans (including orthodontic coverage) Company paid Life, AD&D, short-term and long-term disability 401(k), Employee Stock Purchase Plans, and other financial benefits Employee Assistance Program, Paid Time Off, and Paid Holidays Back-up childcare and employee discounts",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-09-01T21:43:10.000Z"
    },
    "company": {
        "name": "Tesla",
        "link": "https://www.linkedin.com/company/tesla-motors"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Palo Alto",
        "region": "CA",
        "postal_code": "94310",
        "street_address": null,
        "latitude": 37.445103,
        "longitude": -122.16036
    }
}