{
    "job": {
        "title": "REMOTE Sr. Software Developer (70% Backend)",
        "industry": "Construction,Information Technology and Services,Financial Services",
        "description": "Job Title: Sr. Software Developer Job Location: Austin, TX OR -100% REMOTE- Job Salary: $90k - $140k DOE + 15 days of PTO + 9 Company Holidays + 3.5% 401k Match + Comprehensive Health Benefits! Requirements 8+ yrs of Software Development Full-Stack Development Solid background in databases B.S. in Computer Science, or similar Preferred Salesforce Development 100% REMOTE OPPORTUNITY!- Top Reasons to Work with Us Based in North Austin, TX, we are a leading Real Estate Fintech company helping residential investors grow their portfolios with our innovative technology and streamlined process offerings. Currently, we are looking to bring on a Software Developer. If you would like to be a pivotal part of our QA team and help mature our automation, frameworks, and tools, we would love the time to tell you more about this amazing opportunity! Work with a passionate and tight-knit team that are all about working together to achieve our goals! Upward mobility and growth opportunities based on merit and success. Fast 50 growing company in Austin Voted Top Workplace in Austin APPLY NOW: If you are looking for your next incredible challenge that not only will help your skills develop but will help your career move up, this is the place for you! CONTINUE READING AND APPLY TODAY! What You Will Be Doing As the Software Developer, you will be building out pools that are used internally and externally to process loan origination for a growing, well-established and reputable Financial Services Technology Organization! What You Need for this Position Preferred Salesforce Development 100% REMOTE OPPORTUNITY!- So, if you are a Software Developer with 8+ yrs of experience, please apply today! Email Your Resume In Word To Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also: Katherine.Krull@CyberCoders.com Please do NOT change the email subject line in any way. You must keep the JobID: linkedin : KK5-1639613 -- in the email subject line for your application to be considered.*** Katherine Krull - Lead Recruiter - CyberCoders Applicants must be authorized to work in the U.S. CyberCoders, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-25T17:32:14.000Z"
    },
    "company": {
        "name": "CyberCoders",
        "link": "https://www.linkedin.com/company/cybercoders"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 96,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Phoenix",
        "region": "AZ",
        "postal_code": "85009",
        "street_address": null,
        "latitude": 33.448204,
        "longitude": -112.072586
    }
}