{
    "job": {
        "title": "Software Engineer",
        "industry": "Information Technology and Services,Computer Software,Internet",
        "description": "About The Role As the Software Engineer, you will design and develop new web services to provide data analysis, live data/video feeds, data editing, and command and control for client’s access control systems. This project will enable administrators of Brivo access control systems to monitor and interact with all aspects of their specific security control system. In this role you will also be expected to: Work with your team to build scalable microservices and REST APIs Maintain quality of product and test coverage (including automated tests) In conjunction with other team members, help improve development and quality strategies to streamline the check-in, testing, and overall productivity for coding and building the application Collaborate with peers in your Agile team to complete code reviews, sprint planning, and backlog grooming Work in DevOps culture and foster product ownership As part of best development practices, the SW Engineer will ensure full unit test coverage of code they write and implement Focus on performance and writing clean maintainable code About You Bachelor’s degree in Computer Science, or closely related IT field preferred. At least 3 years experience of full-stack .NET development Strong foundation in web applications and services and modern software architecture Experience with the following: REST API development and RESTful Web development with JavaScript Setting up and managing CI builds on Azure and Azure DevOps Services Front-end technologies and frameworks such as JavaScript, Node.js, and React Writing SQL queries and interacting with databases Modern authorization mechanisms, such as JSON Web Token AWS technologies, Kubernetes, and Docker a plus About Us Brivo is the global leader in mobile, cloud-based access control for commercial real estate, multifamily residential, and large distributed enterprises. Our comprehensive product ecosystem and open API provide businesses with powerful digital tools to increase security automation, elevate employee and tenant experience, and improve the safety of all people and assets in the built environment. Having created the category over twenty years ago, our building access platform is now the digital foundation for the largest collection of customer facilities in the world, trusted by more than 25 million users occupying over 300M square feet of secured space in 42 countries. Our dedication to simply better security means providing the best technology and support to property owners, managers, and tenants as they look for more from buildings where they live, work, and play. Our comprehensive product suite includes access control, smart readers, touchless mobile credentials, visitor management, occupancy monitoring, health and safety features, and integrated video surveillance, smart locks, and intercoms. Valued for its simple installation, high-reliability backbone, and rich API partner network, Brivo also has the longest track record of cybersecurity audits and privacy protections in the industry. Brivo is privately held and headquartered in Bethesda, Maryland. Learn more at Brivo is an Equal Opportunity/Affirmative Action Employer Powered by JazzHR VAgPjuOTgZ",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-29T07:08:13.000Z"
    },
    "company": {
        "name": "Brivo",
        "link": "https://www.linkedin.com/company/brivo-inc"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Bethesda",
        "region": "MD",
        "postal_code": "20894",
        "street_address": null,
        "latitude": 38.984856,
        "longitude": -77.09269
    }
}