{
    "job": {
        "title": "Site Reliability Engineer (SRE) Technical Lead/ Sr. Solutions Architect (551)",
        "industry": "Information Technology and Services,Defense &amp; Space,Computer Software",
        "description": "Smartronix is seeking a driven and talented Site Reliability Engineer Technical Lead/Senior Solutions Architect to join our thriving Cloud Services business unit and work with some of the best Cloud Architects and Cloud Engineers in the market. This individual will bring a strong trouble-shooting background, generalist technical skill set, and an ability to deploy production-ready solutions. The individual will be capable of working independently in the role when needed, able to act with a sense of urgency, and willing to contribute as an active member of the Smartronix Cloud community. A strong focus on quality, communication, customer success, and results, the individual will be working alongside some of the best Cloud technologists in the market, jointly driving to successful project execution. Job Responsibilities Take direction from, and provide clear and timely updates to, Project Lead or Project Manager Deploy and configure cloud services according to best practice (e.g.: EC2, VPC, RDS, IAM, CloudFront, Route53, CloudWatch, KMS, Redshift, S3 and Glacier, Kinesis) Identify opportunities to automate and/or bring efficiency to technical processes Identify system or performance issues, and develop resolutions Participate in troubleshooting of infrastructure and/or application related issues Produce well-written technical project documentation and operational runbooks Participate in change management processes Maintain core working hours but remain flexible to support after-hours maintenance and escalations (as necessary) Participate as a team player capable of high performance and flexibility in a dynamic working environment Take ownership of issues and act with high sense of urgency when required Achieve and maintain AWS certifications Required Skills And Experience Clearance requirement: None; ability to obtain Bachelor's degree and 7+ years of relevant hands-on experience Ability to dissect a technical architecture into engineering plans and discrete tasks Ability to develop and deploy Production-ready AWS solutions through Infrastructure as Code 3+ years developing DevOps solutions from scratch using tools such as Ansible, Jenkins, Packer, AWS Code and related products Ability to build code pipelines and support deployment activities 3+ years writing AWS automation solutions using JavaScript, Bash, Python, or similar 3+ years with AWS CloudFormation and/or Terraform 5+ years building infrastructure solutions on AWS platform with a solid understanding of foundational cloud components (e.g.: VPN, Direct Connect, IAM, CloudWatch, \"cross account\" capabilities) Ability to produce client-ready technical documentation Strong ability to assume technical leadership roles and drive project teams to implement solutions Ability to solve complex customer problems Collaboration and communication skills Strong written and verbal communication skills Customer-focused attitude Desired Qualifications Hands-on experience writing and deploying AWS Lambda functions AWS Certified DevOps Engineer – Professional Who We Are Smartronix, an OceanSound Partners company, delivers advanced solutions in digital modernization, cloud, cybersecurity, mission-focused engineering, systems integration and intelligence, surveillance, and reconnaissance (ISR) capabilities. The company provides expertise to design, manage and secure the world's mission critical enterprise solutions. We are a leading provider of next generation multi-cloud platforms to public sector and commercial markets leveraging most innovative global platforms. Headquartered in the Washington DC area, Smartronix has offices throughout the U.S. and has been positioned by Gartner as a Leader in its 2020 Magic Quadrant for Public Cloud Infrastructure Professional and Managed Services, Worldwide. Who Are Our Employees Our employees are encouraged to think big and collaborate every day. We ensure that each employee is not only aware of our strategic vision; they are a part of it. This is because we know that our employees are critical components to the company’s ever-growing success. Committed to ensuring the highest levels of customer satisfaction, Smartronix is structured around the programs and technologies we support to provide optimal and seamless operations. Due to our talented workforce, we have maintained a reputation for excellence, helping to assure the missions of our Department of Defense, Public Sector, Fortune 1000, and other Government and commercial customers. Smartronix is committed to hiring and retaining a diverse workforce. All qualified candidates will receive consideration for employment without regard to disability, protected veteran status, race, color, religious creed, national origin, citizenship, marital status, sex, sexual orientation/gender identity, age, or genetic information. Selected applicant will be subject to a background investigation. Smartronix is an Equal Opportunity/Affirmative Action employer.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-19T04:13:25.000Z"
    },
    "company": {
        "name": "Smartronix",
        "link": "https://www.linkedin.com/company/smartronix"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 84,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "United States",
        "region": null,
        "postal_code": "99999",
        "street_address": null,
        "latitude": 39.50355,
        "longitude": -99.0183
    }
}