{
    "job": {
        "title": "Software Developer, Digital",
        "industry": "Financial Services",
        "description": "As a company whose mission is to be the most progressive and inclusive money transfer business in the world, we deliver the highly reliable payment services to our customers. With locations in over 402k locations in 165 countries, we have adopted the true identity of what it means to be multicultural and embody the idea of being family, no matter where we are. At Ria, you’re be surrounded by colleagues, both in Buena Park, CA and across the Globe, who are dedicated to each other and empowered to be creative and nurture “out of the box” solutions. Ria Digital's line is involved in development and maintenance of Ria Digital web and mobile applications. They handle the maintenance of extensible microservices for all applications at Ria. This branch designs and delivers complex and highly scalable solutions with the best of resources available. WHAT YOU HAVE: 4-5 years of overall full stack software development experience 3+ years’ experience in high transaction volume environment Proven .NET experience (C#) and expert understanding of Object-Oriented Design and Programming Hands-on experience developing SOAP and RESTful services implementing authorization and authentication procedures Demonstrated strong communication skills across cross-functional teams, peers and executives Experience or exposure to architect/design enterprise wide applications OUR TECHNOLOGIES: HTML5, CSS, JavaScript libraries like Angular/ JQuery/ Ionic/Vue, .Net, C#, SQL Server, Web Services, SOAP and RESTful services. WHAT YOU WILL DO: Application analysis, design, development, unit testing and implementation activities Code across all layers including Front end, Web APIs, Integration with 3rd Parties, SQL scripts BONUS POINTS FOR THESE: A bachelor's degree in Computer Science or closely related field from an accredited university; Masters preferred. Troubleshooting experience with Elastic Search tools like Splunk\\Graylog\\Kibana, NoSQL Database experience with Redis\\Dynamo\\Mongo and full Stack development with experience on Web and Mobile front-end technologies Why Choose Ria? In this business, humility can be hard to come by. We put others ahead of ourselves, the way our customers do every day. Because this isn’t just business, it’s personal. People deserve much more than just a fair price. They deserve empathy, hope and ultimately respect. This how we do right by people and their needs – not more, not less. We never rest, we raise the bar and put people first. We work hard and take nothing for granted. We facilitate possibilities in every possible way. We champion people’s needs, today and tomorrow. We open ways for a better everyday life.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-25T17:40:12.000Z"
    },
    "company": {
        "name": "Ria Money Transfer",
        "link": "https://www.linkedin.com/company/ria-financial"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 48,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "California",
        "region": "United States",
        "postal_code": "93266",
        "street_address": null,
        "latitude": 37.254673,
        "longitude": -119.61728
    }
}