{
    "job": {
        "title": "Data Scientist, Client Services",
        "industry": "Information Technology and Services,Computer Software,Internet",
        "description": "We Breathe Life Into Data! At Komodo Health, our mission is to reduce the global burden of disease. Smarter use of data is essential to this mission. We combine the world’s most comprehensive view of patient encounters with innovative algorithms and decades of clinical expertise to power our Healthcare Map, the industry’s most precise view of the U.S. healthcare system. With the Healthcare Map as our foundation, we offer a suite of powerful software applications that deliver exceptional value to the industry. Our people are the center of our success. We are a smart, supportive team with diverse perspectives and a shared passion for fixing what’s broken in healthcare. It’s fun, challenging and important. Join us! The Opportunity at Komodo Health The Life Science Services team’s mission is to support Life Science customers and products through custom applications of our healthcare map along with actionable insights that enable Komodo to meet our business goals. Our data scientists help build analytics pipelines and complex logic for complicated data projects that solve tangible customer use cases. Looking back on your first 12 months at Komodo Health, you will have: Delivered high-value data analytics projects that our existing data products could not cover Worked with Product to help prototype new analytics offerings Effectively partnered with customer-facing teams to reconcile client requirements with the capabilities of datasets available at KH Incorporated a good understanding of the healthcare datasets at Komodo and client use-cases to effectively partner with data engineering teams for architectural decisions Created a plan with the team to scale our solutions, automate code and centralize complex logic. Advocated for good engineering practices within the team like documentation and code reusability Presented findings, insights and analytical results to internal partners for client deliveries, as well as the larger DS function for continued growth and learning What You Bring To Komodo Keenly analytical mindset and the ability to solve complex problems with limited supervision Experience writing SQL queries and working with Relational Databases and Proficient in scripting with Python Ability to work well both independently and collaboratively, in a fast-paced and demanding agile environment Interest in growing their skills as a Data Scientist and being willing to learn and teach as part of a team Strong business acumen demonstrated by a good understanding of how analytics insights tie into business goals High motivation, work ethic, and self-discipline to organize and complete tasks Curiosity piqued? Learn more about us! Komodo Health Acquires Breakaway Partners Komodo Health Secures $220M in Series E funding led by Tiger Global Komodo Health Acquires Mavens, Series D funding led by ICONIQ Growth Wealthfront: The 2021 Career Launching Companies List In Conversation with Dr. Arif Nathoo, Komodo Health’s CEO Komodo Health’s ‘Meet a Dragon’ series Komodo’s Values that Drive our Culture",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-24T01:10:19.000Z"
    },
    "company": {
        "name": "Komodo Health",
        "link": "https://www.linkedin.com/company/komodo-health"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "New York",
        "region": "NY",
        "postal_code": "10132",
        "street_address": null,
        "latitude": 40.713047,
        "longitude": -74.00723
    }
}