{
    "job": {
        "title": "Site Reliability Engineer",
        "industry": "Computer Hardware,Computer Software,Information Technology and Services",
        "description": "RiskIQ, which is part of Microsoft's Cloud Security team. RiskIQ is the leader in attack surface management, providing the most comprehensive discovery, intelligence, and mitigation of threats associated with an organization’s digital presence. With more than 75 percent of attacks originating outside the firewall, RiskIQ allows enterprises to gain unified insight and control over web, social and mobile exposures. RiskIQ’s platform combines advanced internet data reconnaissance and analytics to expedite investigations, understand digital attack surfaces, assess risk, and take action to protect the business, brand, and customers. Responsibilities Design and develop features as part of delivering our Communication Platform. Adhere to and drive modern software engineering practices through design and code reviews. System design through well-defined interfaces across multiple components, code reviews, leveraging data/telemetry to make decisions. Develop “best-in-class” engineering for our services by ensuring that the services and the components are: well-defined and modularized, secure, reliable, diagnosable, actively monitored and reusable. Improve test coverage for services, organize and implement integration tests, and resolve problem areas. Consider testability, portability/monitoring, reliability, and maintainability, and understand when code is ready to be shared and delivered. Gain a working understanding of Microsoft as a business and collaborate with mentors and leaders in order to contribute to cohesive, end-to-end experiences for our users. Focus on customer/partner needs through a data driven approach. Qualifications Significant Coding experience Java, Python, Bash or other equivalent Mastering CI\\CD concepts and hands on implementations experiences 3+ years of Linux hands on system experiences 3+ years of a mix of coding/testing/Integration experience Proven experience with building services, supportability, and monitoring Infrastructures Ability to manage, proof of concept and deliver multiple project phases at the same time Strong analytical and problem solving and organizational skills Excellent written and oral communication skills Ability to deal with the ambiguity associated with working in a fast-paced and changing environment. Leadership skills: Sound problem resolution, judgment, negotiating and decision-making skills. Feedback/Metrics collection techniques to expose live site/service issues Support a 24x7 live site support model for the services the team owns Preferred Experiences And Technologies Kubernetes, and the Kubernetes satellite technologies Hadoop and/or HBase experience Spark, Data Lake or hands on big data platform pipeline development (Ex. Azure Data Factory, Data Explorer/Kusto, Data Bricks, Spark) Azure DevOps and GitHub tooling Data mining or data science experiences utilizing Big Data and\\or relational data bases technologies Excellent communication skills and ability to collaborate in a multi-disciplinary team consisting of Software Engineers, Program Managers, Security researchers, and Data Scientists Development experience with cloud platforms such as Microsoft Azure Microsoft is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. If you need assistance and/or a reasonable accommodation due to a disability during the application or the recruiting process, please send a request via the Accommodation request form. Benefits/perks listed below may vary depending on the nature of your employment with Microsoft and the country where you work.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-10-13T04:33:20.000Z"
    },
    "company": {
        "name": "Microsoft",
        "link": "https://www.linkedin.com/company/microsoft"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "San Francisco",
        "region": "CA",
        "postal_code": "94121",
        "street_address": null,
        "latitude": 37.78008,
        "longitude": -122.42016
    }
}