{
    "job": {
        "title": "Data Analyst",
        "industry": "Information Technology and Services",
        "description": "Need local to Phoenix AZ Need (USC,GC and EAD only) No H1 or C2C Responsibilities include but are not limited to: Designing reports requiring analysis, writing of SQL, data mining, and presentation to technical and non-technical audiences in a variety of technical platforms (Power BI, Tableau, Excel, etc.) Prioritize business and operational needs Extract, import, clean, transform, and validate data Writing queries using SQL, T-SQL, and MS Access Experience with DB2 Identify, analyze, and interpret trends or patterns in complex data sets Create standard and ad-hoc reports including detail, summary, history, snapshots, drill down, and other reports Develop report specifications, test plans, prepare test data, execute tests, supporting documentation, and coordinate production implementation Establish data connections with various data sources Setup report schedule, subscription, access process and procedures, and delivery method Present data in lists, tables, charts, graphs, snapshots, crosstab, and other formats Tailor the analysis and reporting methods by the type of data as well as to the intended audience Review key indicators to locate and correct problems Follow up and track remediation of issues Write and present Desk-Aids and Work-Flows for both technical and non-technical audiences. Knowledge, Skills & Abilities: Knowledge of Service Level Agreement (SLA); laws, rules, security policies, privacy, data confidentiality management. Knowledge of Engineering workflow, IT lifecycle and system design, performance tuning, and Business Intelligence tools and features. Knowledge of Statistical and business analysis and research and analysis methodologies. Knowledge of multiple business intelligence software applications (SQL, SSIS, MS Visual Studio, Tableau, Visual Basic, MS Access, etc.) and multidimensional and relational database design. Knowledge of project management concepts, principles, and practices. Skilled in dimensional and relational database design. Skilled in analysis, design review, troubleshooting, implementation, and integration for applications. Skilled in keyboarding and use of Microsoft Office programs such as Excel, Word, Access, and PowerPoint and Google for gmail, calendar, chat, sheets, docs, slides, etc. Problem and negotiation skills to research and resolve issues. Good time management and organizations skills with attention to detail. Skilled in effective listening, oral and written communications skills to communicate technical and non-technical concepts to a variety of audiences. Ability to write business and functional requirements and diagram business processes, translate into technical solutions and reports, query and view objects, and present in a meaningful format.",
        "employment_type": "CONTRACTOR",
        "date_posted": "2021-07-21T02:07:23.000Z"
    },
    "company": {
        "name": "Sharp Decisions",
        "link": "https://www.linkedin.com/company/sharp-decisions"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Phoenix",
        "region": "AZ",
        "postal_code": "85009",
        "street_address": null,
        "latitude": 33.448204,
        "longitude": -112.072586
    }
}