{
    "job": {
        "title": "Remote React Engineer",
        "industry": "Information Technology and Services",
        "description": "LaSalle Network is currently partnering with one of the fastest growing technology companies of our generation, in an industry larger than any other. This client has the opportunity and obligation to build a world-class engineering team and the operating platform that will transform the real estate industry. In 2019, they tripled the size of their Product & Engineering team, and are searching for creative and inspiring colleagues at all levels of the engineering organization to join as they continue to expand in 2021. The Remote React Engineer will have the opportunity to work 100% remotely (must be located in USA) and this is a long-term contract position (1+ year) and has the option to turn to full time. Remote React Engineer Responsibilities: Lead the tech planning and development of the front end and middleware of our workflow products that power collaboration between buyers, sellers, and real estate agents Write JavaScript code that is architected for scalability and re-use. Have strong opinions on code structure and modularization Work with backend engineers to design and implement intuitive APIs and webhooks in Java and Go Collaborate with product and design to move fast on creating solutions to business problems Be a domain expert on real estate technology and products and an empathetic partner to our customers Continually champion improvement by identifying ways to raise the quality bar of the team and systems around you Remote React Engineer Requirements: Experience building large, complex systems, particularly web service and microservice architectures with emphasis on industry best practices History of delivering products/systems through their full life cycle, from idea conception, technical planning, implementation, launch, measurement, and maintenance/iteration Prior experience collaborating with UX, Design, and Product Managers Familiarity with containerization, microservices architecture, continuous integration, and delivery Strong proficiency with JavaScript, including modern frameworks like React, Angular, or Vue Experience with Redux, ES6, Webpack is a plus Knowledge or strong interest in Java or Go is a plus If you have the experience listed above, possess a great attitude and are looking for a long-term opportunity with a stable and established employer, this is the role for you! If you are interested in learning more, please apply today! Thank you, Curt Winkle Sr. Project Manager, Technology Services LaSalle Network Keywords and Related Terms: software engineering , react , redux , graphQL , JavaScript LaSalle Network is an Equal Opportunity Employer m/f/d/v. LaSalle Network is the leading provider of professional staffing and recruiting services. LaSalle has worked with more than 10,000 companies, ranging from Fortune 500s to start ups. With units specializing in accounting and finance, administrative, marketing, executive search, technology, supply chain, healthcare revenue cycle, call center, and human resources, LaSalle serves companies of all sizes and across all industries.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-25T17:43:57.000Z"
    },
    "company": {
        "name": "LaSalle Network",
        "link": "https://www.linkedin.com/company/lasalle-network"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 12,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Chicago",
        "region": "IL",
        "postal_code": "60654",
        "street_address": null,
        "latitude": 41.88323,
        "longitude": -87.6324
    }
}