{
    "job": {
        "title": "Software Engineer / Web Developer (Python) REMOTE",
        "industry": "",
        "description": "Full Stack Engineer / Web Developer We are looking for a great coder who has experience with Python, Django, Postgres, Git, HTML5, AWS, responsive object-oriented web design, and good communication skills. iOS/ChromeOS development is a plus. The hiring company, SPROCKIT, is well established and profitable. Small team building a brand new product. All REMOTE positions. This is a permanent position for an Internet Software Engineer / Web Developer / Full Stack Engineer / Software Developer. You will design and build scalable internet web-based software systems in a high-availability, high-performance Python / Django environment on AWS. Lead the technical level design, development, testing and debugging of software components and products. Take ownership of product problems and issues including pro-actively communicating to coordinate activities. Develop features in an Agile environment and quickly apply new software enhancements and improvement upgrades effectively. Desired Skills and Experience Education: B.S. in Computer Science, Engineering. Experience: ... Minimum 3+ years \"hands-on\" Internet/web software development experience. ... Experience in development on Unix, Linux, or Solaris platforms. ... Strong object-oriented design & development skills. Skills and Abilities: ... Expert-level Python development skills, Django familiarity. ... Experience with exception handling, namespaces, and internationalization. ... Familiarity with database applications and SQL is highly desirable. ... Strong analytical, communication, and problem solving skills. ... Team-oriented individual, energetic, results oriented, and interested in quality. ... Strong knowledge of data structures, algorithms, and fundamental concepts. ... Fluent in object-oriented programming languages, such as Python. ... Familiarity with AWS is desirable, but not required.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-14T21:00:17.000Z"
    },
    "company": {
        "name": "SPROCKIT",
        "link": "https://www.linkedin.com/company/sprockit-world-series-of-start-ups"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "United States",
        "region": null,
        "postal_code": "99999",
        "street_address": null,
        "latitude": 39.50355,
        "longitude": -99.0183
    }
}