{
    "job": {
        "title": "Data Scientist",
        "industry": "Health, Wellness and Fitness",
        "description": "Athletic Greens is a 100% remote company... and always has been! 🌎 For this particular opening, we are looking for somebody who lives in the United States. ____________ ABOUT US: At Athletic Greens, our purpose is to inspire fulfilling lives, starting with a focus on health. Our core values are: people first, life is an opportunity and no compromises. These values guide us in every decision we make. We look for them within our own team, but also in anyone who works with us. We’ve spent 10 years researching with the help of doctors, naturopaths, and nutritionists to create the highest efficacy and nutritionally complete supplement on the planet. We never stop learning, growing, and researching. It’s our mission to continue adding value to our products and improving the lives of our customers. THE ROLE: We are looking for an experienced and talented Data Scientist to join our Product team. Reporting to the SVP, Data & Analytics, you will work directly with key stakeholders to understand business needs, identify opportunities to optimize existing processes, and leverage your data and analytics skills to provide better visibility into financial data and develop insights to enable leadership to make effective, data-driven decisions. We are looking for a self-motivated, agile team-player who enjoys working in a fast-paced, hyper-growth environment and is excited to take on new challenges. WHAT YOU’LL DO: Identify, design and build solutions that enable strategic initiatives and operational improvements. Utilize internal & external data sources to identify promising new trends to aid in marketing strategy and product development Contextualize the research & synthesize the raw data into actionable insight & trend reports Work cross functionally with internal and external teams to deliver actionable insights & recommendations across business functions Aid in the development of algorithms and automations to be used internally Design and develop ETL workflows and datasets in SQL/Python Write complex SQL queries with multiple joins to automate/manipulate extracts Troubleshooting complex process and functional issues and manage these through to resolution Diagnose and troubleshoot data discrepancies and errors Understand existing source system data models and offer solution for improvement Ad-hoc reporting as necessary across a wide variety of business functions WHAT WE’RE LOOKING FOR: Comfortable navigating large datasets, acquiring and cleansing data from multiple sources Proficiency with at least one of the programming languages, such as R, Python or SQL Advanced data visualization skills and hands-on experience with Tableau, PowerBI or other BI tools Strong digital analytics skills and advanced knowledge of Google Analytics Familiarity with A/B testing, experimentation and product, UX/UI research methodologies Experience with consumer and market research methods, including survey, focus groups, qualitative and quantitative brand, consumer satisfaction, experience and other studies Familiarity with B2C acquisition and subscription marketing concepts and metrics, including customer journeys, conversion funnels and critical reporting (CAC, payback, retention rate, etc.) WHAT’S IN IT FOR YOU? A 100% remote working environment, which has been implemented from day one. An immensely strong company culture that is enforced through the hiring process ensures values alignment and a highly collaborative team. 90% premium coverage for top medical, dental and vision plans. A mission-driven approach to each and everything that we do, with an overall goal to significantly improve our customer's health and wellness. Paid maternity and paternity leave to allow you to spend time with your new family. Top of the market salary and performance incentive structure with “blue sky” upside potential. A monthly fitness class credit to support you on your health and fitness journey. Annual company-wide retreats and quarterly department-wide meet-ups (COVID permitting). A 401k plan with company-matching because life is an opportunity and we care about your future. Paid holidays and an unlimited vacation policy to ensure you have a healthy work-life balance. The opportunity to work with passionate, high-growth, business-minded colleagues who bring their all to the Athletic Greens mission each and every day. A brand new company laptop and a generous home-office budget so you can work your best. *Athletic Greens is an Equal Opportunity Employer. We are committed to inspiring fulfilling lives, starting with a focus on health and we believe this starts in the workplace. We do this by providing employees with a safe and welcoming work environment free of discrimination and harassment. We strive to create a diverse & inclusive environment where all team members can thrive, feel a sense of belonging, and make a difference in the world together. We do not discriminate based on age, race, color, religion, sex, sexual orientation, gender identity, national origin, pregnancy, veteran status, disability, or any other status protected by law. We are an equal opportunity employer.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-24T15:15:04.000Z"
    },
    "company": {
        "name": "Athletic Greens",
        "link": "https://www.linkedin.com/company/athletic-greens"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "San Diego",
        "region": "CA",
        "postal_code": "92161",
        "street_address": null,
        "latitude": 32.71576,
        "longitude": -117.16382
    }
}