{
    "job": {
        "title": "Software Application Production/DevOps Engineer",
        "industry": "Pharmaceuticals",
        "description": "If you are an experienced Software/IT professional with proven success owning the application production environment including changes, security and compliance, and incident response, this is the role for you. We are a tech-enabled pharmaceutical services company. With nearly 10 years in the business, we provide direct, hands-on support to pharmaceutical manufacturers along with custom services to increase patient access and facilitate the economic and operational efficiencies in the prescription fulfillment process. We are looking for an experienced Software/IT Engineer to join our team. What You Will Be Doing You will own the application production environment including all changes, security and compliance, and incident response. Achieve/Maintain HIPAA compliance of the production environment Respond to production-related client requests (ad hoc changes and queries) Reporting data results back to the relevant business stakeholders/customers Ensure all changes to the production environment are documented Execute and/or oversee changes to the production environment Perform regular security tests Own/manage the CI/CD pipeline Monitor performance and uptime of the production application Respond to and document production incidents (security incidents, application failures) Work with outside compliance experts to create processes and software safeguards that allow the production environment, data access procedures, and software development processes to achieve HIPAA compliance. Work with our business rules engine and analyze business rule results Monitor operational trends in our transactional data Code deployments Diagnose bugs and develop fixes What You Need for this Position Qualifications BS Degree Overall experience in software/database development, security and similar Python Scripting AWS/Cloud Security DevOps Tools/Operation HIPAA Compliance Experience owning the application production environment as it relates to changes, security and compliance, and incident response Production Application performance and uptime monitoring, production incident response, security incidents, application failures, etc. Disaster Recovery Process creation Scripting and knowledge of database structures SQL/NoSQL Python, PowerShell, JSON Microsoft Office - Excel and PowerPoint What's In It for You Competitive Salary and Benefits So, if you are an experienced Developer/IT Engineer with relevant experience, please apply today! Email Your Resume In Word To Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also: Tim.Sugrue@CyberCoders.com Please do NOT change the email subject line in any way. You must keep the JobID: linkedin : TS2-1639185 -- in the email subject line for your application to be considered.*** Tim Sugrue - Recruiting Manager - CyberCoders Applicants must be authorized to work in the U.S. CyberCoders, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-31T07:02:08.000Z"
    },
    "company": {
        "name": "CyberCoders",
        "link": "https://www.linkedin.com/company/cybercoders"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Chicago",
        "region": "IL",
        "postal_code": "60654",
        "street_address": null,
        "latitude": 41.88323,
        "longitude": -87.6324
    }
}