{
    "job": {
        "title": "Software Engineer (C#, Azure, Chatbot)",
        "industry": "Information Technology and Services",
        "description": "Title: Software Engineer (C#, Azure, Chatbot) As the Sr. Software Engineer for a nationally recognized healthcare technology company based in Dallas, you will develop and support conversational AI, Voice, and Text applications. The ideal candidate will have experience with natural language conversation concerning Conversational AI (chatbots, Google/Alexa) and enjoy working in a fast-paced, technically astute team. Direct Hire position. Local candidates preferred. Unable to sponsor. Required Skills and Experience Knowledge in/with conversational AI (chatbots, Google/Alexa voice skills) Experience with at least two of the following interfaces (text/SMS, “chat bubble” text, IVR-like interaction on a phone or voice device, e.g., Google Hub/Alexa). C#, .NET Core experience in an Azure environment. Strong experience with Azure Kubernetes Demonstrated experience with Agile methodology. Two + years of experience with relational databases. NoSQL is preferred. Experience with Angular or React, design patterns, event-driven systems, message-driven systems. Nice to Have Knowledge of Node.js and Typescript Familiar with designs and applications using No-SQL technologies Experience in microservice development Prior healthcare experience Responsibilities Work with multiple product development teams to support APIs supporting “chat AI” integration across products. Act as active Agile team member, assisting in the success of the Scrum team Evolve existing product offerings while also designing enterprise-grade green-field systems. BENEFITS of working for our Client: Great Far North Dallas Location Excellent Medical and 401K with matching Generous PTO Work from home options",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-09T20:21:48.000Z"
    },
    "company": {
        "name": "Elan Partners",
        "link": "https://www.linkedin.com/company/elanpartners"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Addison",
        "region": "TX",
        "postal_code": "75001",
        "street_address": null,
        "latitude": 32.968605,
        "longitude": -96.83004
    }
}