{
    "job": {
        "title": "Machine Learning Engineer",
        "industry": "Information Technology and Services",
        "description": "We are: Accenture Federal Services, helping our federal clients tackle their toughest challenges while unleashing their fullest potential…and then some. What makes our approach so unique? Operating from the nation’s capital, we bring together commercial innovation and leading-edge technologies to deliver an integrated and interactive experience that far exceeds expectations. How? Our passion meets purpose! Through our diverse culture and inclusive thinking, we embrace our employees' ideas taking them from concept to practical solutions. Not to mention, we sleep well at night knowing our work directly impacts and improves the way the world works. We keep our tech smarts sharp by providing abundant training and certification opportunities. Through our diverse culture, workforce, and inclusive thinking, we embrace our employees' ideas, taking them from concept to practical solutions. Are you ready to learn and grow in a career, while making a difference? You are: The MVP of Machine Learning and AI. Infatuated with the possibilities behind this technology, you know we’ve only scratched the surface. Your enthusiasm radiates, keeping audiences wowed by how you run machine learning experiments using a programming language with machine learning libraries. What sets your stats apart? You're the game changer in the outputs arena that creates significant improvement in functionality for your clients. You execute and optimize machine learning solutions into production for performance and scalability, so it's nothing but net ! The work: Develop machine learning solutions to meet business use cases and to support experimentation and innovation to advance mission outcomes Collaborate with business SMEs, architects, data engineers, developers, and data scientists to identify innovative machine learning solutions that leverage data to meet business goals Ensure infrastructure and data pipelines are structured to deploy machine learning solutions Here’s what you need: Handling large-scale data processing and machine learning workloads and distributed systems using cloud native services on one or more Cloud Platforms (GCP, Azure and/or AWS). Coding skills in Python Understanding of algorithms, data structures and coding standards Productionizing developed Machine Learning solutions using DevOps One more thing, this role requires US Citizenship; no dual citizenship Bonus Points: Bachelor's degree in data science, applied mathematics, computer science or otherwise research-based field Important information: Applicants for employment in the US must have work authorization that does not now or in the future require sponsorship of a visa for employment authorization in the United States and with Accenture Federal Services Accenture Federal Services is an EEO and Affirmative Action Employer of Females/Minorities/Veterans/Individuals with Disabilities. Equal Employment Opportunity: All employment decisions shall be made without regard to age, race, creed, color, religion, sex, national origin, ancestry, disability status, veteran status, sexual orientation, gender identity or expression, genetic information, marital status, citizenship status or any other basis as protected by federal, state, or local law. Job candidates will not be obligated to disclose sealed or expunged records of conviction or arrest as part of the hiring process. Accenture Federal Services is committed to providing veteran employment opportunities to our service men and women. Candidates who are currently employed by a client of Accenture or an affiliated Accenture business may not be eligible for consideration.  An active security clearance or the ability to obtain one may be required for this role.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-09-02T03:40:34.000Z"
    },
    "company": {
        "name": "Accenture Federal Services",
        "link": "https://www.linkedin.com/company/accenturefederalservices"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Washington DC-Baltimore Area",
        "region": null,
        "postal_code": "21201",
        "street_address": null,
        "latitude": 38.873062,
        "longitude": -77.007385
    }
}