{
    "job": {
        "title": "Autonomy AI Machine Learning Software Engineer",
        "industry": "Defense &amp; Space",
        "description": "Summary Description The Autonomy/AI ML Software Engineer is responsible for developing, integrating, and deploying autonomy and artificial intelligence algorithms for mission systems and production and maintenance operations. Translates requirements and develops code, determining appropriate software methods, training system to recognize patterns to perform specific functions. Supports the technology development life cycle from requirements generation through development, integration, scenario development and modeling, testing and debugging. May support research and development on prototyping of autonomous systems in some organizations. Key Responsibilities Develops, integrates, and implements algorithms to enable perception, motion/mission planning, controls, etc. functionality in LM products and platforms Translates requirements and applies requirements to development code, integrating autonomy, AI or machine learning algorithms to LM products and platforms Determines software methods to best acquire and execute knowledge Implements algorithms into software to train systems to recognize patterns and perform specific functions Responsible for various phases of developing and maintaining autonomy software from requirements generation, software design and development to integration, testing, troubleshooting and debugging, and implementation Review test outcomes, conducts troubleshooting, and works to debug issues Develops human-machine interface scenarios, breaking missions into tasks Documents interface requirements and implements human-machine interfaces Interfaces with other teams involved the development lifecycle for perception, mission and motion planning, simulation and modeling, testing, etc.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-06T20:25:14.000Z"
    },
    "company": {
        "name": "Lockheed Martin",
        "link": "https://www.linkedin.com/company/lockheed-martin"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Littleton",
        "region": "CO",
        "postal_code": "80018",
        "street_address": null,
        "latitude": 39.61265,
        "longitude": -105.0162
    }
}