{
    "job": {
        "title": "Senior Software Engineer",
        "industry": "",
        "description": "We are looking for an experienced Senior Software Engineer who is passionate and has cybersecurity experience. The incumbent will be responsible for writing and coding individual programs, presenting to clients and more. Duties and Responsibilities Interpret business requirements and technical specifications Design APIs to encompass service functionality Perform coding to technical specifications Investigate, analyze and document reported defects Perform maintenance programming and correction of identified defects Create and document and implement unit test plans, scripts, and test harnesses Create and maintain technical documentation using defined technical documentation templates Participate in brainstorm sessions with the team Co-lead presentations, demo our software and answer client questions Performs related duties as assigned Skills / Attributes Required Minimum of 5 years experience Substantial experience in C/C++ and C# Multithreading (concurrent) programming abilities System-level application/services programming experience Knowledge of database architecture and design Strong object-oriented programming skills and design patterns Internationalization experience is a plus Good communication skills, team player and cooperative Ability to interpret requirements and technical specifications. Ability to code software according to published standards and design guidelines. Flexible attitude, ability to perform under pressure. A commitment to quality and a thorough approach to the work. Ability to work well within a team Ability to work with minimal supervision",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-18T22:15:35.000Z"
    },
    "company": {
        "name": "CryptoMill Cybersecurity Solutions",
        "link": "https://ca.linkedin.com/company/cryptomill-technologies"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "CA",
        "locality": "Toronto",
        "region": "ON",
        "postal_code": "N3W1Z9",
        "street_address": null,
        "latitude": 43.651894,
        "longitude": -79.381714
    }
}