{
    "job": {
        "title": "Data Scientist",
        "industry": "Computer Software,Biotechnology,Pharmaceuticals",
        "description": "Schrödinger’s mission is to revolutionize drug discovery through the use of breakthrough computational methods. We are currently looking for outstanding individuals to join our drug discovery group and contribute to our rapidly expanding portfolio of drug discovery collaborations. Our drug discovery group of around 60 scientists includes designers, modelers, computational chemists, medicinal chemists, crystallographers, biochemists, and biologists. The group is supported by more than 100 software developers and engineers. Three of the programs we’ve worked on in the past 7 years have progressed into the clinic and an additional one is expected to enter clinical trials this year. For recent news on one of these programs, go to this website. If you are interested in a career combining science and technology on drug discovery projects, we are eager to hear from you. Job Requirements Participate in drug discovery group projects Research, curate and prepare computational chemistry data sets, including: Search scientific journals, patents, and databases for potential data sources Transfer data from source to computer files or database systems, including the 2D rendering of chemical matter Verify data by comparing it to source documents and update existing data Prepare and maintain drug discovery group chemical database content Querying, exporting, and uploading data and structures Retrieve data from the database or electronic files as requested Participate in improving software and processes via early access usage, bug reporting, and outlining improvement requests Essential Qualifications And Experience Bachelor’s degree in chemistry, biology, or biochemistry Successful completion of at least one year of organic chemistry coursework Familiarity with two-dimensional chemical structure representations, especially depictions of stereochemistry Approach research in an organized fashion with a strong attention to detail Practical experience with tabular data in common spreadsheet formats (e.g. MS Excel, Google Sheets, comma-separated or tab-separated values) Motivated learner: willing to take on new challenges Adapts quickly to changing situations, methods and procedures Desirable Skills Experience with analyzing scientific journal articles Experience with any of the following: Spreadsheets (MS Excel, Google Sheets, CSV) Online sources of scientific information (especially NCBI PubMed, RCSB PDB, UniProtKB, EMBL-EBI ChEMBL, CAS SciFinder, Elsevier Reaxys) Unix and/or Linux Scripting (shell, Python, Perl) Version control (Git) Research experience in chemistry or biology Pay And Perks Schrödinger understands it’s people that make a company great. Because of this, we’re prepared to offer a competitive salary, stock options, and a wide range of benefits that include healthcare (with dental and vision), a 401k, pre-tax commuter benefits, a flexible work schedule, and a parental leave program. We have catered meals in the office every day, a company culture that is relaxed but engaged, and over a month of paid vacation time. Our Administrative and Human Resources departments also plan a myriad of fun company-wide events. We've been working remotely from across the world over the past few months because the health and safety of our employees is paramount. Nonetheless, we have kept Schrödinger's outstanding culture going through a series of online fitness classes, trivia nights, happy hours, and so much more. Sound exciting? Apply today and join us! As an equal opportunity employer, Schrödinger hires outstanding individuals into every position in the company. People who work with us have a high degree of engagement, a commitment to working effectively in teams, and a passion for the company's mission. We place the highest value on creating a safe environment where our employees can grow and contribute, and refuse to discriminate on the basis of race, color, religious belief, sex, age, disability, national origin, alienage or citizenship status, marital status, partnership status, caregiver status, sexual and reproductive health decisions, gender identity or expression, or sexual orientation. To us, \"diversity\" isn't just a buzzword, but an important element of our core principles and key business practices. We believe that diverse companies innovate better and think more creatively than homogenous ones because they take into account a wide range of viewpoints. For us, greater diversity doesn't mean better headlines or public images - it means increased adaptability and profitability.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-13T06:26:06.000Z"
    },
    "company": {
        "name": "Schrödinger",
        "link": "https://www.linkedin.com/company/schr-dinger"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Portland",
        "region": "OR",
        "postal_code": "97268",
        "street_address": null,
        "latitude": 45.516018,
        "longitude": -122.68143
    }
}