{
    "job": {
        "title": "Machine Learning Engineer",
        "industry": "Information Technology and Services",
        "description": "Machine Learning Engineer: About the Position As a member of our Engineering team, you will work with a tight, highly skilled machine learning / data science team dedicated to the development of proprietary consumer insights. You will be working closely with our Data Scientists, implementing highly available and scalable machine learning pipelines. If you are a Software Engineer passionate for technology who wants to work with a mature, intensely skilled team, values total ownership of your work, and can’t imagine a day without coding, we want to speak to you! We're looking for a creative, focused, collaborative, technically curious individual who enjoys both design as well as working hands-on with the code. If you are interested in working on cutting edge ML and AI projects at Internet scale and speed this is the job for you! Key Responsibilities Design and implement ML feature pipelines Optimize pipelines and processes for model development, experimentation and scaled production scoring Implement machine learning algorithms and libraries in service to modeling and production scoring pipelines Monitor and ensure the quality of machine learning solutions by implementing process and control disciplines as well as tooling to govern Analyze large and complex data sets to derive valuable insights, inform feature and product development Apply machine learning and data science techniques and design distributed systems Qualifications & Experience Requirements Strong Software Engineering background with emphasis in data science and machine learning Fluent in Java, Python, and/or Scala programming languages Strong communication skills including the ability to describe complex models and findings to different audiences and stakeholders, from data science peers to business decision-makers Demonstrated exploratory analysis and visualization abilities in a non-academic settings Strong bias for action and ability to pivot quickly and act with agility according to the needs of the business Working knowledge of machine learning frameworks and the data and computation management mechanisms that surround them in a cloud environment (AWS) Experience designing, implementing, and transitioning to AI/ML cloud based frameworks such as Amazon SageMaker Experience implementing quality and control disciplines for Machine Learning pipelines through process and tooling Ability to handle multiple projects simultaneously, meet deadlines, and effectively manage priorities and communicate progress Fluent in Linux based systems, Docker, and code versioning tooling (Git/CI/CD) Computer Science or equivalent degree and work experience",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-15T15:23:52.000Z"
    },
    "company": {
        "name": "1872 Consulting",
        "link": "https://www.linkedin.com/company/1872-consulting"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Virginia",
        "region": "United States",
        "postal_code": "23038",
        "street_address": null,
        "latitude": 37.512905,
        "longitude": -78.697624
    }
}