{
    "job": {
        "title": "Network Engineer",
        "industry": "",
        "description": "Integral Blue, LLC is seeking an Intelligent Transportation Systems (ITS) Network Engineer for ITS Construction and Maintenance projects that will assist with all technical aspects of multiple projects from developing repair plans to device failures and network integration, coordinating with a team of Project Managers, Network and Systems engineers, and technicians. Duties/Responsibilities Device configurations for initial integration of ITS devices and maintenance/repair. Examples of devices include cellular modems, firewalls, ethernet switches (L2 and L3), CCTV, video walls, video management software, network monitoring software, etc. Assist with project specific engineering related to wireless radios, fiber optic cable, network engineering and ITS device integration Network IP scheme development, updates, and management (IPv4 and limited IPv6) Generate technical diagrams, engineering and as-built drawings, scopes of work, test plans and procedures, implementation plans and project schedules; and Assist with updating communication network diagrams, fiber splice diagrams and Ethernet addressing layouts Assist with overseeing day to day operations of several ITS maintenance projects Schedule, attend and run progress/coordination meetings, both internal and external as needed Monitor and review work orders to ensure proper response times Assist with tracking and reporting progress of high priority work orders and out of scope work Work with clients and stakeholders to understand needs as they may relate to system upgrades/enhancements Develop estimates for system upgrades/enhancements, coordinate with vendors and sub-contractors when necessary to provide specialty services and/or material Work with Field Superintendent, Foreman and Project Managers to schedule field labor force to complete high priority work orders, out of scope work and system upgrades/enhancements Develop and/or review bill of materials for different technical project components Successfully communicate project scope and requirements to subcontractors, vendors and suppliers Assist Project Managers with proposal “take-offs” and requirements review in preparation for project proposals and bid estimates, inventory, procurement, and other project engineering tasks Assist with technical proposal development Other duties and responsibilities as assigned by designated supervisor and IB Management This job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the employee. Duties, responsibilities and activities may change or new ones may be assigned at any time with or without notice. Required Knowledge/Skills/Abilities Experience in configuring IPv4 network equipment. Excellent verbal and written communication skills. Excellent interpersonal skills. Excellent organizational skills and attention to detail. Strong analytical and problem-solving skills. Ability to act with integrity, professionalism, and confidentiality. Proficient with Microsoft Office Suite. Any of the Following Qualifications Desired: Completion of a Bachelor’s degree in Electrical/Electronic, Computer Science, Information Technology, Information Systems Management, or equivalent combination of education and/or experience listed within the Knowledge, Skills, and Abilities section. At least two years of work experience related within the industry of IT, ITS, electrical, electronic, and/or telecommunication systems. Any BICSI Certifications – RCDD, RTPM, OSP, TECH, INST1, INSTC, INSTF Any Cisco certifications – CCENT, CCT, CCNA, CCNP CompTIA – A+, Network+, Security+ CWNP – CWNA, CWSP, CWAP, CWDP ISC2 – SSCP, CCSP, CISSP ITIL Certifications Microsoft Certifications Professional Engineering (PE) Licensed in the State of Michigan SolarWinds Certified Professional (SCP) Any existing knowledge, skills, or abilities related to Intelligent Transportation Systems, video display systems, IT networks, SCADA, connect vehicle technology, or backhaul communications such as wireless and fiber optics. Any existing knowledge, skills, or abilities related to Intelligent Transportation Systems (ITS), video display systems, IT networks, or backhaul communications such as wireless, cellular, and fiber optics. Health and Safety Demonstrate a strong commitment to grow and foster a culture of safety by upholding standards and best practices of safety in the workplace. Commit to putting safety first in all aspects of work. Report all safety concerns, incidents and near misses. Company Culture Demonstrate commitment to the company’s core values. Participate in all initiatives supporting the company’s core values. Physical Requirements Prolonged periods of sitting at a desk and working on a computer. Must be able to lift 15 pounds at times. Must be able to access and navigate each department at the organization’s facilities. Travel Requirements Occasional state-wide travel. Regular travel to and from Integral Blue’s Corporate Office in Madison Heights, MI. Integral Blue, LLC provides a competitive employment package which including: Competitive wage compensation Paid Time Off Paid holidays Health, dental, vision group benefits options Health, dental, vision group benefits coverage options Short Term Disability, Critical Illness, Hospitalization, and Accident coverage options Company paid Basic Life \\ AD&D and Long Term Disability coverages Supplemental Life \\ AD&D insurance options 401k with match of 50% up to 6% of annual income Education assistance Integral Blue is an Equal Employment Opportunity Employer. Please visit www.integral-blue.com to check out our updated Vision, Mission and Core Values!",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-20T22:58:04.000Z"
    },
    "company": {
        "name": "Integral Blue",
        "link": "https://www.linkedin.com/company/integral-blue"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Madison Heights",
        "region": "MI",
        "postal_code": "48071",
        "street_address": null,
        "latitude": 42.504738,
        "longitude": -83.10574
    }
}