{
    "job": {
        "title": "Data Scientist, New Graduate",
        "industry": "Marketing and Advertising,Computer Software,Internet",
        "description": "Our mission at Duolingo is to develop the best education in the world and make it universally available. But we’ve got more left to do — and that’s where you come in! Duolingo is the most popular language-learning application in the world, with over 500 million users and over half a billion exercises completed daily. Beyond our core learning product, we have also entered into literacy with Duolingo ABC and English proficiency testing with the Duolingo English Test . We are passionate about educating our users, making fact-based decisions, and finding innovative solutions to complex problems. We offer meaningful work, limitless learning opportunities, and collaboration with world-class minds. Come brighten your life and over half a billion more! What You’ll Do... Derive insights from data to influence product roadmaps and drive business results Lead product experiments to create and improve user experiences Apply advanced analytical methods to model user behavior, and collaborate with product teams to develop solutions Develop dashboards, reports, and forecasts Ensure the quality of our tracking and data collection Help preserve our culture of fact-based decision making as we scale What We’re Looking For… Strong understanding of consumer digital products and an interest in applying advanced analytics to business outcomes Pursuing a BS or MS degree in a quantitative field (e.g., statistics, economics, computer science, computational psychology) or commensurate industry experience Graduation expected in Spring 2022 (or Fall 2021) Previous experience with analyzing large datasets and presenting results Skilled in SQL, R, Python, and/or statistical methods to analyze behavioral data Excellent presentation and communication skills Exceptional Candidates... Experience with \"big data\" and cloud computing technologies like Redshift, Hadoop, Hive, BigQuery Experience articulating business questions and using available data to find answers that translate into product recommendations Self-starter, with a desire both to learn new techniques and guide others Programming experience in Java or Scala is a plus Why you’ll love working here… Language learning opportunities Catered in-house lunches, and breakfast and dinner options Company-wide Hackathon PTO and company holidays Frequent company-wide dinners, monthly celebrations, social clubs, and so much more!",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-07T01:12:55.000Z"
    },
    "company": {
        "name": "Duolingo",
        "link": "https://www.linkedin.com/company/duolingo"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Pittsburgh",
        "region": "PA",
        "postal_code": "15235",
        "street_address": null,
        "latitude": 40.44217,
        "longitude": -79.99496
    }
}