{
    "job": {
        "title": "Site Reliability Engineer",
        "industry": "Information Technology and Services",
        "description": "Site Reliability Engineer- Salesforce Raritan, NJ Contract As the Site Reliability Engineer, you will be supporting a Fortune 50 organization to better run production systems. You will work directly with your team to help automate customer solutions and drive change to promote a more reliable Salesforce platform process. REQUIREMENTS Bachelor’s Degree in Computer Science or related technical field Minimum of 5 years of experience within site reliability engineering Experience within technologies in the commercial Customer and Sales stack (Salesforce, Veeva and/or Mulesoft) Experience with algorithms, data structures and data analysis Ability to debug and optimize code and automate routine tasks Ability to build, foster and handle partner & customer relationships Extensive Salesforce experience preferred RESPONSIBILITIES Work to keep revenue and reputation-critical systems up and running Measure and monitor availability, performance, and overall health systems Assist architects and developers to help automate customer issues and drive solutions to build more reliable Commercial Application solutions Build, fix and extend business critical code to improve automation Evolve systems by suggesting and implementing changes that approve reliability and velocity Develop software platforms, frameworks, and Production Readiness reviews What's in it for you? Working for an international Fortune 50 company Access to cutting edge technologies in an enterprise environment Exposure to high-level business professionals in a variety of departments Play a part in the growth and expansion of a major initiative impacting multiple business units Weekly Paychecks",
        "employment_type": "CONTRACTOR",
        "date_posted": "2021-08-10T15:19:20.000Z"
    },
    "company": {
        "name": "Brooksource",
        "link": "https://www.linkedin.com/company/brooksource"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "New Jersey",
        "region": "United States",
        "postal_code": "08810",
        "street_address": null,
        "latitude": 40.139095,
        "longitude": -74.67851
    }
}