{
    "job": {
        "title": "Machine Learning Engineer | Oregon (Remote)",
        "industry": "Information Technology and Services",
        "description": "Description At Kloud9 our sole focus is to provide cloud expertise to the retail industry giving our clients the empowerment that will take their business to the next level. Our team of proficient architects, engineers, and developers have been designing, building, and implementing solutions for retailers for an average of more than 20 years. We understand the immediate quest of bridging the gap between e-Commerce and Cloud. we use the power of data science, machine learning, and cloud computing to develop and implement customized solutions that address today’s challenges and tomorrow’s opportunities. Help transform retailers with an engaging customer experience that strengthens the brand relationship, drive profitable growth & build competitive advantage.Making AI-enabled retail a reality for Retailers. Headquartered in New York, the delivery, and innovation hub spanned across India & Krakow, Poland. Role: Machine Learning Engineer Job Type: Corp To Corp Rate: Open About The Job ·         Implement end-to-end solutions for batch and real-time algorithms along with requisite tooling around monitoring, logging, automated testing, performance testing and A/B testing ·         Identify new opportunities to improve business processes and improve consumer experiences, and prototype solutions to demonstrate value with a crawl, walk, run mindset. ·         Work with data scientists and analysts to create and deploy new product features on the ecommerce website, in-store portals and the customer mobile app ·         Establish scalable, efficient, automated processes for data analyses, model development, validation and implementation ·         Write efficient software to ship products in an iterative, continual -release environment ·         Contribute to and promote good software engineering practices across the team ·         Contribute to and re-use community best practices · Besides Driving The Transformation Of customer’s Into a Data-driven Enterprise In General, Here Are Some Specific Projects You Will Work On And Contribute To ·         Personalized in-session product recommendation engine ·         Customer Segmentation ·         Automated text summarization and clustering ·         Next-Best offer prediction ·         Design Microassortments for Next-Gen stores ·         Anomaly detection and Root Cause Analysis ·         Unified consumer profile with probabilistic record linkage ·         Visual search for similar and complementary products More About You ·         University or advanced degree in engineering, computer science, mathematics, or a related field ·         7+ years experience developing and deploying machine learning systems into production ·         Experience working with a variety of relational SQL and NoSQL databases ·         Experience working with big data tools: Hadoop, Spark, Kafka , etc . ·         Experience with at least one cloud provider solution (AWS, GCP, Azure) ·         Experience with object-oriented/object function scripting languages: Python, Java, C++, Scala , etc . ·         Experience working in a Linux environment ·         Knowledge of data pipeline and workflow management tools ·         Expertise in standard software engineering methodology, e.g. unit testing, test automation, continuous integration, code reviews, design documentation",
        "employment_type": "CONTRACTOR",
        "date_posted": "2021-07-29T19:51:39.000Z"
    },
    "company": {
        "name": "Kloud9",
        "link": "https://www.linkedin.com/company/kloud9nyc"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 84,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Oregon",
        "region": "United States",
        "postal_code": "97350",
        "street_address": null,
        "latitude": 43.938683,
        "longitude": -120.558105
    }
}