{
    "job": {
        "title": "Software Engineer",
        "industry": "Information Technology and Services,Staffing and Recruiting,Human Resources",
        "description": "Who we are: Modern Hire is an innovative, science-driven organization. Our more than 40 PhD-level psychologists and data scientists are committed to creating and validating new ways of measuring and understanding human potential. What does it mean to be science-driven? We rigorously test our offerings and never market tools that do not meet our high standards for predicting job performance accurately and fairly. Modern Hire’s innovative platform allows diverse data sources to be analyzed and understood like never before. We are combining the predictive power of assessment, interview technology, advanced analytics, and artificial intelligence into an all-in-one solution to create a fairer, more efficient hiring process that provides a better candidate experience and better outcomes. The role: As a Software Engineer with Modern Hire, you will be responsible for the development of a web based rich media service for the HR/Recruitment industry. In this role you will work with a team of developers to continue development of an ASP.NET cloud based web and mobile applications using C#, Web API, jQuery and other web related technologies. You will also work closely with architects, product managers and designers to drive and implement changes to extend its feature set and improve usability, scalability, performance, and reliability of the product and codebase. Current Technologies React C# ASP.NET Core Web API AWS SQL Server Redis Day-to-day you'll: Use client side technologies (CSS, JavaScript) to create lightweight, cross browser/cross platform interfaces using the latest methodologies Work with service contracts and APIs to integrate 3rd party features and/or services Create interfaces that are simple, aesthetic, and user friendly, where code is driven from user experience requirements Work with existing code and re-factor as necessary or appropriate given time and resource constraints. If you can answer \"yes\" to the following, then we want you to apply! Do you have at least two (2) years of experience in software engineering/ development? Are you willing to learn and use new technologies? Do you have working knowledge of relational database theory, and experience with Microsoft SQL Server (2012 or later)? Do you have working knowledge of web application security design and current secure design and coding practices? Do you have experience with SQL database? Are you self-motivated and committed to delivering quality solutions? Are you able to adapt to a changing environment? Are you an effective communicator who works well in a team environment? Are you proactive and adaptable with demonstrated success managing schedules and deliverables? Do you have strong documentation skills Modern Hire provides equal employment opportunities to all employees and applicants for employment without regard to race, color, ancestry, national origin, citizenship status, gender, gender identity or expression, pregnancy, sexual orientation, transgender status, marital status, religion, creed, age, physical or mental disability, results of genetic testing, genetic information, past, present or prospective service in the military, or any other characteristic or activity protected under federal, state, or local law. Equal employment opportunity applies to all terms and conditions of employment, including but not limited to hiring, placement, promotion, termination, layoff, recall, transfer, leave of absence, compensation, and training.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-09T20:20:34.000Z"
    },
    "company": {
        "name": "Modern Hire",
        "link": "https://www.linkedin.com/company/modern-hire"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "United States",
        "region": null,
        "postal_code": "99999",
        "street_address": null,
        "latitude": 39.50355,
        "longitude": -99.0183
    }
}