{
    "job": {
        "title": "Data Scientist",
        "industry": "Computer Hardware",
        "description": "Introduction As a Data Scientist at IBM, you will help transform our clients’ data into tangible business value by analyzing information, communicating outcomes and collaborating on product development. Work with Best in Class open source and visual tools, along with the most flexible and scalable deployment options. Whether it’s investigating patient trends or weather patterns, you will work to solve real world problems for the industries transforming how we live. Your Role and Responsibilities As part of IBM GTS Infrastructure services (IS), Resiliency Orchestration (RO) team is responsible to build software product, applications, data and infrastructure resiliency automation software and services for IBM enterprise customers having their applications spread across traditional systems, private cloud and public clouds like IBM, AWS, Azure and GCP. The GTS IS team is seeking a Data Scientist. You will be working with an amazing team to execute and deliver analytic solutions. The right candidate will be excited by the prospect of optimizing or even re-designing our anomaly detection and correlation models. The solutions developed by you would be highly scalable and will be deployed on platforms like Kubernetes, VMware and public clouds. You Are a Great Fit If You Can Dissect business problems and devise analytical solutions Collaborate with experts in a business area, getting an understanding of the underlying business process, strategy and execution Identify approaches to improve model accuracy and effectiveness of analytics Define output of use cases for end user consumption to perform optimization analytics Address business needs by prioritizing critical pain points that, once solved, will drive the most value Extract, transform, and combine all incoming data with the goal of discovering a previously hidden insight, which in turn can provide a competitive advantage or address a pressing business problem Not just simply collect and report on data, but also build statistical models, determine what they mean, then recommend ways to apply the data Derive business insights through expert mathematical, analytical and computational techniques Design, deploy, and tune analytics models integrated with structured / unstructured data sources Select a suitable tool for the analytics solution or working with data Create visual presentations of analytics results and translates quantitative insights for a non-technical audience Armed with data, modeling expertise, and analytical results, communicate informed conclusions and recommendations across an organization’s leadership structure Work within an Agile Development team Kyndryl_NorthAmerica Required Technical and Professional Expertise Experience in working in an agile development team building software product Inquisitive: exploring, asking “what if”, performing informal and formal analysis, questioning assumptions and building new paradigms Ability to think “beyond the API” Familiar or expert with big data / analytic tools, such as Python, Python Analytical Libraries, Graph/NoSQL databases, Cloud Environment Broad and deep data and analytics skills such classification, communication, creativity, diagnostics, metrics / measurement, organizing, prioritization, qualitative and quantitative analysis, research Experience in creating and using advanced machine learning algorithms and statistics such as regression, simulation, scenario analysis, modelling, clustering, decision trees, neural networks, etc. Experienced with manipulation of large volumes of data Experienced with programming languages and tools and general software development skills (source code management, debugging, testing, deployment, etc.) Able to elevate and challenge the existing use of data Strong business acumen, coupled with the ability to communicate findings to both business and IT leaders in a way that can influence how an organization approaches a business challenge Recognize business and challenges and influence people and organizations, including executive management, when issues are complex/difficult and require considerable diplomacy Lead and or participate in multi-functional teams or conduct special projects Can work effectively with considerable latitude to define and decide on tools, processes, priorities and resources following general business unit directives Preferred Technical And Professional Expertise Adaptable and flexible to work environment including, but not limited to, out of town travel as required to meet business commitments and handling multiple tasks concurrently, and easily adapting to new assignments, system, tools Understanding of GDPR and other data privacy and responsible use of data issues Experience with Business Intelligence solutions About Business Unit This position currently sits within Global Technology Services (GTS) Infrastructure Services (IS) or a shared services function supporting GTS. As announced in October 2020, IBM intends that its managed infrastructure services business of the GTS organization will become an independent company named Kyndryl by the end of 2021, creating two distinct and powerful market-leading companies. Together, we will advance the vital systems that power the digital economy. Serving over 4,600 technology-intensive, highly regulated customers, including over 75% of the Fortune 100, our people will design, run, and manage the most modern and reliable technology infrastructure that the world depends on today. We will work flexibly and in partnership with our customers to amplify business outcomes while always pushing ourselves to improve and meet all opportunities. Come join our team of diverse, devoted, and empathetic technology experts who are at the center of discovering what’s next. Please note: The final decision if this position will transition from IBM to Kyndryl is yet to be confirmed. Your Life @ IBM What matters to you when you’re looking for your next career challenge? Maybe you want to get involved in work that really changes the world? What about somewhere with incredible and diverse career and development opportunities – where you can truly discover your passion? Are you looking for a culture of openness, collaboration and trust – where everyone has a voice? What about all of these? If so, then IBM could be your next career challenge. Join us, not to do something better, but to attempt things you never thought possible. Impact. Inclusion. Infinite Experiences. Do your best work ever. About IBM IBM’s greatest invention is the IBMer. We believe that progress is made through progressive thinking, progressive leadership, progressive policy and progressive action. IBMers believe that the application of intelligence, reason and science can improve business, society and the human condition. Restlessly reinventing since 1911, we are the largest technology and consulting employer in the world, with more than 380,000 IBMers serving clients in 170 countries. Location Statement Benefits In addition to a competitive benefits program consisting of medical and life insurance, retirement plans, and time off, eligible employees may also have access to IBM offers a wide range of resources for eligible IBMers to thrive both inside and outside of work. 12 weeks of paid parental bonding leave. Family care options are also available to support eligible employees during COVID-19. World-class training and educational resources on our personalized, AI-driven learning platform. IBM's learning culture supports your restless attitude to grow your skills and build the depth and scale of knowledge needed to achieve your career goals. Well-being programs to support mental and physical health. Financial programs that empower you to plan, save, and manage your money (including expert financial counseling, 401(k), IBM stock discount, etc.). Select educational reimbursement opportunities. Diverse and inclusive employee resource groups where you can network and connect with IBMers across the globe. Giving and volunteer programs to benefit charitable organizations and local communities. Discounts on retail products, services, and experiences. We consider qualified applicants with criminal histories, consistent with applicable law. Being You @ IBM IBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, pregnancy, disability, age, veteran status, or other characteristics. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-08T00:00:00.000Z"
    },
    "company": {
        "name": "IBM",
        "link": "https://www.linkedin.com/company/ibm"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Austin",
        "region": "TX",
        "postal_code": "78746",
        "street_address": null,
        "latitude": 30.264978,
        "longitude": -97.7466
    }
}