{
    "job": {
        "title": "Software Engineer in Test",
        "industry": "Health, Wellness and Fitness,Medical Devices,Information Technology and Services",
        "description": "The Opportunity Teladoc Health is transforming how people access and experience healthcare. Recognized as the world leader in virtual care, we are partnering with over a thousand clients to serve hundreds of thousands (soon millions!) of people living with chronic conditions every day. Teladoc Health offers a whole person virtual care platform that empowers all people everywhere to live their healthiest lives by transforming the healthcare experience, from acute and primary care to chronic care, mental health, and specialty care. Our team of data scientists aggregate and interpret substantial amounts of health data and information to create actionable, personalized, and timely health signals for our members. This approach delivers better clinical and financial outcomes while creating a different and better healthcare experience for people everywhere. Join a dynamic team of smart, driven engineers who take ownership and aren’t afraid to ask big questions, as we solve intriguing challenges in break-through digital healthcare engineering. With the best practices and technologies at our disposal, we have our eyes set on making a meaningful impact on the lives of millions of people suffering from a variety of health conditions. If you’re an experienced Software Engineer in Test, this is your chance to work with a passionate engineering team to solve the hard problems in test automation. You’ll be the primary driver in scaling our test platform, keeping it stable and creating a test strategy to cover our ever-growing set of programs. Collaborating with different product and feature teams to understand their goals, feature functionality and data needs will be key to your success. Working across groups and focusing on the big picture will be your charter. You’ll enhance our existing automation framework, evaluate and integrate new tools and develop solutions to augment QA and Development testing. Working closely with software developers and other engineers in small scrum teams, you’ll deliver the highest-quality products in a timely and cost-effective manner, during a time of astronomical growth and product expansion. Responsibilities Measure and improve system-wide stability and performance of automation initiatives Drive the evaluation and adoption of test automation frameworks, tools, and technologies across the organization Work deeply with Engineering and DevOps to drive efficiency, stability, and improvement in our Continuous Integration (CI) environment Design and implement a strategy for end-to-end automation across our complex, distributed system including multiple product lines Collaborate across multiple product lines to align test implementation strategies Write specialized testing tools for our software platform, as needed Review estimates, test plans and automation implementation across the team providing feedback as necessary Mentor automation engineers, providing constructive feedback Collaborate with teammates in Development, Test and Product Management to design and implement test and validation strategies Candidate Profile BS degree in Engineering, Computer Science, or a related field. In lieu of degree, relevant work experience and/or trade school is acceptable Experience designing and implementing an automation framework from scratch for a product line Active contributor to relevant open-source software projects in the automation space Deep experience automating and debugging production-level microservices architecture Proven experience automating across surfaces including web, mobile and backend Deep knowledge of testing styles including BDD, TDD and others Expert knowledge of object-oriented programming, along with requisite coding and debugging skills Demonstrable experience across multiple programming languages such as Python, Java, JavaScript, Scala Expertise in software design principles, patterns, algorithms, data structures and multi-threading concepts Proven ability to translate both functional and non-functional requirements and use cases into working test plans and test cases with automation strategy Experience building highly automated environments using virtual and cloud resources, preferably AWS Knowledge of continuous integration practices, preferably using Jenkins, Hudson, or Bamboo Experience working in an agile environment Strong verbal and written communication skills A strong work ethic and an analytical mind Impress Us Even More Experience with container technologies such as Kubernetes and Docker Owner of a maintained open-source project in the automation space Published articles, blogs, etc. on testing automation theory or best practices Why Join Teladoc Health? A New Category in Healthcare :  Teladoc Health is transforming the healthcare experience and empowering people everywhere to live healthier lives. Our Work Truly Matters: Recognized as the world leader in whole-person virtual care, Teladoc Health uses proprietary health signals and personalized interactions to drive better health outcomes across the full continuum of care, at every stage in a person’s health journey. Make an Impact: In more than 175 countries and ranked Best in KLAS for Virtual Care Platforms in 2020, Teladoc Health leverages more than a decade of expertise and data-driven insights to meet the growing virtual care needs of consumers and healthcare professionals. Focus on PEOPLE :  Teladoc Health has been recognized as a top employer by numerous media and professional organizations. Talented, passionate individuals make the difference, in this fast-moving, collaborative, and inspiring environment. Diversity and Inclusion :  At Teladoc Health we believe that personal and professional diversity is the key to innovation. We hire based solely on your strengths and qualifications, and the way in which those strengths can directly contribute to your success in your new position. Growth and Innovation :  We’ve already made healthcare yet remain on the threshold of very big things. Come grow with us and support our mission to make a tangible difference in the lives of our Members. As an Equal Opportunity Employer, we never have and never will discriminate against any job candidate or employee due to age, race, religion, color, ethnicity, national origin, gender, gender identity/expression, sexual orientation, membership in an employee organization, medical condition, family history, genetic information, veteran status, marital status, parental status or pregnancy (including breastfeeding – we have a mother’s room in both our offices). In our innovative and inclusive workplace, we prohibit discrimination and harassment of any kind.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-31T00:04:43.000Z"
    },
    "company": {
        "name": "Teladoc Health",
        "link": "https://www.linkedin.com/company/teladoc-health"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Austin",
        "region": "TX",
        "postal_code": "78746",
        "street_address": null,
        "latitude": 30.264978,
        "longitude": -97.7466
    }
}