{
    "job": {
        "title": "Data Scientist",
        "industry": "Consumer Goods",
        "description": "As Data Science Manager, you would have the opportunity to apply data science techniques across our portfolio of brands to create novel tools and analyses, pushing the boundaries of marketing analytics within the company. This role is responsible for building data products and translating data into clear and compelling insights ensuring proper activation that leads to business results. You will work closely with other data scientists, engineers and partners across Marketing, Sales and R&D to derive insights from diverse data sources, help the business make data-driven decisions and apply cutting edge data science techniques. The ideal candidate would be passionate about data science and product analytics with business facing experience. This position reports to the Associate Director, Data Science. Key Responsibilities Engage with studios and business stakeholders to discover data science and analytics opportunities and pain points Assess and scope data science work within these opportunities and pain points to effectively develop priorities and map to specific algorithms, data products and components Lead and coach stakeholders and team members to enhance their ability to deliver on the agreed data strategy Collaborate with a cross-functional team to develop strategic data-driven frameworks and use agile product management to ensure on-time product delivery and activation Ensure projects are delivered within the agreed schedule and budget while ensuring quality Deliver clear and consistent communications within projects and across stakeholders of all levels Actively engage in meetings, solution design, review sessions and retrospectives. Support team by actively engaging in knowledge share sessions and brining in innovative data science ideas Manage expectations daily to keep everyone aligned Education & Experience Bachelor’s degree or higher in data science, math, statistics, computer science or other relevant quantitative fields. MS strongly preferred 5-7+ years of relevant business experience with bachelor’s, or 3-5+ years with graduate degree Highly collaborative and able to communicate effectively with non-technical audiences . Business partner facing experience is preferred Technical Skills Comfortable with predictive modeling, A/B testing and experimentation, neural networks and deep learning, natural language processing, data visualization, and statistical analysis Experience in Python and its packages such as PySpark, PyTorch, Keras, TensorFlow Experience with cloud-based data tools like BigQuery, Azure Synapse and GCS Ability to create examples, prototypes, demonstrations to help management better understand the work Other Skills Self-starter who can think creatively and look for/develop elegant and viable solves for real world problems Skilled at producing actionable and compelling recommendations driven by complex data Strong leadership and communication skills Excellent time and project management skills with the ability to work efficiently under tight deadlines Strong interpersonal and relationship building skills Strong Business acumen. Consumer goods (CPG/FMCG) experience preferred Comfortable in a dynamic environment and able to identify needs, develop a plan of action and implement",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-06T00:12:00.000Z"
    },
    "company": {
        "name": "The Clorox Company",
        "link": "https://www.linkedin.com/company/the-clorox-company"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Oakland",
        "region": "CA",
        "postal_code": "94612",
        "street_address": null,
        "latitude": 37.80483,
        "longitude": -122.27248
    }
}