{
    "job": {
        "title": "Data Scientist - Payments - Austin",
        "industry": "Consumer Electronics",
        "description": "Summary Apple Wallet, Payments and Commerce is seeking an experienced Data Scientist to support critical initiatives and uncover potential business opportunities within the EMEIA region. As a member of the WPC team you will collaborate with partners across business development, product, marketing and engineering teams to drive your findings and recommendations into action. Our culture is about getting things done efficiently, with open feedback and debate along the way. Within analytics, we are collaborative and team oriented, but we also strive for independent decision-making, curiosity and taking calculated risks. As a successful candidate you have a knowledge and passion for payments, as well as an insatiable curiosity and strong verbal and written skills. In addition, you are a self-motivated and driven individual who thrives in a fast-paced environment Key Qualifications Proven experience in a data science or equivalent role, ideally within the payments industry Ability to conceive and execute the design of end to end scripted analytics solutions using SQL/TeraData, Spark SQL and PySpark/Hadoop Proven understanding of Python, R and standard statistical modelling packages Love for applied empirical analytics, data mining and predictive analytics Collaboration, communication and presentation skills, with the ability to adapt and engage across a variety of audiences. This includes significant written, verbal and data visualization skills to communicate complex quantitative analysis in a clear, detailed, and concise manner Experience in data visualization tools such as Tableau for full-stack data analysis, insight synthesis and presentation Description Deep dives in large-scale data to identify key insights that influence product improvements and business/Marketing strategy Utilize data science approaches and solutions, both applying tried-and-tested and creative techniques to meet business needs Engage with internal partners including business, engineering, product and marketing teams as a thought partner, and to optimally deliver measurable insights and performance improvements Measure and monitor payments products, features and marketing efficiency Deliver and support automated reporting solutions Partner with other Apple organizations in relation to data gathering, governance, best practices, reporting tools and critical metrics Education & Experience Minimum of bachelor’s degree, preferably in economics, statistics, computer science, applied mathematics, machine learning or a related quantitative field. Role Number: 200283556",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-09-01T09:20:49.000Z"
    },
    "company": {
        "name": "Apple",
        "link": "https://www.linkedin.com/company/apple"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Austin",
        "region": "TX",
        "postal_code": "78746",
        "street_address": null,
        "latitude": 30.264978,
        "longitude": -97.7466
    }
}