{
    "job": {
        "title": "Software Engineer Associate",
        "industry": "Information Technology and Services,Computer Software,Internet",
        "description": "We are looking for talented software developers to join us in creating cutting-edge software solutions for our clients. You will be assigned to one of our project teams based on alignment of skills, resource demand and individual desire. The opportunity to work on different projects will give you exposure to a wide variety of technologies, tools and platforms. You will learn more in less time and will be continually challenged. The technology group's mission is to provide engaging and innovative products that are used by millions of people. The software we develop is highly visible and highly impactful to our client's business. There is a tremendous opportunity to make a direct impact and to learn from the best along the way. Software Engineer Associates can expect to: Work in a collaborative, team-centric environment utilizing agile principles Deliver high-quality solutions across multiple industries Build software solutions where the problem is often ill defined Work on a variety of projects ranging in both size and scope Receive mentorship and accelerated learning Skills And Experience BS in Computer Science OR relevant work experience Proficiency in one or more of the following: C#, Java, Golang, SQL, and Python Strong team ethic, exceptional analytical skills, and attention to details Ability to test your code and the code of others Strong communication and interpersonal skills Excellent troubleshooting and problem-solving abilities Aptitude to write clean, clear, commented code Ability to learn and adapt to new, complex development environments Working knowledge of object-oriented design Web development experience Desired Qualifications Proficiency in one or more of the following: Go, React, Javascript, HTML, CSS, ReactJS, Docker, and cross-browser coding Android, iOS, and other mobile device development experience Experience utilizing test-driven development processes and automated testing frameworks Compensation Digital Foundry offers a comprehensive compensation and benefits package including a competitive salary and performance bonuses; medical, dental, and vision benefits; and a matching 401(k) retirement program. All employees get up to three weeks of time off in their first year! ______ The Company Digital Foundry is a digital consulting agency focused on architecting and developing elegant, user-centric software solutions for global industry leaders. We pride ourselves on maintaining a positive, fun environment and provide a competitive benefits package to all full-time employees. We are located on the Bay in beautiful Tiburon, California, a short drive across the Golden Gate Bridge or ferry ride from San Francisco. The People We are comprised of a diverse group of intelligent, fun people who will push your thinking at every turn. Everyone here shares an intense passion for innovation and a propensity to thrive in a highly dynamic, agile working environment. During lunch hours you can find us on the basketball court, playing volleyball down the street, or running along the Bay here in Tiburon. Thank you for your interest in Digital Foundry. We look forward to hearing from you! Digital Foundry, Inc. is an equal opportunity employer that is dedicated to a policy of non discrimination in employment and does not discriminate in hiring or employment on the basis of race, religion, creed, color, sex, sexual orientation, age, national origin, ancestry, mental or physical handicap, disability, or veteran status. Powered by JazzHR PEi2Uftmrl",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-14T07:14:29.000Z"
    },
    "company": {
        "name": "Digital Foundry",
        "link": "https://www.linkedin.com/company/digital-foundry"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Tiburon",
        "region": "CA",
        "postal_code": "94938",
        "street_address": null,
        "latitude": 37.873634,
        "longitude": -122.455765
    }
}