{
    "job": {
        "title": "Data Scientist",
        "industry": "Staffing and Recruiting",
        "description": "Our client, a global provider of information technology products and services, is seeking an IT Data Scientist Location: Remote Position Type: Full Time Position Summary: The IT Data Scientist position is responsible for defining, planning and managing data analysis initiatives that applies data science principles and technology to develop innovative, high-quality technology solutions to solve complex operational problems and process challenges. The IT Data Scientist identifies opportunities through the use of statistical, algorithmic, mining and visualization techniques. The role requires advanced analytical skills and proficiency at integrating and preparing large, varied datasets, architecting specialized data structures and computing environments, and effectively communicating results. The IT Data Scientist works closely with IT application and database teams, along with business and operational subject matter experts. What You Will Do: Lead and mentor staff and provide learning and development opportunities by sharing Subject Matter Expertise Designs experiments, test hypotheses and build models for the assigned operational problems. Conducts advanced data analysis and complex design algorithms to discover patterns. Work with stakeholders to identify business requirements and expected outcomes. Models and frames business scenarios that are meaningful and which impact critical business processes and/or decisions. Collaborates with subject matter experts, both within IT and business areas, to select the relevant sources of information. Works with IT teams to support data collection, integration and retention requirements based on input collected with the business. Works in iterative processes, at times using experimental design approaches to validate findings. Assesses, with the business, the expected qualification and assurance of the information in support of the use case(s). Defines the validity of the information, how long the information is meaningful and other information it is related to. Recommends ongoing improvements to methods and algorithms that lead to findings, including new information or data external to the organization that may be useful. Identifies and analyzes patterns in the data, including the type of data and speed of sudden variations in the data collection. Provides business metrics for assigned projects to show improvements. Provides on-going tracking and monitoring of performance of decision systems and models. Troubleshoots and implements enhancements and fixes to systems as needed. Demonstrates data scientist qualities, including clarity, accuracy, precision, relevance, depth, breath, logic, significance and fairness. Adhere to ethical standards and comply with the laws and regulations applicable to your job function What You Will Bring: Bachelor’s degree in Data Science, Mathematics, Statistics, Computer Science or related field, or an equivalent combination of education and professional experience is required. Masters’ degree is preferred. 5-7 years of related experience in IT or a related field 5-7 years of experience in IT technologies, trends, and analysis Previous experience in Data Warehouse and Data Analytics is preferred Excellent written and verbal communication skills Strong tactical and analytical skills at the corporate level Experience with machine learning techniques and algorithms Experience with Data Warehouse implementations and ETL skills Ability to work with complex data sources, technical concepts and business problems effectively Must be proficient in query languages such as SQL. Ability to work effectively as member of a team and also independently to achieve business goals Process Outputs & Deliverables: New or improved operational data analysis technologies and/or methodologies Data analysis design and implementation in support of operational processes and projects Achievement of documented project goals and deliverables Work product specific to individual business unit (e.g. application development, new products, improved security, database maintenance, cost estimates) Increased productivity, problem resolution and process efficiencies Reduced costs and consistent customer satisfaction Increased product and/or service quality and staff efficiency through consistent implementation of industry best practices Timely and relevant updates to IT Manager or Director and other leadership (as appropriate) on departmental activity Development and implementation of standards, procedures and technologies that support company objectives",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-25T17:31:11.000Z"
    },
    "company": {
        "name": "Mitchell Martin Inc.",
        "link": "https://www.linkedin.com/company/mitchell-martin"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "United States",
        "region": null,
        "postal_code": "99999",
        "street_address": null,
        "latitude": 39.50355,
        "longitude": -99.0183
    }
}