{
    "job": {
        "title": "Senior Software Engineer (100% Remote)",
        "industry": "Computer Software",
        "description": "Senior Software Engineer needed for a consulting company providing business-to-technology lifecycle support! Title: Senior Software Engineer Location: Washington, DC or Remote Salary: $120,000 - $140,000 Requirements: JavaScript, Python, SQL As a Senior Software Engineer, this individual will be responsible for supporting a client in the music industry. We have re-architected a core enterprise software platform to support managing digital performance rights. You will be responsible for leading software strategy and development. What You Will Be Doing Develop high-quality software design and architecture Software Product Design Software Product Implementation Identify, prioritize and execute tasks in the software development life cycle What You Need for this Position Bachelor's degree in Computer Science, Computer Engineering, engineering discipline, or equivalent experience 3+ years of professional experience in software development You Should Know Some Of The Following JavaScript JS Frameworks (Angular, React, Vue, Node) Python Django/Flask SQL/PostgreSQL AWS What's In It for You Competitive base salary and overall compensation package 100% company paid medical, vision, and dental insurance (including family) 100% company paid employee life, short-term and long- term disability 3% annual company contribution to 401(k) Generous Paid time off (PTO) 10 training days per year Public Transit Reimbursement Apply directly to this job opening here! or E-mail directly for more information to josh.sanchez@CyberCoders.com Email Your Resume In Word To Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also: Josh.Sanchez@CyberCoders.com Please do NOT change the email subject line in any way. You must keep the JobID: linkedin : JS22-1649082 -- in the email subject line for your application to be considered.*** Josh Sanchez - Sr. Executive Recruiter - CyberCoders Applicants must be authorized to work in the U.S. CyberCoders, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-09-02T05:29:01.000Z"
    },
    "company": {
        "name": "CyberCoders",
        "link": "https://www.linkedin.com/company/cybercoders"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Arlington",
        "region": "VA",
        "postal_code": "22210",
        "street_address": null,
        "latitude": 38.890762,
        "longitude": -77.084755
    }
}