{
    "job": {
        "title": "Machine Learning Engineer",
        "industry": "",
        "description": "Machine Learning Engineer SignalPET is a new and innovative addition to the veterinary technology space.  With our proprietary pure AI science, we provide a second set of eyes on veterinary radiographs to assist veterinarians in diagnosing and treating companion animals.  We are offering a Machine Learning Engineer a life changing position on the SignalPET Engineering Team.  This opportunity allows hands-on practicing of deep learning models that will shape the future of veterinary medicine. We are looking for a Machine Learning (ML) engineer that is interested in a long-term position with SignalPET.  This candidate should have a broad experience and knowledge in machine/deep learning and computer vision. The responsibilities will include: Build and enhance the company’s AI tools, solutions and platforms in order to enable AI based medical decision support systems at a scale to the growing community of SignalPET customers. Develop tools and applications by producing clean, efficient code Conduct code reviews; write unit, integration, and performance tests; and perform validation and verification tests;  to improve code quality Perform advanced debugging to identify issues, root cause, and remediation Instrument and measure code to identify bottlenecks and improve performance Research and propose new techniques and methodologies to improve quality and efficiency of our platforms Exhibit ownership of the software, application, tooling throughout SDLC including documentation and monitoring Collaborate with internal teams and customer support to improve product utilization and remediate issues Key Qualifications You have strong coding skills in Python using scientific libraries like numpy, scipy. You have practical experience training deep neural networks with one or more frameworks such as PyTorch, Tensorflow, or Keras You are proficient in complex software systems, able to apply AI techniques to solve real problems, and able to deliver software of high build quality that is performant and easily supportable. You possess exceptional data management skills and the ability to perform complex modeling on dynamic data sets You enjoy working with cross functional teams of driven people excited to solve challenging problems. You believe that code-reviews, giving and asking for them, are important to delivering a quality product. You care about best-practices and evangelizing them within the team. You can clearly convey your thoughts, enjoy presenting what you’ve done, and can cater your message to audiences both technical and non-technical. You respect and share our company values and operating principles. What can you expect as a SignalPET team member: We offer a competitive compensation and benefit package to all of our team members, including: Medical, dental, vision, and prescription drug benefits for you and eligible dependents Paid time off Guardian voluntary benefits 401(K) plan with an employer match Possibility of Equity incentive package \"We are an equal opportunity employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity or expression, pregnancy, age, national origin, disability status, genetic information, protected veteran status, or any other characteristic protected by law.\"",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-09-07T15:11:24.000Z"
    },
    "company": {
        "name": "SignalPET®",
        "link": "https://www.linkedin.com/company/signalpet"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "United States",
        "region": null,
        "postal_code": "99999",
        "street_address": null,
        "latitude": 39.50355,
        "longitude": -99.0183
    }
}