{
    "job": {
        "title": "Data Scientist-REMOTE",
        "industry": "Information Technology and Services,Computer Software",
        "description": "This AI Computer Software company located in Palo Alto, CA is looking to hire a sharp Data Science Engineer to join their growing company This Jobot Job is hosted by Taylor Buckelew Are you a fit? Easy Apply now by clicking the \"Apply\" button and sending us your resume. Salary $135,000 - $170,000 per year A Bit About Us Located in the beautiful Palo Alto, CA we are the leading provider of AI- powered software products that transform healthcare claims and payment operations. Our platform has enabled us to develop and deploy, at high speed, industry-specific products. We are looking to hire a strong Data Scientist, that will come in, develop and deploy scalable machine learning solutions to solve problems in the healthcare space. Why join us? We offer a comprehensive compensation package including but not limited to A competitive base salary ranging from $135K-$165K (DOE) + EQUITY! 401k Benefits Health, Dental, Vision Collaborative team Trainings Paid time off Parties and team building events Job Details You will be responsible for and MUST have most or ALL of the following Bachelor's of Master's in Computer Science or related field Strong business analysis skills Experience in solving real-world business problems involving data-driven optimization Experience with developing and deploying machine-learning systems Strong experience with a programming language ( Python, SQL, R, etc.) Experience building data pipelines IF INTERESTED, APPLY DIRECTLY HERE OR EMAIL ME A RESUME AT taylor.buckelew@jobot.com Interested in hearing more? Easy Apply now by clicking the \"Apply\" button.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-12T21:16:40.000Z"
    },
    "company": {
        "name": "Jobot",
        "link": "https://www.linkedin.com/company/jobot"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Denver",
        "region": "CO",
        "postal_code": "80247",
        "street_address": null,
        "latitude": 39.738453,
        "longitude": -104.984856
    }
}