{
    "job": {
        "title": "Software Engineer",
        "industry": "",
        "description": "Software Engineer Los Angeles (Santa Monica) or Remote (US time zones) Full-Time | Salary Range: $100K-$180K Maximus is a mission-driven consumer telemedicine company that provides men with content, community, and clinical support to optimize their health & hormones. Maximus has raised $5M from top Silicon Valley VCs such as Founders Fund and 8VC as well as leading angel investors/operators from companies like Bulletproof, Tinder, Coinbase, Daily Stoic, & Shopify. Maximus is building an advanced telemedicine platform to help men improve their mental and physical health. We iterate on our product rapidly and safely by applying continuous integration and code quality measurements, as well as TDD and pair programming when appropriate. We work collaboratively, emphasizing the productivity of the team first. We aim to deliver a robust, reliable system by using pragmatic, tried-and-true technologies. We hone our craft as engineers by applying advanced functional, data-oriented techniques that are appropriate to the problem. Responsibilities Write and ship high quality code Contribute across the codebase to complete entire features and changes with support from the rest of the team. Continuously invest in demonstrable quality and reliability of the system via unit tests, automated integration tests, TDD and refactoring. Keep data management and security in mind at all times to protect customer privacy. Contribute to a continuously improving engineering organization Identify software quality, performance, and operational issues, including impediments to team-wide efficiency and work constructively with the team to address them. Define and improve our internal engineering standards and processes and exert positive influence on the objectives and tactics taken by the team Contribute actively to product iteration and development to ensure the company delivers a compelling experience to its customers. Generate ideas and assess the associated options and tradeoffs for how they impact the growth of the business and customer experience. Work across functional teams (engineering, marketing, product, etc.) to translate business and product ideas into software designs and releases. Product & Project Management skills and experience are a plus. The ideal candidate will have the following Experience: 3+ years of experience in product software development, especially public consumer web applications. Back-end : Ruby-on-Rails / Ruby experience. Front-end : React/Redux/ImmutableJS experience Familiarity with or interest in Event Sourcing and other immutability / functional-programming patterns. Experience in unit testing, integration testing. TDD experience is a plus. Qualities : Strong communication and teamwork skills: Proven ability to build strong relationships with technical and non-technical members of the team to solve challenging technical and business problems. Relentlessly Resourceful (http://www.paulgraham.com/relres.html): Highly proactive, does not quit, and finds innovative solutions with little guidance. Bias for action and ability to thrive in an ambiguous environment with a high degree of autonomy. A dedication to keeping things simple and pragmatic. Attitude of shared ownership of the system, frequent integration. Collaborates proactively, in service of the shared highest priority. Love of virtue & health: Interest in modern-day men’s movements and personal development. Demonstrates personal dedication and interest in health optimization (you should walk the talk when it comes to diet, exercise, sleep, focus, and relationships). World-Class Benefits: Premium Blue Shield Platinum PPO & HMO Plans (up to 100% coverage) Full Suite: Medical, Dental, Vision, Life Insurance Best-in-class 401K options Flexible vacation/time-off policies Liquidity of options whenever available Extended options exercise window for loyal employees (3 months for every year of service; e.g. 1 year for 4+ year employees) Maximus is an equal opportunity employer, which not only includes standard protected categories, but the additional freedom from discrimination against your free speech and beliefs, as long as they are aligned with company values. We celebrate intellectual diversity.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-25T13:46:28.000Z"
    },
    "company": {
        "name": "Maximus",
        "link": "https://www.linkedin.com/company/maximustribe"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 48,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "United States",
        "region": null,
        "postal_code": "99999",
        "street_address": null,
        "latitude": 39.50355,
        "longitude": -99.0183
    }
}