{
    "job": {
        "title": "Data Scientist",
        "industry": "Financial Services",
        "description": "If you’re looking for the DNA of a start-up with the financial stability of a larger corporation, then you’ll love BorrowWorks! Why Join us? Our success is driven by the collective talent, expertise and enthusiasm of each unique employee working toward a common goal of delivering a superior customer experience. Yet, in spite of having one mission, we encourage individual contributions, ideas and challenges to ensure we’re always on the cutting edge of FinTech solutions that our clients won’t find anywhere else. Honored by the Fort Worth Chamber of Commerce as a Small Business of the Year, it shows that others recognize our past accomplishments and exponential growth potential. Everyone at BorrowWorks is excited to be a part of this surging success – and we’d love to have you join us. Position BorrowWorks is looking to grow our Strategy team by adding a Data Scientist. The Data Scientist will collect relevant data to model and report utilizing statistical techniques and machine learning, such as logistic regression, random forest, and gradient boosting. Responsibilities Conduct data analysis to optimize the underwriting policies in how model scores, business and credit bureau rules work together to produce desired financial performance Prepare model development documentation and update policy documentation Prepare on-going model performance monitoring reports and provide recommendations when performance deteriorates Support data vendor evaluation in preparing raw data, and analyzing appended bureau data in predicting credit and fraud risk Perform other ad-hoc analysis as it relates to modeling and policy Qualifications Bachelor’s degree in a quantitative subject. (Mathematics, Economics, Statistics preferred) 1-3 years’ experience preferred or relevant internship or course experience in the analytical or financial services field (both are highly preferred) Strong technical aptitude Familiarity with SAS, ETL processes, SQL, Python, and R Understanding of business needs/requirements Ability to effectively communicate with both internal departments and external vendors/clients Ability to self-motivate and manage multiple analytical projects simultaneously. Benefits BorrowWorks offers a full benefits package including: Medical insurance options, including an HSA plan Telemedicine 401k with company matching Surgical and Imaging assistance Employer paid Life Insurance Vision Insurance Dental Insurance Options Short and Long Term Disability Options Critical Illness and Accident Options Employee Assistance Program Health and Wellness Program Onsite gym Parental leave PTO policy",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-10-12T18:33:26.000Z"
    },
    "company": {
        "name": "BorrowWorks",
        "link": "https://www.linkedin.com/company/borrowworks"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 12,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Dallas-Fort Worth Metroplex",
        "region": null,
        "postal_code": "75049",
        "street_address": null,
        "latitude": 32.7513,
        "longitude": -97.08263
    }
}