{
    "job": {
        "title": "Site Reliability Engineer/DevOps Engineer",
        "industry": "",
        "description": "Kronologic is focused on using AI to eliminate one of the biggest issues facing many Fortune 500 companies, manual scheduling. We help businesses automate scheduling to capitalize on leads more effectively. Our team has several AI patents filed based on our scheduling AI technology. We are currently looking to build out our products with curious ,passionate problem solvers. We are currently seeking mid/senior DevOps engineers with experience building and maintaining CI/CD pipelines, monitoring and alerting systems. Our goal is to automate all aspects of our infrastructure. Qualifications Experience: Devops, 3+ years (Required) Work authorization: United States (Required) Core Values Bias for Action Truth Premium Tribe Movement ≠ Work Comfortable Being Uncomfortable Expertise Our stack currently consists of: EKS Terraform Kibana, DataDog KMS, SQS, S3, Redis, Dynamo, Aurora, et al ... Github, Gitlab & GitLabCI CloudFlare, Bonus if you have security and/or compliance experience. Benefits: Dental insurance Flexible schedule Health insurance Paid time off Vision insurance Work Location: Austin,TX ( flex model) This Job Is Ideal for Someone Who Is: Dependable -- more reliable than spontaneous Autonomous/Independent -- enjoys working with little direction Innovative -- prefers working in unconventional ways or on tasks that require creativity High stress tolerance -- thrives in a high-pressure environment This Job Is: A “Fair Chance” job (you or the employer follow Fair Chance hiring practices when performing background checks) A good fit for applicants with gaps in their resume, or who have been out of the workforce for the past 6 months or more Open to applicants who do not have a college diploma A job for which people with disabilities are encouraged to apply Work Remotely: Temporarily due to COVID-19 COVID-19 Precaution(s): Remote interview process",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-12T15:54:29.000Z"
    },
    "company": {
        "name": "Kronologic",
        "link": "https://www.linkedin.com/company/kronologic"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Austin",
        "region": "Texas Metropolitan Area",
        "postal_code": "78723",
        "street_address": null,
        "latitude": 30.276316,
        "longitude": -97.70931
    }
}