{
    "job": {
        "title": "Data Scientist - Remote ",
        "industry": "",
        "description": "Do you get excited about solving complex problems in data science? Would you like to develop solutions for working with giant real-world clinical data to radically improve healthcare? We need creative and versatile data scientists to join our team. We’re looking for self-motivated individuals with experience working with clinical datasets who want to positively impact the lives of millions of patients around the world. Droice engineers are thought leaders in data science, applying it to vast repositories of real-world clinical data, including EHR and clinical text datasets. Our products leverage our unique proprietary technology to power critical decisions for patient care. How you’ll contribute Lead and execute data science projects & research studies from conception to completion using large, real-world clinical data datasets (e.g., EMR, claims, disease registries, etc.), including design, protocol development, implementation, and collaboration with other functions Apply advanced statistical and machine learning methods, including various classification and clustering algorithms, to develop clinically relevant insights Apply novel analytical or computational/machine learning techniques and data science expertise to integrate and analyze large complex data Conduct and guide observational data analyses, including data management and data science & statistical analyses Work with a multidisciplinary team of business analysts, data scientists, clinicians, and engineers to develop novel data science-driven solutions Present results, project summaries, and analytical techniques to customers, stakeholders, and internal audiences Contribute to presentations, reports, and publications Provide scientific oversight and mentor/upskill more junior members of the team Assist the department leadership in the hiring process of new talent What we’re looking for 5+ years of experience in data science or ML work in research organizations/academia or industry (e.g., tech, pharma) MSc, PhD, or similar qualification in a quantitative data science discipline (e.g., math, statistics/biostatistics, biomedical informatics, machine learning, engineering, computer science, physics, etc.) Good oral and written communication skills demonstrated by a track record of publication(s) in major scientific journals and presentations in national or international conferences Ability to create and implement a research/statistical analysis plan independently Track record of developing and executing clinical data science/ML or RWE studies Ability to understand clinical use cases and pull the necessary data from various sources to provide key insights Strong quantitative background, with deep understanding in several of the following domains: math, statistics, machine learning, deep learning, signal processing, data science, computer science, and/or algorithms Strong programming skills in at least one analytical programming language Python, R; ability to comprehend and contribute to large codebases and collaborate with other data scientists and software engineers Familiar with large healthcare databases such as EMRs, claims, registries, etc. Excellent organizational skills, including strong personal initiative, attention to detail, the ability to learn and work independently and as part of a team, prioritize multiple tasks and goals to ensure timely delivery Able to challenge conventional thinking, speak out, think independently, generate original ideas, and stand up for them Bonus points if you have Experience in leadership roles or demonstrated leadership capabilities Experience building data pipelines using big data/distributed computing technologies (e.g., Spark) Experience or familiarity with natural language processing systems and approaches Startup experience Knowledge of healthcare IT (hospital workflows, patient data infrastructure) About Droice Droice Labs is a deep-technology company based in New York City committed to matching patients to the interventions that work best for them. To accomplish that, we apply cutting-edge artificial intelligence to healthcare data to develop best-in-class products that help various healthcare stakeholders to treat patients, efficiently develop therapies, and manage patient populations. Droice offers a challenging, fast-paced environment with a focus on learning and real-world problem-solving in the healthcare sector. Digital health data in the form of real-world patient data and clinical text is one of the richest sources of information in patient care. Our engineers use the latest advances in machine learning, natural language processing, data science, and data engineering with deep clinical and biomedical expertise to build the tools that allow health systems, life sciences, and payors to position—for the first time in history—long-term patient wellbeing at the center of their strategic objectives. Interested in applying? Curious to know more? Visit us at www.droicelabs.com !",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-09-07T12:09:24.000Z"
    },
    "company": {
        "name": "Droice Labs",
        "link": "https://www.linkedin.com/company/droice-labs"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "United States",
        "region": null,
        "postal_code": "99999",
        "street_address": null,
        "latitude": 39.50355,
        "longitude": -99.0183
    }
}