{
    "job": {
        "title": "Data Scientist",
        "industry": "",
        "description": "We are looking for a mission-driven team member to join our team as a data scientist. You will work directly with CTO and lead AI engineer to support the development and testing of new AI models for bias detection in text content. Ideal candidate should have: A degree in a quantitative field  mathematics, computer science, physics, economics, engineering, statistics, operations research, quantitative social science, etc.). Basic Knowledge on software development principles and architecture. Good analytical and problem-solving abilities. Ability to break down and understand complex business problems, define a solution and implement it using advanced quantitative methods. Familiarity with programming for data analysis; ideally Python, SQL Prior experience with text data analysis is preferred Solid oral and written communication skills, especially around analytical concepts and methods. Great work ethic and intellectual curiosity. Knowledge of cloud technologies such as AWS Work in an Agile environment. Must be a team player with excellent communication and problem-solving skills and have experience working with customers across",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-19T15:57:35.000Z"
    },
    "company": {
        "name": "Barometer",
        "link": "https://www.linkedin.com/company/thebarometer"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Atlanta Metropolitan Area",
        "region": null,
        "postal_code": "30317",
        "street_address": null,
        "latitude": 33.74975,
        "longitude": -84.38857
    }
}