{
    "job": {
        "title": "Manufacturing Test Engineer - Acoustic",
        "industry": "Marketing and Advertising,Information Technology and Services,Computer Software",
        "description": "Be part of a revolution! Sonos is redefining the listening experience for music. The Audio Systems Engineering team at Sonos is developing designs that define the sonic performance characteristics of Sonos products. We are seeking individuals that have an eye and an ear for details, are excited about innovative engineering designs, are curious about why things work (or don’t), have an analytic mind coupled with a practical approach, and want to make things sound just right. Have fun every day on this fast paced, creative team and help take Sonos to explore new places in this space. If you love music, solving challenging problems and doing things the right way every time, we’d like to talk to you! POSITION SUMMARY -Responsibilities Develop acoustics testing for loudspeaker products, audio transducers and microphones. Develop the acoustics test schedule, executed the test plan to meet the project schedule. Created and integrated acoustics test tools into test infrastructure. Work with acoustics development engineers closely to define the acoustics testing method and testing limits. Maintain, review and debug production acoustics testing setup. Be part of the team to review and conduct the failure analysis for acoustics production testing. Required Experience 3+ years experience on acoustics related product testing, high volume production line testing experience preferred. Fluency in both written and oral English. Fluent in Mandarin. Minimum of BS degree in engineering. Has basic understand with DSP, audio codec and A/D. Familiar with the acoustics testing on acoustic components such as microphone, audio transducer and hi-fi systems. Familiar with speaker measurement platforms such as Soundcheck, Audio Precision, Clio, Klippel and LMS. Familiar with test software programming language, experience of using LabVIEW is preferred. Must have a passion for perfecting test and measurement procedures and services, emphasizing efficiency as well as accuracy of the measurement process. Understand of audio components, such as microphone, audio transducers and loudspeakers. Strong communication and interpersonal skills. General understanding of statistics and process capability metrics. Ability to multi-task, work quickly, accurately and communicate effectively with team members across multiple time zones. Ability to travel domestically (up to 35%) and internationally (up to 4 times per year, sometimes with little notice). Desirable Qualifications Strong working experience in first tier consumer electronics companies is a plus. Familiarity with Acoustic transducer and loudspeaker, or audio products is a plus. Experience in high volume products is a plus.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-20T00:16:06.000Z"
    },
    "company": {
        "name": "Sonos, Inc.",
        "link": "https://www.linkedin.com/company/sonos-inc-"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "California",
        "region": "United States",
        "postal_code": "93266",
        "street_address": null,
        "latitude": 37.254673,
        "longitude": -119.61728
    }
}