{
    "job": {
        "title": "Site Reliability Engineer",
        "industry": "Marketing and Advertising,Chemicals,Staffing and Recruiting",
        "description": "Job Description Indorama Integrated Oxides & Derivatives is looking for an experienced Site Reliability Engineer located at our Port Neches, Texas facility. In this role, you will develop, maintain, and execute the site’s reliability systems and processes. This role is expected to influence the culture of the site to design, operate, and maintain Indorama PNO assets with a reliability focus, and to provide the site with tools and systems to allow continuous reliability improvement. What will be expected from you? Develop and maintain reliability processes and create associated procedures. Own and steward the RCM (Reliability Centered Maintenance) program for the site: facilitate RCM analysis, Leads cross-functional team to identify mechanical integrity scenarios and failure modes and effect analysis (FMEA), utilize RCM software to manage asset strategies, steward progress of task completion through area resources, and utilize failure data to maintain and improve asset strategies. Facilitate criticality analysis for PNO assets to determine risk-based maintenance strategies. Develop and stewards site Reliability reports and KPIs. Create SAP PM’s as an output of the RCM process. Gatekeeper for new or modified PM's through the PM request and approval flow. Steward, audit, and improve the site PM plans to ensure the health and effectiveness of the systems. Facilitate and document high impact or high potential impact incidents as assigned. Provide reliability support and consultation for problem analysis, risk assessment, root cause analysis, etc. for equipment failures where the failure root cause is not well understood. Identify site bad actors through analysis of maintenance expense and production loss data. Drive the organization to find true root cause and effective mitigations to systematically eliminate bad actors. Facilitate criticality assessment and RCM analysis for Capital Projects. Support economic analysis of capital project through life cycle cost analysis. Provide capital investment and expense project ideas based on reliability analysis and feedback from operations and other site personnel. Provide SAP support as a site Super-User. Essential functions require presence in the workplace on a regular basis and an ability to work extra hours if needed. If applicable, ability to work overtime may be needed to ensure required staffing capacity to meet daily production objectives. Work collaboratively with team members with different backgrounds and perspectives. Assists other employees in accomplishments of Indorama company goals. Follows instructions and performs other duties as may be assigned by supervisor. Participates in Environmental, Health, & Safety initiatives as set forth by the company. Participates in and completes company required training programs. What are we looking for in the ideal candidate? Bachelor’s degree in Mechanical, Instrumentation, Electrical, or Reliability Engineering required. Minimum of 10 years relevant engineering experience in a petrochemical or refining facility required. Must have or be able to obtain TWIC card. Must have a level of proficiency with Internet, Email, and Microsoft programs. Knowledge of risk-based work prioritization methodology. Experience in performing root cause analysis. Knowledge of economic evaluation methods (Life-Cycle Cost Analysis, NPV, Benefit/Cost). Knowledge in Reliability Centered Maintenance or some form of Asset Management Plan Development is required. Experience with reliability-focuses statistical analysis is desired. SAP experience required. What can we offer you? Indorama Ventures Oxides & Derivatives is a leading chemical intermediates and surfactants producer with a diverse range of products in growth markets such as home & personal care, agrochemicals, oilfield technologies, fuel & lube additives and more. The successful candidate will receive a competitive compensation and will be eligible to participate in a comprehensive benefits package which includes: medical, vision and dental, basic life insurance, AD&D insurance, and 401k. Here, you can make an impact and make a difference. Come join us! Additional Locations:",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-08T01:52:39.000Z"
    },
    "company": {
        "name": "Indorama Ventures: Integrated Oxides &amp; Derivatives",
        "link": "https://www.linkedin.com/company/indorama-ventures-integrated-oxides-derivatives"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 120,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Port Neches",
        "region": "TX",
        "postal_code": "77651",
        "street_address": null,
        "latitude": 29.980604,
        "longitude": -93.963615
    }
}