{
    "job": {
        "title": "(Remote) Senior PHP/React Engineer",
        "industry": "Information Technology and Services,Computer Software,Financial Services",
        "description": "100% Remote Full Time Direct Hire Job Title: Senior Software Engineer Salary: $140k - $170k Job Location: 100% Remote Requirements: 8+ years development experience - Good experience with PHP and Javascript (React is desired) We are a SaaS company that works with banking, healthcare, real estate and other industries to help execute sales more quickly and efficiently. Our platform integrates will all email and CRM applications to help provide real time analytics and track ROI on investments. We need an experienced Software Developer to create innovative and efficient software solutions and have a focus on full stack development using PHP and Javascript/React. Top Reasons to Work with Us Competitive salary ($140k - $170k) Full Benefits (health, dental, vision, etc.) Strong GlassDoor rating Very low turnover rate Stable and growing company Huge opportunity for career and personal growth What You Will Be Doing Architecture and development Improve and contribute to the scalability of existing systems and applications Work on complex engineering problems Produce high-quality, commented and documented code that will easily be maintainable What You Need for this Position 8+ years software development experience PHP (Yii is a plus) JavaScript React is desired (or Angular) Node is a plus HTML/CSS BS in CS (or related) is preferred So, if you are a (Remote) Senior PHP/React Engineer with experience, please apply today! Email Your Resume In Word To Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also: Danny.Herries@Optello.com Please do NOT change the email subject line in any way. You must keep the JobID: linkedin : DH1-1617295 -- in the email subject line for your application to be considered.*** Danny Herries - Lead Recruiter - Optello Applicants must be authorized to work in the U.S. Optello is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-31T07:11:07.000Z"
    },
    "company": {
        "name": "Optello",
        "link": "https://www.linkedin.com/company/optello-us"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 96,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Redwood City",
        "region": "CA",
        "postal_code": "94064",
        "street_address": null,
        "latitude": 37.4805,
        "longitude": -122.21528
    }
}