{
    "job": {
        "title": "Machine Learning Engineer",
        "industry": "Information Technology and Services,Computer Software,Internet",
        "description": "We are currently looking for a Senior Machine Learning Engineer. We have one open position. Please apply and we can discuss! Location: San Francisco Salary: $150,000 (+/- depending on experience) Benefits: Full benefits Type: Full Time, Direct Hire Sponsorship Available: Yes Most Important 5+ years overall experience 3+ years w/ Machine Learning (NLU/NLP) Proficient Python Responsibilities Build an maintain the SaaS application platform Design, implement and maintain functionality and enhancements of the Application Play a leading role in all phases of software development from planning, designing, implementation, testing, deployment, to day-to-day operations Must Have Skills 5+ years of overall experience with at least 3 in Machine Learning Python experience Experience w/ reinforcement learning Experience w/ AWS, GCP, and or Azure If the above seems like a fit, then apply!! CRB Workforce, LLC provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-08T01:56:09.000Z"
    },
    "company": {
        "name": "CRB Workforce",
        "link": "https://www.linkedin.com/company/crbworkforce"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Sunnyvale",
        "region": "CA",
        "postal_code": "94089",
        "street_address": null,
        "latitude": 37.373676,
        "longitude": -122.036575
    }
}