{
    "job": {
        "title": "Youth Development Specialist",
        "industry": "",
        "description": "Title: Part-Time Youth Developer Location: Daly City, Bayshore and Lomita Park Sites, (Depending on Club Needs) Reports To: Area Director Salary: $16hr + (DOE) About the Mid-Peninsula Boys & Girls Club (MPBGC) The Mid-Peninsula Boys & Girls Club is a non-profit organization that has served youth between the ages of 5 and 19 years since 1955. We are part of a national movement that began in 1860 and now serves over 4.8 million youth in over 4,000 Boys & Girls Clubs across the country. As part of our mission, we provide our members with a wide array of educational, recreational and social activities in a safe and structured environment during after-school hours. We believe our success is achieved through our talented and motivated staff members. Our staff is a diverse group of people: some are in college, some are coaches, while others have family with children of their own. Whether a staff member is full-time, part-time, or seasonal, everyone plays a key role in our youths’ growth and achievements in all facets of life. Not to mention all the lifetime memories with our kids! Check us out at: https://www.midpenbgc.org/ Once you are here, you will be able to: Help inspire and positively impact the lives of the youth we serve. Grow hands on experience building community within your respective youth group and provide fun and engaging programs for our kids. Grow skills in project-based learning, event coordination, and leadership skills. Receive professional development trainings, online learnings, and specialized certifications to ensure your own personal and professional growth. What does BGC offer you? Part Time shift hours: Monday to Friday (Except Wed.): 2:00pm – 6:30pm Wednesdays 12:30pm - 6:30pm (Varies per site) Creative work environment. Professional and Personal Development. Periodic job-related perks such as attending professional sporting events, movies, and outdoor activities. This role is ideal for someone with the following traits: Strong oral and written communication skills. Responsible human beings who care for the well being of themselves and others. Interest/ability to partner with teammates in shared efforts to provide youth supervision and group/program management. Community minded and wants to see others succeed. High level of comfort having fun with the kids! We take our work seriously but not ourselves. Embraces being a child at heart, being silly highly encouraged! ADDITIONAL REQUIREMENTS Speaking Spanish is a plus. Must have valid California Driver’s License, proof of auto liability insurance and a good driving record. May be required to drive 9 passenger van. Must pass background check and provide TB test clearance. PHYSICAL REQUIREMENTS/WORK ENVIRONMENT This position may require the ability to lift 40lbs. The position may entail long periods of standing and/or walking. There may be periods of high levels of ambient noise. This position may include both indoor and outdoor environmental conditions. DISCLAIMER The information presented indicates the general nature and level of work expected of employees in this classification. It is not designed to contain, nor to be interpreted as, a comprehensive inventory of all duties, responsibilities, qualifications and objectives required of employees assigned to this job.",
        "employment_type": "PART_TIME",
        "date_posted": "2021-08-20T00:27:32.000Z"
    },
    "company": {
        "name": "Mid-Peninsula Boys &amp; Girls Club",
        "link": "https://www.linkedin.com/company/midpenbgc"
    },
    "education": {
        "required_credential": null
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "San Francisco Bay Area",
        "region": null,
        "postal_code": "94112",
        "street_address": null,
        "latitude": 37.39271,
        "longitude": -122.042
    }
}