{
    "job": {
        "title": "Software Engineer",
        "industry": "",
        "description": "POSITION (REMOTE) Software Engineer – Web Apps COMPANY OVERVIEW Founded in 2011, privately held TransformativeMed, Inc., headquartered in Seattle, Washington, is the world-wide leader in developing Cerner and Epic integrated solutions that enable hospitals and health systems to modernize their Electronic Health Record (EHR). Our mission is simple: Make clinician’s lives easier and improve patient safety by simplifying the medical software experience through embedded applications and ancillary tools. POSITION OVERVIEW TransformativeMed is seeking a mid or senior front-end leaning full-stack software engineer. The primary focus of this position will be front-end development of the Core Diabetes App using JavaScript (jQuery/React) and other related web technologies. However, competency in middle-ware/back-end technologies is desired as occasional RESTful API work with PHP/Postgres will be needed. This position will also have the opportunity to collaborate with our other development teams but will remain predominately focused on the Core Diabetes App to start. COMPETENCIES & ESSENTIAL ATTRIBUTES ·  Ability and desire to work in a team setting, collaborating with product management, developers, customers and clinicians is expected ·  Proficient written and verbal communication skills ·  Thrive in a dynamic start-up environment ·  Eagerness to learn ·  Ability to work with a degree of technical ambiguity ESSENTIAL FUNCTIONS ·  Refactor existing legacy jQuery application into new standardized React product ·  Improve existing features for legacy application versions ·  Provide detailed product documentation for your contributions ·  Collaborate with the Solutions Delivery team to deliver and support deployments for new and existing clients as needed with occasional after-hours tasks ·  Provide Tier-3 support for client-reported issues as needed REQUIRED SKILLS ·  Bachelor’s degree or equivalent relevant work experience ·  4+ years experience of front-end development with JavaScript HTML5 CSS3 JavaScript: jQuery and React, Angular or similar SPA Frameworks Responsive/Cross-Browser Web Design Templating engines (MustacheJS/Handlebars) ·  2+ years experience of back-end development PHP or NodeJS SQL Apache or Nginx ·  Experience with industry standard development tools/practices Git and GitHub JSON/XML/WebSockets/SOAP/RESTful APIs Virtualization technology (Vagrant/Docker/VirtualBox/VMWare/KVM) Waterfall and Agile development methodologies Knowledge of common software development patterns BONUS SKILLS ·  Previous healthcare development experience with Cerner CCL, mPages, or PowerChart ·  Linux system administration and scripting (CentOS/RedHat/Bash) ·  CI/CD Pipeline configuration (Jenkins, Bamboo, GitHub CI) ·  Automated testing experience (WebDriver, Mocha, Protractor) ·  Knowledge of JavaScript transpilers/minifiers (Babel, Webpack, Typescript) ·  Cordova development SUPERVISORY RESPONSIBILITY ·  None PERFORMANCE & SUCCESS MEASURES ·  Growth in application/infrastructure knowledge for our product suite and related EHR application/infrastructure knowledge ·  Shippable development contributions to the core company products with minimal rework ·  Effective and timely technical support for complex issue escalation ·  Ability to work effectively and collaboratively with the TransformativeMed team ·  Consistent contributions to code/product documentation COMPANY BENEFITS ·  Employee-centric culture, we consider and contribute to your career growth ·  Competitive pay ·  Unlimited PTO and flexible work schedules ·  Health/dental/vision/disability insurance OUR APPLICATIONS Core Mobile App – An iOS/Android application that presents rich, actionable EHR information in a format unique to each clinical specialty’s priorities. Clinical teams caring for a patient have what they need, when they need it, can organize rounds, convey discharge readiness, conduct handoffs, and manage their patient lists. As status and situations change, smart notifications and secure messaging ensure the right information is provided to act. Core Work Manager App – An EHR-embedded application that can create any number of patient lists, group and filter them based on the team’s specialty or individual’s needs, and view data in their preferred format. Built-in capabilities securely synchronize tasks; route alerts, notifications, and secure messages across the entire care team. Core Diabetes App – An EHR-embedded application that standardizes and streamlines the management of patients with diabetes, ensuring patient safety from admission to discharge. By presenting workflow wizards, visualizing important clinical data, and providing a comprehensive dashboard of diabetic patients, the Core Diabetes App helps clinicians effectively and quickly treat diabetic conditions. Equal Opportunity Employer TransformativeMed is an equal opportunity employer and is committed to diversity and inclusion in the workplace. We prohibit discrimination and harassment of any kind based on race, color, sex, religion, sexual orientation, national origin, disability, genetic information, pregnancy, or any other protected characteristic as outlined by federal, state, or local laws. This policy applies to all employment practices within our organization, including hiring, recruiting, promotion, termination, layoff, recall, leave of absence, compensation, benefits, training, and apprenticeship. TransformativeMed makes hiring decisions based solely on qualifications, merit, and business needs at the time. Other Duties Please note this job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the employee for this job. Duties, responsibilities, and activities may change at any time with or without notice.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-14T17:20:56.000Z"
    },
    "company": {
        "name": "TransformativeMed",
        "link": "https://www.linkedin.com/company/transformativemed"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 48,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Greater Seattle Area",
        "region": null,
        "postal_code": "98109",
        "street_address": null,
        "latitude": 47.591396,
        "longitude": -122.33279
    }
}