{
    "job": {
        "title": "Systems Engineer",
        "industry": "Internet",
        "description": "IT SYSTEMS ENGINEER JOB DESCRIPTION Prescient Solutions is an award-winning, Chicagoland-based IT outsourcer. For more than 25 years we have been providing CIO-level advisory support and on-site IT services to small, mid-sized and global organizations and government entities. We are committed to making our clients' businesses run better by adding more value to their organizations through technology. If you are looking for an opportunity to join a team where you can drive your career while being part of a company that values the ability to learn and grow, this is your chance! Prescient Solutions offers a great work environment that encourages teamwork to achieve a greater purpose while providing a higher level of service through better communication. We are looking for a dynamic IT S ystems Engineer (Administrator) who shares our commitment and believes in the value of communication and client interaction. As a Systems Engineer / Administrator , you will establish, maintain, and provide the engineering direction needed to connect and configure Microsoft servers on enterprise networks. You will also be responsible for working cross-functionally across several clients' enterprises between technology and the rest of their business to design and implement large scale solutions. You will implement Prescient Solutions' best practices and continually update skills and certifications to keep current with the most current technology. IT SYSTEMS ENGINEER ESSENTIAL DUTIES AND RESPONSIBILITIES Supports both operational and engineering functions at multiple client accounts concurrently; Evaluates customer generated requirements and works with the clients to ensure the implementation meets the clients' needs; Works with technicians and engineering groups at both Prescient Solutions and at the client locations to troubleshoot and resolve issues as required; Prepares operational and technical documentation; Troubleshoots and maintains clients' infrastructures 24/7; and Performs other duties and assists with special projects as needed. REQUIREMENTS Technical expertise, including proficiency in Microsoft Server operating systems, Office365, Active Directory and Microsoft Exchange server; mastery of Microsoft Desktop Operating Systems; Knowledge of system security; Excellent communication skills, both verbal and written; Professional and personable; Attention to detail; Ability to balance priorities and shift quickly; Ability to take ownership of area and follow assigned tasks through to successful completion; Self-motivated; Client Service Excellence; Problem Solving Skills; Time Management; Flexibility and organizational skills to manage multiple clients' IT infrastructures concurrently. EDUCATION / CERTIFICATION Microsoft certification or equivalent experience; or Minimum of five years of experience with MS systems administration.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-23T06:32:38.000Z"
    },
    "company": {
        "name": "Prescient Solutions",
        "link": "https://www.linkedin.com/company/prescient-solutions"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Westchester",
        "region": "IL",
        "postal_code": "60154",
        "street_address": null,
        "latitude": 41.85582,
        "longitude": -87.88214
    }
}