{
    "job": {
        "title": "Data Scientist",
        "industry": "Computer Software",
        "description": "SemanticBits is a leading company specializing in the design and development of digital health services and the work we do is just as unique as the culture we’ve created. We deliver using Agile practices to help the government solve their most technically challenging problems. The systems we develop are used to improve the quality of healthcare delivered to millions of people and revolutionize the healthcare industry on a nationwide scale. SemanticBits is a remote-first employer and has been named a Top Workplace in 2021. Candidate must be able to obtain a Public Trust. SemanticBits is looking for a Data Scientist with strong Business Intelligence, SQL, statistics, and Python knowledge who is eager to use their skills to rapidly turn data into insights. You'll have an opportunity to work on projects that support the Centers for Medicare and Medicaid Services (CMS) as we develop next-generation analytics and reporting systems that directly impacts healthcare quality. This position is open to a mid-level to principal professional depending on experience. Responsibilities: Work with business users to understand data requirements Build critical BI dashboards Train business users to use self-service tools - e.g. BI dashboards Maintain data documentation and definitions Apply software engineering best practices to analytics code Provide clean, transformed data ready for analysis Qualifications: Bachelor's degree required in Computer Science or a similar field Six years of relevant technical experience Three or more years working in a data scientist or data analyst role Expert skills with SQL and basic statistics Intermediate expertise in Python programming Strong problem solving and structuring skills Ability and desire to take ownership of and initiative for analysis; from requirements clarification to deliverable Strong technical communication skills; both written and verbal Ability to understand and articulate the \"big picture\" and simplify complex ideas Ability to identify and learn applicable new techniques independently as needed Candidate must reside in the United States Flexible and willing to accept a change in priorities as necessary Preferred Qualifications: Prior experience working with Medicare and/or Medicaid data Strong understanding of relational database and data warehousing concepts (e.g. OLAP, dimensional modeling) Experience with one or more BI tools, such as Superset, Tableau, MicroStrategy, Looker, etc. Prior experience working remotely full-time Federal Government contracting work experience Physical and emotional requirements for the job: This position is to be performed remotely from an individual’s home office and involves sedentary work. Employees in this role can be expected to exert up to 10 pounds of force on occasion in order to lift, carry, push, pull or otherwise move standard electronic equipment. Employees are expected to make decisions in a timely manner and display emotional intelligence during occasional stressful situations. Benefits: Competitive salary Stipend for work station set up Three weeks of PTO Eleven paid holiday days One floating holiday Comprehensive health benefits (medical with HSA option, dental, and vision) 401k retirement plan with matching benefit 100% paid short-term and long-term disability 100% paid life insurance Flexible Spending Accounts (FSA) Casual working environment Flexible working hours SemanticBits, LLC is an equal opportunity, affirmative action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, disability, or any other characteristic protected by law. We are also a veteran-friendly employer. If you are an individual with a disability and require a reasonable accommodation to complete any part of the application process, or are limited in the ability or unable to access or use this online application process and need an alternative method for applying, you may contact 703-787-9656 x257 for assistance.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-06T18:55:14.000Z"
    },
    "company": {
        "name": "SemanticBits",
        "link": "https://www.linkedin.com/company/semanticbits"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 72,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "United States",
        "region": null,
        "postal_code": "99999",
        "street_address": null,
        "latitude": 39.50355,
        "longitude": -99.0183
    }
}