{
    "job": {
        "title": "Senior Software Engineer II - Customer Platform",
        "industry": "Computer Software,Consumer Services,Information Technology and Services",
        "description": "About The Role Engages with stakeholders across teams to lead the development and maintenance of backend services and solutions to support user-facing products, downstream services, or infrastructure tools and platforms used across Uber. About The Team The Customer Platform team is seeking a Senior Backend Engineer II with experience building high scale services and platforms, as well as experience working with customer systems and data modeling. As an engineer on the Customer Platform team, you'll be responsible for designing, data modeling and developing the next-generation customer platform for Uber which has 1M+ QPS. You have to be partners with stakeholders and leads team efforts to build and maintain backend services and solutions to support user-facing products, downstream services, or infrastructure tools and platforms used across Uber. Minimum Qualifications PhD or equivalent in Computer Science, Engineering, Mathematics or related field AND 2-years full-time Software Engineering work experience OR 5-years full-time Software Engineering work experience, WHICH INCLUDES 3-years total technical software engineering experience in one or more of the following areas: Programming language (e.g. C, C++, Java, Python, or Go) Note the 3-years total of specialized software engineering experience may have been gained through education and full-time work experience, additional training, coursework, research, or similar (OR some combination of these). The years of specialized experience are not necessarily in addition to the years of Education & full-time work experience indicated. Required Technical skills: Distributed systems Preferred Product engineering Scalability engineering",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-20T22:22:29.000Z"
    },
    "company": {
        "name": "Uber",
        "link": "https://www.linkedin.com/company/uber-com"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Pacifica",
        "region": "CA",
        "postal_code": "94045",
        "street_address": null,
        "latitude": 37.613724,
        "longitude": -122.48571
    }
}