{
    "job": {
        "title": "Lead Data Engineer - Azure Platform",
        "industry": "Information Technology and Services,Computer Software,Financial Services",
        "description": "Job Description Key Role Responsibilities: Translate business requirements to technical solutions leveraging strong business acumen. Analyses current business practices, processes, and procedures as well as identifying future business opportunities for leveraging Microsoft Azure Data & Analytics PaaS Services. Support the planning and implementation of data design services, providing sizing and configuration assistance, and performing needs assessments. Delivery of architectures for transformations and modernizations of enterprise data solutions using Azure cloud data technologies. Design and Build Modern Data Pipelines and Data Streams. Design and Build Data Service APIs. Develop and maintain data warehouse schematics, layouts, architectures, and relational/non-relational databases for data access and Advanced Analytics. Expose data to end-users using PowerBI, Azure API Apps, or any other modern visualization platform or experience. Implement effective metrics and monitoring processes. Travel as needed Key Role Skill & Capability Requirements Strong experience as an Azure Data Engineer and must have Azure Purview experience. Strong experience in Azure Functions (Optional), Logic Apps (Optional), C# .NET, SQL, APIs. REST Demonstrated experience in turning business use cases and requirements into technical solutions. Expert level understanding of Azure Data Factory, Azure Data Lake, Azure SQL DW, and Azure SQL, Azure App Service is required. Experience in business processing mapping of data and analytics solutions. Ability to conduct data profiling, cataloging, and mapping for technical design and construction of technical data flow. The ability to apply such methods to solve business problems using one or more Azure Data and Analytics services in combination with building data pipelines, data streams, and system integration. Azure IoT, Azure HDInsight + Spark, Azure Cosmos DB, Azure Stream Analytics is a plus. Knowledge of Python is a plus. Experience preparing data for Data Science and Machine Learning. Experience preparing data for use in Azure Machine Learning and/or Azure Databricks is a plus. Demonstrated experience preparing data and building data pipelines for AI Use Cases (text, voice, image, etc.…). Designing and building Data Pipelines using streams of IoT data. Knowledge of Lambda and Kappa architecture patterns. Knowledge of Master Data Management (MDM) and Data Quality tools and processes Strong team collaboration and experience working with remote teams. Knowledge of Dev-Ops processes (including CI/CD) and Infrastructure as code fundamentals. Working experience with Visual Studio, PowerShell Scripting, and ARM templates. Experience with Git/TFS/VSTS is a must.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-17T07:41:34.000Z"
    },
    "company": {
        "name": "UST",
        "link": "https://www.linkedin.com/company/ustglobal"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Winston-Salem",
        "region": "NC",
        "postal_code": "27150",
        "street_address": null,
        "latitude": 36.09626,
        "longitude": -80.24374
    }
}