{
    "job": {
        "title": "Machine Learning Engineer",
        "industry": "Information Technology and Services",
        "description": "We’re hiring for a rapidly growing series A startup, who are developing an autonomous vehicle using “shared autonomy”. The company’s platform combines robotics, computer vision and machine learning and it’s here to revolutionize their $12 billion market. They’re looking for a Machine Learning Engineer to design and deliver their new autonomous vehicle. If you are passionate about cutting edge machine learning, robotics and having real-world impact – this could be the place for you! You will: Design and train neural networks Design, train and verify robust machine learning systems Provide technical leadership Write maintainable code, design software and deploy machine learning models Collaborate with other members of the team You have: PhD or Master’s degree in Computer Science or related field Experience in reinforcement learning, machine learning or optimization theory 3+ years of hands-on experience Expertise with deep learning frameworks (PyTorch, Tensorflow, Keras) Experience developing machine learning systems Expertise in Python and C++ Excellent communication skills Big Cloud is acting as a vendor to this position which is a direct hire.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-01T12:21:07.000Z"
    },
    "company": {
        "name": "Big Cloud",
        "link": "https://uk.linkedin.com/company/big-cloud"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "San Francisco Bay Area",
        "region": null,
        "postal_code": "94112",
        "street_address": null,
        "latitude": 37.39271,
        "longitude": -122.042
    }
}