{
    "job": {
        "title": "Software Engineer",
        "industry": "",
        "description": "Force-X is seeking a Software Engineer for our client in Suwanee, GA. This is a full-time, Direct Hire position. QUALIFICATIONS: Requires at least 1 year relevant experience. Must be a US person (US citizen or Green Card) Adaptable, Flexible, Ability to Learn – must be able to work with different architecture and software Experience with creative problem-solving – must be able to overcome obstacles with a unique perspective to benefit the team Team Player – must be able to accept a role in a team and work well together, sharing goals, effort, and not afraid to ask for assistance Experience with C++ and C# programming. Experience with 3D software development (Gaming, Simulation, or Commercial) – experience in using modern 3D development software and understanding of engine-related optimization, limitation, and strengths. Experience with object-oriented and component-oriented programming. Experience with database management – interfacing with a database to external software for handling large amounts of save/load, and data management Experience of programing with 3rd party SDK and API – utilizing 3rd party hardware and software Experience with Unity – as well as packages, C#, and prefab management EDUCATION: Engineering degree in computer science or relevant field",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-17T13:44:14.000Z"
    },
    "company": {
        "name": "Force-X",
        "link": "https://www.linkedin.com/company/force-x"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 12,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Suwanee",
        "region": "GA",
        "postal_code": "30024",
        "street_address": null,
        "latitude": 34.057514,
        "longitude": -84.0666
    }
}