{
    "job": {
        "title": "Software Engineer - New Grad 2022",
        "industry": "Computer Software",
        "description": "What We're Looking For Stytch is the platform for user authentication. We make it simple for developers to build complex authentication flows in a matter of minutes. We look for engineers who are excited to think about what to build, not just how to build it, whether that be a new API product, a feature in our developer dashboard, or a new data pipeline. What Excites You A collaborative environment with a tight feedback loop between the work you do and the impact it has on users Solving problems with pragmatic solutions — you know when to make trade offs between complexity and shipping quickly Shaping the culture and growing the team through recruiting, mentorship, and establishing best practices Learning new skills and technologies in a fast paced environment — as a small start up, things move quickly What Excites Us Curiosity and excitement to dive into complex problems A degree in Computer Science or similar What Success Looks Like Technical — build foundations that enable our team to create experiences that delight developers and end users Ownership — advocate for projects and solutions that you believe in and ship them to production Leadership — level up your teammates by providing feedback and guidance Our Tech Stack Go for back end services Node and Typescript for our web services React on the front end Swift for our iOS sdk and Kotlin for the Android sdk We run on AWS with Kubernetes for containerization gRPC and protobufs for internal service communication We're looking to hire a GREAT team and that means hiring people who are highly empathetic, ambitious, and excited about building the future of user authentication. You should feel empowered to apply for this role even if your experience doesn't exactly match up to our job description (our job descriptions are directional and not perfect recipes for exactly what we need). We are committed to building a diverse, inclusive, and equitable workspace where everyone (regardless of age, education, ethnicity, gender, sexual orientation, or any personal characteristics) feels like they belong. We look forward to hearing from you! Learn more about our team and culture here !",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-04T12:55:07.000Z"
    },
    "company": {
        "name": "Stytch",
        "link": "https://www.linkedin.com/company/stytch"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "San Francisco",
        "region": "CA",
        "postal_code": "94121",
        "street_address": null,
        "latitude": 37.78008,
        "longitude": -122.42016
    }
}