{
    "job": {
        "title": "Validation Test Engineer - Medical Device Software",
        "industry": "Biotechnology,Medical Devices,Computer Software",
        "description": "Lead the development and authoring of software Verification test plans, protocols, and reports for medical devices. Develop efficient and effective methods to qualify changes and improvements to products and processes in a manner that complies with medical device design standards. ESSENTIAL DUTIES AND RESPONSIBILITIES Develop and execute software/firmware verification protocols and scripts. Participate in product definition and requirements analysis to assure requirements are testable. Coordinate medical device system verification and validation scripts and reports. Review and support engineering change requests, deviation notices, and risk management. Utilize issue tracking tools and other methods to ensure consistent traceability between requirements, the design, and test cases. Working knowledge of FDA (21 CFR part 820), ISO 13485, 14971 & 62304 Working knowledge in SDLC, STLC, test methodologies, and defect management. QUALIFICATIONS Ability to comprehend software specifications and write corresponding test protocols High attention to detail and ability to lead V&V efforts to timely completion. Experience developing/configuring scripting and automation frameworks Excellent understanding of software design verification and validation for medical devices. Excellent written and verbal communication skills, including the ability to collect data, concisely organize information and author reports. Strong interpersonal skills, including the ability to work with and influence individuals of diverse backgrounds and technical ability. Able to perform well in a fast-paced, team environment. Successful 510K submissions, a plus Working knowledge of IEC 62366 and/or 60601-1, a plus Knowledge of software programming and embedded systems, C++, a big plus. EDUCATION and/or EXPERIENCE Minimum of bachelor’s degree (B.S.) Three (3) years related experience in an ISO 13485, FDA regulated or equivalent environment.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-20T22:41:13.000Z"
    },
    "company": {
        "name": "Integrated Computer Solutions, Inc. (ICS)",
        "link": "https://www.linkedin.com/company/integrated-computer-solutions-inc."
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "United States",
        "region": null,
        "postal_code": "99999",
        "street_address": null,
        "latitude": 39.50355,
        "longitude": -99.0183
    }
}