{
    "job": {
        "title": "Software Engineer",
        "industry": "Information Technology and Services,Computer Software,Computer Networking",
        "description": "RESOLVIT Bringing Solutions That Make Business Better Join Resolvit as a Software Engineer and be part of a creative, forward-thinking team. Our success at deploying skilled, highly knowledgeable experts has landed us on the Inc. 5000 list of America’s fastest-growing companies four times – and we’re just getting started. As the Software Engineer , you will work with the remote development and support teams to contribute to all aspects related to the enhancement and maintenance of our software. You will develop software, guide work, assist with planning of new projects, and troubleshoot any problems that occur. You will also report directly to the CTO. Additionally, you will: Actively participate in the development, analysis, and testing of web applications and databases Collaborate with remote teams to identify and fix technical issues Analyze users’ needs and work on features to satisfy them Coordinate support related tasks with the support team Develop and maintain websites What You’ll Need to be Successful: At least 2 years of experience as a software developer (front end and back end) At least 2 years of experience with Azure SQL Server (preferred) or Microsoft SQL Server At least 1 year of experience with tools like PHP, CSS, and JavaScript Bachelor’s degree in a STEM field (preferably computer science related) or equivalent experience or training Experience working on a software development team doing modern web application development Experience working in an Azure development environment with C# and Git Ability to create APIs to integrate product features Strong communication, motivational, and interpersonal skills Great Additional Skills: Banking and/or FinTech experience Knowledge of WordPress Experience working with Azure DevOps Experience in website administration Experience working with Twilio’s platform Experience developing mobile applications Benefits: At Resolvit, you’ll be given the support you need to grow in your consulting career. In addition to opportunities for advancement, we offer: Medical, dental, and vision insurance Life insurance coverage Long-term and short-term disability coverage 401(k) retirement plan with matching Professional support from our Client & Employee Optimization Specialist We currently have more than 100 open career opportunities across the country, so be sure to mention the appropriate Job Code with any correspondence! About Resolvit: Resolvit is an international technology consulting firm with industry-leading customers in the financial services, high tech, manufacturing, retail, life sciences, and government sectors. Through its partnerships, Resolvit delivers highly impactful, innovative solutions across five core areas: Infrastructure Modernization, Application Development Services, Enterprise Data Management & Analytics, Knowledge & Content Management, and Strategic Staffing.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-10-05T17:38:33.000Z"
    },
    "company": {
        "name": "Resolvit",
        "link": "https://www.linkedin.com/company/resolvit"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Greater New Orleans Region",
        "region": null,
        "postal_code": "70112",
        "street_address": null,
        "latitude": 29.975271,
        "longitude": -90.19994
    }
}