{
    "job": {
        "title": "Data Scientist",
        "industry": "Information Technology and Services",
        "description": "An early stage startup with secure revenue and funding is looking to build out their data team with several data scientists of all levels! 100% remote, but someone on the East Coast preferred! This Jobot Job is hosted by Christine McNamara Are you a fit? Easy Apply now by clicking the \"Apply\" button and sending us your resume. Salary $90,000 - $150,000 per year A Bit About Us We are a small startup looking to double in size over the next year. Our bleeding edge solutions are helping change the way the insurance industry operates on a daily basis and we are looking for Data Scientists to help us achieve these goals. The role would be entirely greenfield development and would offer you the opportunity to be involved in the overall technical direction of our data and analytics environment. We have the luxury of offering you all of the ownership and impacts as a small startup, while also giving you the security of a stable organization. Why join us? Opportunity to build something from scratch Medical, dental, vision coverage 401k with company match Full remote work Exponential growth opportunities Unlimited PTO Competitive compensation packages Job Details Requirements 2+ years of professional work experience Experience building out data pipelines from scratch (Python, R) Good exposure to data warehousing and ETL tools (Snowflake, Redshift, etc) Strong database experience with extensive experience using SQL Experience with cloud based technologies (Azure, AWS) Comfortable building out CICD pipelines and deploying ML models into production Version Control experience (Git) Extensive problem solving experience and self-starter attitude Nice to Haves Bachelors in STEM related field Experience with Spark or other streaming technologies Domain knowledge experience working with insurance related data sets Experience working on projects from end to end Customer facing experience to gather requirements and deliver solutions effectively Machine Learning (xGBoost, GLMs, Random Forest, NLP, NLTK, Computer Vision) Experience working with structured and unstructured data sets Mentoring junior level engineers Interested in hearing more? Easy Apply now by clicking the \"Apply\" button.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-12T00:00:00.000Z"
    },
    "company": {
        "name": "Jobot",
        "link": "https://www.linkedin.com/company/jobot"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "New York",
        "region": "NY",
        "postal_code": "10132",
        "street_address": null,
        "latitude": 40.713047,
        "longitude": -74.00723
    }
}