{
    "job": {
        "title": "Machine Learning Engineer/Prototyper",
        "industry": "Banking,Financial Services",
        "description": "Description: Machine Learning Engineer and Prototyper. We need engineers who are comfortable with pre-production work, rather than working on existing systems. Description: We are looking for a machine learning engineer with a focus on rapid prototyping and pre-production development to build innovative solutions for the Productivity team . The ML Engineer will become an integral part of the Productivity and D10X team. Our teams work with businesses to solve hard problems that require experimentation, an outside-in perspective, and experience navigating ambiguity. Job Background/context: The objective of the job is to create, experiment, and put in place rapid prototypes and initial MVPs where solution hypothesis generation and testing is done with tangible throwaway proofs-of-concept and rapidly implemented solutions. We expect that much of the work will require an application of machine learning aimed at process automation, but will likely also involve elements of data engineering, back-end development, and process/systems mapping and design. You should be a jack of all trades with a well-rounded set of programming skills and data science/data engineering knowledge, with experience in pre-production development. You should have an interest in understanding why a software feature has business value – and want to know the customer journey that is being addressed to ensure you are building the right thing in the right way. Versatility is key, as every project will require a different approach- sometimes including non-technical work like process mapping or data gathering. This job will require a high degree of independence, curiosity, initiative, and comfort with “good enough” over perfection. It will also require a huge amount of extroverted communications with other parts of Client. If you have to be told what to do on a daily basis, if you don’t like sharing your work early, or if you are not comfortable in developing relationships in a large organization, then this job is not for you. Key Responsibilities: Primarily you’ll be developing prototypes and initial MVPs for functions like risk, finance, compliance, and HR. Technical Skills: • Rapid prototyping experience • Comfort with ML concepts and tools, including Python • Comfort with data manipulation and data engineering • Basic backend development skills (PHP, Java) • Experience with API’s, REST and microservices • Experience with rational databases • Knowledge of code versioning • Comfort with systems mapping and communicating about process and data flows Other Considerations: • Technical degree • Basic frontend development skills (HTML, CSS, JavaScript, Angular, Flutter, React) a plus, but not required. • Experience with early stage new product development • Excellent communication skills • Ability to work with minimal supervision • Willing to collaborate with teams in diverse locations • Problem solving skills demonstrated by past positions • Ability to work under tight deadlines and handle multiple tasks in changing environment. • Experience working at fintech startups or corporate innovation teams is a plus",
        "employment_type": "CONTRACTOR",
        "date_posted": "2021-08-05T19:21:59.000Z"
    },
    "company": {
        "name": "Mindlance",
        "link": "https://www.linkedin.com/company/mindlance"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Tampa",
        "region": "FL",
        "postal_code": "33675",
        "street_address": null,
        "latitude": 27.947424,
        "longitude": -82.45878
    }
}