{
    "job": {
        "title": "Senior Software Engineer",
        "industry": "",
        "description": "Cohesion is a leading Intelligent Buildings software solution that is disrupting how buildings operate and how people engage with buildings – from real estate owners/investors, operators, building engineers, to tenants and visitors. Our cutting-edge converged IoT-enabled platform brings together building systems, building software, and business applications into a single portal for on web and mobile platforms to forge the path to autonomous buildings. Cohesion is looking for talented software engineers that specialize in .Net to join our rapidly growing startup in our Chicago office located in the Loop. In this position, you will work in a scrum team that is responsible for iterating on new and existing product micro-services and ensuring quality code through automated testing. You will have the opportunity to work with our integration partners and building implementation teams to facilitate smooth onboarding for our rapidly growing portfolio of client s. What You'l l Do • Iterative development on new and existing product based micro-services in a scrum team. • Collaborate with the engineering department to discuss current and future archite cture. • Write automated tests to ensure code quality and functio nality. • Encapsulate tools and reusable code as shared libraries to be used across all micro-s ervices. • Integrate with multiple vendors to help facilitate client on boarding. • Improve SDLC to increase efficiency of product releases. •Create proof of concepts for new tools and technologies to facilitate produc t planning. •Participate in sprint reviews to demonstrate and take pride in your sprint work. Required Qualifications • Proficiency in .Net Core 2.1/3.1 framework and C # 8.0 language. • One or more years of experience working on a micro-service driven platform. • Intimate knowledge of design and architecture paradigms such as Domain-Driven Design, Event-Driven Archite cture, CQRS, etc. • Experience implementing ORM tools such as Entity Framewo rk Core or Dapper. • Background using relational and document databases. • Skilled with Git repositories, su ch GitHub or GitLab. • Experience using cloud providers to maintain and create new resources. • Excellent communication skills with a team-oriented mindset. • Superior organizational and time management skills. • Position requires flexibility to work outside of non-traditional business hours as requir ed to perform job duti es Desired Qualifications • Bachelor’s Degree in Computer Science and/or two o r more years of experience. • Proficiency with the NodeJs framework an d JavaScript and TypeScript. • Funct ional programming experience. • Familiari ty with time-series databases. • Understandin g of IoT platforms and devices. • High-level knowledge of Building Automation Systems and n etworks. • Experience with Azure. • Proficient at using Kubernetes . What You Can Expect From Cohesion Cohesion is proud to offer a comprehensive benefits package to eligible, full-time employees in the United States. Our benefits are designed to invest in our employees— and their family’s —well-being, including investments in the ir health, happiness, and well-being. • Receiving a competitive compensation package, including bonus, medical/ dental/vision insurance, and 401k match • Rece iving a monthly cell phone reimbursement • Comprehensive wellness stipend progra m (eligible after 6 months of employment) • Enjoying a responsible unlimited PTO program to help employees maintain work -life balance after 3 months of emplo yment • 2-way flexibili ty of work schedules • Dressing for your day • Working in an open environment with creative opti onal brainstorming sessions for all employees • Participating in one all-employee lunch per month and one all-employee break fast per month • Enjoying family leave benefits At Cohesion, we see diversity and inclusion as a source of strength. We believe building trust and innovation are best achieved through diverse thought and practice. Individuals seeking employment at Cohesion are considered without regard to race, religion, color, national origin, gender identity and expression, sexual orientation, gender identity and expression, age, mari tal status, veteran status, or disability status.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-25T17:23:00.000Z"
    },
    "company": {
        "name": "cohesion",
        "link": "https://www.linkedin.com/company/cohesionib"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 12,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Chicago",
        "region": "IL",
        "postal_code": "60654",
        "street_address": null,
        "latitude": 41.88323,
        "longitude": -87.6324
    }
}