{
    "job": {
        "title": "Artificial Intelligence Engineer",
        "industry": "Hospital &amp; Health Care",
        "description": "Preferred Locations – Atlanta, GA or Chicago, IL This Engineer Lead role is responsible for designing and developing AI solutions. This role will function expert level architecture technology that is responsible for development and delivery of the business unit software solutions technology road map to ensures specific technology solutions are in place to support business and it customers. Leads the development and delivery of AI architectural technologies for software solutions and ensure that technology deliverables are met based on business requirements; work with leadership to design and deliver technology requirements and leverages necessary resources; leads technical teams and provide direction on all stages of a project the middle phases as well as implementation, and final proven leadership in the delivery and deployment phases. Performs technical planning, architecture development and modification of specifications. Develops specifications for products/services, applications and service offerings. Assesses the compatibility and integration of products/services proposed as standards in order to ensure an integrated architecture across interdependent technologies. Qualifications: Requires Bachelor's degree in related field 7+ years of experience in architecture/design in relevant technology disciplines Or any combination of education and experience, which would provide an equivalent background. Able to translate between customer needs and product specifications. Full SDLC exposure delivering production-ready engineering solutions, including requirements definition, architecture selection, prototype development, application design, enabling continuous integration and deployment pipelines, and preparing support and maintenance processes. Experience in designing scalable full-stack applications and leading engineering teams in developing real-time and decision support solution types. Proven experience in an agile and DevOps environments who can mentor engineers fostering best practice design and development skills. Experience designing solutions that leverage container-based platforms ; such as OpenShift/Kubernetes. 5+ years of hands-on experience in one or more modern Object-Oriented Programming languages (Java, Scala, Python) including the ability to code in more than one programming language. 5+ years of hands-on experience applying principles, best practices in programming APIs and RESTFul web services . 2+ years of hands-on experience in developing enterprise level APIs leveraging python web frameworks, like Flask. 2+ years of hands-on experience implementing real-time API integrations in private or public cloud environments (AWS, Azure, GCP, etc.). Good understanding of the latest data science and data engineering methods to implement enterprise-level services.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-18T21:53:23.000Z"
    },
    "company": {
        "name": "Anthem, Inc.",
        "link": "https://www.linkedin.com/company/antheminc"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 84,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Greater Chicago Area",
        "region": null,
        "postal_code": "60618",
        "street_address": null,
        "latitude": 41.948055,
        "longitude": -87.655754
    }
}