{
    "job": {
        "title": "Machine Learning Operations Engineer",
        "industry": "Information Technology and Services,Health, Wellness and Fitness",
        "description": "AI/ML Ops Engineer TeleHealth Start Up aiming to revolutionise healthcare ⚡ New York (remote US/Europe) $145,000 - $180,000 + Equity + Benefits A New York based HealthTech Analytics Company is looking to hire a n AI/ML Ops Engineer. They have recently raised over $20million Series B Funding to assist their rapid growth across the states and potentially Europe as well! The AI/ML Ops Engineer will join a team of ML and NLP (Natural Language Processing) experts, and will work closely with the AI Scientist to leverage healthcare data, and be fundamental in building their automated quality assessment program. The AI/ML Ops Engineer should have prior experience in the Healthtech Space or a keen interest and passion for working on lifechanging and meaningful projects. Responsibilities Build and deploy robust, industrial scale Machine Learning Pipelines for NLP (Natural Language Processing) Collaborate with both Software Engineering teams and Data Science teams Enhance and maintain pipelines for continuous integration Contribute to the enhancement and extension of data analytics pipelines Requirements MS/PhD in Computer Science, Computer Engineering or related discipline MUST have experience deploying Machine Learning Models Experience within Unix-based Environments Expert proficiency with Python, AWS and related libraries Ideally experience with deep learning frameworks such as PyTorch and Tensorflow Strong communication skills as you will be required to collaborate with teams across data, engineering Experience or interest in the HealthTech. Experience working in a similar organization would be a big plus but not required Bonus if you have experience with Kubernetes, Docker, or similar platforms Benefits Competitive Salary + Equity (negotiable and based on experience) Robust healthcare plans and matching 401K Flexible working hours and WFH Stipend to spruce up your home office! Great people to work with - an extremely diverse team and a company that cares about Diversity, Equity & Inclusion Lots of virtual events for you to connect with your team The team has just started it’s search and with the fast growth plans is looking to secure a candidate as soon as possible. 🌎 The office is based in New York. Remote may be a possibility. 📧 Interested in applying? Please click on the ‘Easy Apply’ button ⚡ Storm3 is a HealthTech recruitment firm with clients across London, Europe and North America. To discuss open opportunities or career options, please visit our website www.storm3.com and follow the Storm3 Linked In page for the latest jobs and intel",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-16T15:51:37.000Z"
    },
    "company": {
        "name": "Storm3",
        "link": "https://uk.linkedin.com/company/storm3"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "United States",
        "region": null,
        "postal_code": "99999",
        "street_address": null,
        "latitude": 39.50355,
        "longitude": -99.0183
    }
}