{
    "job": {
        "title": "Data Scientist I",
        "industry": "Entertainment",
        "description": "Company Overview WarnerMedia is a powerful portfolio of iconic entertainment, news, and sports brands. We bring people, technology, and the world’s best storytellers together to drive culture and meaningful connection. We believe the enduring power of stories can open our eyes to the world, to each other, and to new and different perspectives. HBO Max is where storytelling takes center stage and where creatives find a home with the support and resources to do their best work, no matter the genre or format. Whatever the viewer wants to watch is front and center and more of what they crave is easily discovered. It is where our exclusive HBO Max Originals and iconic entertainment brands thrive, with HBO, Warner Bros., DC, Turner Classic Movies, Cartoon Network and more delivering the greatest array of series, movies and specials for audiences of all ages. HBO Max launched in the US in May 2020 and will launch in Latin America and Europe during 2021. Join us. Shape your story here. The Job We are looking for a Data Scientist to join the HBO Max Experimentation team. In this role, you will play a key part in growing the experimentation-centric culture of HBO Max. You will participate in several cross-functional teams to establish best practices, develop cutting-edge statistical tests and evaluate the vast number of experiments being run across every aspect of the company. The Daily Partner with Product, Analytics & Engineering teams to design, analyze and interpret the experiments that drive decision-making at HBO Max. Perform research into new tests and techniques that can reduce both test time and errors. Establish and evangelize best practices around experimentation. The Essentials M.S. or Ph.D. in Statistics, Biostatistics, Neuroscience, Psychology or related field. Mastery of statistical testing and experimentation. Strong knowledge of variance reduction techniques. Expertise in Bayesian statistics, state-space models & hierarchical modeling. Strong programming skills in Python (or R, Julia) and SQL The ability to clearly communicate complex statistical results to a broad audience Nice-to-Haves Experience with probabilistic programming (e.g. PyMC3, STAN, Pyro, NumPyro) Knowledge of Causal inference techniques and libraries. Experience with multi-armed bandits The Perks Exclusive WarnerMedia events and advance screenings Paid time off every year to volunteer for eligible employees Access to well-being tools, resources, and freebies Access to in-house learning and development resources Part of the WarnerMedia family of powerhouse brands Warner Media, LLC and its subsidiaries are equal opportunity employers. Qualified candidates will receive consideration for employment without regard to race, color, religion, national origin, gender, sexual orientation, gender identity or expression, age, mental or physical disability, and genetic information, marital status, citizenship status, military status, protected veteran status or any other category protected by law.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-24T03:31:03.000Z"
    },
    "company": {
        "name": "WarnerMedia",
        "link": "https://www.linkedin.com/company/warnermedia"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Culver City",
        "region": "CA",
        "postal_code": "90232",
        "street_address": null,
        "latitude": 34.0225,
        "longitude": -118.39429
    }
}