{
    "job": {
        "title": "Data Scientist",
        "industry": "Staffing and Recruiting",
        "description": "We at neteffects are looking for a motivated Data Scientist for our direct client. No C2C but Neteffects sponsor work visas. This is a Remote position. Required Skills: • Ph.D. (or MS with 4+ years of post MS experience) in Statistics, Geo-statistics, Mathematics or closely related field. • 2 years of experience in using machine learning, artificial intelligence & statistical methodologies to solve research problems. • Proficiency in Python or in another high-level programming language. • Experience in developing statistical, and machine learning models for environmental and agronomical applications. • Experience analyzing and presenting complex data and proven problem-solving abilities. • Strong organizational, interpersonal, and written communication skills. Desired Skills: • Experience working with agricultural/biological scientific data is highly desired. • Experience working with various environmental data and categorizing environmental variabilities using geospatial model and approach is highly desired. • Familiarity with geospatial data and tools and techniques required to explore geospatial data is highly desired. • Familiarity with deep learning architectures and techniques as well as constructing and evaluating these models. • Drive for translating business problems into research initiatives that deliver business value. • Creativity in defining challenging exploratory projects.",
        "employment_type": "CONTRACTOR",
        "date_posted": "2021-08-31T22:56:06.000Z"
    },
    "company": {
        "name": "neteffects",
        "link": "https://www.linkedin.com/company/neteffects"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 48,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "United States",
        "region": null,
        "postal_code": "99999",
        "street_address": null,
        "latitude": 39.50355,
        "longitude": -99.0183
    }
}