{
    "job": {
        "title": "Machine Learning Engineer",
        "industry": "Information Technology and Services",
        "description": "Munich Re America Services (MRAS) is a shared service organization that delivers services to all Munich Re US P&C Companies and other group entities. We're adding to our diverse team of experts and are looking to hire those who are committed to building a culture that enables the creation of innovative solutions for our business units and clients. The Company As a member of Munich Re's US operations, we offer the financial strength and stability that comes with being part of the world's preeminent insurance and reinsurance brand. Our risk experts work together to assemble the right mix of products and services to help our clients stay competitive - from traditional reinsurance coverages, to niche and specialty reinsurance and insurance products. The Opportunity Future focused and always one step ahead The Business Technology (BT) unit works closely with business leaders to drive innovation and business transformation, spearheading the digitalization of Munich Re's business activities. The focus areas for the BT unit are outlined below: Digital Insurance Platforms and Ecosystems Advanced Analytics and Big Data Artificial Intelligence, Machine Learning, and Automation Solutions Micro Service, APIs and Cloud Architectures Cyber Security Web and mobile distribution The Machine Learning Engineerwill be part of a cross-functional Agile development team to deliver high-quality digital solutions across a broad range of innovation initiatives, while championing quality and good coding practices. Your Job Collaborate with different business units on building Data/ML Applications Build and maintain robust scalable data pipelines and machine learning pipelines in Microsoft Azure Optimize data ingestion process for better reliability and throughput Design and develop data models for Machine Learning as well as Analytics Own projects from design through delivery with ongoing support Communicate effectively across diverse disciplines(with Product, Data Science, Actuarial, etc) to collect requirements. Build CI/CD pipelines for Infrastructure provisioning/configuration, application deployment, etc. Develop expert knowledge of Data and ML infrastructure within Munich Re Successful candidates should possess the following skills/capabilities: Bachelor's degree (MS preferred) in Computer Science, Statistics, Math or equivalent combination of education and experience Extensive data modeling and data architecture skills 3+ years of hands-on experience with scikit-learn, tensorflow or pytorch 3+ years of building and operating Machine Learning Production System 5+ years of hands-on Python, R, or Java experience required Expert SQL skills including T-SQL, Hive, Spark SQL, etc. Expert Knowledge in cloud technologies such as Azure App Services, Azure Kubernetes, Azure Databricks Experience in data pipeline development using Azure Data Factory, T-SQL, PySpark, Airflow, etc. Experience with data visualization tools such as Power BI Drive and dedication, as well as creativity and hands-on attitude Curiosity in searching for new solutions outside of traditional approaches Demonstrated ability to experiment with and learn new technologies Strong oral and written communication and interpersonal skills Excellent analytical, problem solving and organizational skills At Munich Re US, we see Diversity and Inclusion as a solution to the challenges and opportunities all around us. Our goal is to foster an inclusive culture and build a workforce that reflects the customers we serve and the communities in which we live and work. We strive to provide a workplace where all of our colleagues feel respected, valued and empowered to achieve their very best every day. We recruit and develop talent with a focus on providing our customers the most innovative products and services. We are an equal opportunity employer. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-12T22:03:55.000Z"
    },
    "company": {
        "name": "Munich Re",
        "link": "https://de.linkedin.com/company/munich-re"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "New York",
        "region": "NY",
        "postal_code": "10132",
        "street_address": null,
        "latitude": 40.713047,
        "longitude": -74.00723
    }
}