{
    "job": {
        "title": "Data Scientist",
        "industry": "Information Technology and Services,Computer Software,Financial Services",
        "description": "HI, Kindly let me know if you have a suitable fit for the following position Thanks REMOTE Data Scientist 6MONTHS Contract to hire Please send the resume to or 847- 350-1008 Only W2 or 1099 We are looking for an entry-level Data Scientist for our Practice who will work with clients for problem definition, data exploration and solution identification and design for critical business problems of our customers. The ideal candidate must have strong experience using a variety of data mining/data analysis methods, using a variety of data tools, building and implementing models, using/creating algorithms and creating/running simulations. They must be comfortable working with a wide range of customers from various industries. must have : AWS, Python ,machine learning Required Qualifications: Comfortable with developing end-to-end advanced analytics projects using statistical analysis and/or machine learning Expert with programming for data analysis using Python. Knowledge of Cloud technologies such as AWS SageMaker. Knowledge of any relational database such as SQL/My SQL. Ability to integrate data from disparate sources into an efficient and intuitive rational database structure. Bachelor's or Master's degree in computer science, data science, statistics, mathematics, business administration and/or related field or the foreign equivalent or relevant work experience. Other Qualifications: Excellent analytical, troubleshooting and problem-solving skills, with proven ability to quickly understand a problem, determine the significance of the issue and identify a solution. Focus on delivering results, and work ethic based on a strong desire to exceed expectations. Demonstrated understanding of product database structure and design principles. Strong interpersonal skills, including written and oral communication skills. Ability to work within a team environment, networking and collaborating cross-functionally. Ability to remain flexible in a fast-paced and rapidly changing environment. Commitment to continuous improvement, and demonstrated the ability to innovate. Charan Kumar | IVY Tech Sols Inc. 3403 N Kennecott Avenue, Suite B&C Arlington Heights, IL 60004 PH. ( Direct: (847) 350-1008 |Gtalk : charan.ivytech| Powered by JazzHR 8TrA97VmtN",
        "employment_type": "CONTRACTOR",
        "date_posted": "2021-07-15T19:16:27.000Z"
    },
    "company": {
        "name": "IVY TECH SOLUTIONS INC",
        "link": "https://www.linkedin.com/company/ivy-tech-solutions-inc"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Richmond",
        "region": "VA",
        "postal_code": "23284",
        "street_address": null,
        "latitude": 37.54076,
        "longitude": -77.43393
    }
}