{
    "job": {
        "title": "IT Data Analyst, Principal",
        "industry": "Hospital &amp; Health Care,Insurance",
        "description": "Job Summary The Data & Analytics Lead serves as a liaison between the Enterprise Data & Analytics organization, IT Portfolios, and senior/functional business leaders to understand support needs, define / drive data and analytics strategy and priorities, and collaborate to ensure the successful delivery of data and analytics solutions to support strategic and operational objectives. Responsibilities Collaborate with business stakeholders to assess needs, define priorities, and support prioritization of data and analytics initiatives. Identify opportunities to leverage D&A capabilities to support business priorities. Engage with key IT Portfolio roles and business stakeholders in shaping the IT priorities and roadmap. Ensure data and analytics teams are fully aware and aligned to IT Portfolio goals. Facilitate discussions around business case development and business requirements. Play a trusted strategic advisor role to business and help derive value from data and analytics. Identify and escalate data & analytics priorities requiring enterprise data and analytics governance review. Coordinate across IT functions to facilitate evaluation of data and analytics priorities (e.g. Enterprise Architecture). Coordinate with D&A Engagement Team and participate in forums to review, prioritize, and triage relevant initiative and requests. Monitor execution efforts, provide visibility to business stakeholders across delivery cycle, and ensure needs are being met. Engage data & analytics shared services team (as needed) to drive delivery and provide subject matter expertise. Partner with data & analytics teams to negotiate scope, timelines, trade-offs, and budget requirements with business stakeholders to facilitate successful delivery. Build strong relationships with key stakeholders across business and IT. Manage coordination and communication between business and IT stakeholders and Enterprise Data & Analytics. This role is a senior individual contributor. Knowledge And Experience BS/BA Degree. MBA or Advanced Degree in Business / Health Sciences or Quantitative discipline preferred. At least 8 years of relevant work experience acting in roles of increasing responsibility working in or supporting the needs of business functions within healthcare organizations. Proven experience leveraging data and analytics to improve operational performance. Extensive knowledge of healthcare data and advanced analytics concepts. Must be flexible, team oriented and able to accept and create change and results oriented. Enthusiastic, entrepreneurial approach with confidence to business challenges. Creative thinker – Ability to “think outside the box”. Proven leadership skills – ability to motivate a diverse range of stakeholders to quickly achieve results. Extensive experience engaging with senior business leaders and executives (e.g. corporate officers). Extensive experience engaging with IT leaders and technical leads. Extensive healthcare payer expertise emphasizing the business function(s) and area(s) of focus they would be responsible for. Knowledge of healthcare payer data across domains (claims, provider, member, etc.) and how it can be leveraged to support business operations and guide strategic priorities. Ability to understand use cases, define data and analytics strategies and translate business requirements into data and analytic solutions to achieve critical business outcomes. Excellent verbal and written communication skills, with the ability to build rapport and credibility with business leaders. Ability to engage business and technical leaders to drive business impact. Ability to develop and implement business processes, procedures and systems. Previous consulting experience recommended.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-09-12T04:12:10.000Z"
    },
    "company": {
        "name": "Blue Shield of California",
        "link": "https://www.linkedin.com/company/blue-shield-of-california"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 96,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Oakland",
        "region": "CA",
        "postal_code": "94612",
        "street_address": null,
        "latitude": 37.80483,
        "longitude": -122.27248
    }
}