{
    "job": {
        "title": "Software Engineer",
        "industry": "Computer Games,Computer Software",
        "description": "We are looking for an Engineer to architect, document, implement, and test our systems, mechanics, and infrastructure as we continue to refine the core experience and build new features within Skullgirls Mobile, and beyond. You will work with interdisciplinary teams using every tool at hand to the delight of millions of players around the world. Requirements Swiss Army Programmer - You possess strong foundational computer science skills that enable you to do everything from UI to game mechanics to profiling. Jedi Mind - You are a Unity ninja and are proficient in C# on desktop, iOS, and Android platforms. Sage - Solutions to problems often lurk beneath the surface, but you are wise enough (and determined enough) to think critically about what you are developing. Evangelist - You have informed opinions about what’s fun and exciting in games because you play them all the time, especially the mobile ones. Crackerjack - Skills don’t grow on trees. They are developed. You know what you know, but more importantly, you know what you need to learn. Conversationalist - You can have a conversation. You know, with other people. Responsibilities So, you know how to do a lot of stuff, but what do we expect from you? Architect, document, implement, test, debug, and maintain code for iOS, Android, and other platforms. Write robust, maintainable code with consideration to economy, elegance, and modularity. Support technical excellence in whatever you do. Respond to critical feedback in a professional and can-do manner. Prototype and iterate rapidly in conjunction with other members of the development team. Provide input and insight to the development team in the implementation of new gameplay features. An unyielding fascination with video games. The Perks There are a lot of great reasons to work at Hidden Variable! Some of the highlights include: Unlimited PTO Policy - When it comes to sick and vacation days, we don’t believe in tracking the hours our employees work or don’t work. If you need to take time off — be it for date night, a vacation, or even just a personal wellness day — we support you. We go out of our way to create a guilt-free office environment. Our goal is simply to create incredible products, which we believe is best achieved when you don’t have a manager looming over your shoulder, tracking the minutes you are in or out. Medical, Dental, and Vision Plans - We offer a generous yearly stipend, and have several premium plans available from major health care providers. Already have medical coverage? Keep the stipend as an end of year bonus. Matching 401k - Send a portion of your salary towards retirement, and we’ll match a certain amount. Free money! Well Stocked Kitchen - Healthy snacks, not-as-healthy (but arguably tastier) snacks, and beverages are supplied to keep you going throughout the day (when we all eventually return to the office). Frequent Celebrations - We work hard, but we like to let off steam, too. You’ll find us playing board games, video games, trivia, and even the occasional field trip to an escape room or other attraction around the city, all courtesy of Hidden Variable. Equal Opportunities We believe diverse backgrounds and life experiences enable us to collectively build better and more inclusive games. We encourage applications from candidates from any background who are eager to celebrate their unique perspective. How to Apply? Hopefully, by the time you’ve scrolled this far, you’ve realized that we value high quality products and people who are passionate about what they do for a living. Ready to apply? Please send us an email with your resume, a cover letter, and if applicable, a portfolio. List the position you’re applying for in the subject line and send us a message at careers@hiddenvariable.com. We can’t wait to hear from you! For more details, visit here: https://www.hiddenvariable.com/careers/engineer/",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-29T17:30:57.000Z"
    },
    "company": {
        "name": "Hidden Variable Studios",
        "link": "https://www.linkedin.com/company/hidden-variable-studios"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Los Angeles Metropolitan Area",
        "region": null,
        "postal_code": "90021",
        "street_address": null,
        "latitude": 34.073666,
        "longitude": -118.23985
    }
}