{
    "job": {
        "title": "ELS - AMZ - Reliability Engineer",
        "industry": "Electrical/Electronic Manufacturing,Construction,Automotive",
        "description": "Overview Elite Line Services is a major single source maintenance solution in the industry with the bandwidth to service all of your equipment maintenance needs. We maintain all original equipment manufacturers for material handling equipment, BHS, PBB, Facilities, GSE and vehicles. Our hybrid programs efficiently cross utilize technicians between equipment types to provide seamless coverage that protects the best interest of our customers. Whether this is getting full warranty value for new parts and systems or applying experienced and specialized technical support for mature equipment needs, ELS has you covered. Position Summary Responsibilities Join a rapidly growing team at ELS by helping us grow the client’s US portfolio. This ground floor expansion provides an opportunity for team members to apply building engineering skills in new ways. As part of a new line of business for the client, we are developing means and methods by which facilities, systems and assets are managed throughout their lifecycle. This explosive new business will create near term challenges and long term career choices. Essential Functions Establish and maintain a safety-first culture by promoting and driving safe work practices timely training, best practices as well as delivering rewards and recognitions to promote safe behavior. Drive and promote safety culture within portfolio including subcontractors, suppliers and visitors Drive performance as measured by client’s Key Performance Indicators Responsible for performance of team of Technicians/Mechanics over multiple shifts or a large scale facility to perform maintenance and repair on client equipment and facilities systems. Establish relationships with client Site Leads, business partners such as EHS leads to establish trust and credibility in the delivery of IFM services Provide engineering guidance to Technicians as needed to ensure operations are aligned with site and portfolio goals and values Manage operating expense budgets for relevant sites including monthly variance reports Initiate purchase order requests for goods and services for sites within responsibility Manage subcontractors and suppliers to deliver goods and services against contracts and expectations Administer training to ensure compliance, readiness and competency of staff Work with Maintenance Manager to oversee the delivery of maintenance and repair services Support the Maintenance Manager in the implementation of short and long-term projects for the client as requested Develop a strong collaborative team-based environment. Ensure compliance with ELS minimum operational audit and safety standards Import ELS best practices in the interest of exceeding client goals and expectations Perform regular deep dives/data analysis to understand key focus areas for improvement across facility Deploy, manage, and improve predictive maintenance program, including Thermography, Vibration, and Ultrasound technologies Create, deploy, and share best practices at facility and across network of sites Lead continuous improvement events and generate cost savings that exceed site performance goals Qualifications BASIC QUALIFICATIONS Minimum eight years’ experience as a Reliability Engineer or equivalent including managing teams, budget responsibilities, supplier management, problem solving, and client/ customer relations Must have solid knowledge of building/ mechanical, electrical systems (MEP) Prefer experience managing teams in an industrial environment containing conveyance, process control and powered trucks. Experience required using CMMS systems and reporting Demonstrated communication skills written and verbal including negotiation and conflict resolution Must have strong computer skills, including MS Excel, Word and Office Strong organizational skills Ability to align, motivate and lead a team including creating accountability Bachelor’s degree or equivalent work experience in Reliability Engineering, Facilities Management or property management preferred Relevant training in MHE, Controls Systems, PIT as well as general building operations Preferred Qualifications Ability to develop and maintain a partnership and communicate effectively, both in writing and verbally with Safety, Operations, Engineering, Sr. Management, peers, contractors and vendors Ability to multitask and prioritize many different projects Additional Skills & Abilities Ability to accept responsibility and account for his/her actions and results. Ability to use thinking and reasoning to solve a problem. Ability to take care of customer needs while following company procedures. Ability to demonstrate conduct conforming to a set of values and accepted standards. Ability to focus on a goal and obtain a pre-determined result. Ability to formulate a sound decision using the available information. Ability to effectively build relationships with customers and co-workers. Possess the trait of being organized or following a systematic method of performing a task. Ability to work with people regardless of race, gender, religion, ancestry, national origin, sex, sexual orientation, age, disability, marital status, veteran status, medical condition or job type. Ability to get along well with a variety of personalities and individuals. Ability to manage resources to complete job assignment. Ability to identify and correct conditions that affect employee safety. Ability to be truthful and be seen as credible in the workplace. Ability to communicate clearly and concisely, both orally and in writing. Ability to work under pressure with time constraints. Ability to complete assigned training in a timely manner. Basic Requirements Computer Skills: Microsoft Office Suite (Word, Excel, Power Point), E-Mail, scanning and copying equipment. Preferred Requirements None Basic Requirements Other Requirements: Must have and maintain a valid driver’s license and be insurable under the Company’s insurance policy Must be able to comply with the ELS Drug and Alcohol policy. Promoting and conducting good housekeeping practices Dedicated to supporting production by working in a safe, customer focused manner Must be able to read, write, speak and understand English Preferred Requirements None PHYSICAL DEMANDS Lift/Carry Stand F (Frequently) Walk F (Frequently) Sit O (Occasionally) Handling / Fingering F (Frequently) Reach Outward F (Frequently)) Reach Above Shoulder O (Occasionally) Climb F (Frequently) Crawl O (Occasionally) Squat or Kneel F (Frequently) Bend F (Frequently) 10 lbs or less F (Frequently) 11-20 lbs F (Frequently) 21-50 lbs O (Occasionally) 51-100 lbs O (Occasionally) Over 100 lbs N (Not Applicable) Push/Pull 12 lbs or less O (Occasionally) 13-25 lbs O (Occasionally) 26-40 lbs O (Occasionally) 41-100 lbs N (Not Applicable) N (Not Applicable) Activity is not applicable to this occupation. O (Occasionally) Occupation requires this activity up to 33% of the time (0 - 2.5+ hrs/day) F (Frequently) Occupation requires this activity from 33% - 66% of the time (2.5 - 5.5+ hrs/day) C (Constantly) Occupation requires this activity more than 66% of the time (5.5+ hrs/day) Other Physical Requirements Vision (Near, Distance) Lift and move totes up to 49 pounds each Regular bending, lifting, stretching and reaching both below the waist and above the head Occasionally push and pull wheeled dollies loaded with products up to 100 pounds during site visits Engage in full manual dexterity in both hands and wrists Walking in the FC and around area with great frequency; facilities are over a quarter mile in length Ability to climb ladders and gangways safely and without limitation Ability to work in construction /distribution environments that may be noisy, unlit, unheated, not air-conditioned Continual standing and/or walking an average of 5 miles daily Able to access all areas of building (ascending and descending ladders, stairs, etc.) WORK ENVIRONMENT Varies between an office environment as well as all areas located in a distribution center. May be around dust, dirt and noise levels above OSHA minimum requirements. Use of PPE required. Additional Responsibilities Elite Line Services (ELS) is an Affirmative Action/Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to their race, color, gender identity, religion, ancestry, national origin, sex, sexual orientation, age, disability, marital status, veteran status or medical condition. If you are an individual with a disability and would like to request a reasonable accommodation as part of the employment selection process, please contact elshr@elitelineservices.com. This email address is reserved solely for job seekers with disabilities requesting accessibility assistance or an accommodation in the job application process. Please do not call about the status of your job application if you do not require accessibility assistance or an accommodation. Messages left for other purposes, such as following up on an application or non-disability related technical issues, will not receive a response.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-24T01:22:08.000Z"
    },
    "company": {
        "name": "ELS",
        "link": "https://www.linkedin.com/company/els"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 96,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "North Las Vegas",
        "region": "NV",
        "postal_code": "89030",
        "street_address": null,
        "latitude": 36.19585,
        "longitude": -115.11457
    }
}