{
    "job": {
        "title": "Senior Scientist - Protein Sciences",
        "industry": "Biotechnology",
        "description": "If you are a Senior Scientist - Protein Sciences with experience, please read on! We are an immunotherapy company developing T cell receptor therapies to help cure cancer. Our platform is driving therapeutics solutions to make them come true. You will have an opportunity make an impact on patient lives with this opportunity. Top Reasons to Work with Us Leverage your skills to help in the fight against cancer Be part of a creative and ambitious team Work at a fast-growing start up Great location What You Will Be Doing As the Scientist in Protein Sciences, you will be engineering and purifying antibodies and t-cell receptors from high-throughput expression. You will generate yeast-display libraries and design selection protocols. You will also manage a team of research associates and manage external collaborations. What You Need for this Position Must Haves PhD in relevant field Yeast and/or Phage display experience Molecular biology skills (PCR, gel electrophoresis) Protein Biology skills (Ni-NTA purification, FPLC Purification, His-tag purification) Knowledge of 2+ of the following: structural biology, immunology, protein engineering. Nice To Haves NGS Data Analysis experience HT protein purification protocol development experience Liquid handling robot experience What's In It for You Competitive salary Health, medical and dental insurance Equity Retirement Plan Company Holidays Flexible Work Arrangements Life & Disability benefits So, if you are a Senior Scientist - Protein Sciences with experience, please apply today! Email Your Resume In Word To Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also: Alexander.Charles@CyberCoders.com Please do NOT change the email subject line in any way. You must keep the JobID: linkedin : AC11-1645485 -- in the email subject line for your application to be considered.*** Alexander Charles - Recruiter - CyberCoders Applicants must be authorized to work in the U.S. CyberCoders, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-25T17:34:27.000Z"
    },
    "company": {
        "name": "CyberCoders",
        "link": "https://www.linkedin.com/company/cybercoders"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "South San Francisco",
        "region": "CA",
        "postal_code": "94083",
        "street_address": null,
        "latitude": 37.65568,
        "longitude": -122.41248
    }
}