{
    "job": {
        "title": "Senior Software Engineer | Payments | Banking",
        "industry": "Investment Banking,Investment Management,Banking",
        "description": "Senior Software Engineer - Core Payments – Leading FinTech – Tempe, Arizona Are you an Experienced Software Engineer that wants to make a meaningful impact in an organization? Are you interested in working in a banking organization that works more like a tech innovation org compared to a traditional bank? Are you looking to work in an Agile environment with a clear career progression? My Client, a leading Fintech Organization based in the San Francisco Bay Area, are looking to grow their Core Payments tech teams with both Lead and Senior full-stack software engineers with both Java and JavaScript ( ReactJS ) in Phoenix, Arizona . The ideal person should have the necessary skills and experience to provide technical guidance, estimation of efforts, understanding; and decide upon the optimal technology solution to achieve the desired business needs. You will ideally have: 5+ years of development experience as a Software Engineer Hands-on development experience in Java , J2EE, Spring Boot, etc. A deep fascination of building elegant, maintainable, well-documented, secure code – Abstracting and refactoring should be a passion, not a chore Experience with TDD and CI/CD Experience with JavaScript , React.JS , HTML, CSS, etc Experience with distributed systems and with Micro-services architecture. Experience working within a cloud environment, including Amazon Web Services (AWS) This is an excellent opportunity to work with a leading and highly respected Financial Organization, which are going through a vast and fascinating digital transformation. They have multiple office locations across the USA and can work on a Hybrid Model, although all interviews are currently fully remote. Excellent salary, bonus and benefits on offer! Send in your details ASAP to find out more and receive a full job specification",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-10-05T17:40:59.000Z"
    },
    "company": {
        "name": "TDA Creative",
        "link": "https://www.linkedin.com/company/tda-creative"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Phoenix",
        "region": "AZ",
        "postal_code": "85009",
        "street_address": null,
        "latitude": 33.448204,
        "longitude": -112.072586
    }
}