{
    "job": {
        "title": "Data Scientist",
        "industry": "Information Technology and Services,Computer Software,Financial Services",
        "description": "s at Zest AI develop radically new methods for manipulation and prediction that will enable us to provide fair, transparent credit. Using a combination of machine learning technology and vast amounts of data sources, we seek to transform the credit market while expanding our team into interesting and revolutionary frontiers within the credit world. In This Role You Will Translate unstructured business problems into well-defined machine learning projects Collaborate with a cross-functional team of Engineers, Product Managers, and Business Analysts to identify and manage high leverage opportunities for modeling work Design and implement highly generalizable models for predicting various outcomes Take responsibility for modeling implementation in real world settings to solve real world problems Mentor junior team members in modeling artistry We Are Looking For Bachelor’s Degree in a quantitative discipline; advanced degrees preferred Expert experience designing, developing, and implementing machine learning models/algorithms Successful Kaggle competition experience is encouraged Extensive programming experience in R or Python and an interest in learning new languages and technologies Knowledge of data structures and parallelization Perks And Benefits Robust healthcare plans, matching 401K and unlimited vacation time Weekly company wide “all hands” meetings Virtual weekly happy hours, sometimes casual and other times with a focus around topics like racial discrimination and LGBTQ+ history Employee care packages to make WFH more enjoyable About Zest AI Zest AI has been perfecting AI for consumer lending decisions since 2009. Our Model Management System helps lenders make better decisions and better loans—increasing revenue, reducing risk, and automating compliance. Our mission is to make fair and transparent credit available to everyone and our software creates some of the most inclusive risk models in the industry. Using Zest-built machine learning software, financial institutions can dramatically expand credit access to deserving people with no added risk. Learn more at Zest.ai and connect with us on Twitter @Zest_AI or our Insights blog. Zest is committed to diversity, equity, and inclusion and encourages professionals from underrepresented groups in technology and financial services to apply. Please review our CCPA Policy with regard to applicant and employee personal information here.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-25T17:03:44.000Z"
    },
    "company": {
        "name": "Zest AI",
        "link": "https://www.linkedin.com/company/zest-ai"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Burbank",
        "region": "CA",
        "postal_code": "91504",
        "street_address": null,
        "latitude": 34.182053,
        "longitude": -118.30747
    }
}