{
    "job": {
        "title": "Machine Learning Engineer",
        "industry": "Aviation &amp; Aerospace,Computer Software,Defense &amp; Space",
        "description": "Smith Hanley Associates Machine Learning Engineer Austin, TX area Base salary $60,000 - 80,000 depending on experience Leading edge company is seeking a Machine Learning Engineer to develop data sets and build and test models. The role will involve procuring and cleaning data from a variety of sources including from sensors, labs modeling software and more. You will prototype algorithms, evaluate neural networks for computer vision tasks, debug scripts, assist in software development utilizing python and C++, produce research and present work. Use your deep experience in data modeling and analysis in this challenging and high visibility role. Note: No visas or OPT candidates will be processed at this time. Requirements of the Machine Learning Engineer: --Proficiency with multiple machine learning techniques including deep learning, k-means clustering, Bayesian classifiers and tree-based models. --Proficiency using Python, C++, Matlab. --Experience using Tensorflow or PyTorch to train and tune machine learning models. --Experience producing production quality code. --Expertise with linear systems, graph theory, probability, and statistics. --Minimum 1-2 years of solid experience in a professional environment. --Minimum Bachelor's degree in Computer Science, Engineering, Statistics, Mathematics or other quantitative discipline. Master's degree preferred. --Ability to work with a variety of platforms. If this job isn't for you, see our other open positions at www.jobs.smithhanley.com. Smith Hanley Associates takes pride in being the premier recruiting agency serving the marketing analytics industry. For more information, please visit our website at www.smithhanley.com.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-26T20:22:55.000Z"
    },
    "company": {
        "name": "Smith Hanley Associates",
        "link": "https://www.linkedin.com/company/smith-hanley-associates"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 12,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Austin",
        "region": "Texas Metropolitan Area",
        "postal_code": "78723",
        "street_address": null,
        "latitude": 30.276316,
        "longitude": -97.70931
    }
}