{
    "job": {
        "title": "Network Engineer",
        "industry": "Information Technology and Services",
        "description": "A permanent/direct-hire Network Engineer position is available with an IT organization located in Roseville, CA. Only local candidates are currently being considered. Essential Duties and Responsibilities: Designing and implementing new network solutions and/or improving the efficiency of current networks Installing, configuring, and supporting network equipment including routers, proxy servers, switches, WAN accelerators, DNS and DHCP Configuring firewalls, routing, and switching to maximize network efficiency and security Maximizing network performance through ongoing monitoring and troubleshooting Arranging scheduled upgrades Investigating faults in the network Updating network equipment to the latest firmware releases Reporting network status to key stakeholders Support services for: Microsoft related technologies: Windows Server, Exchange, SQL, O365, etc.; Virtualization technologies: VMware and Hyper-V; Remote access solutions: Fortinet VPN, Duo; DHCP and DNS; Security Suite: FortiNet, Carbon Black, MimeCast Knowledge, Skills, and/or Abilities Required: 3+ years’ experience with Networking and Security Interpersonal skills: such as telephony skills, communication skills, active listening and customer-care Ability to multi-task and adapt to changes quickly Apply now!",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-20T00:11:59.000Z"
    },
    "company": {
        "name": "Modis",
        "link": "https://ch.linkedin.com/company/modis"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Roseville",
        "region": "CA",
        "postal_code": "95747",
        "street_address": null,
        "latitude": 38.74806,
        "longitude": -121.2852
    }
}