{
    "job": {
        "title": "Data Scientist",
        "industry": "",
        "description": "Data Scientist We are seeking a quantitatively talented Data Scientist to uncover data-driven insights to help our partners better attract, develop, motivate, and retain a diverse and inclusive workforce. This role will perform research and analyses for the data team as well as partner with our sales, product development, editorial, and business development functions. Responsibilities: Apply expertise in organizational and human capital research, quantitative analysis, and the presentation of data to help customers learn critical insights Collaborate with data engineering and visualization engineers to access and manipulate data, explain data gathering requirements, and display results Prepare for customer briefing sessions/meetings, presenting, and addressing pushback from clients and internal stakeholders. Support the development and advancement of DiversityInc’s benchmarking services. Partner with the sales, marketing, product development and customer support on projects to identify, analyze and deliver unique insights to our customers Communicate statistical analyses and results, along with implications, to technical and non-technical audiences Collaborate effectively with legal, customer operations and data security teams on a variety projects related to data security, methods and privacy policies and practices Work with COO on select business development related data projects such those related to partnership targeting, partnership conversation and pricing Minimum Requirements MS with 5+ years of experience in a quantitative field emphasizing organizational research (e.g., Economics, Data Science, Management, Policy Analysis, Organizational Psychology, etc.) 3+ years of experience conducting quantitative organizational/human capital research in an organization or consulting environment, including working with stakeholders to understand and clarify their research needs Experience utilizing, managing and analyzing structured and unstructured data with R and SQL Experience working with Tableau and AWS Experience communicating technical results to technical and non-technical audiences Experience defining a roadmap of data requirements, metrics reporting, and research to drive insights Expert knowledge of statistical analysis (e.g., descriptive statistics and knowledge with statistical significance), quantitative research, and experience gathering and interpreting data Experience working with business-related data to generate internal business insights which will help shape our corporate strategy High degree of independence , self-motivation , and adaptability . Preferred Qualifications Doctorate degree in a quantitative field 3+ years of experience applying multivariate statistical methods to human capital & organizational effectiveness research topics 5+ years of progressive consulting or corporate work experience 3+ years of experience in analytics, management consulting, operations, or related fields Building interactive and complex data visualizations and analysis tools (e. g., Dynamic Dashboard) Experience working with REST API (HTTP computer-to-computer API for automated requests and responses) Web visualization, Web development and Web programming (e. g., JavaScript, etc.) Software engineering principles and project managements (e. g., Agile methodology development, etc.) Version control and git Location This is a remote position. However, it's a bonus if you're located within a commutable distance from our offices in Northern New Jersey. Salary Range Competitive base + full benefit package About DiversityInc DiversityInc is a fast growing, data-driven, DEI services firm that helps iconic companies create inclusive workplaces and improve business outcomes. Through our benchmarking, branding, training, and online solutions, we use our industry expertise and analytics to create solutions that work. You will be surrounded by colleagues who are passionate about diversity and making DiversityInc the leading DEI solution provider. If you are a face-paced, quantitative expert ready to utilize their talents to make a positive impact, we want to hear from you!",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-03T03:29:21.000Z"
    },
    "company": {
        "name": "DiversityInc",
        "link": "https://www.linkedin.com/company/diversityinc"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "United States",
        "region": null,
        "postal_code": "99999",
        "street_address": null,
        "latitude": 39.50355,
        "longitude": -99.0183
    }
}