{
    "job": {
        "title": "Helpdesk Engineer",
        "industry": "Internet",
        "description": "HELPDESK ENGINEER Prescient Solutions is an award-winning, Chicagoland-based IT outsourcer. For more than 25 years we have been providing CIO-level advisory support and on-site IT services to small, mid-sized and global organizations and government entities. We are committed to making our clients' businesses run better by adding more value to their organizations through technology. If you are looking for an opportunity to join a team where you can drive your career while being part of a company that values the ability to learn and grow, this is your chance! Prescient Solutions offers a great work environment that encourages teamwork to achieve a greater purpose while providing a higher level of service through better communication. We are looking for a dynamic Helpdesk / Help Desk Engineer who shares our commitment and believes in the value of communication and client interaction. As a Helpdesk / Help Desk Engineer, you will provide Level 1 and Level 2 support in a primarily Microsoft environment on-site at at a client account. ESSENTIAL DUTIES AND RESPONSIBILITIES Responsible for hardware and software maintenance, upgrades, computer roll outs; Creates and maintains new user accounts, have knowledge of Active Directory structure; Works closely with Network and Systems Engineers to gain knowledge of network topology, profiles and tasks within a Windows-based back end environment; Documents and posts procedures to the SharePoint portal used as a tool to educate fellow team members and enhance our knowledgebase; Contributes to the planning and design of workstation hardware, software, and application capabilities; Interfaces with other Information Technology groups to coordinate projects; Works with our clients to make decisions on desktop and laptop purchases, setup images and deployment/testing issues; Researches options for long and short-term changes to the desktop computer technologies in order to ensure that required functions are available to support business initiative across the client organization; Evaluates emerging technologies; Delivers assigned projects while meeting assigned time lines and budget objectives; and Performs other duties and/or assists with special projects as needed. COMPETENCIES Minimum of two years of IT related customer service experience in a helpdesk or call center setting; An excellent verbal and written communicator; Team player with the ability to take ownership of an area, following assigned tasks through to successful completion; Technical knowledge of Anti-Virus software, Office 365, Citrix, printers, and peripherals; Advanced understanding of desktop and laptop OS's, general applications and troubleshooting; Great technical writing skills (Process and how-to docs); Solid understanding of TCP/IP and communications protocols; Basic understanding of servers and networks; Ability to work on multiple tasks; Commitment to Client service excellence; and Creative problem-solving skills.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-17T07:45:45.000Z"
    },
    "company": {
        "name": "Prescient Solutions",
        "link": "https://www.linkedin.com/company/prescient-solutions"
    },
    "education": {
        "required_credential": "associate degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Chicago",
        "region": "IL",
        "postal_code": "60654",
        "street_address": null,
        "latitude": 41.88323,
        "longitude": -87.6324
    }
}