{
    "job": {
        "title": "Site Reliability Engineer",
        "industry": "Construction,Marketing and Advertising,Financial Services",
        "description": "Brief Description The Site Reliability Engineer will be responsible for the planning, management, and maintenance of all Cambria-owned sites and platforms that power our company. Our team works cross-functionally to ensure that services are available and perform optimally to continue to scale our manufacturing operations. Essential Duties And Responsibilities B uild, operate, and maintain scalable, highly-available, and resilient distributed systems Participate in chaos engineering exercises to help increase the reliability of Cambria's systems Participate in on-call rotation to ensure critical services are available Analyze metrics to create actionable monitors or alerts to ensure critical services are available and performing well Work with product teams to ensure SLO targets are met or exceeded Participate in root cause analysis after incidents to ensure they won’t happen again Identify and implement improvements to Cambria’s CI/CD deployment pipeline to improve speed and efficiency of code deployments Maintain excellent documentation and diagrams of the complex systems supporting the Microservices environment Requirements Bachelor’s degree of Computer Science, Electrical Engineering, or related technical degree or equivalent experience Motivated self-learner pushing technology solutions forward, who anticipates problems and challenges Solid understanding of Software Engineering and Computer Science principles with security mindfulness Mastery in at least one programming language. Python, Powershell, Golang, or Bash preferred 3-5 years of experience with building, operating and maintaining complex, highly available, and scalable systems Solid foundation in Linux administration and troubleshooting Experience working with Agile delivery methodologies such as Scrum and Kanban. Familiarity and experience with ALM toolsets (Cambria uses Jira) and collaboration software (such as Slack, G-Suite, and Confluence). Experience with some or all of the following software/tools, or close equivalents: Highly-available MySQL clusters Elasticsearch clusters Apache Kafka clusters Hashicorp tools consul vault Container technologies such Docker, LXC, or Podman Container orchestrators such as Kubernetes or Hashicorp Nomad CI/CD tools like Jenkins, TravisCI, or CircleCI. Jenkins Pipelines preferred Configuration management tools like Ansible, Saltstack, or Puppet Load balancing technologies such as Nginx, Apache2, or Haproxy Infrastructure as Code tools such as Terraform or Cloudformation Public cloud platforms such as AWS, Azure, or GCP Application performance and Monitoring tools such as Datadog or Dynatrace Minimum Requirements Education: Minimum 4-year technical degree or equivalent work experience Experience: 5 years working in a Site Reliability/Systems Engineering position Additional Requirements Travel Requirements: This position may require travel to other Cambria locations Physical Requirements: This position requires the ability to lift up to 50lbs, be able to work in prolonged standing and/or sitting positions Cambria offers a competitive benefits package that encompasses your health and well-being, financial health, retirement planning and time-off. Please note this job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the employee for this job. Duties, responsibilities and activities may change at any time with or without notice. For Additional Company Information, Please Visit Www.CambriaUSA.com We are an equal opportunity employer. M/W/VET/DISABLED The salary range associated with this job posting has not been provided by Cambria.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-03T07:47:36.000Z"
    },
    "company": {
        "name": "Cambria",
        "link": "https://www.linkedin.com/company/cambria"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Eden Prairie",
        "region": "MN",
        "postal_code": "55344",
        "street_address": null,
        "latitude": 44.854034,
        "longitude": -93.46017
    }
}