{
    "job": {
        "title": "Software Engineer",
        "industry": "Commercial Real Estate,Information Technology and Services,Research",
        "description": "Software Engineer Job Description CoStar delivers real-time, verified commercial real estate data that helps clients confidently spot great opportunities and make smart choices ahead of competitors. By combining the power of CoStar’s independent research organization – the industry’s largest – with global data delivery, software, and application solutions, clients can act on opportunities with confidence. CoStar’s software developers build products that facilitate 86% of commercial real estate transactions in the United States. These transactions range from a small business owner leasing their first office space to a large multi-national buying a new headquarters campus. On any given day our developers are building products that manage nearly a trillion dollars of potential real estate transactions. RESPONSIBILITIES (Bullet Points Outlining Top Requirements Of The Role) Build big, distributed, API-driven systems for tens of thousands of users Produce bullet-proof code that is robust, efficient and maintainable; our primary tools are C#, .NET Framework, React, JavaScript, AngularJS, JSON, SQL Server Drive and lead software design, development standards, code reviews. Continually evaluate emerging technologies to identify opportunities, trends, and best practices that can be leveraged to strength CoStar’s technology platform and develop practices. Qualifications 3+ years experience in a C# and .NET Framework 3+ years experience working in Javascript Demonstrated experience in architecting, designing and building large scale distributed, services-oriented systems and web applications in an agile environment 3+ years data modeling experience Bachelor’s Degree PREFERRED QUALIFCATIONS AND SKILLS (Nice To Haves) Strong communication skills (to both business and technical partners) Bachelor’s Degree Knowledge of SQL experience Data modeling experience from conceptual, logical and physical designs Experience with RESTful web services CoStar Group is an Equal Employment Opportunity Employer; we maintain a drug-free workplace and perform pre-employment substance abuse testing",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-30T05:10:08.000Z"
    },
    "company": {
        "name": "CoStar Group",
        "link": "https://www.linkedin.com/company/costar-group"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Richmond",
        "region": "VA",
        "postal_code": "23284",
        "street_address": null,
        "latitude": 37.54076,
        "longitude": -77.43393
    }
}