{
    "job": {
        "title": "Data Scientist",
        "industry": "",
        "description": "Lakarya is Hiring for one our Clients Position: Data Scientist /Data Analyst Location: Highpoint, NC Job type: Long term Contract Job Description Manage administration and supervise the development of logistics policies and programs to ensure they meet the changing conditions in program requirements. Prepare and present membership changes to large audience including senior staff using PowerPoint. Develop reports using IBM Cognos as part of the migration of a particular customer. Coded/Maintain a SAS program including embed SQL written by consultants for use in manual claim forecasting. Analyze the existing BO universe and provide the guidelines to migrate and implementation effect of Cognos. Develop dashboards and trend reports that keep track of utilization volume, cost, and quality performance. Serve as project officer/team leader; provide direction and guidance to contractors and support to DoD personnel. Involve in development for highly complicate reports, scorecards and dashboards for a specific business needs and performance improvement. Develop routine SAS macros to create tables, graphs and listings for inclusion in reports and maintain existing ones. Devise new improve procedure (by use of VBA) to create campus tables that saves time and ensures accuracy. Job Types: Full-time, Contract",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-05T14:50:10.000Z"
    },
    "company": {
        "name": "Lakarya",
        "link": "https://www.linkedin.com/company/lakarya"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Greensboro--Winston-Salem--High Point Area",
        "region": null,
        "postal_code": "27401",
        "street_address": null,
        "latitude": 36.076633,
        "longitude": -79.79478
    }
}