{
    "job": {
        "title": "Software Engineer",
        "industry": "Insurance,Health, Wellness and Fitness",
        "description": "Our health system is broken, and it’s a huge problem. Costs are rising out of control while the patient experience gets worse. At Sana, we're passionate about fixing this problem by bringing accessible and affordable health plans to small and medium businesses. We've built an innovative team with top talent from across the health insurance and tech industries to create engaging, modern plans for our clients. This allows our customers to offer competitive benefits packages while paying an average of 20% less than traditional plans. Sana is looking for a Software Engineer to join our small but growing team. As a successful candidate, you have demonstrated the ability to build, deploy and maintain large-scale, distributed applications with complex database schemas. You understand and use automated testing and know how to write clean, readable code. We are building a distributed engineering team and encourage all applicants to apply, regardless of location. We work primarily in Ruby on Rails and JavaScript, but are open to those with differing backgrounds. You should have a deep understanding of how to build software that goes beyond the ability to use these tools. What you will do Tackle complicated projects to make health insurance work better for our members Automate insurance claims processing Build internal tools to support our operations team Enhance our testing, monitoring and continuous deployment infrastructure Help keep sensitive medical data safe and secure Work with our operations team to build out a roadmap for new features About you Minimum of 3 years writing code as a Software Engineer in a production environment Strong object-oriented design and coding skills Working knowledge of Ruby, Javascript Experience working with complicated systems at scale Solid understanding of data structures and algorithms Tech we use Rails React Docker Elasticsearch AWS Linux Postgres Git Benefits Stock options in rapidly scaling startup Flexible vacation Medical, dental, and vision Insurance 401(k) and HSA plans Parental leave Remote worker stipend Wellness program Opportunity for career growth Dynamic start-up environment About Sana Sana is a modern health plan solution for small and medium businesses. We use a more efficient financing structure and integrated technology solutions to cut out wasteful spending and get members access to better quality care at lower cost. Founded in 2017, we are an experienced team of engineers, designers and health system operators. We have the financial backing of Silicon Valley venture firms and innovative reinsurance partners. If you are excited about building something new and being a part of fixing our broken healthcare system from the inside, please reach out!",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-27T18:41:21.000Z"
    },
    "company": {
        "name": "Sana",
        "link": "https://www.linkedin.com/company/sana-benefits"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Austin",
        "region": "Texas Metropolitan Area",
        "postal_code": "78723",
        "street_address": null,
        "latitude": 30.276316,
        "longitude": -97.70931
    }
}