{
    "job": {
        "title": "Site Reliability Engineer",
        "industry": "Information Technology and Services,Computer Software,Internet",
        "description": "Company Overview: At Identity Automation, we understand the unique challenges that educators, faculty, students, and even parents face. That’s why we created RapidIdentity, an identity and access management (IAM) platform, used by hundreds of school districts, colleges, and universities to provide secure and agile online access that digitally connects students to their learning environment. By putting the unique identities of both educators and students at the heart of the learning process, RapidIdentity helps academic institutions unlock their potential and provide a safer, more personalized learning experience. About the Role: Our Site Reliability Engineers (SREs) empower our users with a rich feature set, high availability, and stellar performance level to pursue their missions. As we expand our customer deployments, we are currently seeking an experienced SRE to deliver insights from massive scale data in real time. Specifically, we are searching for someone who brings fresh ideas, demonstrates a unique and informed viewpoint, and enjoys collaborating with a cross-functional team to develop real-world solutions and positive user experiences at every interaction. Responsibilities: Run the production environment by monitoring availability and taking a holistic view of system health Build software and systems to manage platform infrastructure and applications Improve reliability, quality, and time-to-market of our suite of software solutions Measure and optimize system performance, with an eye toward pushing our capabilities forward, getting ahead of customer needs, and innovating to continually improve Provide primary operational support and engineering for multiple large distributed software applications Gather and analyze metrics from both operating systems and applications to assist in performance tuning and fault finding Partner with development teams to improve services through rigorous testing and release procedures Participate in system design consulting, platform management, and capacity planning Create sustainable systems and services through automation and uplifts Balance feature development speed and reliability with well-defined service level objectives Qualifications: Bachelor’s degree in computer science or other highly technical, scientific discipline Ability to program (structured and OO) with one or more high level languages, such as Python, Java, C/C++, Ruby, and JavaScript Hands-on experience with containerization orchestration technologies like Kubernetes Hands-on experience with Amazon Web Services technologies like EC2, S3, EFS/EBS, RDS, VPC, CloudWatch, networking, security Hands-on experience managing Linux servers A proactive approach to spotting problems, areas for improvement, and performance bottlenecks Preferred Qualifications: Previous success in technical engineering Coding experience beyond simple scripts Powered by JazzHR kWgHu04H6d",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-25T07:12:12.000Z"
    },
    "company": {
        "name": "Identity Automation",
        "link": "https://www.linkedin.com/company/identity-automation"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Houston",
        "region": "TX",
        "postal_code": "77208",
        "street_address": null,
        "latitude": 29.760803,
        "longitude": -95.36951
    }
}