{
    "job": {
        "title": "Machine Learning Engineer",
        "industry": "Staffing and Recruiting",
        "description": "MACHINE LEARNING ENGINEER ROBOTICS PITTSBURGH $140,000-$170,000 THE COMPANY This well-funded company develops autonomous robotic systems that are used in industrial and manufacturing environments. They are backed by some of the biggest technology companies in the United States. They are combining robotic systems, computer vision, and deep learning to change both academic and industry settings. THE ROLE – MACHINE LEARNING ENGINEER In this role, you will be working cross-functionally to improve and deploy machine learning and deep learning models into production. You will be training and deploying machine learning models into production You will be working with PyTorch to deploy deep learning models onto embedded systems You will be doing distributing training, model optimization, and model benchmarking You will work cross-functionally with the research and engineer team to further the research and development of their ai systems in robotics YOUR SKILLS AND EXPERIENCE Commercial experience working with robotics or autonomous vehicles Experience with distributing training, model measurement, and model optimization Experience training and deploying machine learning and deep learning models Experience working on GPUs and CPUs Experience working with TVM, Asic, FPGA or Xla A Master’s degree in computer science or a related field BENEFITS As a Machine Learning Engineer, you can expect to earn up to $170,000 (depending on experience) along with competitive benefits. HOW TO APPLY Please register your interest by sending your resume to Mitchell Resor via the apply link on this page KEYWORDS: | Computer Vision | 3D | Robotics | Image Processing| Computer Vision | Image Analysis | Image Reconstruction | GPU| Cuda | TensorFlow | C++ | Keras |PyTorch |AI| machine learning | deep learning | SLAM | robots | artificial intelligence",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-09-03T19:37:56.000Z"
    },
    "company": {
        "name": "Harnham",
        "link": "https://uk.linkedin.com/company/harnham"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Pittsburgh",
        "region": "PA",
        "postal_code": "15235",
        "street_address": null,
        "latitude": 40.44217,
        "longitude": -79.99496
    }
}