{
    "job": {
        "title": "Senior Data Engineer - Kubernetes (Remote)",
        "industry": "Information Technology and Services,Computer Software,Financial Services",
        "description": "Title: Senior Data Engineer Salary: $140,000 - $170,000 Requirements: 5-10+ years as a Data Engineer + Docker/Kubernetes + Python + AWS We are a 200 person SaaS healthcare company with a mission to improve quality of life. We have experienced consistent growth for the past 6 years and are continuing to scale our engineering team. If you are looking for a role at a technology company where you can have a positive impact on peoples lives and healthcare, please apply today! Top Reasons to Work with Us Competitive salary ($140k - $170k) Work w/ Industry Pros who have a few impressive exits under their belts Full Benefits (health, dental, vision, etc.) Have your voice be heard in and play a role in company direction Huge opportunity for career and personal growth What You Will Be Doing Create and maintain optimal data pipeline architecture Identify, design, and implement internal process improvements Assemble large, complex data sets that meet functional / non-functional business requirements Handle production issues Ensure code is high quality through automated tests, monitoring, etc. Collaborate with team to provide visibility into the data layer and related pipelines What You Need for this Position 5-10+ years as a data engineer Python preferred (Java considered) AWS Kubernetes (Helm is desired) Data lake solutions like Hadoop, Hive, Spark, Databricks SQL Experience in the healthcare industry is a plus BS in CS (or related) is preferred So, if you are a Senior Data Engineer - Kubernetes (Remote) with experience, please apply today! Email Your Resume In Word To Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also: Danny.Herries@Optello.com Please do NOT change the email subject line in any way. You must keep the JobID: linkedin : DH1-1639294 -- in the email subject line for your application to be considered.*** Danny Herries - Lead Recruiter - Optello Applicants must be authorized to work in the U.S. Optello is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-31T07:10:37.000Z"
    },
    "company": {
        "name": "Optello",
        "link": "https://www.linkedin.com/company/optello-us"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 120,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Austin",
        "region": "TX",
        "postal_code": "78746",
        "street_address": null,
        "latitude": 30.264978,
        "longitude": -97.7466
    }
}