{
    "job": {
        "title": "Software Testing Engineer",
        "industry": "Information Technology and Services,Computer Software,Information Services",
        "description": "Smarsh is the leader in communications compliance, archiving, and analytics. We provide compliance across the broadest set of communications channels with insights on what’s being captured. Smarsh customers manage over 500 million daily conversations across 80 channels and growing. Customers include the top 10 U.S., top 8 European, top 5 Canadian, and top 3 Asian banks. The Smarsh advantage is customers stay ahead of compliance and uncover patterns and relationships hidden within their data. At Smarsh, we’ve been helping our customers manage new forms of communication since 1998. We work closely with regulators including the SEC, FINRA, IIROC, PRA, FCA and with our customers, to ensure they understand capabilities of today’s technology and our platform meets their most stringent requirements. Our products include Connected Capture, Connected Archive, Web Archive & Business Solutions. We recently acquired Digital Reasoning, the global leader in natural language processing (NLP), artificial intelligence (AI), and machine learning (ML). The addition of Digital Reasoning’s capabilities and expertise will further enable Smarsh customers to spot risks before they happen, maximize the scalability of supervision teams, and uncover strategic insights from large volumes of data in real-time. The Product Test Engineering team works closely with Product Dev Engineering and Product Management to ensure product performance, quality and customer satisfaction. Develops, revisesand maintains Test code and test processes/methodologies to qualify software towards functional, scale and performance criteria. Applies customer feedback to drive product improvement through the development process. Gather product requirements from the Product Management team and turn them into working software that satisfy market needs which customers use to solve their specificproblems. Essential Functions Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. Essential Functions below: Continue to learn. Become a tactical member of the team. Design and implement quality solutions independently. Collaborate with Product Owners and the rest of the engineering team to define test mechanisms and their implementations. Investigate and fix bugs independently. Create and sustain test environments and setups independently. Participate in all Agile ceremonies and meetings. Track work in ticketing system (JIRA) Participate in Pull Request reviews. Provide and receive feedback to continuously improve. Ask clarifying questions. Establish oneself as the Point of Contact for your area of expertise/knowledge. Other duties as assigned Education and Experience Bachelor's Degree (or higher) in Computer Science or related field, or equivalent experience 8+ years direct experience in software test engineering role in an Agile software development environment 5+ years direct experience developing automated tests in Java or Groovy (e.g. Selenium or Geb) 3+ years of experience in one or more of Java, Python, Java Script, Groovy, with JIRA Additional Eligibility Qualifications Underneath the hood of our cognitive computing platform Conduct Surveillance is a lot of Linux-y goodness, so the more comfortable you are with things like working in a command line environment, the more effective you’ll be able to be in this role. Testing tools/frameworks: Spock, Appium, JUnit, Xray for JIRA Cross browser/device testing: Sauce Labs, Browserstack, Zalenium Testing RESTful APIs Languages: Groovy, Java, Javascript, Scala UI Integration, Load and Performance Testing with tools such as Protractor, JMeter, Gatling CI servers: Bamboo Distributed version control systems: Git Elasticsearch Amazon Web Services Google Web Services Advanced programming skills in relevant languages. Strong analytical and problem-solving skills. Strong communication and collaboration skills. Good understanding and experience in modern software programming/engineering Why Smarsh? Ready to join a thriving tech company that’s redefining digital archiving and business intelligence? Smarsh is the leading comprehensive archiving platform. Recognized as one of today’s fastest growing companies in the U.S., Smarsh delivers innovative cloud-based solutions that help organizations manage and enforce flexible and secure records retention and compliance strategies for electronic communications, including social media and enterprise social networks (Yammer, Chatter, Facebook, LinkedIn and more). Our motto is ‘People First. Inspire Confidence. Embrace the Impossible.’ We hire lifelong learners who have a passion for their discipline and a track record of excellence. To learn more about us, visit www.smarsh.com/careers",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-09T20:19:55.000Z"
    },
    "company": {
        "name": "Smarsh",
        "link": "https://www.linkedin.com/company/smarsh"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 96,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Franklin",
        "region": "TN",
        "postal_code": "37064",
        "street_address": null,
        "latitude": 35.923653,
        "longitude": -86.86783
    }
}