{
    "job": {
        "title": "Data Scientist",
        "industry": "Information Technology and Services",
        "description": "Data Scientist The ideal candidate's favorite words are learning, data, scale, and agility. You will leverage your strong collaboration skills and ability to extract valuable insights from highly complex data sets to ask the right questions and find the right answers. Location: North Austin office if you'd like to use it Salary: $120k - $135k Visa Status: US Citizen Responsibilities Analyze raw data: assessing quality, cleansing, structuring for downstream processing Design accurate and scalable prediction algorithms Collaborate with engineering team to bring analytical prototypes to production Generate actionable insights for business improvements Qualifications M.S. in quantitative field (Statistics, Mathematics, Computer Science, Engineering, etc.) At least 1 - 2 years' of experience as a Data Scientist Deep understanding of predictive modeling, machine-learning, clustering and classification techniques, and algorithms Fluency in Python Familiarity with Big Data frameworks and visualization tools (Cassandra, Hadoop, Spark, Tableau) For further details please submit a resume. Austin Fraser Inc is acting as an employment business in relation to this advert. As a professional company, we gladly welcome applications from persons of any age and background and do not intend to discriminate with advert text and terminology.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-16T15:04:41.000Z"
    },
    "company": {
        "name": "Austin Fraser",
        "link": "https://uk.linkedin.com/company/austin-fraser"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 12,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Austin",
        "region": "Texas Metropolitan Area",
        "postal_code": "78723",
        "street_address": null,
        "latitude": 30.276316,
        "longitude": -97.70931
    }
}