{
    "job": {
        "title": "Software Engineer",
        "industry": "",
        "description": "Remote job with a strong preference for candidates based in Miami, FL, Austin, TX, or Des Moines, IA. About Trend At Trend, we're enabling hundreds of brands to scale their content efforts and enabling creators to earn more money from their passion. Content creation is a uniquely human ability that can bring so much value to the world, Trend enables more of it. Trend is building the future of marketing and the creator economy. We've created a paradigm shift in how consumer brands work with digitally native content creators. What we're building has never been done before and our customers are clamoring for us to deliver more to satisfy their pain points. We’re a remote-based company with hubs in Miami and Austin. We're also a proud Techstars Portfolio Company looking to make a massive impact on the world. By joining Trend, you'll influence: Helping us define our company culture. Direct & tangible impact on the business and people's lives. The direction of the Trend marketplace. Role Summary: A Software Engineer at Trend will assist our off-shore development team turn designs into screens in our web app and eliminate bugs as they appear. This role will be a full-time salaried position. Trend has created a paradigm shift in how consumer brands work with digitally native content creators. What we're building has never been done before and our customers are clamoring for us to deliver MORE. This role will allow us to move much faster. You'll be a founding member of our engineering team. Your role: The software engineering role is all about delivery. Trend is seeking a talented software engineer to implement feature changes from Figma to git push. You'll work directly with our Chief Product Officer (CPO) who will prioritize the most important tickets. Our CPO is a world-class product manager, UX, and UI designer who has experience in handling millions of transactions and users per month before Founding Trend. You'll be working in both frontend and backend web development, including writing dynamic web backends and writing CSS and JS. Simply put, the work you do here will make an impact on both content creators (increasing their personal earning potential) and business (helping them grow their business). What it's like to work with us: At Trend, you're not afraid to work on multiple projects and you are excited about working in a fast-paced environment. Yes, we're talking very fast. We have incredibly ambitious goals... Trend wants to turn everyone into a creator to empower businesses around the world . We're looking for incredibly ambitious people to join us and build the new paradigm of content creation. What we can offer you: Competitive salary + equity Health and dental insurance coverage 100% Remote work (though a few in-person meetings here and there could be cool too) Paid for team retreats A quickly growing, small, fun, and very driven team to work with Our ideal candidate will have: 3+ years of React.js is required. We're looking for someone who lives in React.js Extensive knowledge of Node.js and working knowledge of Objective-C Experience in Firebase and Firestore Bonus: Management experience with a track record of successfully building and leading inclusive, highly productive teams. (This is the first hire on the team after all! Growing this team will be required.) Bonus: You have experience working with video across browsers and applications. How to Apply Great! You made it this far. Sound like an intriguing challenge? You should email us at careers@trend.io. Include the role's title in your subject line \"Full Stack Trend\" Send along with any portfolios, projects you've been working on, and your GitHub. A little bit about yourself wouldn't hurt either. Here is more on why you should join Trend: https://trendio.notion.site/JOIN-OUR-SUPERHERO-TEAM-612a3e645a5642b79d180195d7ab57ee",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-29T19:13:01.000Z"
    },
    "company": {
        "name": "Trend",
        "link": "https://www.linkedin.com/company/trend-io"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "United States",
        "region": null,
        "postal_code": "99999",
        "street_address": null,
        "latitude": 39.50355,
        "longitude": -99.0183
    }
}