{
    "job": {
        "title": "Network Engineer",
        "industry": "Information Technology and Services,Computer &amp; Network Security",
        "description": "One of our clients is looking to fill a Network Engineer role for their team in Quincy, MA . The main duties of the job would involve providing modern smartphone and tablet technology for health and human services workers across the state by developing, integrating, and administrating mobile device platforms. **This would be a contract role going through the end of June 2022 at their office in Quincy, MA** Required Skills & Experience 5+ years of experience in IT Asset Management, Customer Support, Service Delivery, Application Development, or Business Analysis. 2+ years of experience working or basic knowledge of Mobile Device Management (MDM), Enterprise Mobility Management (EMM), or Unified Endpoint Management (UEM) and tools such as Workspace One (AirWatch), Verizon MDM, Apple Business Manager, and Microsoft Intune. Mobility Platform Certifications (Workspace One (AirWatch), Intune, MobileIron, etc.) optional but preferred Strong customer and team orientation with a focus on collaboration, an ability to work independently, and a high level of professionalism and quality. Hands-on experience with evaluating, recommending, engineering, and formulating test and implementation plans. Knowledge of industry trends and insight into mobility device use cases, and knowledge of IOS and Android devices Willingness to grow and learn with a new IT team in a cutting-edge technology discipline Excellent written and verbal communication skills; interpersonal and collaborative skills; with the ability to effectively relate and communicate at all levels, including explaining technical matters in business terms. Ability to plan and prioritize workload to meet implementation schedules and minimize schedule conflicts. Essential Job Requirements: Develop, integrate, and administrate mobile device platforms, to include Workspace One (AirWatch), Verizon MDM, Apple Business Manager, and Microsoft Intune; includes provisioning, deprovisioning, and ordering of devices Integrate commercial off-the-shelf and in-house mobile applications into the EMM catalog and ensure deployment of those applications Enforce mobile device policies and procedures in the EMM environment Track device inventory in the EMM infrastructure and perform routine asset management audits and in-person device exchanges and upgrades as needed Respond to requests from internal and authorized external business units in a timely manner for Tier II support: telephone, e-mail, remote control, and occasional on-site problem diagnosis and resolution for mobile device issues Build synergies and interoperability between multiple existing EMM systems, and maintain system integrity and security by resolving issues from compliance scans Collaborate and strategize with business units to formulate secretariat application reference manuals for mobile applications Evaluate current and next-generation mobile hardware, software, and services; recommend purchases Cooperate with consultants for installations, deployments, and troubleshooting of new releases as needed Perform continuous in-depth analysis and suggest strategic solutions to improve user experience, drive value for government business units, and realize cost efficiencies The Offer ·       Compensation: competitive pay based on experience ·       Job Type: contract to the end of June 2022 ·       Location: onsite in Quincy, MA You will receive the following benefits: •            Medical & Dental Insurance •            Health Savings Account (HSA) •            401(k) •            Paid Sick Time Leave •            Pre-tax Commuter Benefit Applicants must be currently authorized to work in the United States on a full-time basis now and in the future.",
        "employment_type": "CONTRACTOR",
        "date_posted": "2021-10-05T17:49:27.000Z"
    },
    "company": {
        "name": "Motion Recruitment",
        "link": "https://www.linkedin.com/company/motion-recruitment-partners"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Quincy",
        "region": "MA",
        "postal_code": "02170",
        "street_address": null,
        "latitude": 42.251385,
        "longitude": -71.002335
    }
}