{
    "job": {
        "title": "Data Scientist",
        "industry": "Computer Software,Information Technology and Services,Internet",
        "description": "Description Are you excited about powering Amazon’s physical stores’ expansion through the application of Machine Learning and Big Data technologies? Do you thrive in a fast-moving, innovative environment that values data-driven decision making, scalable solutions, and sound scientific practices? We are looking for experienced scientists to build the next level of intelligence that will help Amazon physical stores grow and succeed. Our team is responsible for building the core intelligence, insights, and algorithms that support the real estate acquisition strategies for Amazon physical stores. We are tackling cutting-edge, complex problems — such as predicting the optimal location for new Amazon stores — by bringing together numerous data assets from disparate sources inside and outside of Amazon, and using best-in-class modeling solutions to extract the most information out of them. You will have a proven track-record of delivering solutions using advanced science approaches. You will be comfortable using a variety of tools and data sources to answer high-impact business questions. You will transform one-off models into automated systems. You will be able to break down complex information and insights into clear and concise language and be comfortable presenting your findings to audiences with a broad range of backgrounds. Responsibilities Develop production software systems utilizing advanced algorithms to solve business problems. Analyze and validate data to ensure high data quality and reliable insights. Partner with data engineering teams across multiple business lines to improve data assets, quality, metrics and insights. Proactively identify interesting areas for deep dive investigations and future product development. Design and execute experiments, and analyze experimental results in collaboration with Product Managers, Business Analysts, Economists, and other specialists. Leverage industry best practices to establish repeatable applied science practices, principles & processes. Basic Qualifications MS in computer science, statistics, applied mathematics, engineering, or related field with 2+ years of relevant experience. Strong Python programming skills in industrial setting. Excellent understanding of computer science fundamentals, machine learning, data structures, and algorithms. Able to understand and translate business and product questions into analytics projects. Understanding of relational databases and familiarity with statistics. Great design and problem solving skills, passion for quality and engineering excellence at scale. Ability to work independently in a fast-paced, iterative development environment. Exemplary communication skills, ability to work with large cross functional teams of technical and non-technical members. Preferred Qualifications PhD in computer science, statistics, applied mathematics, engineering or related field with 5+ years of relevant experience. Expertise in specialized areas such as Machine Learning. Expertise in Big Data technologies (EMR, Spark, Hive, Pig) Knowledge and direct experience using statistical packages and business intelligence tools. Experience in gathering requirements and formulating business metrics for reporting. Track record of delivering actionable solutions which drive business decisions. Amazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please visit https://www.amazon.jobs/en/disability/us. Company - Amazon.com Services LLC Job ID: A1646627",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-17T17:00:40.000Z"
    },
    "company": {
        "name": "Amazon",
        "link": "https://www.linkedin.com/company/amazon"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Chicago",
        "region": "IL",
        "postal_code": "60654",
        "street_address": null,
        "latitude": 41.88323,
        "longitude": -87.6324
    }
}