{
    "job": {
        "title": "Data Scientist (Predictive Analytics)",
        "industry": "Information Technology and Services",
        "description": "Focus Capital is supporting its health technology group by providing an effective Data Scientist who will work to develop state-of-the-art predictive analytic data models to optimize revenue opportunities for the marketing and sales teams. This ideal candidate must be technical and capable of driving digital innovation among the data engineers, while also capable of interfacing with business stakeholders and conducting predictive models. This role will start remotely, however at some point in the future we will want someone who can come in once every 10-15 days. Therefore, you must be local to NY or NJ or open to relocating. The total compensation and benefits offered are completely unmatched in the industry. MINIMUM REQUIREMENTS: 3+ years as a data scientist Experience building predictive models in Python and its frameworks (i.e. Pandas, PySpark, etc) Professional experience deploying machine learning models. Prior experience with Spark and SQL. Experience with Random Forest, Logistic Regression, Linear Regression, supervised and unsupervised models, etc Experience in a cloud environment (i.e. AWS or Azure) Azure Databricks experience is a plus Ability to translate complex mathematical models and data science concepts into business decisions (and vice versa) Masters degree in computer science, statistics or engineering (or 5+ years of experience).",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-17T18:26:25.000Z"
    },
    "company": {
        "name": "Focus Capital Markets",
        "link": "https://www.linkedin.com/company/focus-capital-markets"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "New York City Metropolitan Area",
        "region": null,
        "postal_code": "10021",
        "street_address": null,
        "latitude": 40.748295,
        "longitude": -73.98556
    }
}