{
    "job": {
        "title": "Software Engineer III",
        "industry": "Computer Software",
        "description": "Description RMS looking for a Software Engineer to be part of a team responsible for designing and developing the critical business applications in the Core Products suite. The Software Development group focuses on developing and building cutting edge, high-performance enterprise software solutions that deliver risk quantification tools to our 400+ clients worldwide. You will use best-of-breed technology from both established vendors such as Oracle Java as well as open source technology. As a Software Engineer, you will have the opportunity to play a key role in designing, developing, and innovating together as you bring your considerable software engineering skills to our dynamically growing organization. What You'll Be Doing Design, develop and maintain high-performance risk analytics, enterprise application designs, and software infrastructure using object-oriented design and analysis, using Java. Build a REST API service layer for the new generation of RiskLink. Utilize modularity and layering to enable high scalability and maintainability for software applications. Write high-performance computer algorithms and software code for Risk Analytics suite of applications. Create software design documents, architecture, sequence, class and related artifacts. Translate design inputs into development work items. Assist in providing estimates for levels of effort required to accomplish expected deliverables. Collaborate with fellow engineers, Product/Project Managers and Quality Assurance engineers to develop multi-tier, multi-layered application layer framework and functional components, following coding, documentation and design standards. Research new technologies and techniques to support leading-edge development. Mentor junior team members on technical aspects. Provide an active contribution to the team responsible for the design, development, and implementation of critical enterprise scale applications. Required Experience And Skills BS/MS degree in Computer Science or related field with 3-5 years of professional experience 1 year of experience in object-oriented design, data structures, design patterns, algorithms, and programming skills using C++ or Java/C# Ability to build fast, reliable, scalable, highly available, services and software components Demonstrated ability to produce quality code and experience with source control systems like Git/Bitbucket Past experience with Agile methodology Desirable Experience And Skills Experience with SQL server About RMS There’s a 5% chance that a hurricane will cause $60 billion of insured losses next year and a 1% chance an earthquake will cause $50 billion of insured loss in the next 12 months. At RMS, we build the simulation models that allow insurers and investors to understand portfolio risks due to catastrophes: natural catastrophes (hurricane, earthquake, flood), terrorism, pandemic, and changes in life expectancy. We are one of the most exciting firms you’ve probably ‘never’ heard of, unless you’re one of our hundreds of clients in the (re)insurance, banking or hedge fund sector. We lead an industry we helped pioneer and ultimately our work makes a true impact on the world at large. How we understand and manage risk affects everybody and our passion is nothing less than creating a more resilient world through a better understanding of catastrophic events. We are evolving our vision by delivering future solutions in the cloud, releasing in 2016 a cutting-edge risk management platform ‘RMS(one)’ for the global risk market. RMS(one) will create a holistic and integrated view across the enterprise with one platform for all models, all points of view, and all data. All will be run as equal partners on RMS(one). To find out more, visit www.rms.com Or follow us on Facebook, LinkedIn or @rmsjobs on Twitter. RMS is proud to be an equal opportunity workplace and is an affirmative action employer. We are committed to equal employment opportunity without regard to race, color, creed, gender, religion, marital status, registered domestic partner status, age, national origin or ancestry, physical or mental disability, genetic characteristics, sexual orientation, or any other classification protected by applicable local, state, or federal law. RMS is enrolled in E-Verify® and will be participating in E-Verify in addition to our Form I-9 process. www.dhs.gov/E-Verify . To all recruitment agencies: RMS does not accept unsolicited agency resumes and will not responsible for the payment of placement fees related to unsolicited resumes submitted to open positions, job aliases, or to our employees.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-11T23:42:28.000Z"
    },
    "company": {
        "name": "RMS",
        "link": "https://www.linkedin.com/company/rms"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Newark",
        "region": "CA",
        "postal_code": "94560",
        "street_address": null,
        "latitude": 37.540813,
        "longitude": -122.033394
    }
}