{
    "job": {
        "title": "C++ Developer",
        "industry": "Information Technology and Services",
        "description": "Required Skills 3-5 years of C++ development experience. Grid computing technologies. Technical background in integration, development, and/or infrastructure. Familiar with system architecture to understand how data flows from upstream systems to downstream integration. Excellent relationship management, communication, teamwork, and influence skills; ability to operate at senior levels in both written and verbal communications interacting professionally with a diverse group, executives, managers, and subject matter experts. Excellent communication, organization, facilitation and analytical skills, attention to details and ability to multi-task. Exposure to overall SDLC process, technology frameworks and tools (ex: Jira, HP Quality Center, etc.). Highly versed in various development methodologies, including waterfall and agile software development lifecycle. Self-motivated and can work independently as well as in a team environment. Ability to effectively prioritize and execute tasks in a high-pressure environment is crucial. Skills Desired Previous experience in the financial services field, with emphasis on Market Risk area. Educational Qualification Minimum BS degree in Computer Science, Engineering or a related field.",
        "employment_type": "CONTRACTOR",
        "date_posted": "2021-08-31T00:10:33.000Z"
    },
    "company": {
        "name": "NLB Services",
        "link": "https://www.linkedin.com/company/nlb-services"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "New York",
        "region": "United States",
        "postal_code": "13856",
        "street_address": null,
        "latitude": 42.93923,
        "longitude": -75.62005
    }
}