{
    "job": {
        "title": "Site Reliability Engineer",
        "industry": "Information Technology and Services,Computer Software,Internet",
        "description": "Job Description Title: Site Reliability Engineer Location: Beaverton, Oregon (97008) / Remote Option Employment Type: Direct Hire (no c2c or sponsorship available) Job Description EdgeLink is looking for a Site Reliability Engineer (SRE) to join an expanding team focused on connecting business to cloud applications and environments. From a skills perspective we are targeting most of the following: Bachelor' s degree or equivalent practical experience Experience supporting development environments that include Linux tools, Bamboo, Puppet, Terraform, AWS, and Azure Deep understanding of the Unix/Linux operating systems, including kernel networking packet flow Strong understanding of network fundamentals, including tunneling Working knowledge of SQL databases Experience with algorithms and data structures are a nice to have Edgelink would like to thank all applicants, however only those who qualify for an interview will be contacted. EdgeLink is an equal opportunity employer. Job Requirements SRE, DevOps, Site Reliability, CI/CD, Cloud, Azure, AWS, Linux, Bamboo, Puppet, Terraform, Unix, Networking, Tunneling, SQL, Database, Algorithm, Data Structure, VPN",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-25T03:12:38.000Z"
    },
    "company": {
        "name": "EdgeLink",
        "link": "https://www.linkedin.com/company/edgelink"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Portland",
        "region": "OR",
        "postal_code": "97268",
        "street_address": null,
        "latitude": 45.516018,
        "longitude": -122.68143
    }
}