{
    "job": {
        "title": "Lead Software Engineer - (C#/ .NET-Docker/Kubernetes)",
        "industry": "Hospitality",
        "description": "If you are a Lead Software Engineer with C# / .NET - Docker/Kubernetes experience, please read on! We are the leading provider of innovative automation technology for the hospitality industry. We design and market advanced software and hardware products, including state-of-the-art kitchen management technology that enables companies to effectively enhance the productivity of their hospitality business. Reporting to the Manager of Software Development, the Lead Engineer is responsible for leading the development of our product features and capabilities. You will work in an agile environment and help with the design, implementation, and testing of our products. Top Reasons to Work with Us Great room for growth Fully Remote Work/life balance What You Will Be Doing Work with business analysts to ensure requirements are appropriately defined. Provide technical guidance and reviews for other team members to ensure high-quality, maintainable code. Work with Solution Architects to design efficient and resilient applications and services. Research new tools and tech for use within the organization. Work with the DevOps team to identify and resolve product issues. What You Need for this Position 5+ years experience : At least 2+ years experience with C# / .NET Lead Experience Familiarity with at least one JavaScript framework, Vue, Angular, React, etc... Experience with any cloud provider (AWS preferred) Microservices Docker/Kubernetes Plus Skills CI/CD So, if you are a Lead Software Engineer with C# / .NET experience, please apply today! Email Your Resume In Word To Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also: Nate.Shuman@CyberCoders.com Please do NOT change the email subject line in any way. You must keep the JobID: linkedin : NS6-1640086 -- in the email subject line for your application to be considered.*** Nate Shuman - Recruiter - CyberCoders Applicants must be authorized to work in the U.S. CyberCoders, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-25T17:49:00.000Z"
    },
    "company": {
        "name": "CyberCoders",
        "link": "https://www.linkedin.com/company/cybercoders"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Louisville",
        "region": "KY",
        "postal_code": "40270",
        "street_address": null,
        "latitude": 38.256077,
        "longitude": -85.75157
    }
}