{
    "job": {
        "title": "Senior Robot Software Engineer - \"Can we make recycling, better?\" ",
        "industry": "Computer Software,Logistics and Supply Chain",
        "description": "CAN WE MAKE RECYCLING, BETTER? There is a tremendous amount of value in recycled materials: paper, plastic, metal ... But that value is heavily \"eroded\" in the cost of the high cost of manual labor needed to properly sort materials at recycling centers. Our heavily mission-driven client is revolutionizing the recycling industry with AI-driven robots. Their products are now working across the country, and they are deeply expanding their reach: Right now, they are a Series B Company with almost 75M in total funding. Their strong mission to make recycling better is just ONE of the many reasons they keep climbing up and up-and-up-and-up our list of the BEST Companies in Colorado. We are helping them hire across the board ... they are hiring for Developer roles,ML/AI roles, EE roles, RoS roles etc. ... That said, we are specifically focused on helping them hire Senior Robot Software Engineers : They generally hire \"polyglots\" but right now their deepest needs are centered around Software / Hardware Integration , ROS and C++ with TypeScript & JavaScript experience a nice bonus :) If you're a Senior/Lead/Staff/Principal Robotics Developer (Front End, Back-End, or Full-Stack )and you want to learn more about this company, OR if you just want to have an open-ended chat about your careers goals, perhaps one of the 37 other Software Engineering roles we are working on could be a good fit for you :) Salary: They are hiring at all levels, but so this is a wide range, but the general target for \"Senior Candidates is 130K - 150K, with room to go up to 170K for the right candidates. Benefits: Health, Dental, Vision, 401K, Strong PTO Location: Their office is in Louisville, but right now and for the foreseeable future (maybe forever), most Software Development teams are working 100% remotely. That said, they do prefer local candidates to keep the door open to meeting a few times a month. Looking forward to meeting you! Cheers, -Will p.s. Also happy to connect on LinkedIn! https://www.linkedin.com/in/willwegert/",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-25T17:33:37.000Z"
    },
    "company": {
        "name": "High Country Search Group",
        "link": "https://www.linkedin.com/company/high-country-executive-search"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Denver Metropolitan Area",
        "region": null,
        "postal_code": "80205",
        "street_address": null,
        "latitude": 39.756443,
        "longitude": -104.99415
    }
}