{
    "job": {
        "title": "Software Engineer",
        "industry": "",
        "description": "Wello Inc. is looking for an energetic and motivated junior to mid-level Software Engineer to design, code, test, debug, and document software for our current and new innovative products. Duties and Responsibilities: Design, develop, test and debug software for Wello products. Work in multi-disciplinary group (onshore/offshore) to understand and implement interfaces between various software components. Work with internal and external customers to thoroughly understand product requirements and use cases to develop optimal software solutions. Support software test, manufacturing, and customer support group to troubleshoot/resolve issues. Write software engineering documents such as Software Architecture Document, Detailed Design Document, etc. Onsite/Remote hybrid work environment. Candidates must be in DFW. Relocation not provided. Individual contributor role. Wello is unable to provide work-visa sponsorship at this time. Basic Qualifications: B.S in Computer Science, Electrical Engineering, Software Engineering, or similar discipline. 2-4 years of experience in software development using C++ and Linux. Must have experience and/or strong understanding of SDLC, Object Oriented Programming, UML Modeling, software design patterns and software development best practices. Experience in User Interface development (embedded or desktop) required. Preferred Skills and Experience: Prior experience with User interface development in QT strongly preferred. Experience in developing multi-threaded applications preferred. Experience in Medical Device or other highly regulated industry is strongly preferred. Experience with GIT source control. Experience with communication protocols such as ethernet (TCP/IP, UDP), i2C, USB is a plus. Familiarity or some experience with web development (LAMP, MERN stack) is a plus. Familiarity with SQL is a plus. Experience with bash scripts and Python is a plus. Familiarity with Internet of Things (AWS, Azure, Google Cloud, etc) is a plus. About Wello Since 2014, Wello has been on a mission to end the spread of contagious illness and set a new standard in employee health and safety. We provide temperature screening stations, instant badges, and flexible reporting and alerts to lower the risk of COVID-19 and other contagious illnesses in the workplace. Wello is also a great place to work. Our team is passionate about health and safety, and that shows in our workplace and culture. We provide generous compensation packages, including medical, dental, and vision benefits and paid time off to support you in doing your best work. We are dedicated to diversity, and we believe that a variety of backgrounds and perspectives leads to the strongest organizations. We encourage individuals from all races, ethnicities, nationalities, genders, sexual orientations, and abilities to apply. Please apply via LinkedIn or email your resume and cover letter to careers@welloinc.com. We look forward to meeting you!",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-18T20:48:10.000Z"
    },
    "company": {
        "name": "Wello Inc.",
        "link": "https://www.linkedin.com/company/wello-inc"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Addison",
        "region": "TX",
        "postal_code": "75001",
        "street_address": null,
        "latitude": 32.968605,
        "longitude": -96.83004
    }
}