{
    "job": {
        "title": "Site Reliability Engineer",
        "industry": "Electrical/Electronic Manufacturing,Information Technology and Services,Mechanical or Industrial Engineering",
        "description": "SpaceX was founded under the belief that a future where humanity is out exploring the stars is fundamentally more exciting than one where we are not. Today SpaceX is actively developing the technologies to make this possible, with the ultimate goal of enabling human life on Mars. SITE RELIABILITY ENGINEER (STARLINK) Want to build the next era of the Internet? Want to develop the infrastructure necessary to operate thousands of satellites in space and bring high speed broadband to every corner of the world? SpaceX is looking for an experienced Site Reliability Engineer to design, operate and scale the infrastructure we use to run Starlink, a global ISP and the world's largest satellite constellation. We have no shortage of hard problems and challenges. The ideal candidate will be flexible, possess broad skills across product operations and software development, and flourish in a fast-paced and challenging environment. RESPONSIBILITIES: Develop automation to deploy and manage compute resources both on-premises and in the cloud. Deploy and manage core infrastructure such as databases, monitoring and storage. Closely collaborate with Software Engineers to create highly scalable, operable and maintainable products. Engage in and improve the whole lifecycle of services -- from inception and design, through deployment, operation and refinement. BASIC QUALIFICATIONS: 1+ years of Site Reliability or DevOps experience. 1+ years of experience with Linux operating systems. Experience with Terraform, Ansible, or other infrastructure tools. Experience with containerization technologies (i.e. Docker, Kubernetes, etc.) Automation experience in Bash, Python, and/or other scripting languages. Experience with source code and version control tools such as Git. PREFERRED SKILLS AND EXPERIENCE: Bachelor's degree in computer science, information systems/IT, or an engineering discipline. 5+ years of Systems Administration, Site Reliability Engineering, or DevOps experience. 3+ years of experience with Python and Python-based development frameworks. Strong understanding of Docker, Vagrant, and Kubernetes, or similar technologies. Strong understanding of virtualization and hypervisor technologies. Understanding of databases and data modeling. Experience with automatically managing dozens or hundreds of servers. Focus on performance bottlenecks and performance improvement techniques. Strong networking knowledge of TCP/IP. Must be comfortable working with mission critical, with a sense of urgency appropriate to the responsibilities. Excellent communications skills with the ability to communicate with customers, peers, management etc. in both formal and informal situations. ADDITIONAL REQUIREMENTS: Ability to work long hours and weekends as necessary. ITAR REQUIREMENTS: To conform to U.S. Government space technology export regulations, including the International Traffic in Arms Regulations (ITAR) you must be a U.S. citizen, lawful permanent resident of the U.S., protected individual as defined by 8 U.S.C. 1324b(a)(3), or eligible to obtain the required authorizations from the U.S. Department of State. Learn more about the ITAR here. SpaceX is an Equal Opportunity Employer; employment with SpaceX is governed on the basis of merit, competence and qualifications and will not be influenced in any manner by race, color, religion, gender, national origin/ethnicity, veteran status, disability status, age, sexual orientation, gender identity, marital status, mental or physical disability or any other legally protected status. Applicants wishing to view a copy of SpaceX's Affirmative Action Plan for veterans and individuals with disabilities, or applicants requiring reasonable accommodation to the application/interview process should notify the Human Resources Department at (310) 363-6000.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-07T05:08:33.000Z"
    },
    "company": {
        "name": "SpaceX",
        "link": "https://www.linkedin.com/company/spacex"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Seattle",
        "region": "WA",
        "postal_code": "98133",
        "street_address": null,
        "latitude": 47.60323,
        "longitude": -122.33028
    }
}