{
    "job": {
        "title": "Senior Embedded Software Engineer - C /C++ / Linux",
        "industry": "Computer Software",
        "description": "We are a disruptive medical device startup that is revolutionizing the way that the world thinks about diagnostics! We value our relaxed and fun company culture, and we're looking for someone who isn't solely money motivated; but instead sees the true potential of a stable, VC-funded (50M) company that has been in business for 10+ years! What's In It for You Competitive pay with incentive opportunities Medical Insurance (Cost is 99% covered for employees) Dental, Vision (Cost is 100% covered for employees) Performance Bonus (2% - 10%) Opportunity to work in a relaxed/flexible work environment! What You Need for this Position Experience as a Senior Embedded Software Engineer Embedded system development experience Strong C and C++ skills Linux programming Proficient with version control systems, preferably Git Experience in the medical device industry or interest in it Experience with Python (Preferred) Knowledge of ISO13485 and IEC62304 (Plus) Working knowledge of Bitbake/Yocto ecosystem (Plus) Experience working in a lab with oscilloscopes, DMMs, power supplies, and logic analyzers (Plus) What You Will Be Doing Use C and C++ programming languages to develop high quality, easily maintainable production code Improve existing devices interfaces, both internal and external Explore and experiment with new methodologies for existing features and interfaces Assist in the development of software architecture and high-level design choices Assist in the selection of technical standards, tools, and platforms Execute unit and integration tests and generate unit and integration test reports Lead, define, and improve software development methodologies, processes, procedures, and tools Work closely with hardware and hardware engineers, bringing up boards, interpreting data sheets and schematics, and developing device drivers Participate in code reviews across languages and job functions Gather requirements and write specification documents Develop custom applications to support biology and device R&D projects So, if you have the experience above, please apply today or email me directly at edwin.ocampo@cybercoders.com! Email Your Resume In Word To Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also: Edwin.Ocampo@CyberCoders.com Please do NOT change the email subject line in any way. You must keep the JobID: linkedin : EO1-1633875 -- in the email subject line for your application to be considered.*** Edwin Ocampo - Recruiting Manager - CyberCoders Applicants must be authorized to work in the U.S. CyberCoders, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-31T07:01:02.000Z"
    },
    "company": {
        "name": "CyberCoders",
        "link": "https://www.linkedin.com/company/cybercoders"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 120,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Irvine",
        "region": "CA",
        "postal_code": "92717",
        "street_address": null,
        "latitude": 33.68591,
        "longitude": -117.82472
    }
}