{
    "job": {
        "title": "Senior Data Scientist",
        "industry": "Marketing and Advertising,Information Technology and Services",
        "description": "Senior Data Scientist Travel, Leisure & Tourism $125,00 - $140,000 plus bonus & benefits Remote (US BASED - EST) THE COMPANY: An eCommerce company operating in the leisure, travel, and tourism industry is searching for a Senior Data Scientist to join their team. This organization focuses primarily on the travel rewards and benefits subsector. My client has recently entered a high growth period and is looking to scale their analytics division. THE ROLE: In the role of Senior Data Scientist, you will be responsible for analyzing products and marketing campaigns as well as handling data decision models. This will include managing A/B testing platforms as well as building ranking models and pricing models. YOUR SKILLS AND EXPERIENCES: The Senior Data Scientist must have: Commercial experience with logistic regression, gradient boosting, and XG Boost Hands-on exercise with using both SQL and Python on a regular basis Previously worked in an eCommerce or customer data-focused environment Ability to multitask, handle several roles with different areas of focus THE BENEFITS: As a Director of Analytics, you can earn as much as $140,000 per year depending on your experience, as well as several different bonuses, benefits, including unlimited PTO. HOW TO APPLY: Please register your interest by sending your CV to Andrew Bauersfeld via the Apply link on this page. KEYWORDS: Senior Data Scientist, Data Scientist, Logistic Regression, Gradient Boost, XG Boost, SQL, Python, eCommerce, Customer, Data, Analysis, Analytics, Travel, Tourism, Leisure, Rewards, Benefits",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-18T22:08:19.000Z"
    },
    "company": {
        "name": "Harnham",
        "link": "https://uk.linkedin.com/company/harnham"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "New York",
        "region": "United States",
        "postal_code": "13856",
        "street_address": null,
        "latitude": 42.93923,
        "longitude": -75.62005
    }
}