{
    "job": {
        "title": "Data Scientist",
        "industry": "",
        "description": "About Innowatts: A Utility-in-a-Box SaaS platform, combining energy data & predictive analytics to enable energy providers to Increase customer value, Unlock grid edge opportunities and Accelerate energy transition. Innowatts is backed by Energy Impact Partners, Shell Ventures, Iberdrola Energy Ventures, Veronorte and Energy and Environment Investment (Japan). Summary We are seeking a data scientist/programmer who thrives in a challenging environment, is passionate about technology products, and who can apply AI & Machine learning data analytics techniques to build a scalable energy analytics platform. This position will work closely with the data science team to help support all facets of the data supply chain involving consumption and analytics. As a Jr. data scientist, this candidate can be involved in the following activities: Processing, cleansing, and verifying the integrity of data used for analysis Perform predictive analysis i.e. load forecasting in different geographical regions and track forecast performance Apply statistical analysis, machine learning modeling techniques, and data visualization methods Involve in research for the new electrification trends Doing ad-hoc analysis and presenting results in a clear manner Responsibilities Excellent understanding of machine learning techniques and algorithms, such as Neural Network, Random Forest, Gradient Boosting Experience with common data science toolkits, such as Anaconda, Python, SQL Experience with data visualization tools, such as Tableau, Power Bi, etc. Expert in writing queries using SQL, AWS Athena etc. Good programming skills in Python using different python packages Minimum Qualifications BS/MS degree in Engineering, with data science specialty discipline At least 1-3 years of data analytics experience in a distributed computing environment Good communication and presentation skills Data-oriented personality Benefits and Additional Perks Fast paced, collaborative and fun environment Work with data and latest technology to transform the industry Competitive salary and bonus 401k Medical, dental, vision, life, and long-term disability insurance Paid vacation",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-09-01T22:21:49.000Z"
    },
    "company": {
        "name": "Innowatts",
        "link": "https://www.linkedin.com/company/innowatts-energy"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 12,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Houston",
        "region": "TX",
        "postal_code": "77208",
        "street_address": null,
        "latitude": 29.760803,
        "longitude": -95.36951
    }
}