{
    "job": {
        "title": "Data Scientist - 100% Remote",
        "industry": "Information Technology and Services,Computer Software,Financial Services",
        "description": "ALTA is supporting a contract opportunity for a client in Dayton, Ohio with a Data Scientist opportunity.   100% Remote. For immediate interest, please send your resume to pjackson@altaits.com The Data Scientist II is responsible for designing and validating predictive models, machine learning models, and artificial intelligence that inform and improve business processes across the organization (operational, clinical, financial, marketing, etc.). Essential Functions: Mine and analyze large structured and unstructured datasets Develop visualizations that demonstrate the efficacy of models Provide statistical validation of outcomes analysis associated with clinical programs and interventions Communicate results and ideas to key stakeholders Perform any other job duties as requested Education and Experience: Bachelor's Degree in Mathematics, Statistics, Engineering, Computer Science, other related field or equivalent years of relevant work experience is required Minimum of three (3) years of experience in data analysis and/or analytic programming required Healthcare experience is preferred Competencies, Knowledge and Skills: Proficient in two or more of the following programming languages: R, Python, SAS or SQL Ability to perform advanced statistical analysis and modeling such as liner and non-liner regression, resampling and Markov chains Working knowledge of predictive modeling, machine learning algorithms such as clustering, decision trees, dimensionality reduction and natural language processing Proficient in feature engineering techniques and exploratory data analysis Familiarity with optimization techniques and artificial intelligence methods Ability to analyze large quantities of information and identify patterns, irregularities, and deficiencies Proficient with MS office (Excel, PowerPoint, Word, Access) Demonstrated critical thinking, verbal communication, presentation and written communication skills Ability to work independently and within a cross-functional team environment Licensure and Certification: None Travel and Telecommuting: Travel: None Telecommute Options: Yes, 100% Remote ALTA IT Services, is an established leader in IT Staffing and Services, specializing in Agile Transformation Services, Program & Project Management, Application Development, Cybersecurity, and Data & Advanced Analytics. We are an equal opportunity/affirmative action employer and considers qualified applicants for employment without regard to race, gender, age, color, religion, disability, veteran status, sexual orientation, or any other factor.",
        "employment_type": "CONTRACTOR",
        "date_posted": "2021-07-19T18:56:25.000Z"
    },
    "company": {
        "name": "System One",
        "link": "https://www.linkedin.com/company/system-one"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Dayton",
        "region": "OH",
        "postal_code": "45402",
        "street_address": null,
        "latitude": 39.76184,
        "longitude": -84.209694
    }
}