{
    "job": {
        "title": "C++ Software Engineer (TS/SCI with FS Poly Required)",
        "industry": "Information Technology and Services,Computer Software,Financial Services",
        "description": "If you are a 5 year, C++ Software Engineer with a TS/SCI and Full Scope Polygraph, please read on. We're a small engineering contractor that supports clients in the commercial and government sectors with RF Engineering, Analog and Digital Hardware, Audio and Video DSP, application and embedded software engineering and more. We have offices in Maryland, Virginia and North Carolina and are currently looking for a C++ and Matlab, Software Engineer at one of these locations. All candidates must have an active, TS/SCI clearance with a Full Scope Poly clearance in order to be considered. What's In It for You $100k-$180k/year base salary (DOE) Full company benefits (medical, dental, vision, short and long-term disability) 401k with company match and more What You Will Be Doing Implement C++ and Matlab signal processing techniques into the Redhawk framework Develop, maintain and enhance complex software systems Work with intensive analytics, novel algorithm development, real-time systems) What You Need for this Position Active TS/SCI clearance with a Full Scope Polygraph Bachelors degree in Computer Science or related field 14+ years of related software engineering experience Expert C++ programming 3+ years with Signal Analysis Tools (Redhawk, GNU, XMIDAS, Matlab, Octave, WVT, DVT) SIGNIT RF BONUS POINTS Software architectures (SCA, Redhawk, GNU) Commercial wireless standards Geolocation techniques Software configuration management tools (GIT) Python Eclipse Linux OS So, if you are a 5 year, C++ Software Engineer with a TS/SCI and Full Scope Polygraph, please apply today. More openings for Software Engineers, Scrum Masters, Network Engineers, Cyber Security Analysts, Database Engineers and System Engineers are available in California, New Jersey, Colorado, Maryland, Virginia and Washington DC. All roles require a TS/SCI with CI Poly, TS/SCI with Full Scope Poly, TS/SCI with Poly or a Top Secret Clearance. Email Daniel.Chavez@Optello.com for details. Email Your Resume In Word To Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also: Melanie.McElwee@Optello.com Please do NOT change the email subject line in any way. You must keep the JobID: linkedin : DC6-1626956 -- in the email subject line for your application to be considered.*** Melanie McElwee - Sr. Executive Recruiter - Optello Applicants must be authorized to work in the U.S. Optello is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-06-18T11:29:18.000Z"
    },
    "company": {
        "name": "Optello",
        "link": "https://www.linkedin.com/company/optello-us"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 168,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Raleigh",
        "region": "NC",
        "postal_code": "27699",
        "street_address": null,
        "latitude": 35.781303,
        "longitude": -78.64168
    }
}