{
    "job": {
        "title": "Data Scientist",
        "industry": "Insurance,Research",
        "description": "Ready to make an impact? If so, read on! The Research, Analytics and Development team has a great opportunity for a Data Scientist or Senior Data Scientist . As a Data Scientist, you will serve as a technical and thought leader on this diverse and highly skilled team. You will design and develop inventive solutions to drive innovation and delivery of organizational value. You’ll analyze large datasets to further develop underwriting, marketing, claims, application and product optimization. You’ll work in a highly collaborative, team environment, and collaborating with multiple stakeholders. You will assist management in the communication of insights and the implementation of impactful data science solutions across the organization. The successful candidate leads the research of new business concepts, new products, new technologies, new data, and stays on the cutting-edge of innovation of the insurance industry. You’ll develop algorithms to target specific business objectives and create other business opportunities. Works with different functional teams, identifies and encourages innovation opportunities, and translates business needs to projects. Designs resource allocation processes to take potential innovations forward from the seed stage to development. Required Qualifications BA/BS required in Economics, Statistics, Operations Research, Mathematics or related field. Analyzes large, complex datasets and identifies meaningful patterns that lead to actionable recommendations. Deep understanding and experience identifying, extracting, aggregating and synthesizing data from multiple sources to enable campaign optimization. Superior coding skills using common data science tools, including Python (strongly preferred), R, Linux/Unix command line and shell scripting. Excellent skill and significant experience in data processing using SQL, SAS, Hive, Impala, Spark, or equivalent querying language. Strong experience with distributed storage and big data computing technology, such as AWS, Hadoop, or Spark. Ability to work with cross departmental teams to define metrics, guidelines and strategies for effective use of algorithms and data. Excellent communication skills and experience in working with stakeholders. Passion for extracting hidden insights and building machine learning systems that enhance business outcomes. To ensure our associates receive the training and support needed to excel and thrive, associates hired for this position are generally required to work at the GEICO building during their orientation period. GEICO follows federal and state guidance and legal requirements regarding measures designed to limit the spread of COVID-19, including masking and social distancing. Measures may vary by GEICO location. Benefits As a full-time Data Scientist, you’ll enjoy our Total Rewards Program * to help secure your financial future and preserve your health and well-being, including: Premier Medical, Dental and Vision Insurance with no waiting period** Paid Vacation, Sick and Parental Leave 401(k) Plan with Profit Sharing Tuition Reimbursement Paid Training and Licensures Benefits may be different by location. Benefit eligibility requirements vary and may include length of service. Coverage begins with the pay period after hire date. Must enroll in New Hire Benefits within 30 days of the date of hire for coverage to take effect. GEICO is an equal opportunity employer. GEICO conducts drug screens and background checks on applicants who accept employment offers. The equal employment opportunity policy of the GEICO Companies provides for a fair and equal employment opportunity for all associates and job applicants regardless of race, color, religious creed, national origin, ancestry, age, gender, pregnancy, sexual orientation, gender identity, marital status, familial status, disability or genetic information, in compliance with applicable federal, state and local law. GEICO hires and promotes individuals solely on the basis of their qualifications for the job to be filled. GEICO reasonably accommodates qualified individuals with disabilities to enable them to receive equal employment opportunity and/or perform the essential functions of the job, unless the accommodation would impose an undue hardship to the Company. This applies to all applicants and associates. GEICO also provides a work environment in which each associate is able to be productive and work to the best of their ability. We do not condone or tolerate an atmosphere of intimidation or harassment. We expect and require the cooperation of all associates in maintaining an atmosphere free from discrimination and harassment with mutual respect by and for all associates and applicants. #DI-AM",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-15T13:55:28.000Z"
    },
    "company": {
        "name": "GEICO",
        "link": "https://www.linkedin.com/company/geico"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Chevy Chase",
        "region": "MD",
        "postal_code": "20861",
        "street_address": null,
        "latitude": 38.98284,
        "longitude": -77.08646
    }
}