{
    "job": {
        "title": "Remote Senior Site Reliability Engineer, SRE / DevOps Engineer",
        "industry": "Information Technology and Services,Computer Software",
        "description": "100% remote, 30 days vacation, 401k matching This Jobot Job is hosted by Amber Heigerick Are you a fit? Easy Apply now by clicking the \"Apply\" button and sending us your resume. Salary $160,000 - $200,000 per year A Bit About Us We are a leading cloud-based financial technology company that is looking to add a Senior SRE / DevOps Engineer to our dynamic team! The team is crucial to building/deployment/monitoring automation of products for our cloud offering using cutting edge technologies. Why join us? We believe that everyone deserves to thrive at the company they are part of! We treat our employees like our clients, without you we wouldn't have a company! We have very low turn-over, because we have happy employees. We like to promote from with in whenever possible and 90% of the time, are able to do that. Job Details The Senior DevOps Enginner is a key member of our fast-growing and high-performing team; You will, research, define and architect solutions for Source Control, Build and Deployment automation, Continuous Integration, Environment Monitoring, and general developer tools and provide strategic and tactical directions. Build software releases and testing new code; as an automation expert using tools that automate the development, testing and integration of software releases/fixes Design, develop, and implement software that defines and evolves our infrastructure. Troubleshoot production issues and coordinate with the development team to streamline code deployment. Implement automation tools and frameworks (CI/CD pipelines). Analyze code and communicate detailed reviews to development teams to ensure a marked improvement in applications and the timely completion of projects. Collaborate with team members to improve the company's engineering tools, systems and procedures, and data security. Optimize the company's computing architecture. You should know the following Experience in DevOps Engineering, SRE, or Cloud Engineering Experience with with Infrastructure-as-code concepts and tools, such as Terraform. Experience in using template languages for definition of infrastructure provisioning (AWS CFN, OpenStack HOT) Experience with Continuous Integration (CI) tools such as Jenkins/Bamboo, source control tools such as Git and Subversion. Experience with Atlassian tools setup and administration like Jira, Confluence, Bitbucket, Hipchat Must be proficient in one or more scripting languages Unix Shell, Perl, Python. Experience in a production environment with Public IaaS and PaaS clouds, such as AWS, Azure, CloudFoundry, Heroku or Private cloud systems, such as OpenStack and Kubernetes Interested in hearing more? Easy Apply now by clicking the \"Apply\" button.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-05T09:15:11.000Z"
    },
    "company": {
        "name": "Jobot",
        "link": "https://www.linkedin.com/company/jobot"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "San Diego",
        "region": "CA",
        "postal_code": "92161",
        "street_address": null,
        "latitude": 32.71576,
        "longitude": -117.16382
    }
}