{
    "job": {
        "title": "Machine Learning Engineer",
        "industry": "Consumer Electronics,Computer Software,Electrical/Electronic Manufacturing",
        "description": "ML ENGINEER This leading Social Media Company which focuses on delivering its vision through Virtual Reality(VR) and Augmented Reality(AR) is looking for you! The Compute performance and power efficiency requirements of Virtual and Augmented Reality require custom silicon. This silicon team is driving the state of the art forward with breakthrough work in computer vision, machine learning, mixed reality, graphics, displays, sensors, and new ways to map the human body. Our chips will enable AR & VR devices where our real and virtual world will mix and match throughout the day. We believe the only way to achieve our goals is to look at the entire stack, from transistor, through architecture, to firmware, and algorithms. We are growing our ASIC Design and Microarchitecture team within AR Silicon and are seeking engineers at all levels who will work with a world-class group of researchers and engineers using their digital design skills to implement and contribute to the development and optimization of low power machine learning accelerators and state-of-the-art SoCs. Responsibilities: identify and solve multi-discipline ML acceleration problems involving alogorithims, network design, hardware architechture and AR/VR use cases. Many of these would be first time solutions in the industry. Work across hrdware and software, to solve deep co-design problems with other research scientists working in this area Attend conferences/interpret papers and stay updated wit latest research advancements in the field of ML acceleration Minimum Qualifications: PhD in Electrical Engineering, Computer science or equivaent experience 8+ years experience in silicon architecture Experience with ML models, algorithms or accelerator architechture Expereince in either RTL coding or performance modeling",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-12T00:04:55.000Z"
    },
    "company": {
        "name": "Larsen &amp; Toubro",
        "link": "https://in.linkedin.com/company/larsen-&amp;-toubro-limited"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 96,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Menlo Park",
        "region": "CA",
        "postal_code": "94029",
        "street_address": null,
        "latitude": 37.45322,
        "longitude": -122.18322
    }
}