{
    "job": {
        "title": "Data Scientist, Analytics (New Grad)",
        "industry": "Information Technology and Services,Computer Software,Financial Services",
        "description": "Join a leading fintech company that’s democratizing finance for all. Robinhood was founded on a simple idea: that our financial markets should be accessible to all. With customers at the heart of our decisions, Robinhood is lowering barriers and providing greater access to financial information. Together, we are building products and services that help create a financial system everyone can participate in. We Are Proud Of The Competitive Products And Company Culture We Continue To Build And Have Been Recognized As Just as we focus on our customers, we also strive to create an inclusive environment where our employees can thrive and do impactful work. Glassdoor Best Places to Work 2020 TIME100 Most Influential Companies 2021 Fortune Best Workplaces in Financial Services & Insurance™ 2021 and Fortune Best Workplaces for Millennials™ 2021 Check out life at Robinhood on The Muse! Application review will begin on 8/30/21** About The Team Insights from data power most decisions at Robinhood. This Data Scientist -Analytics role at Robinhood will work with partners in product, marketing, engineering, finance, design, and compliance to understand and analyze data from all parts of our business to power how our product works and feels. Our company trajectory is defined by the systems, tools, and analytics powered by our exceptional team. What You’ll Do Day-to-day Developing and sharing insights around the key metrics that drive the company and your particular product Working with partners to identify the key metrics their product should track and developing and sharing analysis, guidance, reports, and dashboards to successfully track and move these metrics Powering quick decisions by answering business questions by querying our vast datasets Adapting quantitative techniques to solve problems surfaced by multiple perspectives About You BA/BS/MS degree in a quantitative field such as mathematics, economics, statistics, engineering or natural sciences (or equivalent research experience) with an expected graduation date in 2022 Excellent programming skills, including familiarity with either Python (numpy, scipy, pandas) or R programming languages Familiarity with SQL (preferred for new grads and a plus for interns) Experience with Tableau, Looker, and/or Mode Solid understanding of statistical analysis Experience communicating data driven insights 1 year of experience working in a research setting in academic or commercial setting Bonus Points Passion for working and learning in a fast-growing company Strong customer empathy Intense sense of curiosity We’re looking for more growth-minded and collaborative people to be a part of our journey in democratizing finance for all. If you’re ready to give 100% in helping us achieve our mission—we’d love to have you apply even if you feel unsure about whether you meet every single requirement in this posting. At Robinhood, we're looking for people invigorated by our mission, values, and drive to change the world, not just those who simply check off all the boxes. Robinhood promotes diversity and provides equal opportunity for all applicants and employees. We are dedicated to building a company that represents a variety of backgrounds, perspectives, and skills. We believe that the more inclusive we are, the better our work (and work environment) will be for everyone. Additionally, Robinhood provides reasonable accommodations for candidates on request and respects applicants' privacy rights. To review Robinhood's Privacy Policy please visit rbnhd.co/applicant-privacy. Robinhood's benefits include generous time off, 401(k) participation with employer match, comprehensive health coverage, a health savings account (HSA), wellness benefits, backup childcare and education stipends (all benefits are subject to applicable taxes and based on eligibility).",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-03T01:07:04.000Z"
    },
    "company": {
        "name": "Robinhood",
        "link": "https://www.linkedin.com/company/robinhood"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 12,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Menlo Park",
        "region": "CA",
        "postal_code": "94029",
        "street_address": null,
        "latitude": 37.45322,
        "longitude": -122.18322
    }
}