{
    "job": {
        "title": "Principal Full Stack Software Engineer.",
        "industry": "Hospital &amp; Health Care,Medical Devices,Pharmaceuticals",
        "description": "Ethicon, part of Johnson & Johnson Medical Devices Companies, is recruiting for a Principal Software Engineer , located remotely in the United States or in the Munich, Germany area. Johnson & Johnson Medical Devices is focused on shaping the future of digital surgery and expanding its robotics and digital solutions offerings across the entire portfolio, with multi-specialty, end-to-end solutions in orthopedics, endoluminal intervention and general surgery. This includes the MONARCH® platform, a first-of-its-kind robotic technology indicated for bronchoscopic visualization of and access to patient airways for diagnostic and therapeutic procedures in the lung. Ethicon, part of Johnson & Johnson Medical Devices Companies, has made significant contributions to surgery for more than 100 years from creating the first sutures, to revolutionizing surgery with minimally invasive procedures. Our continuing dedication to Shape the Future of Surgery is built on our commitment to help address the world's most pressing health care issues and improve and save more lives. Through Ethicon's surgical technologies and solutions including sutures, staplers, energy devices, trocars and hemostats and our commitment to treat serious medical conditions like obesity worldwide, we deliver innovation to make a life-changing impact. For more information, visit www.ethicon.com. The Digital Solutions group is building advanced technologies to improve healthcare, and we are looking for a Software Engineer to join our team. We're looking for an experienced software engineer with strong C++ programming skills to help us continue developing our system software. This individual will be responsible for design and implementation of software solutions, as an active participant in all phases of the software development lifecycle. Key Responsibilities Use best practices for building software under Design Control procedures for use in a medical device. Using requirements developed through multi-functional team input, design and develop software solutions for sophisticated digital systems. Design, develop and debug software for complex, multi-process systems. Design and implement C++ software prototypes, components, and applications that are flexible and capable. Johnson & Johnson is an Affirmative Action and Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, age, national origin, or protected veteran status and will not be discriminated against on the basis of disability. Qualifications Required: Bachelor’s Degree in Computer Science, Computer Engineering, Electrical Engineering or relevant field Minimum 8 years of hands-on experience in software product development Demonstrated programming in C and C++ in a production environment Solid knowledge of data structure and algorithms Experience writing multi-process and multi-threaded software with practical knowledge of how this software can fail. Experience with software configuration management systems, such as Subversion and Git Experience with Full Stack Development Ability to mentor/teach others on the team Ability to travel up to 10% Preferred Advanced Degree in Computer Science, Computer Engineering, Electrical Engineering or relevant field Experience with medical device development Experience with front end languages such as HTML, CSS, and JavaScript Understanding of JavaScript frameworks such as AngularJs, React and Node.js Experience with server-side development using Python, Ruby, or PHP Familiarity with database technology such as MySQL and Postgres Experience with UI frameworks such as Qt. #gia Primary Location United States--- Other Locations Europe/Middle East/Africa-Germany-Bavaria-Munich, United States-California-Santa Clara Organization Verb Surgical Inc. (6270) Job Function R&D Requisition ID 2105907683W",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-09T17:39:11.000Z"
    },
    "company": {
        "name": "Johnson &amp; Johnson",
        "link": "https://www.linkedin.com/company/johnson-&amp;-johnson"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 96,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Santa Clara",
        "region": "CA",
        "postal_code": "95050",
        "street_address": null,
        "latitude": 37.352394,
        "longitude": -121.95308
    }
}