{
    "job": {
        "title": "Software Engineer",
        "industry": "Computer Software,Internet,Financial Services",
        "description": "Our vision & mission: Paro is freeing business professionals from the constraints of traditional employment by empowering them to pursue meaningful work on their own terms. In turn, we are democratizing access to the business solutions that companies need. What We Deliver Paro provides flexible finance and accounting solutions to businesses via its network of highly vetted freelance experts. Through our proprietary AI-powered platform, we match clients with the best-fit experts to solve problems and drive growth. Our carefully curated expert community provides a range of financial services to clients, from basic bookkeeping and accounting to highly specialized corporate development and strategic advisory. The Role The Software Engineer will work closely with Product Managers, UX, and Engineering teams at Paro to create solutions, develop stories, and execute them. You’ll be expected to bring your experiences to the table to collaborate with the team to solve complex problems. As a junior member on the team, you’ll use your current knowledge and build on it as you are mentored by more senior members on the team. The Software Engineer will be encouraged to think critically about challenges every day. This is the ideal opportunity for someone eager to start their career in a cutting-edge field with a rapidly growing startup that will help you grow professionally and personally. Core Responsibilities Build modern web frontend components with Node.js, React, NextJS, GraphQL, Lambda functions. Implement backend infrastructure with Amazon Web Services (emphasis on modern serverless architecture). Assist with building, testing, and deploying new features and functionality for our e-commerce, matchmaking & billing platforms. Participate in sprint planning and estimating your tasks in JIRA. Work with people and their ideas, and then design, engineer, and deliver those ideas as well-built products. How You’ll Add Value 0-3 years of experience in a relevant role or relevant internships BS Degree in CS, Computer Engineer, or relevant preferred Knowledge utilizing Javascript/Typescript, React, Node.JS, and AWS Being a go-getter and loves to write code. A collaborative attitude towards problem solving Who You Are We’re more interested in how you add to our innovative community than formal education or experience. That said, you will shine in this role if you: Believe that in order to be successful, you need to be surrounded with others who can be their authentic selves at work while driving forward the future of work with Paro. You value taking smart risks and having your colleague’s backs. You welcome challenges and are rigorous in ensuring all voices are heard. You are open to understanding each other’s experiences and communicating effectively together. At Paro we work hard, but we also want every employee to enjoy the journey. You work collaboratively, do the right thing, never settle and put your best work into everything you do. Benefits At Paro Compensation - We offer a competitive base salary and equity options in Paro. Benefits - We offer a comprehensive benefits package including: medical (Blue Cross Blue Shield), dental, vision, and a 401(k) plan. Paro currently does not match 401(k). Vacation - We offer our employees unlimited vacation, as we believe rest and recharging allows you to bring your full self into work. In addition to unlimited vacation, we observe all federal holidays and offer unique Paro Holidays during months there isn’t a federal holiday Office Environment - We have a beautiful, relaxed office space in River North, steps away from public transportation. We love our pets and have a pet-friendly office for your furry friends as well. Remote Work - Given our company’s mission to empower professionals to pursue meaningful work on their own terms, we believe we too can accomplish great things while not always together under one roof. Therefore, we accept remote employees in the following states: IL, OH, MI, AZ, WA, PA, NJ, NY, TX, IN More about Paro Join us as we shape the future of finance work. A mass migration to a workforce without boundaries is already underway, with many leading analysts predicting that 50% of the workforce will be freelancing by 2025. We recently raised a $25M Series B funding round led by Madrona Venture Group, with participation from existing investors Revolution Ventures, Sierra Ventures and KGC Capital, so we are ready and excited to invest in even greater growth as we disrupt the $500+bn antiquated finance and accounting industry! We are an equal opportunity employer and are committed to building a company that embraces and celebrates diversity and inclusion. We do not discriminate on the basis of race, religion, color, national origin, gender, gender identity or expression, sexual orientation, age, marital status, veteran status, or disability status.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-26T00:06:35.000Z"
    },
    "company": {
        "name": "Paro.io",
        "link": "https://www.linkedin.com/company/paro-io"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Chicago",
        "region": "IL",
        "postal_code": "60654",
        "street_address": null,
        "latitude": 41.88323,
        "longitude": -87.6324
    }
}