{
    "job": {
        "title": "Full-Stack Software Engineer (Remote)",
        "industry": "Information Technology and Services",
        "description": "About Inception Health Our goal is to transform healthcare. We improve the health of individuals and communities through the use of digital technology. Inception Health brings together the best aspects of innovation accelerators, an “outside-in” mindset, and resources to rapidly test and scale digital health solutions. We work hard to define the problem, and we use design thinking and human-centered design to understand the issues from all perspectives. Inception serves as a Catalyst, an Incubator, a Designer/Developer, and an Operator of solutions. Join the first-of-its-kind digital engineering group at Inception Health. You will be working delivering greenfield products as well as shaping our engineering culture. This is a unique opportunity if you are excited to transform healthcare and shape the future of care. At Inception, we aim to build a thriving engineering team focused on delivering a data-driven and experience-focused digital services to our members, community, and providers. That means we aspire to bring a full-stack engineering culture as our philosophy to grow our engineering team and build a cross-functional resiliency of our members to dive in and help engineer experience across the technology stack layers. The Job Write code, build tests, resolve bugs, and refactor. Solve healthcare challenges and build care experiences through writing code across platforms and services. Contribute to foster a culture of engineering excellence - writing well-tested, maintainable, and performant code. Deliver features independently and in collaboration with your peers. Engage with the team following an Agile / Scrum process. Participate in design and code reviews. Help build and improve our DevSecOps. Contribute to research and development in various areas of engineering. We truly believe that this is an opportunity for candidates to bring their unique value to healthcare to make change. At Inception Health, you can innovate and build sophisticated solutions that enrich thousands of lives. The Right Fit Software development experience in one or more programming languages such as React, Node, TypeScript & Python. Has worked on projects that involve databases, building user-facing websites. Someone who loves both front-end and back-end development. Working proficiency and communication skills in verbal and written English. Enjoys being creative and solving problems — and you enjoy having an understanding for the full picture of how different things interact and work together. Qualifications You’re an outstanding full-stack engineer with a knowledge in the following areas: Software development experience in one or more general purpose programming languages. Modern Javascript and Typescript. Maybe Go or Erlang. React and React Native. Maybe React Native Web and Hermes! Enjoy building and coding modern event-based architecture leveraging GraphQL, Relay, and modern Serverless backend technology. Testing, unit testing, integration testing, performance testing, \"everything\" testing with tools like Jest, Detox, Cypress, K8, etc. Other Qualifications Include Passionate about healthcare and want to build technology that makes it more accessible and modern. Passionate about the web, Android and iOS surfaces and how technology can foster a better human experience. You’re interested in full-stack modern cloud development and are comfortable diving into back-end code to find a bug or assist other engineers. Preferred BS degree in Computer Science, similar technical field of study or equivalent practical experience. Experience with one or more general purpose programming languages including but not limited to: Python, JavaScript, Erlang or Go. Experience developing accessible technologies. Interest and ability to learn other coding languages as needed. Benefits For You Health, Dental and Vision Insurance 403b Savings Plan HSA and FSA Generous Paid Time Off Ability to collaboratively chart your own career path",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-21T01:47:26.000Z"
    },
    "company": {
        "name": "Newance ",
        "link": "https://www.linkedin.com/company/newanceco"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Florida",
        "region": "United States",
        "postal_code": "33805",
        "street_address": null,
        "latitude": 28.595512,
        "longitude": -82.48734
    }
}