{
    "job": {
        "title": "Jr Software Engineer",
        "industry": "",
        "description": "KIOSK helps organizations digitally transform by enabling automation with self-service solutions to improve the customer experience, while increasing operational and cost efficiencies. With over 27 years of experience and 250,000+ kiosks deployed, KIOSK is a market leader and trusted partner of Top 100 Retailers and Fortune 500 clients delivering proven expertise in design engineering and manufacturing, application development, integration, and comprehensive support services. We offer an innovative portfolio of kiosk solutions along with managed services and IoT capabilities to ensure a seamless user experience. Self-service is a fast paced and exciting industry with high professional growth potential. The company offers a full spectrum product portfolio with all solution disciplines in one professional / manufacturing campus. We are a high performing and customer-centric team. KIOSK provides a respectful, fun, and collaborative work environment with great benefits and work / life balance. KIOSK is hiring a Jr Software Engineer that will be responsible for analyzing, planning, developing, implementing, testing and maintaining various hardware and cloud based IoT projects. Responsibilities: Perform full stack software development Participate in pull requests and code reviews Ability to work with off shore development team Design and update software as needed Test and maintain software products to ensure strong functionality and optimization Work on production and commercial deployment of systems for enterprise customers Maintain and improve the performance of software throughout the entire complete software development life cycle Recommend improvements to existing software programs as necessary Provide timely solutions to production issues Ability to accurately estimate effort Develop windows hardware abstraction layer to interface with vendor driver/firmware for components such as card reader, bar code scanner, printers etc. Required Skills: 3+ years of experience developing C# .NET applications .NET core, .NET Standard, .NET framework Typescript, modern JavaScript framework such as Angular, React.js etc. Test Driven Development Git, Gitflow, Azure DevOps AWS cloud services (preferred) Experience consuming, designing and developing microservices APIs (highly preferred) Desired Skills: Adaptability – Being open to and actively solicit new ideas and opinions. Experience consuming, designing and developing microservices APIs (highly preferred) Travel: Less than 5% travel Physical: Must be able to sit and stand 8 hours Must be able to lift 10 pounds Starting Salary - Final compensation for this role will be determined by various factors such as a candidate’s relevant work experience, skills, and certifications. Benefits- KIOSK values its employees by supporting them with a full benefits package including: Medical (3 plans to choose from) Dental (company paid for employee only coverage) Vision (company paid for employee only coverage) Life Insurance (company paid) Short and long term disability insurance (company paid) Flexible Spending Accounts 401(k) match with immediate vesting Employee Assistance Program Paid Time Off 10 Paid Holidays per calendar year Annual Bonus program",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-06T17:09:48.000Z"
    },
    "company": {
        "name": "KIOSK Information Systems",
        "link": "https://www.linkedin.com/company/kiosk-information-systems"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Louisville",
        "region": "CO",
        "postal_code": "80027",
        "street_address": null,
        "latitude": 39.96572,
        "longitude": -105.15234
    }
}