{
    "job": {
        "title": "Software Escalation Engineer",
        "industry": "Computer Networking,Computer Software,Computer &amp; Network Security",
        "description": "Description What We Do: Today the modern enterprise is an Enterprise of Things. We are on a mission to secure the Enterprise of Things with active defense by identifying, segmenting and enforcing compliance of every connected thing. In real time. And at scale. Our unified security platform enables enterprises and government agencies to focus on Zero Trust segmentation, IT/OT convergence and OT/ICS innovation, all supporting our mission and vision. Join us as we secure the world with our products. We are looking for resourceful and gritty individuals to collaborate as one team while ensuring a world-class customer experience. We are cyber-obsessed about addressing the world’s most challenging security problems. Innovation starts here, everyone’s ideas are valued, visionaries welcomed! What You Will Do If you are a great developer with passion for security and technology, come join Forescout’s R&D/Sustaining team of Software Engineers and take part in defining and driving the future world-wide market leading product suite consisting of: Network Access Control, Endpoint Compliance, Mobile Control, and Intrusion Prevention. Applications range from Client/Server applications to Web apps for a Network Access Control solution, running on both Windows and Linux systems. Duties involve analyzing customer escalation issues and to work with cross-functional teams (Development Engineering, Customer support and Account teams) to ensure smooth flow of information in resolving critical customer issues Provide technical leadership on the team as needed Development of new security features and maintenance of existing ones Handle the resolution of technical issues by doing the following: Analyze the available data to identify and narrow down root cause Investigate the technical issue Attempt or drive reproduction of customer issue in house Describe in detail the issue to support engineers or customers Identify and develop the software code changes to resolve it. Analyze and report defects on software to improve conformance, stability and supportability Understand customer network architecture and design and accordingly provide alternative solutions when applicable to achieve greater stability or performance Provide technical leadership to internal teams Mentor other Engineers on techniques and methodologies of troubleshooting and supporting Forescout products and solutions Actively suggest and describe ways to improve the supportability of Forescout products Use Kanban development methodology to deliver on tasks Familiar with Atlassian tool set, including Jira, Confluence, etc. What You Bring To Forescout Minimum of 5-10 years of experience in software development or sustaining engineering preferably in Network or Endpoint security Past technical leadership experience Deep knowledge of software engineering concepts and techniques. C/C++ experience Experience in Java programming Perl experience Linux/Unix development experience Linux system/environment experience (scripting languages, regular exp., awk, sed, etc.) Networking: Good understanding of TCP/IP Knowledge in protocols (DNS, SMTP, SNMP, DHCP, 802.1 x) Familiar with network equipment configuration (Switch, Router, Firewall) Windows-based networks, domain management Low-level network monitoring and sniffing (Experience with sniffers) Personal Skills Strong communication – both written and spoken Ability to easily learn and apply new technologies Past technical leadership experience Excels in team environments Ability/Experience in customer interactions Ability to work independently when needed Highly motivated to succeed in current position Strong sense of urgency Education Bachelor’s degree in Computer Science or equivalent experience What Forescout Offers You Competitive compensation and benefits – we cover 95% of employee and dependents’ benefits premiums (US only), 401K match, generous PTO policy, and much more Collaborative and innovative environment – make an impact on worldwide security while working on the hottest technology Leadership that supports and encourages professional growth and development Want a glimpse of Life @ Forescout? Check us out on Facebook and Instagram Learn more at: www.forescout.com Forescout is proud to be an equal opportunity workplace dedicated to pursuing and hiring a diverse workforce.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-15T18:34:49.000Z"
    },
    "company": {
        "name": "Forescout Technologies Inc.",
        "link": "https://www.linkedin.com/company/forescout-technologies"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Dallas",
        "region": "TX",
        "postal_code": "75342",
        "street_address": null,
        "latitude": 32.777977,
        "longitude": -96.79621
    }
}