{
    "job": {
        "title": "Software Engineer, Integrations",
        "industry": "Computer Software,Internet,Financial Services",
        "description": "Pinwheel - Building a fairer financial system by unlocking API access to payroll systems. Pinwheel provides an API that makes it easy for any user to connect their payroll account to any app. By building pipes that connect payroll platforms to banks, lenders, and other service providers, we hope to help underserved consumers gain equitable access to financial services when they need it most, while sparking innovation of new financial products. Financial institutions often rely on traditional credit scoring systems that look at a consumer's past behavior and limited demographic data. More than half of Americans have a poor credit score or no score at all, and 78% live paycheck to paycheck. Without access to affordable financial products, they resort to high-interest credit cards, payday loans, and trigger overdraft fees to make ends meet — which ultimately push them into deeper cycles of debt. At Pinwheel, we believe that unlocking API access to payroll systems helps build towards a fairer financial system. Most people's money can be traced back to a payroll system (e.g., ADP, Paychex, Gusto) — meaning those systems sit at the top of the financial stack and harbor a wealth of income and employment data, and tapping into them offers limitless possibilities. Here are just a few ways Pinwheel's solution helps our customers and their end users: Enable real-time, seamless direct deposit switching within a bank's UX, driving LTV and account profitability for banks, and giving users control over where their paycheck goes Let consumers share their income and employment data directly with lenders, no paperwork required — speeding up the process and delivering the high quality data lenders need in real time Allow borrowers to repay their loans directly from their payroll — massively de-risking loans for lenders and allowing customers to access fairer interest rates What are we looking for? We are looking for skilled engineers to join our integrations engineering team. This team is responsible for the core business function of building and maintaining code that interacts with hundreds of different platforms and payroll providers. If you're the type of person that loves to make your own tools that mash together different data sources, you'll be a good fit. What you will be doing? Writing new integrations that range from implementing well-documented APIs to enabling clean data access on otherwise tricky, undocumented or unfriendly systems. Monitoring and supporting live integrations to keep them healthy and up to date as platforms change and evolve. Working and growing with a team of engineers from different backgrounds and collaborating cross-functionally with product management and operations teams. What skills are necessary? Python proficiency (or transferrable scripting language experience). A decent grasp of how the web works (HTTP, webservers, etc.) Experience with processing, manipulating, and cleaning data. BS in Computer Science, Information Sciences or similar. 1-2 years of industry experience. Why join Pinwheel? Best Time to Join - Our company is small but well-funded, meaning you get the upside of starting on the bottom floor with minimal risk. Be a Cultural Founder - You will have an active hand in molding the company culture and being a part of the entrepreneurial journey. Build Something Revolutionary - Help build the consumer data infrastructure of the future. Compensation & Benefits Starting Salary - $90,000 Benefits - Full medical, dental and vision benefits. Unlimited vacation and sick days. 401K plan. Snacks delivered monthly. And so much more!",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-10T05:16:02.000Z"
    },
    "company": {
        "name": "Pinwheel",
        "link": "https://www.linkedin.com/company/pinwheelhq"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 12,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "New York",
        "region": "NY",
        "postal_code": "10132",
        "street_address": null,
        "latitude": 40.713047,
        "longitude": -74.00723
    }
}