{
    "job": {
        "title": "Software Engineer",
        "industry": "Health, Wellness and Fitness,Medical Practice,Hospital &amp; Health Care",
        "description": "Location:Alpharetta Georgia USA, Atlanta Georgia USA, USA USA Remote, Weston Florida USA Function:Software & Product Development Ref #:Description & Requirements Description Collaborate with members of the team to solve challenging engineering tasks on time and with high quality Engage in daily code reviews and training of team members Support continuous deployment pipeline code Situationally troubleshoot production issues alongside the support team Build and integrate features for our enterprise software solution using the latest .Net, Angular, SQL Server, and MongoDB technologies Work productively in a devops environment using Docker, Concourse, and Google Cloud Platforms (GCP) Actively communicate with team members to clarify requirements and overcome obstacles to meet the team goals Use open source and other technologies and languages outside of the .Net framework if the need arises Develop groundbreaking solutions to improve the performance, scalability, and distributed processing capabilities of the system Provide troubleshooting and root cause analysis for production issues that are escalated to the engineering team Work with development teams in an agile context as it relates to software development, including test driven development, automated unit testing and test fixtures, and pair programming Qualifications 3-5 or more years' experience as a key developer on enterprise projects Software development experience including: Object-oriented programming (OOP), concurrency programming, design patterns, RESTful service implementation, Service Oriented Architecture, Test-Driven Development, Acceptance Testing Experience using and building tools to automate the deployment of an enterprise software solution to the cloud Strong object-oriented design experience Knowledge of design patterns and their implementation Multi-tier application design and development Excellent problem solving skills (Experience, Education, Certification, License and Training) C#, .Net Core, .Net Framework AngularJS Event-Oriented Architectures Distributed Systems and Concurrency Programming Kafka, RabbitMQ, or similar eventing platform MongoDB or other NoSQL database SQL Server Experience with Docker, Kubernetes Continuous Integration/Continuous Deployment (CI/CD) frameworks such as TeamCity, Concourse, CircleCI, or Jenkins Cloud development experience using GCP Automation testing tools (Selenium, xUnit, mocking frameworks) Bachelor's degree in Computer Science or Engineering; equivalent experience accepted Corporate overviewHere at UKG, Our Purpose Is People. UKG combines the strength and innovation of Ultimate Software and Kronos, uniting two award-winning, employee-centered cultures. Our employees are an extraordinary group of talented, energetic, and innovative people who care about more than just work. We strive to create a culture of belonging and an employee experience that empowers our people. UKG has more than 13,000 employees around the globe and is known for its inclusive workplace culture. Ready to be inspired? Learn more at EEO Statement Equal Opportunity Employer Ultimate Kronos Group is proud to be an equal opportunity employer and is committed to maintaining a diverse and inclusive work environment. All qualified applicants will receive considerations for employment without regard to race, color, religion, sex, age, disability, marital status, familial status, sexual orientation, pregnancy, genetic information, gender identity, gender expression, national origin, ancestry, citizenship status, veteran status, and any other legally protected status under federal, state, or local anti-discrimination laws. View The EEO is the Law poster and its supplement. View the Pay Transparency Nondiscrimination Provision UKG participates in E-Verify. View the E-Verify posters here. Disability Accommodation For individuals with disabilities that need additional assistance at any point in the application and interview process, please email or please call 1 .",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-11T23:51:32.000Z"
    },
    "company": {
        "name": "Resume-Library",
        "link": "https://www.linkedin.com/company/resume-library"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Alpharetta",
        "region": "GA",
        "postal_code": "30022",
        "street_address": null,
        "latitude": 34.075615,
        "longitude": -84.29455
    }
}