{
    "job": {
        "title": "Software Development Engineer",
        "industry": "Information Technology and Services,Computer &amp; Network Security,Computer Software",
        "description": "Job Description Responsibilities ： Work with the Product Management teams on the product roadmaps, new features design, and product certifications. Work with R&D and QA throughout the product development lifecycle. Develop pre- and post-sales tools and environments. Research new technologies and trends to be familiar with and be able to devise new solution. Requirements ： B.S. in Computer Science or Electrical Engineering; M.S. preferred. Proficient in C language, proficient in development tools and environments under LINUX, such as gcc gdb libc, etc., able to understand GNU Makefile. Deep knowledge of the HTTP/HTTPS protocol. Familiarity with network firewalls, IDS/IPS, VPN, security consulting, SSL, IPsec. Familiarity with common Web Authentication protocols, like NTLM, HTTP Basic, Radius, LDAP. Experience with common web servers and proxies (like Nginx/Apache/Haproxy). Understanding of Web application vulnerabilities, OWASP top 10. Extensive experience in a pre- and post-systems engineering. Experience with containers and Kubernetes. High self-learning abilities. #GD About Us Fortinet (NASDAQ: FTNT) secures the largest enterprise, service provider, and government organizations around the world. Fortinet empowers its customers with intelligent, seamless protection across the expanding attack surface and the power to take on ever-increasing performance requirements of the borderless network - today and into the future. Only the Fortinet Security Fabric architecture can deliver security features without compromise to address the most critical security challenges, whether in networked, application, cloud or mobile environments. Fortinet ranks number one in the most security appliances shipped worldwide and more than 450,000 customers trust Fortinet to protect their businesses. We are committed to providing reasonable accommodations for all qualified individuals with disabilities. If you require assistance or accommodation due to a disability, please contact us at accommadations@fortinet.com. Fortinet is an equal opportunity employer. We value diversity in our company, and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, or any other applicable legally protected characteristics in the location in which the candidate is applying.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-09-12T04:40:46.000Z"
    },
    "company": {
        "name": "Fortinet",
        "link": "https://www.linkedin.com/company/fortinet"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Sunnyvale",
        "region": "CA",
        "postal_code": "94089",
        "street_address": null,
        "latitude": 37.373676,
        "longitude": -122.036575
    }
}