{
    "job": {
        "title": "Senior Software Engineer (.NET)",
        "industry": "Accounting,Financial Services,Information Technology and Services",
        "description": "Are you passionate about .NET technology? Are you a team builder, a team player, a leader extraordinaire? Do you find yourself constantly looking for ways to do better, be better and build better software? If yes to all, we would like to talk to you! Responsibilities: Design, develop and deliver code that is necessary to support new feature developments and enhancements in an agile environment Work closely with our derivative and risk teams to integrate best practices in the development of analytical tools and processes. Work extensively with large data sets and have the ability to optimize and create efficient data models and SQL queries for performance. Interface with 3rd party data vendors to consume 3rd Party APIs Effectively communicate and document the application architecture, utilizing industry standards as part of a team. Deliver unit tests with all code to prove correctness, robustness, and scalability Qualifications: A minimum of 5 years software development experience Experience with REST API, Web APIs, RESTFUL Web Services Experience with C#, MS SQL, JavaScript Strong experience in one or more of the following technologies: ASP.NET MVC, Web API Experience with modern UI web development i.e. , Angular, Typescript Strong experience with SQL Server and database design Knowledge of GPU/CUDA programming and programming for and deploying applications on the cloud is preferred. Knowledge of SOLID principles is preferred Salary: $115.000 - $125,000",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-24T01:11:36.000Z"
    },
    "company": {
        "name": "Allied OneSource",
        "link": "https://www.linkedin.com/company/allied-onesource"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "West Des Moines",
        "region": "IA",
        "postal_code": "50265",
        "street_address": null,
        "latitude": 41.575504,
        "longitude": -93.71303
    }
}