{
    "job": {
        "title": "Data Scientist",
        "industry": "Environmental Services,Information Technology and Services,Staffing and Recruiting",
        "description": "Mackin Talent is seeking a Data Scientist to support our client in Seattle, WA. The main function of this role is to produce innovative solutions driven by exploratory data analysis from complex and high-dimensional datasets. Responsibilities Apply technical expertise with quantitative analysis, machine learning, data mining, experimentation, simulation, and the presentation of data to develop strategies for our products. Identify and measure success of product efforts through goal setting, forecasting, and monitoring of key product metrics to understand trends. Define, understand, and test opportunities and levers to improve the product, and drive roadmaps through your insights and recommendations. Generate and test hypotheses and analyze and interpret the results of product experiments. Partner with Product, Engineering, and cross-functional teams to inform, influence, support, and execute product strategy and investment decisions. Provide Business Intelligence (BI) and data visualization support. Minimum Requirements Proficient with data querying languages (e.g. SQL). Experience with scripting languages (e.g. Python), and/or statistical software (e.g. R)\u2028. Effective communication, able to convey complex information and influence your partners using clear insights and recommendations. Experience working with large datasets. Masters or Ph.D. Degree in a quantitative field. Years of experience - 2 years for Masters, 0-1 year for PHD Mackin Talent offers an attractive benefits package which includes choice of major medical carriers like Aetna, Kaiser and BCBS, 15 days of PTO plus Holiday and Sick pay, paid volunteer hours, paternity/maternity leave and many more. We pride ourselves on our company values, the top one being that Relationships Matter. Come experience the Mackin Difference and our welcoming company culture with a focus on teamwork and family. Learn more about Mackin and apply online at MackinTalent.com.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-09-01T06:49:08.000Z"
    },
    "company": {
        "name": "Mackin Talent",
        "link": "https://www.linkedin.com/company/mackintalent"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Seattle",
        "region": "WA",
        "postal_code": "98133",
        "street_address": null,
        "latitude": 47.60323,
        "longitude": -122.33028
    }
}