{
    "job": {
        "title": "Test Engineer - RF",
        "industry": "Computer Software,Automotive,Telecommunications",
        "description": "yöu top 5 reasöns This position is currently a temporary work from home/remote position. You must be willing to relocate to Morristown, NJ or Irvine, CA USA once COVID policies/restrictions are lifted. üs umlaut is a 4500+ people strong global full-service cross industry end-to-end partner that applies its deep-running interdisciplinary, collaborative advisory and fulfilment capabilities to change its clients fortunes for the better and - on top of that - add value, quality and focus to their organisations and produce. our öffer Perform RF Interference Hunting operations, including identification and mitigation of sources all over the U.S. Perform Passive Intermodulation (PIM) tests and repair base stations Identify source of radio frequency interference Operate and maintain your measurement instruments, tools, and vehicle Identify and plan routes in concert with Interference Hunting management Work closely with senior engineers at the nation’s biggest carriers to solve interference issues Drive obligations to successful closure, balancing a “getting it done” attitude combined with “doing it right the first time” Develop visually compelling presentations of your results Report project status, action items and next planned steps on a regular basis Bachelor's degree in Electrical Engineering, Telecommunications, Computer Science, or equivalent Proficient with a spectrum analyzer, and PIM test tools Knowledge of RF technology, radio propagation, and cellular technologies. Experience in the physical setup of cellular base stations Proficient in computer applications including databases, spreadsheets, and word processing Proficient in MS Power Point Must be technically sound, detail oriented with strong troubleshooting skills Able to work independently Comfortable in a multi-cultural environment Ability to handle short deadlines and ad-hoc travel schedules Willingness to work weekends and holidays if needed Travel up to 90% is expected both domestic and international An entrepreneurial environment with immediate responsibility and a chance to make a difference from the word go Innovative projects with big name clients and exposure to future, cutting edge technologies Unlimited individual growth opportunities and the ability to create a personalised career path Access to a global network with opportunities to live and work abroad All the support, training and coaching you need to further your career +X. A team spirit and family-like culture as exciting and colourful as our gradient coloured coffee marshmallows",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-09-08T03:09:17.000Z"
    },
    "company": {
        "name": "umlaut company",
        "link": "https://de.linkedin.com/company/umlaut-company"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Irvine",
        "region": "CA",
        "postal_code": "92717",
        "street_address": null,
        "latitude": 33.68591,
        "longitude": -117.82472
    }
}