{
    "job": {
        "title": "Junior Full-Stack Software Engineer",
        "industry": "Hospital &amp; Health Care",
        "description": "Brio’s mission is to make diagnostic testing valuable for all and to become the largest provider of diagnostic laboratory testing in the world. We believe that the 21st century will be defined by advances in healthcare and biology. We intend to accelerate that future. Today, Brio empowers employers to test their teams proactively and on their terms, and gain the insights they need to understand in order to keep employees safe and manage risk. While currently focused on the immediate need for B2B COVID testing amidst the global pandemic, our vision is to create a modern and decentralized diagnostic system that addresses the inefficiencies and shortcomings of the >$150bb diagnostic testing market. This is a rare opportunity to get involved in solving a truly meaningful problem with massive scale. The product is up and running, our growth is unprecedented, and there is still a ton of room to make your mark as an early member of the team. We are fully remote, with a center of gravity around Boston, MA where we were founded. You You get excited about challenges, fast-changing environments and problems with no clear solution. You are opinionated, but equally open to the opinions of others. You value extreme ownership, attention to detail, and relish disambiguation. Solving problems nobody has tackled before in an environment where the landscape is shifting daily is your idea of fun. You are eager to contribute to our business and culture, not just our code base. The Current Stack Python 3, Flask, PostgreSQL, and Redis, running on AWS. Server-rendered HTML via Jinja, with Javascript and PostCSS, moving towards React. Responsibilities Be comfortable across the stack from devops to back-end and front-end code, with a passion and strength in at least one zone. Follow right-sized processes for development, QC, and release, and be an advocate for evolving them as the company grows. Keep the data of our users and partners safe through secure code, secure infrastructure, and secure processes. Work with the team to define and achieve delivery schedules. Contribute to technical specs and plans. Collaborate across BRIO with product management, customer support, sales, and others to deliver the best possible experience to our customers. Make a big impact in the company, on the world. Basic Qualifications 1+ years of experience with web-technology coding on a deployed commercial software product. Live experience with back-end development, architecture, and deployment. Some demonstrable experience with our current tech stack frameworks and technologies - AWS, Python, PostgreSQL, JavaScript Understanding of creating secure API interfaces, ACL’s, etc. Ability to communicate technical concepts to non-technical people Output oriented with a bias for action. Bonus Points Experience working on remote teams. Experience in high-criticality / high-stakes industries like health, finance, aerospace. Experience working in a seed-stage, high growth startup environment. Passion for or working knowledge of health, wellness or biology-related topics. Knowledge of security and regulatory frameworks like HIPAA and ISO 27001 Fire in your belly with a need to be extremely challenged every day. Benefits And Perks We are currently covering 100% of premiums for health, vision, and dental Health Reimbursement Account 401k Unlimited PTO Paid sick days Paid holidays Home office improvement stipend Monthly mystery chocolate box Equity and performance based pay options Company Culture Brio’s mission is to increase the impact of diagnostic testing by making it more accessible and valuable to more people. Our core values as a company are devotion, responsibility, fearlessness, and curiosity. Brio is an equal opportunity employer that recruits, employs, trains, compensates and promotes regardless of race, religion, color, national origin, sex, disability, age, veteran status, and other protected status. Individuals and teams with different backgrounds and experiences foster diverse ideas, which brings universal perspectives to universal problems. So if we want to create a world with equitable healthcare, we need to employ and partner with people who represent the world as it is. At Brio, diversity is not just something we believe in, it is a part of our DNA. It makes us unique and it makes us successful. We are interested in every qualified candidate who is eligible to work in the United States. Unfortunately, we currently do not sponsor visas. Commitment This is a full-time position (40+ hours per week). This position is fully remote and can be performed from anywhere in the U.S.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-10-16T04:40:26.000Z"
    },
    "company": {
        "name": "Brio Systems",
        "link": "https://www.linkedin.com/company/briosystems"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 12,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "United States",
        "region": null,
        "postal_code": "99999",
        "street_address": null,
        "latitude": 39.50355,
        "longitude": -99.0183
    }
}