{
    "job": {
        "title": "Data Scientist - Python/SQL - 100% Remote!",
        "industry": "Information Technology and Services,Computer Software,Financial Services",
        "description": "If you are a Data Scientist with experience, please read on! Job Title: Data Scientist Location: 100% Remote! Salary: $150+ Flexible - To Be Adjusted Based on Experience Requirements: Bachelors degree with 5 years experience with data analysis This would be an amazing opportunity for you if you are looking for a dynamic team that is growing! Additional ways in which a candidate may stand out would be: Machine Learning Strong Python experience What You Will Be Doing Collaborate with cross-functional stakeholders to identify questions and business challenges Determine plans of action in order to effectively define, design, and develop models and algorithms to derive insights Generate and test hypotheses and analyze and interpret the results Design, develop, and evaluate algorithms and ML models that lead to optimal value extraction from the data in order to support business process improvements Perform statistical and other ad-hoc analysis, and present results in a clear manner What You Need for this Position Proficiency with structured and unstructured data from disparate sources Python, SQL, common data science toolkits like Scikit-learn Knowledge of data management approaches such as relational databases, data schemas, object stores, column stores, etc. Strong working knowledge of application of statistics, programming, data modeling, simulation, and mathematics to business questions for data analysis Experience with ML modelling: model research, evaluation, interpreting results, feature engineering Experience with cloud-based machine learning platforms: AWS, GCP, and Azure What's In It for You Vacation/PTO Medical Dental Vision 401k So, if you are a Data Scientist with experience, please apply today! Email Your Resume In Word To Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also: Jenn.Parrella@Optello.com Please do NOT change the email subject line in any way. You must keep the JobID: linkedin : JP10-1640876 -- in the email subject line for your application to be considered.*** Jenn Parrella - Lead Recruiter - Optello Applicants must be authorized to work in the U.S. Optello is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-14T05:03:32.000Z"
    },
    "company": {
        "name": "Optello",
        "link": "https://www.linkedin.com/company/optello-us"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Brentwood",
        "region": "TN",
        "postal_code": "37027",
        "street_address": null,
        "latitude": 35.995544,
        "longitude": -86.77889
    }
}