{
    "job": {
        "title": "Software Engineer-Python",
        "industry": "Financial Services,Information Technology and Services,Information Services",
        "description": "Job Description The ECS Analytics team within Fidelity’s Enterprise Cyber Security (ECS) business unit is looking for a Data Engineer to join their team. The focus for this role will be to build data solutions such as data processing, data pipelines, data migration as well as deep knowledge of frameworks such as Hadoop. The team is tasked with driving the overall data strategy for ECS. The Team This team is made up of highly motivated and engaged associates, currently split across North America and India (Bangalore) that works in a fast-paced agile environment. The Expertise You Have Bachelor’s degree or equivalent experience required. Strong SQL skills and knowledge of one of more RDBMS Proven experience building data pipelines using variety of tools including but not limited to Informatica, Python, Shell script, Hadoop (Sqoop/Pig/Hive/Impala). Proficiency working with Python specifically as it relates to data processing. At least 2 years of recent working experience. Exposure and/or understanding of AWS/Snowflake data lake. Ability to work independently to bring tasks/stories to completion. The Skills You Bring You are self-driven and highly motivated. You are a quick learner. Passionate about technology. You love working with data and are confident in your SQL skills Proven expertise in building data pipelines Proficiency in Python in a professional environment for at least one year Proven ability to work independently to bring tasks/stories to completion. The Value You Deliver Developing end-to-end solutions using technologies listed above Finding innovative solutions to old problems Being an inspiring leader Certifications Company Overview At Fidelity Investments, our customers are at the heart of everything we do. As a privately held company with a rich 75-year history, our mission has remained the same since our founding: to strengthen the financial well-being of our clients . We help people invest and plan for their future. We assist companies and non-profit organizations in delivering benefits to their employees. And we provide institutions and independent advisors with investment and technology solutions to help invest their own clients’ money. Join Us At Fidelity, you’ll find endless opportunities to build a meaningful career that positively impacts peoples’ lives, including yours. You can take advantage of flexible benefits that support you through every stage of your career, empowering you to thrive at work and at home. And you don’t need a finance background to succeed at Fidelity—we offer a range of opportunities for learning and growth so you can build the career you’ve always imagined. We welcome associates from different backgrounds and with different perspectives to help us innovate and make a difference for our customers and our communities. We invite you to Find Your Fidelity at fidelitycareers.com. Fidelity Investments is an equal opportunity employer. We believe that the most effective way to attract, develop and retain a diverse workforce is to build an enduring culture of inclusion and belonging. Fidelity will reasonably accommodate applicants with disabilities who need adjustments to participate in the application or interview process. To initiate a request for an accommodation, contact the HR Leave of Absence/Accommodation Team by sending an email to accommodations @fmr.com, or by calling 800-835-5099, prompt 2, option 2.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-17T07:13:27.000Z"
    },
    "company": {
        "name": "Fidelity Investments",
        "link": "https://www.linkedin.com/company/fidelity-investments"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Westlake",
        "region": "TX",
        "postal_code": "76299",
        "street_address": null,
        "latitude": 32.99391,
        "longitude": -97.19771
    }
}