{
    "job": {
        "title": "Data Analyst (Growth)",
        "industry": "",
        "description": "About Cheetah Restaurants and small businesses account for hundreds of billions of dollars in annual purchasing, yet most of it happens offline. From the humblest NYC slice and a cup of joe to museum-quality lattes (and yes, avocado toast), each order represents a long paper trail and a series of truck deliveries. With a rapidly growing market presence, Cheetah is already streamlining the daily workflow of hundreds of restaurants and small business owners. Using Cheetah’s services, they manage millions of dollars in monthly purchasing, while Cheetah eliminates the burden of costly sales reps and inflexible, inefficient distribution centers. Partnering with the largest suppliers in the US, Cheetah is bringing the Silicon Valley user experience to an industry that hasn’t evolved in decades. In the process, we’re helping to reintroduce the small business owner to the small farmer, global supply chains to familiar faces, and delivery and logistics workers to increased mobility and new opportunities. At Cheetah, a relentless executive team has set out to change this reality, armed with deep industry and entrepreneurial experience, personal conviction, and $70M in funding from Eclipse, Floodgate, and the early backers of Facebook, Lyft and Airbnb. Unencumbered by the old-school business models and practices, Cheetah has introduced unprecedented transparency in pricing and inventory to the SMB marketplace. In doing so, Cheetah allows the people who form the backbone of local economies to focus on what they love: cooking great food and providing excellent service. From the convenience of their phones, business owners can now order whatever they need, discover new, rare or seasonal specialty products, and prioritize their customers. No more rushing to unload your double-parked van, or waiting anxiously for a truck to show up with your weekly allotment of boxes. Data Analyst (Growth) Cheetah is looking for a data analyst with experience in market growth and customer behavior analytics. This function is vital to the long-term success of the company and enables Cheetah to meet the needs of existing customers while also identifying/prioritizing new markets and cuisines. In this role, you will dive into data ranging from event-based app usage to item-level order details and extract behavioral patterns. You’ll define core growth KPIs (e.g. retention, basket penetration, etc.) and set up tools to track them. You’ll work closely with a range of stakeholders, from Marketing/Sales to Procurement to executive management. Responsibilities Define and collect relevant data to perform further analyses on growth opportunities. Apply data and analytic skills to help understand how customers use our products – e.g. learning how to extract deep interests and tendencies from event streams. Drive cohort analyses to understand customer behavior and identify opportunities for improving our product(s), customer retention and churn. Work with the sales team to identify and prioritize customer leads in light of market location and cuisine, and work with the supply chain team to ensure we have sufficient inventory for new customers. Work with the executive team on seeding markets for expansion, identifying the key targets / geographies. Collaborate with data and business intelligence teams to develop reports and visualization dashboards. Build financial models to project key business metrics - traffic, conversion, engagement - and develop KPIs to track performance. Qualifications 3+ years of professional experience in business or product analytics, or comparable position, handling large, complex, human behavior data sets. Proven track record in solving business problems using data-driven and scientific methods. Experience using SQL to access and analyze data. Strong data visualization and Python/R skills are a plus. Understanding of statistics, e.g., hypothesis testing, etc. Strong speaking, writing, and presentation skills, as well as the ability to persuade, inspire, and motivate others. Must have the ability to summarize key insights for both technical and non-technical audiences. Benefits and Perks Flexible working schedule / location Company happy hours, team building events, and intramural sports teams Unlimited paid time off Comprehensive medical/dental/vision insurance and commuter benefits 401(k) plan and flexible spending benefits The opportunity to work alongside a visionary team during Cheetah’s rapid growth!",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-20T22:36:14.000Z"
    },
    "company": {
        "name": "Cheetah",
        "link": "https://www.linkedin.com/company/gocheetah"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Pleasanton",
        "region": "CA",
        "postal_code": "94588",
        "street_address": null,
        "latitude": 37.658436,
        "longitude": -121.877
    }
}