{
    "job": {
        "title": "Software Engineer I",
        "industry": "Banking,Financial Services",
        "description": "Job Description At Bank of the West, our people are having a positive impact on the world. We’re investing where we feel we can make the most impact, like advancing diversity and women entrepreneurship programs, financing for more small businesses, and promoting programs for sustainable energy. From our locations across the U.S., Bank of the West is taking action to help protect the planet, improve people’s lives, and strengthen communities. We are part of BNP Paribas, a global leader supporting the UN Sustainable Development Goals (SDGs). Yes, we’re a bank, but as the bank for a changing world, we are continually seeking to improve the ways we help our customers, while contributing to more sustainable and equitable growth. Job Description Summary Contributes to the development, modification, testing, adaption, and/or implementation and post implementation support of short- and long-term software solutions to business and technology needs. Reviews system requirements and business processes; codes, tests, debugs and implements software solutions. Works independently in a fast paced environment on moderately complex issues. Essential Job Functions Provides software development services typically in a defined moderately complex project Conducts a wide range of moderately complex quality control tests and analyses to ensure that software meets or exceeds specified standards and end-user requirements Reviews system requirements and business processes; codes, tests, debugs and implements software solutions. Makes recommendations on process improvements Determines software design requirements Reviews software policies, standards and procedures and make recommendations for change. Leads users in the planning of user acceptance testing, alpha and beta testing Creates test data files with valid and invalid records to thoroughly test program logic and verify system flow Manage environments, Implement/Deploy software upgrade to various environments and support post implementation. Other Job Duties Creates Conceptual approach, Estimation, Detailed design, Software Deployment Guide, Supplemental or non functional specification Defines and documents software installation and configuration processes. Coordinates and communicates applications support activities with key stakeholders Reviews platform requirements and coordinates with vendors and other IT groups in building/maintaining hardware, 3rd party software, patches and network related components to comply with IT standards and procedures. Performs other duties as assigned. Job Qualifications Required Experience Requires practical knowledge of job area typically obtained through advanced education combined with experience. Requires 3 years minimum prior relevant experience. Education Bachelor's Degree Full Stack Engineering Performs low difficulty development with guidance using Agile methodologies including Scrum or Kanban SDET Tests using Agile methodologies including Scrum or Kanban or other SDLC methodologies Create automation test strategies Develop and execute automated tests of moderate complexity and difficulty Supports POCs, installation, configuration, and maintenance of shared Testing tools and frameworks With minimal guidance will create test utilities and tool connectors in support of creating/maintaining automation frameworks Execute performance and load testing strategies Understands CI/CD processes, DevOps practices and full-stack methods and has the ability to test, debug, and code Solid technical competency in an Object Oriented Programing language Equal Employment Opportunity Policy Bank of the West is an Equal Opportunity employer and proud to provide equal employment opportunity to all job seekers without regard to any status protected by applicable law. Bank of the West is also an Affirmative Action employer - Minority / Female / Disabled / Veteran. Bank of the West will consider for employment qualified applicants with criminal histories pursuant to the San Francisco Fair Chance Ordinance subject to the requirements of all state and federal laws and regulations. Primary Location United States-Arizona-Tempe Job Technology Job Posting Sep 1, 2021, 8:27:58 PM",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-09-02T05:20:22.000Z"
    },
    "company": {
        "name": "Bank of the West",
        "link": "https://www.linkedin.com/company/bank-of-the-west"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Tempe",
        "region": "AZ",
        "postal_code": "85280",
        "street_address": null,
        "latitude": 33.42552,
        "longitude": -111.94125
    }
}