{
    "job": {
        "title": "Software Engineer",
        "industry": "Government Administration,Information Services,Information Technology and Services",
        "description": "We are looking to recruit a Software Engineer The Role To review, analyze, and modify programming systems including encoding, testing, debugging, and installing application systems to support the needs of the Department. The Ideal Candidate Will consult with users to identify current operating procedures and to clarify program objectives. Must be familiar with a variety of the field's concepts, practices, and procedures, have extensive experience and judgment to plan and accomplish goals. Will be required to perform tasks which include: Assisting with issues and remaining development related to the WebSphere Liberty 9 / Power BI Release Assisting with Redesign the Provider Liability Account (PLA) interface and redesign the recovery of the Personal Support Worker (PSW) PLA. Supporting the enhancement of the Provider page, PSW page and Electronic Visit Verification (EVV) to help track required training for PSWs Facilitating the creation of capability for CMEs to upload claims for Rationed Fee for Service (RFFS) billing Facilitating the transfer of the concepts and enhancements to existing team members to enable them to provide ongoing support Providing consultation to senior leadership and helping with items in the Backlog to include Critical Priority Bugs and Enhancements Skill and Experience: Experience with eXPRS application Expert-level knowledge and experience with WebSphere Liberty 9 and Java 11 Expert understanding of IBM DB2 UDB systems and concepts Proficient with Eclipse IDE Liberty 9 Plug In, Git source control concepts Excellent communication skills Highly skilled Java developer Qualification: Bachelor's degree in Computer Science or Information Technology or related field. 6+years of equivalent experience in the field or a related area.",
        "employment_type": "CONTRACTOR",
        "date_posted": "2021-08-16T15:51:19.000Z"
    },
    "company": {
        "name": "GeekSeatUSA",
        "link": "https://www.linkedin.com/company/geekseatusa"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 72,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Salem",
        "region": "OR",
        "postal_code": "97311",
        "street_address": null,
        "latitude": 44.939014,
        "longitude": -123.03931
    }
}