{
    "job": {
        "title": "Senior .NET Developer (Remote)",
        "industry": "Information Technology and Services,Computer Software,Financial Services",
        "description": "This position is remote but we would like someone located in Minnesota- Job Title: Senior Software Engineer Salary: $120k - $130k DOE + Bonus + 401k/Benefits Job Location: Remote - Must be located in Minnesota Requirements: 5-10+ years as a software engineer with a good focus in C#/ASP.NET We are a fast growing cloud based self storage management software and payment processing company. We have been in business for 20+ years and current scaling up our engineering team. If you are a senior software engineer with good experience using C# / .NET, please apply today. Top Reasons to Work with Us Work Remote Competitive salary ($120k - $130k) Strong PTO package Dynamic and exciting work environment Stable yet growing organization w/ great track record of growth and strong tenure and employee retention Excellent health and medical benefits for individuals and families Opportunity to work both independently and part of a larger team with various levels of responsibilities What You Will Be Doing New product development using C#/ASP.NET Contribute to all phases of SDLC Improve and monitor existing cloud infrastructure Be a team player / laugh and have fun / strive to get better What You Need for this Position 5-10+ years software development C# ASP.NET JavaScript MVC SQL CI/CD tools such as TeamCity or Azure DevOps is a plus BS in CS (or related) is preferred but not required So, if you are a Senior .NET Developer (Remote) with experience, please apply today! Email Your Resume In Word To Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also: Danny.Herries@Optello.com Please do NOT change the email subject line in any way. You must keep the JobID: linkedin : DH1-1628769 -- in the email subject line for your application to be considered.*** Danny Herries - Lead Recruiter - Optello Applicants must be authorized to work in the U.S. Optello is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-31T07:11:02.000Z"
    },
    "company": {
        "name": "Optello",
        "link": "https://www.linkedin.com/company/optello-us"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 120,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Minneapolis",
        "region": "MN",
        "postal_code": "55440",
        "street_address": null,
        "latitude": 44.977486,
        "longitude": -93.264366
    }
}