{
    "job": {
        "title": "Senior Software Development Engineer in Test",
        "industry": "Computer Software,Insurance,Financial Services",
        "description": "Job Overview Applied Systems, Inc., a worldwide leader in insurance technology, is currently searching for a Senior Software Development Engineer in Test (SDET) to join our corporate Quality Engineering Organization. In this role, you will be responsible for the development and maintenance of automated tests as we migrate to a microservices architecture. You will carry out various tasks to ensure our test approaches, both manually and automated, are effectively and efficiently designed, implemented, and maintained for both legacy and new development. You will leverage software engineering best practices to provide information, feedback, and expertise about software quality and development processes to deliver defect-free applications. You will work with a team of SDETs to ensure our test automation framework and platform is highly scalable and performant with a technical design that allows for future innovation without complete refactoring. RESPONSIBILITIES Exhibit strong hands-on knowledge in develop automated testing using modern software development and testing tools Ensure automated test design adheres to the overall company architecture and quality assurance principles Collaborate with team members across product, architecture, development, DevOps, and testing teams in designing automated testing approaches Promote and support implementation of CI/CT/CD pipeline Exercise fundamental good software engineering practice when developing automated tests, such as design/code reviews Maintain and enhance test automation frameworks for UI, Microservices & API Able to provide in-depth analysis to resolve technical issues, anticipate risks and ensure timely management escalation Provide automated test solutions to deliver for both functional and non-functional software quality Work with stakeholders to plan, estimate & implement test automation strategies Ensure compliance to automation framework, standards & best practices Facilitate automated, on-demand test automation metrics Maintain and update technical documentations relating to test architecture, design steps, integration processes or procedures. Participate in technical design meetings to ensure clear direction in areas of responsibilities Maintain test automation and defect tech debts in timely manner Seek stakeholder feedback via test automation demos Provide coaching and mentoring to junior SDET members Exhibits behaviors which exemplify Applied Systems’ Core Values QUALIFICATIONS FOR THIS JOB Have passion for shipping software that meets customers’ definition of quality 5+ years of software engineering & testing experience Bachelor’s Degree or equivalent experience in computer science, technology, or equivalent work experience 3+ years of hands-on experience in code development procedures, work processes and application systems with object-oriented programming such as C#, VB.Net , Java, Ruby, Python, or C++ as well as JavaScript, Typescript Experience working with SQL Server or other databases Extensive working knowledge with automated or manual testing, with UI and/or API layers, such as SOAP, REST/RESTful, web, mobile, and desk-top application testing In-depth knowledge of common automated testing tools, such as Cypress, Selenium, Katalon, etc. Working knowledge of microservices, cloud computing and related technologies, such as AWS, GCP, Azure, Kubernetes, Docker, Apigee Experience in constructing modern test strategies and quality gating policies within CI/CT/CD pipelines Has passion for continuous learning Strong work ethic and excellent problem-solving skills; strong logical reasoning and solution oriented Ability to work with others in a team-oriented environment is a must Positive and adaptable with multi-tasking in a continually changing environment Experience with Agile scrum and Kanban methodologies WHO WE ARE LEADING GLOBAL PROVIDER OF CLOUD-BASED INSURANCE SOFTWARE - Applied Systems develops the top two Insurance Agency/Broker Management software products in the world. In addition, we also provide innovative mobile apps, Data Analytics, Customer Self-Service, Insurer Connectivity & Rating, eServicing, Benefits Design, and CRM software products. By automating the insurance lifecycle, Applied’s people and products enable millions of people around the world to safeguard and protect what matters most. CLOUD SOLUTIONS & PROFESSIONAL SERVICES - We offer cloud solutions, implementation and education services, 24x7 technical support, and consulting services that are built specifically for our clients. AWARD WINNING TECHNOLOGY - We have been voted the 2019 Best Cloud-Based Software Solutions Provider in the insurance industry (2019 Corporate Excellence Awards), the 2019 Digital Service Provider of the Year (Corporate Insider) and are ranked #56 in the Cloud Top 500 report for the largest cloud application vendors in the world (Apps That Run the World). GOOGLE’S INVESTMENT IN APPLIED - Google/CapitalG made a minority investment in Applied that will spur AI, machine learning, and digital marketing innovation in the global insurance industry. CLIENTS - We provide technology to over 160k users within insurance agencies, brokerages, and carriers throughout the US, Canada, the UK, and Ireland. EMPLOYEES - Applied currently has 1,700+ employees across the US, Canada, the UK, and Ireland. COMPANY CULTURE & PERKS JOIN A GREAT TEAM - We believe that success comes from a dynamic working environment that offers professionals an opportunity to grow and succeed alongside extraordinary people. We encourage idea sharing, problem solving, and teamwork in our environment. RELAXED DRESS CODE - Applied allows for a relaxed dress code where jeans are permitted; we call this “Dress for your Day”! FUN PARTIES & PERKS - Fun perks are a staple at Applied, including holiday parties with games and contests, summer celebrations employee appreciation events, art contests, employee discount programs, free bagel and fruit on Tuesdays, and more! OPPORTUNITIES FOR ADVANCEMENT - We are a growing company that offers career opportunities, and not just “another job”. Applied believes in growing our employees and promoting from within, offering many opportunities for professional advancement along the way! CAREER STABILITY & LONGEVITY - Our average employee tenure is 14 years! CULTURE OF RECOGNITION - Applied provides a culture of employee recognition with our Circle of Excellence program, and our internal social network recognition program. APPLIED CARES - We have a culture that embraces and promotes volunteerism. Applied encourages our employees to help local charities and communities through the ‘Applied Cares’ program BENEFITS & REWARDS BENEFITS FROM DAY ONE - Applied offers Medical, Rx, Dental, Vision, Virtual Doctors’ Appointments, Health Savings Account, Flexible Spending Accounts, Critical Illness, Group Accident, and Wellness Incentives to ensure employees are covered from day one. FINANCIAL PEACE OF MIND - In addition to wellness benefits, Applied offers traditional and Roth 401k options, with employer match. Accidental Death & Dismemberment, Short and Long Term Disability, and Business Travel Accident insurance are also offered. WORKLIFE BALANCE - There is more to life than work: that is why Applied offers benefits to help balance your work and home life. We offer competitive paid vacation time, personal/sick time, paid holidays, paid parental leave, volunteer time off, and a free day off for your birthday! TO LEARN MORE Please visit AppliedSystems.com . Applied Systems welcomes and encourages applications from people with disabilities. Accommodations are available on request for candidates taking part in all aspects of the selection process.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-06-24T20:29:04.000Z"
    },
    "company": {
        "name": "Applied Systems",
        "link": "https://www.linkedin.com/company/applied-systems"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Atlanta",
        "region": "GA",
        "postal_code": "30355",
        "street_address": null,
        "latitude": 33.748547,
        "longitude": -84.3915
    }
}