{
    "job": {
        "title": "Software Engineer I",
        "industry": "Information Technology and Services,Computer Software,Financial Services",
        "description": "Join a team recognized for leadership, innovation and diversity Join a team that designs, develops and integrates highly complex software applications within Honeywell Aerospace. You will be an active and integral member of a team to achieve the completion of goals. You will also generate innovative solutions in work situations; trying different and novel ways to deal with problems and opportunities. Key Responsibilities Requirements and design Software architecture and coding Integration Certification Test Feature Definition Customer Support Verification and Validation YOU MUST HAVE Bachelors degree in Engineering or Computer Science US Citizen due to contractual purposes. WE VALUE Understanding various software development lifecycle Demonstrate the ability to develop efficient and high quality software Knowledge of software configuration management and change management practices Diverse and global teaming and collaboration Effective communicator Can quickly analyze, incorporate and apply new information and concepts Ability to consistently make timely decisions even in the face of complexity, balancing systematic analysis with decisiveness Ability to convey subtle or complex messages clearly, as appropriate for the topic and audience Ability to code in multiple languages Additional Information JOB ID: HRD131832 Category: Engineering Location: 1944 E Sky Harbor Circle,Phoenix,Arizona,85034,United States Exempt Early Career (ALL) Honeywell is an equal opportunity employer. Qualified applicants will be considered without regard to age, race, creed, color, national origin, ancestry, marital status, affectional or sexual orientation, gender identity or expression, disability, nationality, sex, or veteran status.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-23T00:00:00.000Z"
    },
    "company": {
        "name": "Honeywell",
        "link": "https://www.linkedin.com/company/honeywell"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Phoenix",
        "region": "AZ",
        "postal_code": "85009",
        "street_address": null,
        "latitude": 33.448204,
        "longitude": -112.072586
    }
}