{
    "job": {
        "title": "Site Reliability Engineer - Elk Grove, CA / Austin or Dallas TX / Denver, CO / Seattle, WA",
        "industry": "Consumer Electronics",
        "description": "Summary Seeking an experienced SRE responsible for engineering, upkeep, and automation of internet scale load-balancing and proxy services. Key Qualifications Strong knowledge of TCP, HTTP, DNS and SSL protocols Experience with distributed systems in a production operations environment Systems configuration management experience with automation tools such as Puppet, Chef, Ansible, or Salt Experience with programming and/or scripting languages (Python, Perl, Java, bash, Ruby) Systems monitoring experience with tools such as Nagios, Sensu, Zabbix, graphite Experience with devops tools, processes, and culture Experience with microservices/cloud platforms such as Kubernetes a plus Strong communication skills and ability to work effectively across multiple business and technical teams Troubleshooting of traffic flows at a deep level to find anomalies and to optimize performance Demonstrated ability to deliver results on time with high quality Description The Edge Traffic Delivery SRE team is a core engineering group with a mission of providing massively scaled load-balancing and proxy solutions to many of Apple's best known services.  We are passionate about design, implementation, and support of our cutting-edge products.  In addition to traffic engineering, we often work with encryption technologies, monitoring/alerting, cloud computing, automation, etc. We are looking for a motivated devOps engineer, who can work with internal customers, then ultimately engineer, deliver, and maintain sophisticated solutions.  Come join us and see what it means to \"Think Different\"! Education & Experience BS in Computer Science or equivalent experience Role Number: 200227180",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-16T08:27:56.000Z"
    },
    "company": {
        "name": "Apple",
        "link": "https://www.linkedin.com/company/apple"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Elk Grove",
        "region": "CA",
        "postal_code": "95757",
        "street_address": null,
        "latitude": 38.418133,
        "longitude": -121.39326
    }
}