{
    "job": {
        "title": "Software Engineer",
        "industry": "",
        "description": "Role: Software Engineer (Full-Time) Location: Cambridge, MA or Remote Compensation Structure: Cash + Equity + Benefits Application may be submitted by: Saturday, Aug 31, 11:59pm ET As a Software Engineer at MOLTEN, you will join our product team in the following areas: Take ownership of select modules - build, deploy and iterate upon them in Agile sprints Contribute to the design, architecture, research and development of MOLTEN’s core platform and applications (which may include aspects of data transmission, cryptography, back-end and front-end development) Test accuracy, performance and scalability to deploy robust systems for global user groups Incorporate user-centricity in the product, meet directly with users to collect requirements and feedback to continuously improve and optimize the user experience Collaborate with the business development team to best articulate and share the value proposition of your system to its users, and with our technology partners to design and integrate broader solutions As an ideal fit for this role , you are: Analytical: you have a rigorous academic background in engineering, math, physics or a similar field, and a proven ability to think original, train yourself on new skills and innovate to solve difficult problems. Entrepreneurial: you take ownership of your work, aren’t afraid to toss out bad designs and rethink a solution to a complicated problem. You aren’t afraid to ask for help when you need it and collaborate with your teammates to leverage their complementary skill sets. Organized : when things seem to get overwhelming for most people, you have the demonstrated ability to put things in perspective, prioritize your own workload, and deliver results. Evolutionary: you believe in equipping yourself with data and tools to constantly measure and improve. You are comfortable architecting changes on the order of days to months in the future, both in technical processes and in your personal growth. Qualifications: Bachelor's or Master's degree in Computer Science or equivalent education/experience Proficiency in Python, Javascript and MongoDB is expected. Experience in API documentation, Vue.js, and devops tools is a strength, but is not required 0 - 4 years' professional experience _____________ About us: MOLTEN empowers creators and rights-holders of media content through technological innovation. MOLTEN Cloud platform transforms and simplifies today's complex intellectual property rights, content and licensing operations. The platform is used by media organizations across all 6 continents to manage over 175M film/TV rights, hosting data and content for over 4% [per imdb] of all movies known to exist. This is just the beginning. Founded in the heart of MIT, MOLTEN is committed to breaking the barriers that hold digital creativity and media experiences back today. We are a diverse team of hackers, hustlers, and hipsters, and are backed by leading media-tech investors and advisors such as Jack Dorsey. Our culture: is about being rigorous at work and celebrating our big and small wins as a team. At MOLTEN, you will have the opportunity to own and lead your own workstreams, learn from exceptional individuals on the team, and help build technology that matters across the world. You will also have the opportunity and flexibility to drive your own professional growth from the Software Engineer position towards product management, devops, technical operations, or even business development as you gain deeper experience into our business. At present everyone on the team works remotely, but when the world gets back to normal, you will be able to work from our main office at Kendall Square, Cambridge, MA which is across the street from MIT. Here you will find endless snacks, a great office space and benefits (e.g. health, vision and dental insurance), but most importantly – a group of exceptional individuals building industry-defining tech. _____________ Consideration on a first-come-first-serve basis For more information please read molten.co",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-29T03:59:37.000Z"
    },
    "company": {
        "name": "MOLTEN",
        "link": "https://www.linkedin.com/company/molten-inc"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Cambridge",
        "region": "MA",
        "postal_code": "02239",
        "street_address": null,
        "latitude": 42.36525,
        "longitude": -71.10502
    }
}