{
    "job": {
        "title": "Senior Platform Engineer (Java)",
        "industry": "Computer Software",
        "description": "The Senior Software Engineer will work with the architects, leads, and fellow engineers to design, develop, implement, and deploy software architectural components and solutions for system-to-system integrations, cloud infrastructure provisioning automation, data integration pipelines, data modeling with high security, performance, and low total cost of ownership. What You Will Be Doing Design, develop, and implement API based system-to-system integrations Design, development and implement big data integration pipelines Source data ranging from traditional data warehouses, curated data sets in Data Lakes, and real-time streaming Implement cloud infrastructure lifecycle management automation leveraging Infrastructure as Code principles and framework on Azure QA test automation for functional and regression testing key product features and capabilities Partner with architects and tech leads to troubleshoot and resolve critical customer escalations on technical, stability, and performance issues What You Need for this Position Bachelors Degree or above in computer science or related field 5 years of enterprise SaaS/IaaS/PaaS full stack software development experience with focus on big data platform and analytics 3 years of Webservices/Microservices API development using Java plus Spring Boot, Python and Scala 2 years of Azure or AWS or GCP cloud services platforms 2 years of database development experience with any one of SQL Server, Oracle, MySQL, PostgreSQL, Cassandra, RedShift, or MongoDB Security-- In-depth understanding of user authentication and authorization with SSO, SAML, and OAuth; knowledge of data encryption DevOps -- hands-on experience with/modern CICD/automation/eco-systems such asAzure DevOps and/pipelines, Terraform, Azure Resource Manager, AWS Cloud Formation, Kubernetes, GitHub, and configuration management tools such as Puppet, Chef, or Ansible So, if you are a Senior Platform Engineer (Java) with experience, please apply today! Email Your Resume In Word To Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also: Kyle.Martin@CyberCoders.com Please do NOT change the email subject line in any way. You must keep the JobID: linkedin : KM3-1634426 -- in the email subject line for your application to be considered.*** Kyle Martin - Recruiting Manager - CyberCoders Applicants must be authorized to work in the U.S. CyberCoders, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-25T17:42:30.000Z"
    },
    "company": {
        "name": "CyberCoders",
        "link": "https://www.linkedin.com/company/cybercoders"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Campbell",
        "region": "CA",
        "postal_code": "95009",
        "street_address": null,
        "latitude": 37.28766,
        "longitude": -121.94243
    }
}