{
    "job": {
        "title": "Architect, Data",
        "industry": "Information Technology and Services,Computer Software,Financial Services",
        "description": "Job Description **This position can be located in Overland Park, KS; Frisco, TX OR Atlanta, GA** FinCo Visualization, Analytics, Data Engineering & Reporting (VADER) serves all of Finance as a provider of reporting and analytics around T-Mobile’s financial products (loans, leases, securitization) with a focus on: Automation Improved Timeliness and Accuracy of data Data Engineering services for complex processes Self-Service Empower users by removing roadblocks to information and insights Visualization and Analytics Deep dives into data, providing ad-hoc and recurring reconciliations Data visualizations that quickly tell a story We are looking for a savvy Data Engineer to join our growing team of analytics experts. The hire will be responsible for expanding and optimizing our data and data pipeline architecture, as well as optimizing data flow and collection for cross functional teams. The ideal candidate is an experienced data pipeline builder and data wrangler who enjoys optimizing data systems and building them from the ground up. The Data Engineer will support our report developers, database architects, data analysts and data scientists on data initiatives and will ensure optimal data delivery architecture is consistent throughout ongoing projects. They must be self-directed and comfortable supporting the data needs of multiple teams, systems and products. The right candidate will be excited by the prospect of optimizing or even re-designing our company’s data architecture to support our next generation of products and data initiatives. Functional Group Finance Location TX520-TX-Frisco II RBO Location Address 3560 Dallas Pkwy City Frisco State Texas Zip 75034 Other Locations Available Overland Park, KS; Atlanta, GA Travel Required? No Responsibilities Create and maintain optimal data pipeline architecture, Assemble large, complex data sets that meet functional / non-functional business requirements. Identify, design, and implement internal process improvements: automating manual processes, optimizing data delivery, re-designing infrastructure for greater scalability, etc. Build the infrastructure required for optimal extraction, transformation, and loading of data from a wide variety of data sources using SQL and AZURE technologies. Build analytics tools that utilize the data pipeline to provide actionable insights into customer acquisition, operational efficiency and other key business performance metrics. Work with stakeholders including the Executive, Product, Data and Design teams to assist with data-related technical issues and support their data infrastructure needs. Create data tools for analytics and data scientist team members that assist them in building and optimizing our product into an innovative industry leader. Work with data and analytics experts to strive for greater functionality in our data systems. Qualifications 5+ years of experience in a Data Engineer role, who has attained a Graduate degree in Computer Science, Statistics, Informatics, Information Systems or another quantitative field. Advanced working SQL knowledge and experience working with relational databases, query authoring (SQL) as well as working familiarity with a variety of databases. Experience building and optimizing data pipelines, architectures and data sets. Experience performing root cause analysis on internal and external data and processes to answer specific business questions and identify opportunities for improvement. Strong analytic skills related to working with structured or unstructured datasets. Build processes supporting data transformation, data structures, metadata, dependency and workload management. A successful history of manipulating, processing and extracting value from data files. Strong project management and organizational skills. Experience supporting and working with cross-functional teams in a dynamic environment. Experience with relational SQL databases, including Teradata, Oracle, SQL server. Experience with Azure cloud services. Experience with object-oriented/object function scripting languages: Python, Java, etc. Experience in a data analysis role Experience or working knowledge of SAS, Oracle APEX, Snowflake is a plus Minimum Qualifications At least 18 years of age. Legally authorized to work in the United States. High School Diploma or GED. Pre-employment background screen. Company Profile T-Mobile U.S. Inc. (NASDAQ: TMUS) is America’s supercharged Un-carrier, delivering an advanced 4G LTE and transformative nationwide 5G network that will offer reliable connectivity for all. T-Mobile’s customers benefit from its unmatched combination of value and quality, unwavering obsession with offering them the best possible service experience and undisputable drive for disruption that creates competition and innovation in wireless and beyond. Based in Bellevue, Wash., T-Mobile provides services through its subsidiaries and operates its flagship brands, T-Mobile, Metro by T-Mobile and Sprint. For more information please visit: http://www.t-mobile.com Applicant Privacy Policy We are committed to maintaining your trust by respecting and protecting your privacy. For more information about how T-Mobile processes the personal data of job applicants, please visit Applicant Privacy Policy . EOE Statement Equal Employment Opportunity We take equal opportunity seriously—by choice. T-Mobile USA, Inc. is an Equal Opportunity Employer. All decisions concerning the employment relationship will be made without regard to age, race, ethnicity, color, religion, creed, sex, sexual orientation, gender identity or expression, national origin, religious affiliation, marital status, citizenship status, veteran status, the presence of any physical or mental disability, or any other status or characteristic protected by federal, state, or local law. Discrimination, retaliation or harassment based upon any of these factors is wholly inconsistent with how we do business and will not be tolerated. Positions Remaining 1 Brand T-Mobile Schedule Full Time",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-25T17:42:35.000Z"
    },
    "company": {
        "name": "T-Mobile",
        "link": "https://www.linkedin.com/company/t-mobile"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Frisco",
        "region": "TX",
        "postal_code": "75034",
        "street_address": null,
        "latitude": 33.15066,
        "longitude": -96.82508
    }
}