{
    "job": {
        "title": "Junior Data Scientist (Open to NY, TN, Portland, LA)",
        "industry": "Food &amp; Beverages,Food Production,Consumer Goods",
        "description": "Job Purpose/Overview DATA & ANALYTICS AT MARS PETCARE The Petcare Segment consists of five Divisions: Pet Nutrition, Royal Canin, Mars Veterinary Health N. America, Mars Veterinary Health International & Diagnostics, Kinship. Under this new organization of Petcare Product and Service brands, we launched our Strategy in 2018 with an objective to “Create a Better World for Pets by extending global leadership in Nutrition, Health and Services powered by Data”. With the breadth and scale of our Petcare businesses we have unique and unrivalled data assets. The potential to create benefits for Pets and sustainable competitive advantage is huge and we need to seize this opportunity now. Our data assets consist of Veterinary data including appointment and invoice details as well as the medical histories and diagnostic details this provides. We have breed and disease marker data from our DNA diagnostics business (Wisdom Health), Location and Activity Tracking data from our Whistle business. From our nutrition businesses we have sales data, some consumer data as well as valuable information about retailers, Veterinarians, Breeders and Shelters. We also have third party data providing us with product purchasing insights and the potential to develop deeper and broader views into Petcare shopping through collaboration and D2C engagement. We began our work to leverage these more strategically to power our ecosystem in 2018 and there is a core team at the Petcare level incubating and guiding these efforts. Key Responsibilities HOW YOU’LL CREATE A BETTER WORLD FOR PETS In this role, you will be teamed up with Data Scientists, where you are responsible for the following: Assist with data prep, cleaning and documentation from various sources. Build understanding of the Mars Petcare data ecosystem and analytics platforms. Expand dataset exposure by working on various business segment projects or facilitating ecosystem projects. Participate in research hacks to assess project feasibility. Develop and gather project insights. Code peer review and QA notebooks. Design basic experiments, AB testing and other statistical analyses. Work collaboratively with engagement team members and business stakeholders. Collaborate and drive a consumer-centric approach. Participate in model building including statistical models and ML algorithms. Job Specifications/Qualifications Education & Professional Qualifications Bachelor’s degree in STEM, including marketing,mathematics, physics, statistics, economics, engineering, computer science, or social sciences with a quantitative bend. Basic programming, data analysis, and visualization skills. Coding experience is required, which can be from completed university courses or side/personal projects. Python is strongly preferred. Basic understanding of the pet care journey enabling data story telling. Intellectually curious with a strong desire to explore and find insights in new datasets. Why join us? We offer our associates a unique opportunity to have a completely customizable career within pet care. Through Mars Petcare you will work with and learn from a community of industry executives, pet partners, entrepreneurs, and fellow associates across our startup investment companies, outside partners, and in Mars Petcare. Our nimble and flexible approach to work allows you to make an immediate impact across businesses, while learning new skills at every stage. The diversity of our work opens doors to big opportunities and unlocks enormous potential for countless career experiences in pet care. Join us in our mission to chart the future of pet care, alongside the industry’s brightest minds. Mars Petcare’s offices are global, and so are our associates. We are located in NYC, San Francisco, Portland, London, Helsinki, Shanghai, and in Moscow. Many of us flex between our dog-friendly hubs and our home offices. Today, Mars Petcare offers exceptional benefits for you, your family, and your pets, generous paid time off, exponential opportunities to build a career within pet care, and progressive reward packages. Interested? Let’s take big strides, together.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-20T00:00:00.000Z"
    },
    "company": {
        "name": "Mars",
        "link": "https://www.linkedin.com/company/mars"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "New York",
        "region": "NY",
        "postal_code": "10132",
        "street_address": null,
        "latitude": 40.713047,
        "longitude": -74.00723
    }
}