{
    "job": {
        "title": "Site Reliability Engineer (L2)",
        "industry": "Staffing and Recruiting",
        "description": "ShortList Austin are working with a rapidly expanding Tech company that are looking to hire a Site Reliability Engineer (L2). Responsibilities Design, Build, Evolve and Operate SRE-owned services for the team. Provide L2 support for Engineering and Development teams. Offer improvements to existing service with the aim to provide self-service to customers. Collaborate with Tech Leads on designs and advise on implementation. Lower support/toil tasks utilizing automation. The Ideal candidate Produces clear designs and communicates them clearly to consumers. Produces designs that improve performance/reliability. Releases are automated, pass through CI/CD and SDLC and contain unit tests for critical components and performance thresholds. Refactors critical production services with regular cadence, improving MTBI and MTTR. Provides real-time visibility for the health of production services. Standardizes use cases generating less measurable issues with releases. The Ideal person Results orientated. Excellent attention to detail. Able to prioritize effectively. Able to communicate with Technical/non-technical people. Able to escalate effectively when working on solutions. Strong experience with distributed systems. 100% remote working available. If this is a challenge you are interested in, hit APPLY NOW for immediate consideration.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-10T13:07:57.000Z"
    },
    "company": {
        "name": "ShortList Recruitment Limited",
        "link": "https://uk.linkedin.com/company/shortlist-recruitment-limited"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Austin",
        "region": "TX",
        "postal_code": "78746",
        "street_address": null,
        "latitude": 30.264978,
        "longitude": -97.7466
    }
}