{
    "job": {
        "title": "Software Engineer I",
        "industry": "Marketing and Advertising",
        "description": "Company Description Vericast is seeking a highly motivated Software Engineer. The ideal candidate is energized by the thought of developing new system stacks and tools for big data ingestion, processing, and analytics on a multi-petabyte infrastructure. This individual will work on team of talented engineers responsible for reporting on the delivery of our campaigns and handling technical integrations and data ingestion. They will develop products that help validate our media buys, ingest data into our platform, and generate datasets and reporting for our teams to analyze and monitor delivery and performance of our campaigns. Responsibilities Job Description Design, develop, and maintain the software and systems that drive our Display Advertising systems Extend our platform by researching and applying new technologies and stacks to solve business problems Participate in multi-disciplinary projects with our applications and analytics teams Maintain our big data platform by diagnosing, predicting, and correcting scaling problems Contribute to our team’s growing set of development platforms, tools, and processes Skills And Experience Qualifications Proficiency in Java Experience with Postgres, Tableau, Spark, a plus Ability to learn and apply new technologies quickly Ability to multi-task in a dynamic environment Experience with Agile development methodologies is preferred Excellent communications skills across multi-disciplinary teams Ability to gather requirements, develop, test, and deploy software Additional Information All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability status, protected veteran status, or any other characteristic protected by law. Applicants who have disabilities may request that accommodations be made in order to complete the selection process by contacting our Recruiting Administrator directly at 616-541-3145.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-10-05T01:05:59.000Z"
    },
    "company": {
        "name": "Valassis Marketing Solutions",
        "link": "https://www.linkedin.com/company/valassis"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Morrisville",
        "region": "NC",
        "postal_code": "27560",
        "street_address": null,
        "latitude": 35.81964,
        "longitude": -78.82302
    }
}