{
    "job": {
        "title": "Diversity Talent Sourcing and Partnerships Program Manager",
        "industry": "Information Technology and Services,Internet,Telecommunications",
        "description": "Because you belong at Twilio The Who, What, Why And Where Twilio is growing rapidly and seeking a Diversity Talent Sourcing Partnerships and Program Manager as part of our Diversity, Equity, and Inclusion (DEI) team. This position will report directly to the Director of Diversity Talent and will work with our Talent Acquisition team to build out sourcing channels and partnerships to help achieve our diversity goals. Who? They Also Have Twilio is looking for a leader who lives the Twilio Magic and has deep expertise in building learning and development programs focused on diversity, inclusion and equity. 5+ years experience in a diversity based role focused on building inclusive sourcing channels and building strategic partnerships, preferably at a high-growth, technology company Proven track record of cross functional partnerships, building unique channels to increase our top of funnel on qualified, diverse candidates. Experience in a Talent Acquisition and sourcing strategy role targeting diverse populations Demonstrated knowledge of diversity partnership strategies and benefits - globally Knowledge of diversity recruiting data and recruiting funnel report What? As the Diversity Talent Sourcing Partnerships and Program Manager, you will: EMPOWER OTHERS : Partner with the Talent Acquisition and Brand Partnerships teams to support targeted global diversity sourcing and hiring opportunities, at all levels BE AN OWNER : Manage the diversity recruiting funnel report and data to identify recruiting gaps and needs BE BOLD : Develop new channels that drive diverse talent to our pipeline. DON’T SETTLE : Build campaigns and marketing plans to help build our partnerships with diverse communities and continue to nurture our pipeline to ensure a robust diverse candidate pool for our open roles. Why? Our DEI team is a critical partner to the business in building a global diversity strategy. This team plays an integral role in delivering solutions against our Racial Equity and Justice goals. Twilio puts diversity and inclusivity as a top priority in our work both with our customers and employees. Twilio is a company that is empowering the world’s developers with modern communication in order to build better applications. Twilio is truly unique; we are a company committed to your growth, your learning, your development, and your entire employee experience. We only win when our employees succeed and we're dedicated to helping you develop your strengths. We invest in weeks dedicated to tackling hard problems and creating your own ideas. We have a cultural foundation built on diversity, inclusion, and innovation and we want you and your ideas to thrive at Twilio. Come join us! Where? We employ diverse talent from all over the world and we believe great work can be done anywhere. Around the world, Twilio offers benefits and perks to support the physical, financial, and emotional well being of you and your loved ones. No matter where you are based, you will experience a company that believes in small teams for maximum impact; seeks well-rounded talent to ensure a full perspective on our customers’ experience, understands that this is a marathon, not a sprint; that continuously and purposefully builds an inclusive culture that empowers everyone to do their best work and be the best version of themselves. About Us Millions of developers around the world have used Twilio to unlock the magic of communications to improve any human experience. Twilio has democratized communications channels like voice, text, chat, video and email by virtualizing the world’s communications infrastructure through APIs that are simple enough for any developer to use, yet robust enough to power the world’s most demanding applications. By making communications a part of every software developer’s toolkit, Twilio is enabling innovators across every industry — from emerging leaders to the world’s largest organizations — to reinvent how companies engage with their customers. In accordance with applicable law, the following represents Twilio's reasonable estimate of the range of possible compensation for this role if hired in Colorado. Please note that this information is provided for those hired in Colorado only, and this role is open to candidates outside of Colorado as well. Salary Denver/Boulder Metro: Salary Range: $99,840 - $124,800 Rest Of Colorado Salary Range: $87,360 - $109,200 An overview of Twilio’s benefits offered is listed below: Benefits At the time of this posting, this role is eligible to participate in the following benefits, which Twilio reserves the right to modify at any time for any reason in accordance with applicable law Twilio is committed to delivering a comprehensive benefits program that provides support needed for you and your loved ones. It’s likely that you don’t think about benefits every day; however, they are an important component of your total compensation, and we want you to understand the options available to you so that you can make the most of your benefit dollars. Healthcare Insurance and Leave Prescription Drug Dental Vision Flexible Spending and Health Savings Accounts Leave programs for all of life’s moments: maternity, parental/bonding, as well medical leave to care for yourself or a loved one Financial Benefits Short and Long Term Disability Insurance Life and Accidental Death & Dismemberment Insurance 401(k) Retirement Savings Plan with a match Reimbursement Programs & Stipends $65 per month work-from-home stipend Up to $50 per month for wellness expenses and activities Up to $30 per month to use towards books/eBooks",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-25T17:24:40.000Z"
    },
    "company": {
        "name": "Twilio",
        "link": "https://www.linkedin.com/company/twilio-inc-"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "United States",
        "region": null,
        "postal_code": "99999",
        "street_address": null,
        "latitude": 39.50355,
        "longitude": -99.0183
    }
}