{
    "job": {
        "title": "Software Engineer",
        "industry": "Human Resources,Information Technology and Services,Marketing and Advertising",
        "description": "Job Title: Backend Software Engineer Location: Fully remote but must be based in America or Canada. Job Type: Permanent role The Opportunity: Shutterstock is looking for top technologists to join our software engineering teams and help drive the future of our platform. You will be working with highly motivated and extremely talented engineers on backend services with quality, performance, and scale in mind at every step of the way. Our core belief is that the customers are our number one priority so we work hard to deliver value back to them with everything we do. We believe strongly in team ownership of systems, which includes defining the vision of the services to prioritization of projects. Essentially we looking for someone that is proficient with Node.js, JavaScript / Typescript, is familiar with AWS and at least one relational DB. Requirements: At least 4+ years of relevant software development experience Back-end software development experience Node.js experience Very strong knowledge of how the Web works and how to make it efficient (HTTP, caching, page rendering, etc) Experience building and designing highly scalable services, and RESTful API’s that power multiple consumers. Experience with SOA architecture working on distributed/high trafficked systems. Experience with AWS Familiarity with at least one RDBMS and one NoSQL database. Ability to craft simple and elegant solutions to complex problems. Solid software development fundamentals (Data Structures, algorithms, problem-solving, OO Design, and system architecture). Passionate about what you do and care deeply about the things you build. Able to clearly communicate to technical and non-technical audiences. Strong understanding of continuous delivery, writing unit tests, and automated testing. BS or MS degree in Computer Science or related experience Bonus Skills: Experience building event-driven or message-driven architecture using tools like RabbitMQ and Kafka. Docker, Kubernetes experience Graph database experience Experience working in an agile environment",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-15T08:52:21.000Z"
    },
    "company": {
        "name": "LevelUP",
        "link": "https://www.linkedin.com/company/leveluphcs"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 48,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "United States",
        "region": null,
        "postal_code": "99999",
        "street_address": null,
        "latitude": 39.50355,
        "longitude": -99.0183
    }
}