{
    "job": {
        "title": "Site Reliability Engineer",
        "industry": "Information Technology and Services",
        "description": "Pathwire is looking for a Site Reliability Engineer to join our Site Reliability Engineering team. This team is responsible for building and operating the infrastructure at the heart of every Pathwire service. As an engineer on this team, you will be responsible for the day-to-day management of the global infrastructure. This would include monitoring and tracking key performance indicators, working with other engineers to ensure our products and services are appropriately resources, automating all the things, and planning for future growth and scalability. Responsibilities Work closely with other engineering teams to identity systems requirements Build and support our cloud-based microservices infrastructure Automate wherever possible - routine processes and remediation tasks shouldn't require human intervention Develop, monitor and track SLOs for the systems under management Troubleshoot and resolve issues coming from support staff, other engineering teams, and our automated monitoring system Ensure our datastores are healthy and operations at optimal performance levels Contribute to our growing engineering management team and culture Requirements: 5+ years experience in infrastructure/Ops/SRE/Saas/Platforms Experience with containers and orchestration systems like Nomad Experience with cloud providers such as AWS, GCP Expertise with distributed data stores such as Cassandra, MongoDB, and ElasticSearch A strong and nimble set of technical skills across technologies the team interacts with, such as commonly used infrastructure technologies Strong communication skills and demonstrated capability of building strong relationships with peers and leaderships Experience operating and maintaining production systems in a Linux and public cloud environment Benefits: KEEPING YOU HEALTHY: Pathwire offers 100% employer paid comprehensive medical, dental, and vision plans (US). We offer a variety of supplemental plans to meet your individual needs and provide access to telehealth for all participants. KEEPING YOU BALANCED: Pathwire provides free virtual counseling resources through our Employee Assistance Programs. Your mental health is as important as your physical health. FINANCIAL SECURITY: We offer an employer match for 401k participants to help you plan for the future (US). TAKE A BREAK: We believe performance at work requires balance at home. This is why we provide 5+ weeks of time-off to all employees. FAMILY PLANNING: We know that families can be built in a variety of ways and this is why Pathwire offers paid parental leave and family planning support. WORK WHERE YOU ARE: It's not where you work that matters. This is why we provide flexible remote work offerings for most of our roles Pathwire embraces diversity and equal opportunity in all aspects of our business. We are committed to building a company that empowers individuals from a diverse set of backgrounds and values diversity of thought as a beacon for performance. The more inclusive we are, the better our work will be.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-17T16:20:11.000Z"
    },
    "company": {
        "name": "Mailgun by Pathwire",
        "link": "https://www.linkedin.com/company/mailgun"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "United States",
        "region": null,
        "postal_code": "99999",
        "street_address": null,
        "latitude": 39.50355,
        "longitude": -99.0183
    }
}