{
    "job": {
        "title": "Site Reliability Engineer (SRE)",
        "industry": "Banking,Financial Services,Investment Banking",
        "description": "Job Id: 21336120 As a bank with a brain and a soul, Citi creates economic value that is systemically responsible and in our clients’ best interests. As a financial institution that touches every region of the world and every sector that shapes your daily life, our Enterprise Operations & Technology teams are charged with a mission that rivals any large tech company. Our technology solutions are the foundations of everything we do. We keep the bank safe and provide the technical tools our workers need to be successful. We design our digital architecture and ensure our platforms provide a first-class customer experience. Our operations teams manage risk, resources, and program management. We focus on enterprise resiliency and business continuity. We develop, coordinate, and execute strategic operational plans. Essentially, Enterprise Operations & Technology re-engineers client and partner processes to deliver excellence through secure, reliable, and controlled services. Citi Technology Infrastructure provides the critical technical foundation for Citi’s operations and is responsible for delivering IT solutions, scalable infrastructure services, and secure capabilities while creating a trusted customer experience and enabling Citi’s workforce to be the best for our clients. Making the bank simpler, greener, and better connected while powering it with trusted, well-secured platforms and data, and automating policy enforcement through code are all at the heart of our refreshed global strategy. Data Quality, Simplification, Environmental Stability, Automation, and Service Excellence are the key pillars and priorities on our strategic journey. The Chief Technology Office plays a critical role in fulfilling the firm’s commitment to safety and soundness by ensuring Citi delivers efficient and high-quality solutions and technologies, coordinating foundational macro technology strategies, ensuring Citi’s readiness to safely leverage new technologies, and making Citi a competitive destination for the best technical talent. Our commitment to diversity includes a workforce that represents the clients we serve globally from all walks of life, backgrounds, and origins. We foster an environment where the best people want to work. We value and demand respect for others, promote individuals based on merit, and ensure opportunities for personal development are widely available to all. Ideal candidates are innovators with well-rounded backgrounds who bring their authentic selves to work and complement our culture of delivering results with pride. If you are a problem solver who seeks passion in your work, come join us. We’ll enable growth and progress together. The deployment automation team at Citi manages a platform that orchestrates releases across a very large number of enterprise applications. This is a mature platform running without major issues and supporting modern deployment strategies like canary, blue-green, containers, microservices, public cloud alongside some more traditional distributed systems and databases. As we expand our continuous delivery product portfolio, we are looking for a SRE, hands-on engineer with experience running platforms as scale leveraging industry observability and automation platforms. Someone who brings fresh ideas, demonstrates a unique and informed viewpoint, and enjoys collaborating with a cross-functional team to develop real-world solutions and positive user experiences at every interaction. Responsibilities: Configure and tune the observability platforms we use to streamline alerting and proactive issue identification. Automate manual activities as new features are added to the platform. Ensure the platform functional test suite remains complete and runs quickly. Expand performance and load testing capability to better simulate real production use. Perform root cause analysis owning actionable follow-ups. Measure and optimize system performance setting proper metrics and SLAs/SLOs Mange risk and control activities across the platform and team Qulifications: 3+ SRE and operational role running a large enterprise platform 5+ years working with Linux 5+ years scripting in Python/Shell/Bash/Ksh. 3+ years of software development experience (Java on Linux) Extensive experience working with and customizing automation scripts – Ansible is currently used. Prior experiences with DevOps CI/CD tools like Git and Jenkins. Experience analyzing data to drive decisions. Competent with API, web services and microservices development Strong communication skills, both written and oral Strong architecture and design Strong analytical, algorithmic, and problem-solving skills Excellent teamwork and proactive attitude BS/MS degree in Computer Science or related technical field Desired Skills: Experience with Docker, Kubernetes, Openshift Experience with Sql/NoSql databases like Oracle, MongoDB Java Spring Framework development experience Experience in Config Management tooling e.g. Ansible, Chef, Puppet or SaltStack Experience writing automation tests Ability to quickly learn new concepts and software About Citi Citi, the leading global bank, has approximately 200 million customer accounts and does business in more than 160 countries and jurisdictions. Citi provides consumers, corporations, governments, and institutions with a broad range of financial products and services, including consumer banking and credit, corporate and investment banking, securities brokerage, transaction services, and wealth management. Additional information may be found at www.citigroup.com | Twitter: @Citi | YouTube: www.youtube.com/citi | Blog: http://blog.citigroup.com | Facebook: www.facebook.com/citi | LinkedIn: www.linkedin.com/company/citi. ------------------------------------------------- Job Family Group: Technology ------------------------------------------------- Job Family: Systems & Engineering ------------------------------------------------------ Time Type: ------------------------------------------------------ Citi is an equal opportunity and affirmative action employer. Qualified applicants will receive consideration without regard to their race, color, religion, sex, sexual orientation, gender identity, national origin, disability, or status as a protected veteran. Citigroup Inc. and its subsidiaries (\"Citi”) invite all qualified interested applicants to apply for career opportunities. If you are a person with a disability and need a reasonable accommodation to use our search tools and/or apply for a career opportunity review Accessibility at Citi . View the \" EEO is the Law \" poster. View the EEO is the Law Supplement . View the EEO Policy Statement . View the Pay Transparency Posting",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-28T03:09:55.000Z"
    },
    "company": {
        "name": "Citi",
        "link": "https://www.linkedin.com/company/citi"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Irving",
        "region": "TX",
        "postal_code": "75063",
        "street_address": null,
        "latitude": 32.813877,
        "longitude": -96.949936
    }
}