{
    "job": {
        "title": "Software Engineer",
        "industry": "",
        "description": "Aviture is a technology solutions organization made up of individuals who care about our trade and the impact of our services. We strive to make a true difference in our clients lives with the solutions we craft, ensuring the newest techniques are used effectively to promote innovation within our own walls and those of our clients. Our engineers work on next-generation systems across a wide variety of industries including the Department of Defense, communications, healthcare, energy, banking, retail, hospitality, logistics and technical R&D. The solutions we create have Saved lives in the California wildfires and southern U.S. flooding Provided security for the Super Bowl and post-attack Boston Marathon Provided augmented-reality training environments for surgeons Enabled major corporations to pivot into IoT Increased transparency and promoted patient wellness in hospitals and senior care facilities Provided risk analysis of stock portfolios Combined computer vision and robotics to automate dangerous manual labor tasks Preserved life and increased mission success by allowing government leaders to make quick and informed decisions Part of our ‘secret sauce’ is our continued exposure to diverse and interesting problems and the ability to share ideas across domains in a manner not typically done within a single industry. At our core, Aviture is a group of engineers seeking to build better solutions. We pursue people with aptitude and drive first and foremost; which allows us a staff that spans across all levels of experience, skillsets, and software disciplines. Our prime candidates are people who have technology in their DNA and want to pursue the ‘why’ behind their work. We value a healthy work-life balance so we provide flex time and reasonable hours, all while pushing ourselves to grow and become faster, better engineers. If this sounds like the kind of environment you’d like to be in, why don’t you drop us a line? We’d love to talk to you! Requirements BS degree in Software Engineering related degree, similar technical field of study or equivalent practical experience Software development experience within web application development, mobile application development, service/API development, data storage/analytics, cloud platform (AWS/Azure/Google Cloud) development, IoT development and/or machine learning. Larger or more complex applications preferred Go-getter mentality with good communication skills Experience working within a team preferred Interest and ability to learn new technologies/techniques Benefits Medical, dental, vision and life insurance Matching 401k with 100% vesting in six months Incentive and bonus pay Generous paid time off Laptop options Paid conferences and training Research and development time Company vacations Flex time scheduling Family events Free lunch Fridays Quarterly company event Aviture hosted Speaker Series",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-11T20:29:13.000Z"
    },
    "company": {
        "name": "Aviture",
        "link": "https://www.linkedin.com/company/aviture"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Omaha",
        "region": "NE",
        "postal_code": "68145",
        "street_address": null,
        "latitude": 41.25865,
        "longitude": -95.937195
    }
}