{
    "job": {
        "title": "Data Scientist",
        "industry": "Information Technology and Services,Computer Software,Financial Services",
        "description": "Employee Applicant Privacy Notice Who We Are Welcoming, collaborative and having the opportunity to make an impact - is how our employees describe working here. Galileo is a financial technology company that provides innovative and revolutionary software products and services that power some of the world's largest Fintechs. We are the only payments innovator that applies tech and engineering capabilities to empower Fintechs and financial institutions to unleash their full creativity to achieve their most inspired goals. Galileo leads its industry with superior fraud detection, security, decision-making analytics and regulatory compliance functionality combined with customized, responsive and flexible programs to accelerate the success of all payments companies and solve tomorrow's payments challenges today. We hire energetic and creative employees while providing them the opportunity to excel in their careers and make a difference for our clients. Learn more about us and why we work here at https://www.galileo-ft.com/working-at-galileo. The role As a data scientist at Galileo, you’ll work closely with engineers building out our analytical platform to leverage our unique data sets to drive better outcomes for our clients and their customers. As a long-time leader in the payments space, Galileo has raw data that spans over more than 20 years to all aspects of payments, including transactional card data, payment dispute cases, patterns of fraudulent activity and more. Using cutting-edge tools on cloud platforms, you’ll analyze these datasets and present your insights to internal users and to our clients. What You’ll Do Contribute to the design, orchestration and development of ongoing data science projects from data ingestion to presentation Work with platform engineers and others to develop tools/frameworks needed to carry out projects Synthesize insights from raw data using a Python-based stack including pandas, scikit and other tools Build new and improve existing models and test hypotheses in collaboration with machine learning engineers and others Build dashboards and other visualizations; communicate findings internally and externally Values-driven approach to your role - SoFi and Galileo are values driven companies; we look to work with others who are as well. Desire to make a difference by extending and diversifying the reach of innovative payment solutions around the world What You’ll Need Bachelor's Degree or higher in a quantitative field (Computer Science, Mathematics, Machine Learning, Operations Research, Statistics, etc.) or equivalent experience Experience with the Python data science stack (including pandas, sklearn, numpy, and one or more charting libraries) Fluency in SQL for data queries. Familiarity with relational database design Nice To Have Experience in building machine learning models, ideally with the Python stack (Pytorch, Tensorflow) Familiarity with Oracle SQL or AWS RDS/Redshift Prior exposure to the payments industry and familiarity with card-based services Familiarity with data science tooling in AWS, including SageMaker, S3, EC2, EMR Why You’ll Love Working Here Competitive salary packages and bonuses Comprehensive medical, dental, vision and life insurance benefits Generous vacation and holidays Paid parental leave for eligible employees 401(k) and education on retirement planning Tuition reimbursement on approved programs Monthly contribution up to $200 to help you pay off your student loans Great health & well-being benefits including: telehealth parental support, subsidized gym program Fully stocked kitchen (snacks and drinks) Galileo Financial Technologies provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion (including religious dress and grooming practices), sex (including pregnancy, childbirth and related medical conditions, breastfeeding, and conditions related to breastfeeding), gender, gender identity, gender expression, national origin, ancestry, age (40 or over), physical or medical disability, medical condition, marital status, registered domestic partner status, sexual orientation, genetic information, military and/or veteran status, or any other basis prohibited by applicable state or federal law. Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-14T17:01:19.000Z"
    },
    "company": {
        "name": "Galileo Financial Technologies",
        "link": "https://www.linkedin.com/company/galileo-financial-technologies"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "San Francisco",
        "region": "CA",
        "postal_code": "94121",
        "street_address": null,
        "latitude": 37.78008,
        "longitude": -122.42016
    }
}