{
    "job": {
        "title": "Site Reliability Engineer",
        "industry": "Information Technology and Services",
        "description": "At SmarTek21, we are all innovators on a mission to connect, protect, explore, and inspire. From the beginning you will learn and grow, contributing to work that shapes the world through technology and digitalization. Find your future with us! System Reliability Engineer for the Collaboration and Productivity organization. The position will work to support the portfolio of Collaboration tools within the T-Mobile environment with a focus on Cisco WebEx, WebEx Events, and WebEx hardware. This role will address end user issues, troubleshoot, and resolve hardware issues and assist in the support of executive sponsored live events. Customer focus is a must. Enterprise Core Competencies Requires expertise in Collaboration and voice solutions with customer focus, strategic thinking, operational support, Cisco WebEx, and WebEx hardware including Desk Pros, Room Kits, Cisco Room Phones, 8861s, 7845s, and WebEx Boards. Familiarity with Apple and Laptop configurations. Job Duties and Responsibilities ·      Tier3 engineer will support end users in support of meetings and Cisco hardware questions. ·      Partner with vendor teams in support of Webex services and voice services. ·      Enhance video/ voice reporting and monitoring tools. ·      Excellent communicator and event moderator. ·      Ability to analyze and determine root cause on customer issues including hardware. ·      Collaborate/Partner with other teams including corporate communications, Product and Technology communications, Corporate Real Estate Audio Visual teams. ·      Maintain technical skills and expertise through continuing education and training. Qualifications Minimum Required ·      Minimum 3 years of experience with Cisco equipment and WebEx software. ·      Minimum 3 years professional experience moderating live events with executive leadership. ·      Familiarity with webcasting/livestreaming services. ·      Experience working with AV production support. ·      Experience 3 years customer service experience. ·      Excellent written and verbal communication skills. Education ·      Bachelor’s degree in Computer Science or related experience a plus. SmarTek21 is an Equal Opportunity Employer and do not discriminate against any employee or applicant for employment because of race, color, sex, age, national origin, religion, sexual orientation, gender identity and/or expression, status as a veteran, and basis of disability or any other federal, State, or local protected class.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-09T20:03:06.000Z"
    },
    "company": {
        "name": "SmarTek21",
        "link": "https://www.linkedin.com/company/smartek21"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Kirkland",
        "region": "WA",
        "postal_code": "98034",
        "street_address": null,
        "latitude": 47.675507,
        "longitude": -122.20336
    }
}