{
    "job": {
        "title": "Software Developer for Training Systems",
        "industry": "Information Technology and Services,Computer Software,Financial Services",
        "description": "Description Job Description: Leidos currently has an immediate opening for a Scientific Computing Software Engineer/Team Lead, supporting multiple US Navy programs located at Manassas, VA. Leidos’ High Fidelity Simulation Business Area is responsible for architecting and implementing large-scale System of Systems solutions in support of world class simulation, training, and analysis products for the US Navy. This position requires US citizenship and the ability to obtain an active DoD Secret clearance. You will develop sophisticated, real-time, software to enhance the fidelity of training and simulation systems. You will also be responsible for leading a very cohesive team of high performing software developers. The work may include developing numerical models, sonar system simulation/stimulation software, data visualization software, message passing and data distribution software, and/or trainer command and control software. This code is used in a variety of naval training and simulation systems. All software is developed in a Linux environment, and written primarily in C++, Java, and Python, utilizing various software packages (boost, NumPy, and MPI). Software development will include requirements analysis, designing, coding, unit testing, integration testing, and verification and validation testing. Work will include the development of new code and the maintenance and extension of existing code. A background in physics or mathematics is useful to implement physics-based enhancements to the training and simulation systems. Our team employs an agile development approach. Travel is required to trainer sites at various naval bases, and will account for less than 10% of the job. Required Experience US Citizenship and ability to obtain a DoD Secret security clearance. Must have 8+ years of experience developing software in C++, Java, or related languages. Must have a strong working knowledge of tools and libraries available for the Linux operating system, and be familiar with sound software engineering principles and methodologies. Must have past experience with, and demonstrate the skills and capabilities to successfully execute the duties and responsibilities of this position Requires BS degree and 8 – 12 years of prior relevant experience or Masters with 6 – 10 years of prior relevant experience. May possess a Doctorate in technical domain. Desired Experience Advanced degree, continuing education in computer science, and/or advanced math/physics background. Cluster computing, signal processing, real-time software, numerical simulation software, multi-threaded, multi-processor software, data visualization software, underwater acoustic modeling, or familiarity with sonar systems. Experience with Agile development and Atlassian products. Experience using DevSecOps methods (Continuous Integration, Continuous Delivery) and tools (Jenkins, Docker). Past team lead experience. External Referral Bonus Eligible External Referral Bonus $: $3,000 Potential For Telework No Clearance Level Required Secret Travel Yes, 10% of the time",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-21T02:18:57.000Z"
    },
    "company": {
        "name": "Leidos",
        "link": "https://www.linkedin.com/company/leidos"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 96,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Manassas",
        "region": "VA",
        "postal_code": "20108",
        "street_address": null,
        "latitude": 38.75077,
        "longitude": -77.47509
    }
}