{
    "job": {
        "title": "Data Scientist",
        "industry": "Management Consulting",
        "description": "Our values have led us to two decades of global expansion. Sia Partners first landed in North America in 2012 and is an emerging consulting leader in the United States. Working from our US headquarters in New York with offices in Baltimore-DC, Charlotte, Chicago, Houston, Denver, San Francisco Bay area and Seattle, we serve clients in both the public and private sectors, including mid-sized companies and Fortune 500s. Candidates must be local to one of those cities to be considered for this role. Sia Partners is looking for a talented Data Scientist to support our activities within the Data Science Business Unit. You will be working alongside our Data Science consultants and our clients on Data Science topics, including data acquisition and exploration, creating relevant data models and presenting results to stakeholders. You will also contribute to internal Data Science projects hosted on Heka, our internal accelerator for Data Science projects. As part of the global Data Science team you will contribute to the development of various solutions designed to address our clients’ needs. Key Responsibilities Partner with our client’s leadership teams, engineers, program managers and data analysts to understand data needs. Identify, acquire, process and explore relevant data sources. Analyze large amounts of structured and unstructured information to discover trends and patterns. Use your data analytics and science expertise to derive valuable insights from datasets, build predictive models and machine-learning algorithms. Communicate at scale, through multiple mediums: presentations, dashboards, datasets, bots and more. Propose solutions and strategies to business challenges. Collaborate with engineering and product development teams. Broad range of partners equates to a broad range of projects and deliverables, including Models, algorithms, datasets, measurements, services, tools and process. Qualifications 4+ years’ experience as a Data Scientist or Data Analyst Experience with building models, machine-learning, NLP 4+ years’ experience in R, SQL and Python 4+ years’ experience with data visualization tools (e.g. Tableau, PowerBi, R Shiny) Problem-solving aptitude and business acumen Excellent communication and presentation skills BSc/BA in Data Science, Computer Science, Engineering Preferred experience: Experience with more than one coding language. Experience in data mining Good understanding of Machine Learning techniques Good understanding of statistical techniques and concepts Experience with data visualization tools Experience with Object Oriented Programming Additional Information This is an opportunity to join a rapidly growing team in Seattle that serves some of the most exciting and highly respected companies in the world. You will have the opportunity to provide clients with pioneer mind-set thinking, customized solutions, and you will often have the satisfaction of seeing the impact of your work on their business. We are committed to a healthy work-life integration. We do serve our clients globally and if interested, there are opportunities for international mobility. Benefits Generous PTO, including Parental leave Healthcare that includes dental and vision, life insurance and 401K matching Career advocacy program that supports achieving personal development goals through coaching, collaboration and real-time feedback Robust learning and development platform through the Sia Institute, 360 Learning App, Sia Blend App, working groups, US Training Sessions, and reimbursement for continuing education and certifications Women at Sia Club Annual Seminar/a value add experience to network with your colleagues across North America and other regions Opportunities for geographic mobility if desired Work directly with clients Still interested? Tell us about your.... Academic successes Consulting / Agency experience Data supported success stories Growth from failure Tools and training Cross-functional experience Extracurriculars Additional Information Diversity, equity, inclusion, and belonging (DEIB) are part of Sia Partners’ DNA. Thanks to our expertise in several sectors and our international growth, our teams include a variety of experiences and cultures. We’re confident that promoting DEIB creates an environment in which everyone can reach their full potential. Our global network, DEIB@Sia Partners, brings together our people worldwide to facilitate local and global progress, focused on the following areas: Gender equality (global Gender Equality Index score of 91/100 for FY19-20) LGBTQ+ Race & Ethnicity Working Parents Disabilities To learn more about Sia Partners, please visit: https://www.sia-partners.com/en/work-with-us Sia Partners is an equal opportunity employer. All aspects of employment, including hiring, promotion, remuneration, or discipline, are based solely on performance, competence, conduct, or business needs.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-23T23:35:29.000Z"
    },
    "company": {
        "name": "Sia Partners",
        "link": "https://fr.linkedin.com/company/sia-partners"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 48,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "New York",
        "region": "NY",
        "postal_code": "10132",
        "street_address": null,
        "latitude": 40.713047,
        "longitude": -74.00723
    }
}