{
    "job": {
        "title": "Scientist.",
        "industry": "Hospital &amp; Health Care,Medical Devices,Pharmaceuticals",
        "description": "Janssen R&D, department of Protein Therapeutics Development in BioTherapeutics Development is recruiting for a Scientist, Protein Purification located in Malvern, PA. At the Janssen Pharmaceutical Companies of Johnson & Johnson, we are working to create a world without disease. Transforming lives by finding new and better ways to prevent, intercept, treat and cure disease inspires us. We bring together the best minds and pursue the most promising science. We are Janssen. We collaborate with the world for the health of everyone in it. Learn more at www.janssen.com and follow us @JanssenGlobal. Janssen Research & Development is part of the Janssen Pharmaceutical Companies. Thriving on a diverse company culture, celebrating the uniqueness of our employees and committed to Diversity & Inclusion, Janssen Research & Development, LLC is proud to be an equal opportunity employer. The scientist will lead and perform process development for the antibody purification processes within the API-Protein group. Primary responsibilities will include leading in the design of experiments, executing the planned experiments, and optimizing the process steps to the target process scale. This will include laboratory and occasional pilot-scale scale chromatography and filtration. The candidate will own the design and execution of development studies to identify and determine appropriate conditions and ranges of (critical) process parameters for chromatographic purification & separation and several types of filtration. The candidate will record and analyze experimental data, verify data integrity and accuracy, and report/summarize findings to the project team, and also draft technical documents and perform technology transfer to collaboration partners. Scientist will work in a team environment as well as contributing individually to meet project timeline and objectives. Key Responsibilities Working at a high level of autonomy, develop protein purifications processes. Lead all aspects of laboratory and occasional pilot-scale scale protein purifications and associated in-process measurements. Own the preparation and submission of Technology Transfer technical reports, patent applications and manuscripts. Define elements of new product strategies and act as project leader to support Technology Transfer. Proactively investigate, propose and develop improvements to existing processes or develops new processes. Communicate well and largely autonomously with partnering departments in manufacturing and CMOs. Qualifications A Bachelor's degree with a minimum of 8 years of experience performing progressively advanced duties beyond a BS degree in Biochemical Engineering, Biological Sciences, Biochemistry, Biotechnology or comparable education is required. A Ph.D degree with post-doctoral experience is preferred. Proven knowledge and hands-on experience in optimizing protein purification processes of antibodies or other large proteins is required. This position will be located in Malvern, PA and may require up to 10% travel. Johnson & Johnson is an Affirmative Action and Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, age, national origin, or protected veteran status and will not be discriminated against on the basis of disability. Primary Location United States-Pennsylvania-Malvern-200 Great Valley Parkway Organization Janssen Research & Development, LLC (6084) Job Function R&D Requisition ID 2105960762W",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-09-12T03:27:27.000Z"
    },
    "company": {
        "name": "Johnson &amp; Johnson",
        "link": "https://www.linkedin.com/company/johnson-&amp;-johnson"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 96,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Malvern",
        "region": "PA",
        "postal_code": "19355",
        "street_address": null,
        "latitude": 40.033436,
        "longitude": -75.51271
    }
}