{
    "job": {
        "title": "Site Reliability Engineer",
        "industry": "Internet",
        "description": "About Pushnami Pushnami is a leading digital marketing software provider based in Austin with a focus on building cutting-edge solutions to deliver unparalleled performance. The company offers its clients unparalleled performance through machine learning enabled messaging solutions. Pushnami builds technologies on the forefront of the latest online notification technologies. The system currently delivers over 800 million unique messages per day and is live on more than 10,000 enterprise websites globally. About the Site Reliability Engineer Role We are seeking a creative Site Reliability Engineer to ensure Pushnami's platform is stable and secure. You will be responsible for the health of our system, ensuring that managed assets are performing as expected, creating and maintaining automated alerts, and enabling self-healing infrastructure. Responsibilities Ensure that the infrastructure supporting Pushnami's platform is highly available and scalable Support, maintain, monitor, and manage cloud infrastructure Collaborate with the Tech team to support engineering and development efforts and ensure system integrity Monitor metrics and develop ways to improve reporting and alerting Requirements: Bachelor's degree in in computer science or related field, or equivalent working experience 3+ years in an SRE/DevOps role, or related IT or operations 3+ years operational experience with a public cloud environment (AWS preferred) Strong understanding of security and observability principles and methodologies Proficient with Linux system operations and networking Proficient in scripting with Python and bash Experience working with Kubernetes, ECS, or other containerization platforms Familiar with automation/deployment principles and technologies (Terraform, Ansible/Salt/Puppet, Git) Familiar with Scrum and Agile development methodologies Good interpersonal skills and communication with all levels of management Benefits: Full Medical and Dental PPO Insurance that is 100% paid for by the company 401k Retirement Plan - Fully matched up to 6% Paid parental leave for primary caretaker Flexible work schedule that is based on performance rather than time Hybrid work model Unlimited paid vacation after one year of employment Relaxed dress code and open office environment $100 in \"Fringe\" benefits monthly (online marketplace where you can purchase the perks you choose - Netflix, Hulu, AirBnb, Royal Caribbean Cruises, child care, dog walking, you name it!) Orange Theory Gym Membership Full stocked break room, breakfast taco Tuesday, catered lunches Monday - Friday for in-office employees Our Recruitment Process: Application (You are here!) 12-Question Aptitude Exam Hiring Manager Interview Company Leadership Interview Offer Pushnami was built on the principles of positivity and acceptance. We strive to build an inclusive work environment that uses our success to make a genuine impact on the community around us. No employee or applicant will face discrimination/harassment based on race, color, ancestry, national origin, age, gender, marital domestic partner status, sexual orientation, gender identity, disability status, or veteran status.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-09-02T21:50:10.000Z"
    },
    "company": {
        "name": "Pushnami",
        "link": "https://www.linkedin.com/company/pushnami"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Austin",
        "region": "TX",
        "postal_code": "78746",
        "street_address": null,
        "latitude": 30.264978,
        "longitude": -97.7466
    }
}