{
    "job": {
        "title": "Entry-level Software Engineer",
        "industry": "Information Technology and Services,Management Consulting",
        "description": "Position Overview By joining Cognizant as an Entry-level Software Engineer, you will be analyzing, designing, programming, and testing software programs and applications across all industries. Depending on your background and Cognizant business needs, we will align you to a technology area, allowing you to enhance your core competency skills and grow your career. You will take on challenges to deliver technology innovation, and design and implement solutions impacting our clients’ business and IT imperatives Responsibilities Develop, create, and modify general computer application software or specialized programs Interaction and coordination with offshore team members for various client specific tasks and Enhancements Maintain systems by monitoring, identifying, and correcting software defects Java/Java EE/Spring microservice API development while providing expertise in the full software development lifecycle, from concept and design to testing Designing, developing and delivering high-volume, low-latency applications for mission-critical systems Write well designed, testable, efficient code Ensure designs are in compliance with specifications Support continuous improvement by investigating alternatives and technologies and communicating these for architectural review Qualifications Bachelor’s degree or equivalent. Preferred majors include: Computer Science, Computer Engineering, Computer Engineering, Software Engineering, Information Systems, Decision Sciences, Data Analytics, Data Science, Big Data, and/or Business Administration majors with technical proficiency Candidate should possess strong Java application development skills (e.g. Core Java/J2EE technologies & Spring framework) Demonstrable development experiences in C++/C#, .NET, VB/ASP Development and Database experience Understanding of software development methodologies Self-motivated individuals with strong analytical, troubleshooting and problem solving skills with the passion and appetite to learn newer technologies Excellent interpersonal & communication skills; actively participates in team meetings discussions and be a specialist in Object Oriented analysis and design using common design patterns Ability to work collaboratively with global team projects Work Authorization Due to the nature of this position Cognizant cannot provide?sponsorship?for U.S. work authorization (including participation in a CPT/OPT program) for this role. Location(s) Entry-level Software Engineers will be deployed to Cognizant office(s) in Dallas-TX, Phoenix-AZ, or Tampa-FL where you will work alongside other experienced Cognizant associates delivering technology solutions. Applicants must be willing to relocate to one of the aforementioned major geographic areas. While we will attempt to honor candidate location preferences, business need and position availability will determine final location assignment. Start Date(s) Entry-level Software Engineers will largely start in 2 cohorts; June or August 2022 . While we will attempt to honor candidate summer start date preferences, business need and position availability will determine final start date assignment of June or August. Exact summer start dates will be communicated with enough time for you to plan effectively. Why Choose Us? Cognizant delivers solutions that draw upon the full power and scale of our associates. You will be supported by high-caliber?experts?and employ some of the most advanced and patented capabilities. Our associate’s diverse backgrounds offer varied perspectives and fuel new?ways of thinking. We encourage lively discussions which inspire better results for?our clients. If you’re comfortable with ambiguity, excited by change, and excel through autonomy, we’d love to hear from you. #cb Employee Status : Full Time Employee Shift : Day Job Job Posting : Aug 11 2021 About Cognizant Cognizant (Nasdaq-100: CTSH) is one of the world's leading professional services companies, transforming clients' business, operating and technology models for the digital era. Our unique industry-based, consultative approach helps clients envision, build and run more innovative and efficient businesses. Headquartered in the U.S., Cognizant is ranked 185 on the Fortune 500 and is consistently listed among the most admired companies in the world. Learn how Cognizant helps clients lead with digital at www.cognizant.com or follow us @USJobsCognizant. Applicants may be required to attend interviews in person or by video conference. In addition, candidates may be required to present their current state or government issued ID during each interview. Cognizant is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to sex, gender identity, sexual orientation, race, color, religion, national origin, disability, protected Veteran status, age, or any other characteristic protected by law. If you have a disability that requires a reasonable accommodation to search for a job opening or submit an application, please email CareersNA2@cognizant.com with your request and contact information.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-11T22:44:32.000Z"
    },
    "company": {
        "name": "Cognizant",
        "link": "https://www.linkedin.com/company/cognizant"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Dallas",
        "region": "TX",
        "postal_code": "75342",
        "street_address": null,
        "latitude": 32.777977,
        "longitude": -96.79621
    }
}