{
    "job": {
        "title": "Machine Learning Engineer",
        "industry": "Marketing y publicidad,Servicios y tecnologías de la información ,Recursos humanos",
        "description": "MACHINE LEARNING ENGINEER Description Kavak is a modern, data-driven platform that has helped tens of thousands of customers buy and sell cars. We are the top e-commerce platform for cars in Mexico and one of the fastest growing and most highly-rated companies in Latin America. We have also been selected as Venture of the Year 2018 by Expansión Magazine and the #LinkedInTopStartup 2019 ranked Kavak as the Second Best Startup to work at in Mexico . We are looking for a creative, results-driven solution builder to fill an extremely challenging and exciting role as a member of the data science and machine learning team. You will create value for customers by optimizing decisions, automating processes, and personalizing the user experience using machine learning algorithms. Job Functions Use machine learning to create new, scalable solutions for business problems Design experiments, measure results and provide a point of view in decision-making Work closely with cross-functional teams of skilled engineers and product managers Basic Qualifications Strong drive to learn, experiment, and drive outcomes 2+ years of professional experience performing quantitative analysis Bachelors, Masters or PhD in a quantitative field (e.g. Computer Science, Economics, Statistics) Expertise in Python Preferred Qualifications Experience in price optimization, credit risk scoring, or recommender systems. An advanced degree (Masters, PhD) in a quantitative field (e.g. Computer Science, Economics, Statistics) Experience with libraries commonly used for machine learning, such as Tensorflow/Pytorch/MXNet, XGBoost, pandas, numpy Experience using AWS or other cloud platforms A consistent record of using data to drive product teams to achieve ambitious goals and influence outcomes Experience in schema design and dimensional data modeling and building data pipelines If you are motivated to be part of this mission and help us build the rest of this story, Join KAVAK!",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-16T11:48:26.000Z"
    },
    "company": {
        "name": "Kavak.com",
        "link": "https://mx.linkedin.com/company/kavakcom"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "MX",
        "locality": "Cervantes",
        "region": null,
        "postal_code": "98460",
        "street_address": null,
        "latitude": 23.390266,
        "longitude": -102.01451
    }
}