{
    "job": {
        "title": "Scientist/Senior Scientist, Hematology Reverse Translation",
        "industry": "Biotechnology,Hospital &amp; Health Care,Pharmaceuticals",
        "description": "The Position We seek a highly talented and motivated Scientist/Senior Scientist to join Genentech’s cutting-edge Hematology Reverse Translation effort. The candidate will be a lab-based member of a cross-functional team of biomarker scientists, discovery scientists, pathologists, computational scientists, and clinical researchers working together to translate clinical trial findings into the next generation of therapeutic strategies. The candidate will generate novel biological insights from clinical trial samples to identify targets and combination strategies that will shape new discovery and development programs. The candidate will grow over time into a leader in mechanisms of response and resistance to immune engaging therapies and translational medicine in hematology. Genentech has an extensive hematology pipeline and a wealth of research and clinical expertise in heme malignancies including multiple T-cell engaging bispecific antibodies in early and late-stage development. The candidate will have unparalleled infrastructure and research support at their disposal. The successful candidate is expected to work seamlessly as part of a multifunctional team, have excellent oral and written communication skills, participate and contribute to team meetings, publish in high quality scientific, technical or medical journals and present at internal and external meetings. Role Design, conduct, and interpret experiments to identify, validate, and characterize mechanisms of response and resistance to T-cell engaging therapies with emphasis on tumor microenvironment interactions and functional interplay of different immune cell populations Responsible for integrating various biomarker datasets, preclinical and clinical findings to generate hypotheses that will lead to rational combinations and identification of novel therapeutic avenues Employ and develop cutting-edge experimental approaches to enable discovery of emerging mechanisms of action or resistance and in-depth disease biology understanding Analyze large, multi-omic datasets, including single cell datasets and large-scale clinical trial data Participate in and contribute to team, department, and leadership meetings and collaborate with scientists across different departments at Genentech and externally Publish scientific and methodological results in high quality journals Who You Are PhD degree in a relevant scientific field (e.g. immunology, molecular biology, cancer genetics, cancer biology, molecular oncology, signaling) with 0-5 years of postdoctoral experience Experience in hematology or translational research with preference for immunology training and ability to perform high quality functional assays Experience with single cell methodologies or experience with 3D and ex vivo tissue modeling is highly desirable Ability to work with large, multiomic datasets including single cell datasets using statistical software packages such as R is preferred but not required Demonstrated record of cutting-edge research as evidenced by first authored publications in top tier journals Be able to distill complex issues and clearly articulate solutions Ability to collaborate, lead, influence and motivate others Ability to demonstrate effectiveness and growth What To Expect From Us A highly collaborative and dynamic research environment where we aim to translate our understanding of hematologic malignancies and immunology and develop personalized therapies and diagnostics to transform clinical practice to benefit patient health. Opportunity for cutting-edge research leveraging clinical data sets and samples and state of the art technologies and research tools Train as a Development Scientist in a leading Oncology company Participation in seminar series featuring academic and industry scientists and opportunities to publish in top-tier journals Campus-like lifestyle with a healthy work-life balance Who We Are Genentech, a member of the Roche group and founder of the biotechnology industry, is dedicated to pursuing groundbreaking science to discover and develop medicines for people with serious and life-threatening diseases. To solve the world's most complex health challenges, we ask bigger questions that challenge our industry and the boundaries of science to transform society. Our transformational discoveries include the first targeted antibody for cancer and the first medicine for primary progressive multiple sclerosis. Diversity and Inclusion (D&I) are critical to the success of our company and our impact on society. We believe that by championing diversity of background, thought and experience, we can foster a sense of belonging and provide an environment where every employee feels valued, included, and able to contribute their best for the patients we serve. We’re focused on attracting, retaining, developing and advancing our people to their full potential by rewarding bold ways of thinking and integrating inclusive behaviors into every aspect of our work. The next step is yours. To apply today, click on the \"Apply for this job\" button. Genentech is an equal opportunity employer & prohibits unlawful discrimination based on race, color, religion, gender, sexual orientation, gender identity/expression, national origin/ancestry, age, disability, marital & veteran status. For more information about equal employment opportunity, visit our Genentech Careers page . Job Facts JOB FUNCTION Research COMPANY/DIVISION SCHEDULE Full time JOB TYPE Regular",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-27T05:22:46.000Z"
    },
    "company": {
        "name": "Genentech",
        "link": "https://www.linkedin.com/company/genentech"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "South San Francisco",
        "region": "CA",
        "postal_code": "94083",
        "street_address": null,
        "latitude": 37.65568,
        "longitude": -122.41248
    }
}