{
    "job": {
        "title": "Machine Learning Data Engineer-Photos",
        "industry": "Consumer Electronics",
        "description": "Summary Do you have a passion for building the best photo library in the world? iPhone is the most popular camera in the world. Detailed integration of software and hardware has delivered magical experiences like Photos Memories and Portrait Mode. The Camera & Photos team creates privacy-respecting machine learning technologies to ship emotional experiences to hundreds of millions of users worldwide. We are looking for an outstanding machine learning data engineer to drive data efforts, infrastructure and benchmarking for the next generation of thoughtful and personal products we deliver. If you thrive at the intersection of applied machine learning, data science and infrastructure this position will excite and inspire you. Key Qualifications Demonstrated expertise in data science Exceptional problem-solving and interpersonal skills Knowledge of data structures, algorithms, and object-oriented programming Good programming skills in Python and Bash/*nix experience A passion for visualization and fairness in AI Proven experience or education in statistics and distributed systems Description In this role you will drive data analysis and acquisition efforts to power machine learning algorithms, develop tools and workflows to streamline algorithm development and benchmarking. Candidates should have a proven track record that demonstrates software development expertise, strong collaboration, excellent communication skills and a passion for enabling high quality algorithms with the user experience in focus. The candidate needs to show initiative, take ownership of a problem and work cross-functionally to achieve goals and communicate progress. Education & Experience M.Sc / PhD in Computer Science or equivalent experience Role Number: 200276677",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-10-15T05:12:34.000Z"
    },
    "company": {
        "name": "Apple",
        "link": "https://www.linkedin.com/company/apple"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Cupertino",
        "region": "CA",
        "postal_code": "95014",
        "street_address": null,
        "latitude": 37.319313,
        "longitude": -122.02927
    }
}