{
    "job": {
        "title": "data scientist – AI/ML Solutions - Retail",
        "industry": "Consumer Goods,Food &amp; Beverages,Retail",
        "description": "Job Summary And Mission This job contributes to Starbucks success by guiding business decisions through utilizing data analysis and consulting that results in predicting outcomes, understanding complex data relationships, and developing a quantitative return on investment. This position partners on a cross-functional team of data scientists, statisticians, and business analysts supporting strategic initiatives utilizing the latest in computing technologies and operating across customer transactions and data elements to unlock the opportunities to support our global business. Models and acts in accordance with Starbucks guiding principles. Summary Of Key Responsibilities Responsibilities and essential job functions include but are not limited to the following: Extracts data from various databases; performs exploratory data analysis, cleanses, massages, and aggregates data Employs scaling & automation to data preparation techniques Determines analytics approach to solve business problems; incorporates machine learning algorithms where appropriate Connects insights to business decision making options and next steps testing or research opportunities Understands business initiatives and serves as primary analytic resource in discussions with business partners to define business questions Drives creation of final insights package and recommendations; leads presentation Directs analytic component of implementation of insights into business processes and ensures appropriate testing takes place Develops project proposals, gains stakeholder buy-in, and ensures timelines are met Promotes and advocates value of advanced analytics to solve business problems within department Mentors data analysts in descriptive and predictive analytics Summary Of Experience Years within data analysis field or discipline Minimum 3 Year’s Experience Basic Qualifications Education: MS+ with concentration in quantitative discipline - Stats, Math, Comp Sci, Engineering, Econ, Quantitative Social Science or similar discipline Required Knowledge, Skills And Abilities Ability to apply knowledge of multidisciplinary business principles and practices to achieve successful outcomes in cross-functional projects and activities Advanced competency and expertise in at least one Modeling & Machine Learning Techniques (regression, tree models, survival analysis, cluster analysis, forecasting, anomaly detection, association rules, etc.) with exposure and business-applicable experience in additional techniques Advanced competency and expertise in at least one Data ETL (Teradata, Oracle, SQL, Python, Java, Ruby, Pig) with exposure and business-applicable experience in additional languages Advanced competency and expertise in at least one Analytic Languages (R, SAS, SPSS, Stata) with exposure and business-applicable experience in additional languages Big data processing techniques, preferred Retail, customer loyalty, and eCommerce experience, preferred Core Competencies Puts the Customer First: Has a relentless focus on the customer. Understands what the customer wants and how to best deliver the experience. Works Well with Others: Listens and communicates well with others within and outside of Starbucks. Creates a team environment that is positive and productive. Leads Courageously: Takes personal responsibility to do the right thing, and persists in times of challenge or uncertainty. Adapts quickly to change and makes timely, thoughtful decisions. Develops Continuously: Continuously seek opportunities to improve self and others. Leads with trust, honesty and commitment to hire, coach and develop partners to achieve their potential. Achieves Results: Understands what drives overall business success and is accountable to prioritize and deliver quality results. Demonstrates knowledge of core products and processes to get results. Anticipates obstacles and takes action to prevent or minimize their impact.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-24T00:00:00.000Z"
    },
    "company": {
        "name": "Starbucks",
        "link": "https://www.linkedin.com/company/starbucks"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Seattle",
        "region": "WA",
        "postal_code": "98133",
        "street_address": null,
        "latitude": 47.60323,
        "longitude": -122.33028
    }
}