{
    "job": {
        "title": "Machine Learning Engineer",
        "industry": "Banking,Financial Services",
        "description": "Job Title: Machine Learning Engineer Location: Pune This role will be responsible for the Process Automation Machine Learning new technology implementation working with project teams — defining the defining the problem statement and building solutions, sourcing them from other internal teams or external options. Following are the additional responsibilities – Deep understanding of machine learning capabilitiesNew technology implementation in process automation Build and maintain reusable components and utilities as common serviceSupport / manage the design and development of technology and process solutions to meet the agreed business requirements including management information requirements and mitigation of risks (via appropriate controls / reconciliations) within the technology / process solutionsCreate and work in an agile environment. Stakeholder Management and Leadership skills Must be able to work with global (UK, India and US) and multi-disciplinary (3rd party, contractors and Barclays) delivery teams. What will you be doing? The Role Holder Will Possess The Following Responsible for the successful delivery of projects along with delivery teams Deliver innovative solutions on timely manner and within budget Contribute ideas and suggestions for process improvements within the project and across the group. Ability to work in global environment with people from diverse cultural backgrounds Delivers strategies for Colleague Process automation, improvement and opportunities for consolidation Displays ability to reach decisions under conditions of uncertainty or high risk Candidate Profile Excellent written and verbal English language skills Experience Process automation tools, Workflow/Machine Learning automation technologies. Ability to quickly learn new technology, business domains and processes Proven ability to multi-task, be flexible and work hard, both independently and in a team environment, in a high pressured environment with changing priorities Willingness to work outside of normal business hours Good team player and self-motivated Adaptable and able to pick up new techniques High attention to detail and quality of work Able to create clear technical specifications from business What We’re Looking For Technical expertise in new technologies such as ML, NLP and AI Python expert Excellent communication skills (oral and written) with senior stakeholders, business subject matter experts, IT staff Experience of working to tight deadlines in a fast moving environment Pragmatic rather than idealistic outlook Track record of high-quality delivery Wide range of proven analytical ability Use of Microsoft office products - primarily Outlook, Word, Excel, PowerPoint, Microsoft Project, Visio, Blue Works Live Strong analytical and problem solving abilities. Skills That Will Help You In The Role Strong Project Management skills Decision making capabilities Stakeholders management Development experience on Blueprism/UI Path preferred Where will you be working? Chennai Be More at Barclays At Barclays, each day is about being more – as a professional, and as a person. ‘Be More @ Barclays’ represents our core promise to all current and future employees. It’s the characteristic that we want to be associated with as an employer, and at the heart of every employee experience. We empower our colleagues to Be More Globally Connected, working on international projects that improve the way millions of customers handle their finances. Be More Inspired by working alongside the most talented people in the industry, and delivering imaginative new solutions that are redefining the future of finance. Be More Impactful by having the opportunity to work on cutting-edge projects, and Be More Valued for who you are. Interested and want to know more about Barclays? Visit home.barclays/who-we-are/ for more details. Our Values Everything we do is shaped by the five values of Respect, Integrity, Service, Excellence and Stewardship. Our values inform the foundations of our relationships with customers and clients, but they also shape how we measure and reward the performance of our colleagues. Simply put, success is not just about what you achieve, but about how you achieve it. Our Diversity We aim to foster a culture where individuals of all backgrounds feel confident in bringing their whole selves to work, feel included and their talents are nurtured, empowering them to contribute fully to our vision and goals. Our Benefits Our customers are unique. The same goes for our colleagues. That's why at Barclays we offer a range of benefits, allowing every colleague to choose the best options for their personal circumstances. These include a competitive salary and pension, health care and all the tools, technology and support to help you become the very best you can be. We are proud of our dynamic working options for colleagues. If you have a need for flexibility, then please discuss this with us. 90250590",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-25T17:16:55.000Z"
    },
    "company": {
        "name": "Barclays",
        "link": "https://uk.linkedin.com/company/barclays-bank"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "IN",
        "locality": "Pune",
        "region": null,
        "postal_code": "413115",
        "street_address": null,
        "latitude": 18.528904,
        "longitude": 73.87435
    }
}