{
    "job": {
        "title": "Software Engineer",
        "industry": "Marketing and Advertising,Computer Software,Financial Services",
        "description": "Stax by Fattmerchant We’re more than a Technology Payments Company. We’re a People Company. From simplified, flat-rate payment technology to a full line of innovative business tools, there are so many ways to make a difference with Stax. With a team of talented and inspiring people who are as diverse as the solutions we offer, Stax is a home for innovators, collaborators, and mission drivers to come together and make a meaningful impact on the businesses we serve. Since 2014, Stax has been shaping the future for thousands of businesses with solutions and technology that supports their journey to growth. It is our belief that every business deserves the ability to focus on what matters most to them. Why You’ll Love Stax by Fattmerchant As a familial and highly spirited place to work, the Stax team makes every moment memorable - for our team, our customers, our partners, and our community. From an imaginative drive to endless curiosity and the courage to do things differently, at Stax we make things happen together and are driven by our core values! Create Joy We are united by the desire to give and a deep understanding of what truly matters in life. Reliability and trust support our capacity to do what we love with a ready smile. Get It Done We hone in on what matters to businesses. We cheer and challenge, pushing each other to take one more step. Then another. We don’t stop. We just roll up our sleeves and grind. One Team We communicate with vulnerability and an open heart. We inspire each other as we work towards a common purpose and goal. We spark joy and happiness across our team members and our customers We’re proud to be recognized for our excellence in technology, work environment, and entrepreneurial spirit, with such honors as Best Fintech to Work For from PaymentSource; Coolest Office Space from Orlando Business Journal; and one of Entrepreneur Magazine’s Top Company Cultures. Not to mention countless acknowledgements in technology, innovation, and leadership from publications across the industry! As part of our interview process, we will be using a video interviewing platform, Spark Hire. The video interviewing platform will allow our hiring team and candidates to connect more quickly without the pressure of synchronizing calendars for our initial phase of candidate assessments. Our goal with the video interviewing portion of our hiring process is to learn more about your personality and previous work experience. Your Opportunity As the Software Engineer/Full Stack Engineer, you will be responsible for leading a variety of team members involved in several products at once for various platforms and services. This is a technical leadership role responsible for assisting at any technical capacity within the team to unblock and enable engineers and QA personnel. This person works to set standards and procedures with the team. This experienced engineer should be a great culture fit who is passionate about the team members’ success and the technology behind each product. Openness and vulnerability is a must-have. What You’ll Do This person is the resident technical expert on the team Execute the plans set forth by the CTO & Director of Technology on a technical level Sets standards and procedures for the team to follow Researches new technology and best solutions for each problem Collaborate closely with other teams including Marketing, FInance, BizDev, and Operations Support and troubleshooting issues with existing code Assist heavily in product releases, revisions, patches and code reviews Make decisions backed up by usage data and reporting tools Keep products up to date with new technology Understands and improves all code bases currently under development Understand the role of DevOps for releases and monitoring Other duties as assigned Requirements Your Qualifications Superb verbal and electronic communication skills Leads by example Frontend and Backend Web Development Technologies Experience with leading a technology team Understanding of web services technologies such as HTTP, WSDL, XSD, and REST Security principles and architecture Experience with DevOps - prefer AWS Familiarity with scripting languages (e.g. Typescript, NodeJS, Bash, PHP) is a requirement Experience with PHP, React, Typescript, NodeJS, MySQL Benefits Health Insurance (medical, dental, vision) Comprehensive voluntary benefits Competitive Base Salary 4% 401K Match Conference & Continuing Education Coverage Team Building Events/Opportunities Downtown Parking Unlimited PTO Free snacks + Coffee We strongly believe in the value of having a diverse team and actively work to maintain an inclusive environment. We encourage BIPOC, and candidates of any gender and orientation to apply! Stax is an equal opportunity employer. We evaluate qualified applicants without regard to race, color, religion, sex, sexual orientation, gender identity, marital status, genetic information, national origin, disability, veteran status, and other protected characteristics.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-30T03:40:05.000Z"
    },
    "company": {
        "name": "Stax",
        "link": "https://www.linkedin.com/company/staxpayments"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Orlando",
        "region": "FL",
        "postal_code": "32889",
        "street_address": null,
        "latitude": 28.53833,
        "longitude": -81.378876
    }
}