{
    "job": {
        "title": "Software Engineer",
        "industry": "Information Technology and Services",
        "description": "Software Engineer - Full Stack Summary Join the TradeSun team as a full-stack Software Engineer where you will be working with other Engineers to deliver exciting and groundbreaking technologies within our rapidly evolving platform. TradeSun® Inc. is an Edison-award winning FinTech headquartered in San Diego that delivers a SaaS-based trade finance platform. TradeSun is powered by cutting edge artificial intelligence and blockchain technology to automate trade finance document checking and compliance. We are committed to advancing opportunities for team members and creating an environment where the team can learn, grow, and evolve. Responsibilities Design and develop features in collaboration with other engineers and product owners Implement unit/integration tests and meet quality requirements Participate in Code and Design Reviews Enthusiastic and product-focused, willing and eager to take on new challenges and drive our product and culture forward. Required Qualifications 2-3 years of experience developing web applications BS in computer science or equivalent work experience Solid design and coding skills Strong OOD and SOA principles Experience with web services; consuming or creating with REST Experience with single-page application development Team player with strong analytical and communication skills Ability to work with a global team across multiple time zones Demonstrated ability to effectively drive results with cross-functional team, and make independent decisions. Recommended Qualifications Experience with Agile Development, SCRUM, or XP methodologies Experience with our specific tech stack (Node.js, Python, Angular) Experience with AWS cloud-native architecture and Kubernetes/Docker Broad full-stack experience ranging from Front-End, Services, and Data Layer Basic understanding of traditional ML concepts Location TradeSun’s headquarters are in Del Mar California – just north of San Diego. The work can be completed remotely Powered by JazzHR 3Fj1oeM6TO",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-15T08:57:12.000Z"
    },
    "company": {
        "name": "TradeSun®, Inc.",
        "link": "https://www.linkedin.com/company/tradesun"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "San Diego",
        "region": "CA",
        "postal_code": "92161",
        "street_address": null,
        "latitude": 32.71576,
        "longitude": -117.16382
    }
}