{
    "job": {
        "title": "Software Engineer",
        "industry": "Information Technology and Services",
        "description": "ALLOY’s engineering team provides software development and technical expertise to solve practical, real-world problems and build high-end, world-class customer experiences. We maintain existing products, architect new ones, estimate effort and provide informed opinions around what’s possible, reasonable and feasible. We strive to incorporate more DevOps practices into our work every day and to continually leverage the latest cloud computing services. Our engineers are fearless, aggressive makers and problem solvers. We love to combine talents to overcome the obstacles that strike fear in the hearts of most shops. We learn something new every day and never shy away from conversations, music recommendations, or new ideas. What You Will Do Develop and enhance a suite of applications written in C# and SQL Server, hosted in AWS Implement new features and bug fixes and support them through testing and deployment Migrate legacy, server based applications onto serverless platforms and managed services Research and pinpoint issues in complex systems with lots of moving pieces Develop CI/CD pipelines and automated tests to ensure your applications are always in a deployable state Requirements What we definitely need Takes pride in writing clean, elegant code Knowledgeable of modern software platforms, patterns, and practices Strong understanding of web protocols such as TCP, HTTP, and REST Detail oriented Able to explain complex concepts in simple terms Ability and desire to quickly learn new technology Strong troubleshooting/debugging skills C# ASP.NET MVC Javascript frameworks such as Node.js, React, and Vue Entity Framework/Dapper SQL Server AWS Git Nice to haves Bachelor of Science in CS or MIS preferred SQL/.NET/AWS certification is a plus Experience with Agile and Scrum methodology best practices",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-17T04:34:51.000Z"
    },
    "company": {
        "name": "Alloy",
        "link": "https://www.linkedin.com/company/alloy-birmingham"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Birmingham",
        "region": "AL",
        "postal_code": "35226",
        "street_address": null,
        "latitude": 33.522858,
        "longitude": -86.80771
    }
}