{
    "job": {
        "title": "Software Engineer",
        "industry": "Broadcast Media",
        "description": "Company Overview At Synamedia, we have over 2,000 uniquely talented people working together across the globe to achieve our vision of transforming the way the world is entertained and informed. As the largest global provider of video solutions, you can be part of building and delivering the most complete, secure, and advanced end-to-end technology platform. Our solutions combined with our partnership with over 200 customers worldwide means we are touching the lives of millions of people everywhere. We think that is quite exciting! When welcoming new people to our team we are always looking for opportunities to bring in new ideas, those who ask the challenging questions and have the curiosity to learn. These qualities are important to us as we innovate solutions, seize more opportunities to partner with our customers and make a difference as we collaborate to innovate the future of video. Our values connect us. Our diversity gives us strength. Our curiosity inspires creativity. If that sounds like the place, you would like to be then we look forward to hearing more from you. Role Description This is an opportunity to join a team working at the forefront of new technologies to defeat piracy of TV services. It’s a chance to step aboard at the early stage of new product development and make a valuable contribution. The opportunity involves working in a small, dynamic, tightly-knit and highly supportive team, with very strong links to the wider organisation internationally. Working will initially be fully remote, with the anticipation of a hybrid working model at some point. There may occasionally be a need to travel abroad. Responsibilities The responsibilities of the successful candidate would include With support from the team, build up knowledge of the product design and technology set, and understand what has been implemented so far. Learn the development environment, tools, languages, and processes Contribute to the development and testing of new features, bug fixes and code improvements. Build knowledge of the wider system and join collaborative efforts with other teams to implement larger features across multiple components. Contribute to new feature analysis, estimation, and design. Learn the deployment environment including cloud technologies and containers. Build up knowledge of video technologies over time. Build up security knowledge over time, including secure implementation principles, threat analysis, encryption, and secure protocols. Ensure all code is well covered by automated tests within a CI framework Communicate and share knowledge, within and beyond the team. Personal Attributes The successful candidate will demonstrate outstanding analytical thinking and problem solving, the ability to rapidly assimilate knowledge, and the aptitude to translate this into high quality working software implementations. Basic capability with C++ is a great starting point, and the candidate will eventually also become proficient in Python and Rust. A Culture of Belonging We want to let you know that Synamedia is committed to promoting a diverse and inclusive community - a place where we can all be ourselves and succeed. We offer a range of family friendly, inclusive employment policies, flexible working arrangements, engagement activities and services to support all our people. More information If this role sparks your interest, have any questions, or require any accommodations to be made to help you through your application, please reach out to our recruitment team who will be happy to help.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-18T22:15:33.000Z"
    },
    "company": {
        "name": "Synamedia",
        "link": "https://uk.linkedin.com/company/synamedia"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "GB",
        "locality": "Chandlers Ford",
        "region": null,
        "postal_code": "SO45",
        "street_address": null,
        "latitude": 50.98582,
        "longitude": -1.3889568
    }
}