{
    "job": {
        "title": "Data Engineer",
        "industry": "Information Technology and Services,Staffing and Recruiting,Financial Services",
        "description": "Data Engineer with C++ and Python Fulltime/Perm opportunity Location: Wayne, PA (2 days a week on site once covid clears) Solid python, C++ and sequel. C++ legacy code. Engineering side of data, not analyst. Remote to start but eventually would be in office, could be combo home and office. Join a team of financial software specialists responsible for the acquisition and management of financial market and related data required for research implementation of systematic trading strategies. Primary Responsibilities Implement robust solutions for adoption, storage and management of large volumes of data Develop quality assurance systems in support of high integrity data sets Assist quantitative analysts in crafting custom, bespoke data sets Support timely and fault tolerant data systems in support of production trading algorithms Meet tight deadlines in an efficient manner Requirements Of The Candidate Include Bachelor’s degree in Computer Science or applicable degree and very strong exposure to programming and computer systems Experience with Python and C++ Experience with data storage and manipulation using approaches such as HDF5, Pandas, and RDBMS/SQL 2+ years professional experience in data management role The desire to work in a fast-paced, hardworking and committed environment with a talented team Strong problem solving skills, critical thinking and clear written and verbal communications Financial industry, market data and cloud data environment experience are beneficial #Dice-SPG",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-21T02:20:09.000Z"
    },
    "company": {
        "name": "Yoh, A Day &amp; Zimmermann Company",
        "link": "https://www.linkedin.com/company/yoh-a-day-&amp;-zimmermann-company"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Wayne",
        "region": "PA",
        "postal_code": "19089",
        "street_address": null,
        "latitude": 40.58276,
        "longitude": -76.22929
    }
}