{
    "job": {
        "title": "Entry Level Software Engineer",
        "industry": "Information Technology and Services",
        "description": "About the job Position Description As an Entry-level Software Engineer, you will be trained to develop information systems by designing, developing, and installing software solutions to world class clients we serve. Campus hires begin their careers with TCS in the Initial Learning Program (ILP). A fully paid training program designed to provide you with the information and training necessary to succeed at TCS and excel on assignments with different customers. However, the learning does not stop there! TCS is committed to the continuous growth of its associates, in line with the core value of Learning & Sharing. We provide a Continuous Learning Program that spans technologies, domains, processes and soft skills. In addition, TCS associates are encouraged to undertake certifications and accreditations in a wide range of subject areas. With customers located across the US, TCS can offer great flexibility in work location, excellent career advancement, and a variety of opportunities. TCS' mentoring, career development, and on-the-job training ensure a smooth transition into your professional life and orient you to our culture, values, vision, and mission. These positions are for our TCS Edison, New jersey Hub (Candidates will be expected to be open for relocation within these states - DE, MD, NY, PA, CT, RI, VI, MA, DC, NH ) Eligibility Requirements Bachelors or Masters in one of the following: Computer Science(CS) Computer Engineering(CE) Information Technology (IT) Information Systems (IS) Electrical Engineering (EE) Informatics of Software Engineering, other related majors. Cumulative GPA 3.0 or higher Knowledge of basic computer science, Programming and information systems concepts. Valid work authorization in the US Open to relocation Highest education in US. Responsibilities Design or customize software for client use optimize operational efficiency. Analyze user needs and develop software solutions. Improve existing systems by analyzing of modification. Analyze & design databases with areas. Coordinate database development with a team or individually. Maintain systems by monitoring, identifying correcting software defects. Create technical specifications & test plans. Update knowledge & skills regularly through in-house and external courses, and new applications. For more details, visit our website https://www.tcs.com/ Careers - Entry Level Hiring. If you are interested in exploring career opportunities in other locations, please check out our other job postings. About TCS TCS is a global leader in IT Services, digital & business solutions partnering with clients to simplify, strengthen & transform their businesses. At TCS, our goal is to amplify your impact on the world. Join us as we bring the future into the present by infusing passion, creativity and technology into business through empowerment and innovation. With multiple career opportunities across the US, TCS is dedicated to hiring thousands of new hires this year.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-13T16:39:34.000Z"
    },
    "company": {
        "name": "Tata Consultancy Services",
        "link": "https://in.linkedin.com/company/tata-consultancy-services"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "New Jersey",
        "region": "United States",
        "postal_code": "08810",
        "street_address": null,
        "latitude": 40.139095,
        "longitude": -74.67851
    }
}