{
    "job": {
        "title": "Machine Learning Software Engineer",
        "industry": "Consumer Electronics",
        "description": "Summary The people here at Apple don’t just build products — they build the kind of wonder that’s revolutionized entire industries. It’s the diversity of those people and their ideas that encourages the innovation that runs through everything we do, from amazing technology to industry-leading environmental efforts. Join Apple, and help us leave the world better than we found it. Imagine what you could do here. At Apple, great ideas quickly have a way of becoming great products, services, and customer experiences. Bring passion and dedication to your job and there's no telling what you could accomplish here. Do you want to be part of a team that builds cutting edge software service, a team that is continually innovating and is proud of making a difference? If so, bring your passion and talent and come join us to be part of something big and amazing. Apple's IS&T team is looking for highly motivated and hardworking engineers to build the next generation of software services that powers several critical applications. Would you like to be part of a team that impacts millions of users every single day? Does building highly scalable data-driven systems to tackle real-world problems with a customer-experience centric focus excite you? Do you lose sleep pondering about the algorithm that accurately predicted your recommendation? If so, we'd love to hear from you. We are looking for a hands-on NLP/machine learning software engineer who is passionate about crafting, developing, and fielding intelligent solutions that have direct and measurable Product Quality impact to Apple. You will work with various business leaders and executives to help identify viable data mining opportunities and then implement end to end analytical solutions. You should possess a broad knowledge of existing machine and deep learning algorithms and the creativity to invent and customize when vital. Key Qualifications Proven understanding of Python, and general software development skills (source code management, debugging, testing, deployment etc.) Experience with NLP technologies & the handling of unstructured text Detailed understanding of text pre-processing and normalisation techniques such as tokenisation, lemmatisation, stemming, POS tagging and parsing and how they work at a low level Prior experience in implementation of industry solution with traditional ML - classification, regression or clustering problem Working experience in Software Development Lifecycles, agile methodologies, and continuous integration Expertise in text-analytics - Sentiment Analysis, Entity Extraction, Language modelling - and associated sequence learning models ( RNN, LSTM, GRU ) Comfort in working with deep-learning libraries (Tensorflow, Keras, Theano, PyTorch) Description Apple has a tremendous amount of data, and we have just scratched the surface in pattern detection, anomaly detection, predictive modeling, and process optimization. The Contact Technologies NLP/Machine Learning team has delivered innovative solutions including virtual chat-bots and sentiment analysis in CRM. There are many more exciting problems on improving customer service experience yet to be discovered and solved and business owners eager to use the power of neural networks and machine learning. We support a collaborative work environment, while allowing solution autonomy on projects. Conceive and design end to end machine learning solutions to support Apple's business units: -  Work with business owners to map business requirements into technical solutions -  Develop and implement solutions to fit business problems, which may include applying algorithms from a standard tool or custom algorithm development -  Implement entire ML pipeline from data pre-processing and feature engineering through model building to model evaluation -  Work closely with data warehouse architects and software developers to generate detailed business intelligence solutions for end users -  Perform ad-hoc statistical and data science analysis -  Design model evaluation techniques and present results of analysis to business units Education & Experience BTech/BE in Computer Science - Certifications in Machine Learning, Data Science, Artificial Intelligence, Computational Linguistics or related fields - 5 years or more of proven ability applying data science techniques to real business problems Role Number: 200219504",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-15T16:36:39.000Z"
    },
    "company": {
        "name": "Apple",
        "link": "https://www.linkedin.com/company/apple"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "IN",
        "locality": "Hyderabad",
        "region": null,
        "postal_code": "500065",
        "street_address": null,
        "latitude": 17.36172,
        "longitude": 78.47517
    }
}