{
    "job": {
        "title": "Data Scientist-NLP",
        "industry": "Management Consulting",
        "description": "We are looking for experienced Data Scientists with a specialization in Natural Language Processing (NLP). Our client is a data science consultancy committed to building a centre of excellence for machine learning and analytics. We design, build, and implement platforms which help some of the world’s most recognized brands to increase the value of their services through smarter decision making. We offer a start-up culture, backed by extensive resources and mentorship from our two prestigious parent companies. Working alongside a team of gifted industry experts and supported by dedicated training and personal development, our data scientists thrive in a continuous learning culture. We are recruiting talented data scientists with expertise in NLP who will apply analytics and machine learning to a diverse range of exciting and impactful client projects. As a member of the team, you will develop innovative and sophisticated solutions to some of the most complex strategic business challenges. Responsibilities include: Design and prototype solutions to our clients’ data science use cases and contribute to their deployment in a variety of client environments Regularly collaborate and knowledge-share with colleagues Help establish rigorous machine learning and statistical analysis best- practices to ensure consistency and maximum impact for all projects Data Scientist Expectations: Graduate university degree in Science, Technology, Engineering or Mathematics (STEM) preferred, but professional work experience is highly valued 2-3 years professional experience outside of the classroom with: -Natural language Processing (NLP) models and projects -Supervised and unsupervised learning techniques -Evaluating, visualizing and explaining data science concepts and outcomes -Exploring data, wrangling data and engineering features Proficient in SQL and Python and/or R: -SQL: able to write performant and sophisticated queries and joins -Python/R:authors code that is efficient and follows basic best practices -Python/R: familiar with specialized data science packages Proficient in NLP Concepts including but not limited to: -Feature based Grammars -Constituency Parsing -Dependency Parsing -BERT -Bayesian Optimization -Naive Bayes -N-gram model -Interpolation",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-05T15:00:10.000Z"
    },
    "company": {
        "name": "io173",
        "link": "https://uk.linkedin.com/company/io173"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "New York",
        "region": "NY",
        "postal_code": "10132",
        "street_address": null,
        "latitude": 40.713047,
        "longitude": -74.00723
    }
}