{
    "job": {
        "title": "Production Support Software Engineer- CCE - Mulesoft",
        "industry": "Computer Software,Information Technology and Services,Internet",
        "description": "To get the best candidate experience, please consider applying for a maximum of 3 roles within 12 months to ensure you are not duplicating efforts. Job Category Products and Technology Job Details Production Support - Customer Centric Engineering Location: San Francisco About Mulesoft, a Salesforce Company MuleSoft makes it easy to connect the world’s applications, data and devices. We provide a flexible, unified software platform that enables organizations to easily build application networks using APIs - the digital glue that allows applications to talk to each other and exchange data. MuleSoft is at the heart of the applications and services you use every day, like Netflix, Spotify and Salesforce, from Global 500 corporations to emerging companies in more than 60 countries. Job Details Join a high impact Mulesoft engineering team that delivers Customer Love by solving the toughesttechnical customer escalations fast and champions trust strategy throughout the company. At Mulesoft, trust is our #1 priority. Our cloud applications handle billions of transactions each dayfor companies who demand high quality, responsiveness, and predictability. Performance issues and functional bugs must be identified and resolved quickly. As a Customer Centric Engineer within R&D you will investigate, reproduce, and diagnose complex issues affecting our customers. You shouldbe passionate about solving tough technical problems and recommending improvements to products and processes. Technical skills are important, but so are persistence, patience and communication. What You’ll Be Doing Using your Java, database, Cloud infrastructure, and API frameworks skills to solve criticalcustomer technical escalations to R&D from our Technical Support organization in a timely manner Work together with Technical Support team on alleviating customer from current issue theyface Figuring out ways to \"find the bug\" utilizing top-notch troubleshooting techniques and all the tools and systems available within the R&D organization, and digging deep into code Identifying root causes, proposing test cases and fixes, and developing new debugging tools while working closely with product teams Providing timely information to customer facing teams to improve overall customersatisfaction Mentoring Technical Support on technical issues and best practices Building relationships with other teams across Customer Services, R&D, and data centeroperations as a technical expert Provide expert opinion as R&D when required during an incident. Championing Support and Debug initiatives throughout R&D What We’re Looking For Developer-level technical chops along with a strong desire to interact with customers, support engineers and management on high-profile issues critical to the long-term successof the company Demonstrable curiosity, passion, integrity and outstanding attention to detail in professional and personal pursuits Unparalleled troubleshooting and problem-solving skills Excellent written and verbal communication skills, as exemplified by clear bug/issue explanations, documentation of knowledge, mentoring ability, and comfort interacting withall levels of management Bachelor's Degree. BS or MS in Computer Science preferred. Required Technical Skills Fluency in an object oriented language; Java preferred Experience with a known IDE: Eclipse or IntelliJ Prior experience building tools, frameworks to automate product functionality, building API driven applications and CI/CD pipelines Familiarity with core web technologies: HTTP, JSON, REST, XML Experience using Linux environments and Cloud technologies For Colorado-based roles: Minimum annual salary of $121,800. You may also be offered a bonus, restricted stock units, and benefits. More details about our company benefits can be found at the following link: https://www.getsalesforcebenefits.com/ Accommodations If you require assistance due to a disability applying for open positions please submit a request via this Accommodations Request Form. Posting Statement At Salesforce we believe that the business of business is to improve the state of our world. Each of us has a responsibility to drive Equality in our communities and workplaces. We are committed to creating a workforce that reflects society through inclusive programs and initiatives such as equal pay, employee resource groups, inclusive benefits, and more. Learn more about Equality at Salesforce and explore our benefits. Salesforce.com and Salesforce.org are Equal Employment Opportunity and Affirmative Action Employers. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender perception or identity, national origin, age, marital status, protected veteran status, or disability status. Salesforce.com and Salesforce.org do not accept unsolicited headhunter and agency resumes. Salesforce.com and Salesforce.org will not pay any third-party agency or company that does not have a signed agreement with Salesforce.com or Salesforce.org . Salesforce welcomes all. Pursuant to the San Francisco Fair Chance Ordinance and the Los Angeles Fair Chance Initiative for Hiring, Salesforce will consider for employment qualified applicants with arrest and conviction records.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-09T17:43:23.000Z"
    },
    "company": {
        "name": "MuleSoft",
        "link": "https://www.linkedin.com/company/mulesoft"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "San Francisco",
        "region": "CA",
        "postal_code": "94121",
        "street_address": null,
        "latitude": 37.78008,
        "longitude": -122.42016
    }
}