{
    "job": {
        "title": "Front-End Software Engineer",
        "industry": "Financial Services",
        "description": "Grade ( relevant for internal applicants only ): 10 The S&P Global Platform team is a creative team of experts collaborating across divisions and driving continuous improvements in platform usability and innovation. The Platform team is building NextGen core capabilities to drive deeper Technology transformation for S&P Global. We are now looking for a motivated engineer in this space to help grow and expand our Platform Core Services. The front-end UI/UX engineering for Platform Core Services is a key component of S&P Global's Technology organization that provides an enriched and valuable ecosystem of core capabilities for the S&P Global platform that drive innovation for our clients, within S&P Global divisions, and globally. The Impact The S&P Global Platform team is responsible for defining the next generation of the S&P Global Platform. To do this, the front-end engineer for the Platform Front-End team needs to understand the technical challenges and apply industry best practices to create scalable capabilities. This position will report to Common Capability Approach technical product management. What’s In It For You This position provides the opportunity to play a role in a highly involved strategic team across S&P Global. Through partnerships with divisional Technology, Data, Product, and Commercial Teams, you will work with talented individuals to help identify market and competitive influences to drive platform innovation and expansion. Responsibilities Creating POCs leveraging the latest web and cross-platform technologies Implementing reusable code for future use Implementing lean, clean, and high-quality code Conferring with team colleagues to resolve conflicts, prioritize needs, develop content criteria, or choose solutions Evaluating code to ensure it meets industry standards, is valid, is properly structured, and is compatible with browsers or devices. Promoting positive team culture and staying vigilant to ensure that the team stays at its optimal state Must Have Qualifications: Bachelor's degree in Computer Science or Equivalent, Information System, or equivalent work experiences A minimum of 5+ years of Full STACK significant experience in application development. Proficiency in HTML, CSS, and Javascript/TypeScript 5+ years of work experience - Web Development, Front-End Software Engineering 2+ years of work experience with at least one of the front-end frameworks such as React 2+ years of work experience with CSS pre-processors such as LESS and SASS 2+ years of work experience with NodeJS and NPM environments Proficiency in HTML, CSS, and Javascript/Typescript Proficiency in C# programming language and related frameworks, API development experience Proficiency in software development lifecycle (SDLC) methodologies like Agile, Test-driven development. Preferred Experience in responsive and adaptive design Experience working with relational Database Experience Microsoft Azure DevOps Experience with Git Good To Have Able to work well individually and with a team Excellent verbal communication skills Strong problem-solving skills Good work ethic, self-starter, and results-oriented Good problem-solving skills Good interpersonal skills S&P Global states that the anticipated base salary range for this position is $68,300 to $155,900. Base salary ranges may vary by geographic location. In addition to base compensation, this role is eligible for an annual incentive plan. This role is eligible to receive additional S&P Global benefits. For more information on the benefits we provide to our employees, visit https://www.spgbenefitessentials.com/newhires . S&P Global is an equal opportunity employer and all qualified candidates will receive consideration for employment without regard to race/ethnicity, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, marital status, military veteran status, unemployment status, or any other status protected by law. Only electronic job submissions will be considered for employment. If you need an accommodation during the application process due to a disability, please send an email to: EEO.Compliance@spglobal.com and your request will be forwarded to the appropriate person. The EEO is the Law Poster http://www.dol.gov/ofccp/regs/compliance/posters/pdf/eeopost.pdf describes discrimination protections under federal law. 20 - Professional (EEO-2 Job Categories-United States of America), IFTECH202.1 - Middle Professional Tier I (EEO Job Group), SWP Priority – Ratings - (Strategic Workforce Planning) Job ID: 261204 Posted On: 2021-06-11 Location: New York, New York, United States",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-01T06:38:49.000Z"
    },
    "company": {
        "name": "S&amp;P Global Market Intelligence",
        "link": "https://www.linkedin.com/company/s&amp;p-global-market-intelligence"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "New York",
        "region": "NY",
        "postal_code": "10132",
        "street_address": null,
        "latitude": 40.713047,
        "longitude": -74.00723
    }
}