{
    "job": {
        "title": "Sr. Software Development Engineer in Test - System Foundation",
        "industry": "Marketing and Advertising,Information Technology and Services,Computer Software",
        "description": "At Sonos, we want to create the ultimate listening experience for our customers, and connect them to the content they want, where they want it. As part of the Sonos team, you’ll collaborate with people of all styles, skill sets, and backgrounds to realize our vision while fostering a community where everyone feels included and empowered to do to the best work of their lives. As a Sr SDET, you will represent the Software Quality Engineering discipline in the Software Engineering group. You will strive for service engineering excellence and work closely with the SW team in the design, implementation and testing of embedded systems, APIs and SDK integration as well as mobile to make our validation strategy a reality in this new domain. Be part of the team building and integrating the next generation IoT platform, API, and developer portal for controlling the Sonos system to bring these experiences to businesses, their customers and employees. What You’ll Do Engineer new automated frameworks to support embedded devices and cloud services/features Drive and document test strategies, design edge cases, and conduct manual and automated testing for various features across all platforms: Mac, Win, Linux, Android and iOS Constantly perform gap analysis to ensure good test coverage, assess and provide proactive advice or solutions Investigate logs and triage bugs to determine root cause and establish prioritization of any issues discovered during manual and/or automated testing that runs in a CI environment Review requirements, behavior specifications, and design documents to begin test development early and uncover issues prior to implementation Mentor other members of the team to expand their technical competencies and to adapt the best software engineering practices Basic Qualifications What You’ll Need Bachelor's Degree in Computer Science, Software Engineering or equivalent experience 5+ years of experience in a back-end or service side automation and testing role Demonstrated proficiency writing code for automation with one or more of the following: Python, Pytest, Java, C/C++ Additional technologies we use across our teams Embedded, Restful API and Cloud automation testing tools in a B2B model Test Automation Frameworks in Python App automation tools such as Earl Grey, Simulators, XCode Jira, TestRail and CI/CD tools such as Jenkins, Ansible, SonarQube and Coverity Kubernetes and Docker containerization AWS Cloud Services Linux as a development platform Tableau, DataDog and other system reliability and quality tracking tools Open API Specifications, Data Telemetry and Code Instrumentation",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-08T17:14:31.000Z"
    },
    "company": {
        "name": "Sonos, Inc.",
        "link": "https://www.linkedin.com/company/sonos-inc-"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "San Francisco",
        "region": "CA",
        "postal_code": "94121",
        "street_address": null,
        "latitude": 37.78008,
        "longitude": -122.42016
    }
}