{
    "job": {
        "title": "Data Scientist",
        "industry": "Marketing and Advertising,Computer Software,Internet",
        "description": "FocusKPI is seeking smart, curious, technically savvy and experienced candidates to join our cutting-edge data science team. The data science team at FocusKPI build models and machine learning algorithms that power all our clients’ ad-tech/mar-tech products at scale, develop methodology and tools to precisely and effectively measure market campaign effects, and research in-house and public data sources for consumer spend behavior insights. In this role, you'll be spearheading the company’s advanced predictive modeling and analytical innovation to bring the analytical capability to the next level. In addition, you'll be expected to play an important role in carrying out R&D agenda, and in product deliveries for different business on time and quality. Duties And Responsibilities Support all clients modeling needs, including model development, maintenance and improvement of the company’s current modeling/scoring methodology and processes, and to ensure on time and quality delivery, Provide innovative and automated solutions to customized modeling/scoring/targeting with appropriate ML/statistical tools. Work with the data engineering team on the data platform initiative to enable client building modeling through API. Engage in R&D to explore, test and implement new modeling methods and technology. Mine large consumer datasets in the cloud environment to support ad hoc business and statistical analysis, Provide analytical/statistical support such as marketing test design, projection, campaign measurement, market insights to clients and stakeholders. Communicate the methodologies and the results to the management, clients, and other non-technical stakeholders. Basic Qualifications Advanced degree in Statistics/Mathematics/Computer Science/Economics or other fields that requires advanced training in data modeling and analytics. Deep understanding and solid knowledge of the fundamentals of statistic reasoning and data modeling. Excellent in the conceptualization of business problems and ability to craft sound and practical modeling and analytical solutions to solve problems. Industry experience in classification, time series and survival modeling/algorithm, and in statistical tests to solve business problems such as targeting, test design, KPI projection and performance measurement. Strong Python and SQL background, and excellent command in other programming languages, preferably R for business data modeling and analytics. Experience and comfortable working in the Cloud environment and familiar with one of the database technologies such as PostgreSQL, MySQL and at ease with SQL queries. Entrepreneurial, highly self-motivated, collaborative, keen attention to detail, willingness and capable learn quickly, and ability to effectively prioritize and execute tasks in a demanding environment. Flexibility in a wide range of data science areas. Great communication skills (verbal, written and presentation). Preferred Qualifications Experience or exposure to large consumer and/or demographic data sets. Familiarity with data manipulation and cleaning routines and techniques. Powered by JazzHR RfMP8STfgf",
        "employment_type": "CONTRACTOR",
        "date_posted": "2021-06-25T19:56:55.000Z"
    },
    "company": {
        "name": "FocusKPI, Inc.",
        "link": "https://www.linkedin.com/company/focuskpi"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Mountain View",
        "region": "CA",
        "postal_code": "94040",
        "street_address": null,
        "latitude": 37.39008,
        "longitude": -122.08139
    }
}