{
    "job": {
        "title": "Data Scientist - U.S. Electricity Markets",
        "industry": "Construction,Oil &amp; Energy,Financial Services",
        "description": "Company Overview Edison Energy is the expert independent advisor for commercial, industrial, and institutional energy users, delivering comprehensive, data driven and integrated global energy solutions. We provide a full-suite of sustainability-driven & energy management solutions including specialized delivery of renewables, supply, demand, engineering, portfolio advisory and analytics services, serving market leaders facing an increasingly complex energy environment. As a wholly owned subsidiary of Edison International (NYSE: EIX), Edison Energy combines sophisticated, cloud-based analytics and focused energy advisory services with Edison International’s scale and stability to deliver high-quality services to our clients. Our goal is to leverage our years of experience in traditional power and gas markets, renewable energy and sustainability advisory, and engineering and implementation services to design solutions that empower our clients to build economically sustainable energy portfolios. Position Overview The data scientist will provide insight and expert analysis of electricity markets across the U.S. The Market Insights and Analysis team provides market insights, price forecasts, and PPA cash flow evaluations to support client engagements. This role will help enhance the company’s electricity market modeling capabilities and integrate the modeling process into the company’s broader analytical process. Essential Functions Manage build out of in-house electricity market models for specific U.S. markets; Develop tools for automating model updates and improving model integration with other in-house analytics tools; Collaborate closely with other teams to ensure streamlined client support and appropriate data warehousing; Articulate and explain market model inputs/outputs to senior executives and other stakeholders with market analysis, modeling, & assessments of market impacts; Monitor market developments and provide analysis of critical changes; Track key regulatory changes within specific markets through research and attending conferences; Qualifications Bachelor’s and/or Master’s in engineering, mathematics, or a related quantitative field; High level of quantitative & analytical skills with 2+ years of relevant work experience providing quantitative analysis, electricity market modeling, and/or consulting; Ability to work independently and manage task development and deadlines; Broad knowledge of U.S. power industry structures, policies, regulations, and market fundamentals; Familiarity with recent trends in conventional generation, renewables, energy storage, distributed generation, and transmission development; Experience developing & employing market and/or financial models, as well as with commercial production cost and capacity expansion modeling software: PSO/Enelytix, PLEXOS, ProMOD, Gridview, Aurora, GE MAPS, Dayzer, etc. Ability to translate model outputs and articulate impact of results on client decisions; Advanced proficiency in Excel; Familiarity with PowerBI or Tableau for data analysis, visualization, and dashboard development; Experience using one or more scientific programming languages such as Python, R, or MATLAB; Work Environment Regular professional, office business setting Noise level ranges from low to moderate (if in office setting) Noise level ranges from moderate to high (if on construction worksite) Benefits for Full-Time Employees: Generous Paid Time Off (includes but not limited to Paid Parental Leave, Bereavement, Jury Duty, Sick, Vacation, etc.) National Holiday Pay & Float Holidays 401(k) Employer Matching Health Benefits: Medical, Dental, Vision Employer 100% Paid Life Insurance Benefits Employer 100% Paid Short Term and Long Term Disability Plans Supplemental (Flexible Spending Accounts, Commuter Benefits, Cancer/Critical Care, Hospitalization, Accident) Education tuition reimbursement program (from an accredited institution for college level and/or advance degree) Recognition of Hard Work and Exemplary Performance Short Term Incentive (STI) Bonus Based on Performance Goals",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-27T05:04:27.000Z"
    },
    "company": {
        "name": "Edison Energy",
        "link": "https://www.linkedin.com/company/edison-energy-inc-"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Boston",
        "region": "MA",
        "postal_code": "02118",
        "street_address": null,
        "latitude": 42.358994,
        "longitude": -71.05863
    }
}