{
    "job": {
        "title": "Data Scientist",
        "industry": "",
        "description": "Sumner & Scott are looking to recruit a number of Data Scientists to join a fast growing FinTech start up focussing on bringing down data barriers. One of the most valuable kinds of data today is in the financial sector. Financial data plays a key role across many industry verticals. However, it has notoriously been locked behind regulatory barriers and a lack of format standards. Our clients first product is an API that makes financial transactions accessible with minimal engineering overhead to both humans and machine-learning models in a scalable and privacy-preserving way. They - are allergic to over-engineering. - are anarchists at heart and like to hack around the status quo. - are radically honest and appreciate challenging one another, rather than giving out “pats on the back”. - are willing to learn and adapt quickly to new situations and requirements. Languages, frameworks, libraries, compilers, etc. are just tools for a job. A new problem might need a new tool. If it doesn’t exist yet, we will build it. - have a sense of humor (well, we think we do). As an early member of their data science team, you will help - push the limits of what can be done with data. - build the team and drive the direction of the company. - shape our product and culture. - experience the direct impact of what you build on hundreds of millions of people’s financial lives. The following are required - the tools: Python, Pandas, Matplotlib, scikit-learn, etc. - Spark, SQL and fundamental database operations. - recognized open-source contributions and/or top performance in data competitions (Kaggle, Numerai, etc.). - fluency in statistics and probability.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-10-04T13:56:25.000Z"
    },
    "company": {
        "name": "Sumner &amp; Scott",
        "link": "https://www.linkedin.com/company/sumner-&amp;-scott"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "United States",
        "region": null,
        "postal_code": "99999",
        "street_address": null,
        "latitude": 39.50355,
        "longitude": -99.0183
    }
}