{
    "job": {
        "title": "Site Reliability Engineer",
        "industry": "Information Technology and Services",
        "description": "Site Reliability Engineer Excellent opportunity to be part of this high growth business unit transforming on premise applications to Google Cloud Platform. You will work with a dedicated team to design, configure, deploy, and support enterprise applications to GCP in a large, data intensive environment. RESPONSIBILITIES: Work with business and IT team to transform enterprise applications from on prem to GCP Design, configure, deploy, and triage applications into production Code deployment utilizing terraform CI/CD Write scripts, performance monitoring Support and on call duties Document new processes This is an excellent 6+ month contract opportunity working with a high growth business unit as they transform to GCP. Outstanding opportunity to learn and grow your skills in a team that is seeking innovation in product and technology. Potential for conversion to full time employment. Ideally in Saint Louis or Atlanta but you can work 100% remotely. REQUIRED SKILLS: 5+ years as an SRE - Site Reliability Engineer GCP - 1 year - experience deploying code to cloud platforms Experience deploying/supporting .Net/C# applications Windows and related scripting skills in PowerShell, Python, or Bash Knowledge of CI/CD, Jenkins pipelines Excellent troubleshooting skills and a problem-solver mindset PREFERRED SKILLS: Kubernetes - certifications GKE AppDynamics",
        "employment_type": "CONTRACTOR",
        "date_posted": "2021-08-10T15:15:22.000Z"
    },
    "company": {
        "name": "Visionaire Partners",
        "link": "https://www.linkedin.com/company/visionaire-partners"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "United States",
        "region": null,
        "postal_code": "99999",
        "street_address": null,
        "latitude": 39.50355,
        "longitude": -99.0183
    }
}