{
    "job": {
        "title": "Data Engineer III",
        "industry": "Information Technology and Services,Computer Software,Hospital &amp; Health Care",
        "description": "Description “TO ENSURE THAT NO ONE WILL EVER WAIT FOR CARE” Data Engineer I I I Who We Are For over 30 years, TeleTracking has been operating with a simple mission, to ensure that no one waits for the care they need . Our state-of-the-art technology, combined with actionable best practices and a strong advisory services team, means that we provide the critical operational components required to build a responsive, resilient healthcare system. One of those key components is the centralization of hospital operations…the ability to see in real-time everything from the number of available beds to receive and treat patients to the number of pieces of available medical equipment. Teletracking values people with and entrepreneurial spirit, creativity and building strong relationships with our employees. We believe that diversity, equity and inclusion in our workforce keeps us competitive and provides opportunities for everyone. JOB SUMMARY A Data Engineer I I I is responsible for coding and continuous testing of complex modules and applications in support of the TeleTracking platform. This role will also be charged with understanding and interpreting requirements to contribute to the technical architecture and the associated design documents. PRIMARY DUTIES AND RESPONSIBILITIES Writing, debugging, unit testing, and performance test code in the data access layer in accordance with TeleTracking standards. As an agile team member, participate in code reviews, design reviews, etc. Utilize domain driven techniques and design patterns to build and contribute to technical design. Develop and maintain strong knowledge of implemented requirements and detailed application behaviors. Assists in the development and training of SE I. EDUCATION Bachelor's computer information technology, computer science, management required Master's preferred Experience 7 + years of experience in a cloud computing environment. Strong understanding and familiarity working in the Linux operating environment. Familiarity and experience executing several software development methodologies and life cycles preferred. Skills 7 + years of developing software using object-oriented or functional language experience 5+ years of SQL 7 + years working with open source Big Data technology stacks (Apache Nifi , Spark, Kafka, HBase, Hadoop/HDFS, Hive, Drill, Pig, etc.) or commercial open source Big Data technology stacks (Hortonworks, Clouder a , etc.) 3 + years with document databases (e.g. MongoDB, Accumulo , etc.) 3+ years of experience using Agile development processes (e.g. developing and estimating user stories, sprint planning, sprint retrospectives, etc.) 2+ years of distributed version control system (e.g. git) 3+ years of experience in cloud-based development and delivery Familiarity with distributed computing patterns, techniques, and technologies (e.g. ESB) Familiarity with continuous delivery technologies (e.g. Puppet, Chef, Ansible, Docker, Vagrant, etc.) Familiarity with build automation and continuous integration tools (e.g. Maven, Jenkins, Bamboo, etc.) Familiarity with Agile process management tools (e.g. Atlassian Jira) Familiarity with test automation (Selenium, SoapUI, etc.) Good software development and Object Oriented programming skills. Strong analytical skills and the ability to work with end users to transform requests into robust solutions. Excellent oral and written communication skills. Initiative and self-motivation to work independently on projects. WORK ENVIRONMENT AND TRAVEL The work environment characteristics described here are representative of those an employee encounters while performing the essential functions of this job. Reasonable accommodations may be made to enable qualified individuals with disabilities to perform the essential functions. The term \"qualified individual with a disability\" means an individual with a disability who, with or without reasonable accommodation, can perform the essential functions of the position. While performing the duties of this job, the employee is regularly required to communicate professionally in person, over the telephone, through email and other electronic means, move about the office, handle various types of media and equipment, and visually or otherwise identify, observe and assess. The employee is occasionally required to lift up to 10 pounds unless otherwise specified in the job description. TeleTracking is committed to providing equal employment opportunity to all people in all aspects of the employment relationship, without discrimination because of race, age, sex, color, religion, national origin, disability or status as a Vietnam era or special disabled veteran or any other unlawful basis, as defined by applicable law, and fostering a workplace free of unlawful discrimination and retaliation. This policy affects decisions including, but not limited to, hiring, compensation, benefits, terms and conditions of employment, opportunities for promotion, transfer, layoffs, return from a layoff, training and development, and other privileges of employment. An integral part of TeleTracking’s commitment is to comply with all applicable federal, state and local laws concerning equal employment and affirmative action .",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-10-18T06:03:23.000Z"
    },
    "company": {
        "name": "TeleTracking",
        "link": "https://www.linkedin.com/company/teletracking"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 84,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Pittsburgh",
        "region": "PA",
        "postal_code": "15235",
        "street_address": null,
        "latitude": 40.44217,
        "longitude": -79.99496
    }
}