{
    "job": {
        "title": "Data Scientist",
        "industry": "",
        "description": "Data Scientist – Machine Learning Creative Radicals is seeking a data scientist with an expertise in machine learning to join our exciting, entrepreneurial, startup-like atmosphere. The data scientist will work closely with the other data scientists and software engineers, to incorporate innovative machine learning techniques into our flagship product. Basic Qualifications Master’s degree in Data Science or Machine learning or a Bachelor’s degree in a quantitative discipline such as Engineering, Statistics, Mathematics, or Physics and 3+ years industry experience working as a data scientist or a similar role with exposure to statistical modeling and/or machine learning. Proficiency in Python and/or Java. Proficiency with at least one machine learning library (e.g., Scikit-learn, MALLET). Conceptual understanding of basic machine learning concepts and commonly used algorithms. Outstanding written and verbal communication skills. Preferred Qualifications Experience working with Natural Language processing (NLP) related tasks. Experience working with a deep learning framework (e.g., PyTorch). Additional Requirements ·      Willing to obtain a Security Clearance and MUST be a US Citizen. About Us Creative Radicals is a software company that develops specialized solutions for emergency management, first responder support, security, executive protection, and threat management. Our work is technically challenging and in support of important missions around the world. We are looking for talented, dedicated people to join our team and help us continue to deliver top-quality technical solutions for our customers. To learn more about our company, please visit http://www.creativeradicals.com. We value our team members and offer the following benefits to our full-time employees: Competitive Salary Premium Health Plan Dental and Vision Life/AD&D Benefits Casual Work Environment",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-05T15:15:49.000Z"
    },
    "company": {
        "name": "Creative Radicals",
        "link": "https://www.linkedin.com/company/creative-radicals"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "McLean",
        "region": "VA",
        "postal_code": "22102",
        "street_address": null,
        "latitude": 38.929565,
        "longitude": -77.228096
    }
}