{
    "job": {
        "title": "Software Engineer- New Grad- United States",
        "industry": "Information Technology and Services,Internet,Telecommunications",
        "description": "Because you belong at Twilio. The Who, What, Why And Where At Twilio, our mission is to power the future of communications. We are looking for Software Engineers (SWE) who want to design, develop, deploy and operate software solutions and help Twilio deliver real-time, low latency capabilities for next-generation communications. Twilio New Grad Software Engineers are eager to learn and inspire and like to think at scale and meet high availability goals, bringing a focus to solving resiliency, latency and quality challenges in our virtualized cloud environment. SWE’s want to develop technical skills and industry experience while working on complex distributed systems. You Should Have Some Or All Of The Following Pursuing a Bachelors, Masters or Phd degree in Computer Science or Computer Engineering, or equivalent experience Proficient background in networking, operating systems, and security 0-3+ Years of engineering experience with Python, PHP, C, C++ or Java Knowledge of unit and integration testing methodologies, and the ability to write, debug and deploy testing frameworks Experience with traditional RDBMS databases, such as MySQL, Postgres, Oracle, etc. Who? Ideal Candidates Twilio is looking for Engineers who live the Twilio Magic and have a demonstrated track record of learning, growth, impact, and success. Are working towards a BS, MS, or PhD degree in computer science, computer engineering or a related field. Have a keen interest in software development with several side projects and perhaps are a part of the open source community. Have a hungry entrepreneurial and \"can do\" spirit, as evidenced by successful interest in learning new technologies. Have experience in data processing, analytics, business intelligence, and reporting Have experience with technologies such as hadoop, spark, python, scala etc. What? As a Software Engineer, you will live the Twilio Magic values: BE INCLUSIVE: Work in a small, high-impact, diverse team EMPOWER OTHERS: Bring in your expertise and experience to empower the your team and make things better in all aspects DRAW THE OWL: Collaborate with the team to tackle complex problems in distributed computing BE AN OWNER: Build and operate your team's services in a production environment leveraging a DevOps model; Ensure quality by writing unit, integration, and load tests. DON’T SETTLE, RUTHLESSLY PRIORITIZE: Constantly look for areas of improvement in processes, system and optimize. Be an advocate for balancing tech debt and feature development Design and implement various initiatives, scalable infrastructure solutions that meet Twilio’s high scalability & performance needs Perform detailed and thoughtful peer code reviews Help building Continuous Integration and Continuous Delivery on managed AWS services Develop monitoring & alerting solutions that keeps our system’s health in check Internalize the set of good habits (development techniques, test driven development, load and performance testing, security, tech debt balance, Agile discipline etc.) that drives high-end engineering excellence Why? Twilio is a company that is empowering the world’s developers with modern communication in order to build better applications. Twilio is truly unique; we are a company committed to your growth, your learning, your development and your entire employee experience. We only win when our employees succeed and we're dedicated to helping you develop your strengths. We invest in weeks dedicated to tackling hard problems and creating your own ideas. We have a cultural foundation built on diversity, inclusion and innovation and we want you and your ideas to thrive at Twilio. Come join us. Where? We employ diverse talent from all over the world and we believe great work can be done anywhere. Around the world, Twilio offers benefits and perks to support the physical, financial, and emotional well being of you and your loved ones. No matter where you are based, you will experience a company that believes in small teams for maximum impact; seeks well-rounded talent to ensure a full perspective on our customers’ experience, understands that this is a marathon, not a sprint; that continuously and purposefully builds an inclusive culture that empowers everyone to do their best work and be the best version of themselves. About Us Millions of developers around the world have used Twilio to unlock the magic of communications to improve any human experience. Twilio has democratized communications channels like voice, text, chat, video and email by virtualizing the world’s communications infrastructure through APIs that are simple enough for any developer to use, yet robust enough to power the world’s most demanding applications. By making communications a part of every software developer’s toolkit, Twilio is enabling innovators across every industry — from emerging leaders to the world’s largest organizations — to reinvent how companies engage with their customers. In accordance with applicable law, the following represents Twilio's reasonable estimate of the range of possible compensation for this role if hired in Colorado. Salary Denver/Boulder Metro: $106,000/annually Benefits At the time of this posting, this role is eligible to participate in the following benefits, which Twilio reserves the right to modify at any time for any reason in accordance with applicable law Twilio is committed to delivering a comprehensive benefits program that provides support needed for you and your loved ones. It’s likely that you don’t think about benefits every day; however, they are an important component of your total compensation, and we want you to understand the options available to you so that you can make the most of your benefit dollars. Healthcare Insurance Prescription Drug Medical Dental Vision Reimbursement Programs & Stipends $65 per month work-from-home stipend Up to $50 per month for wellness expenses and activities Up to $30 per month to use towards books/eBooks",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-25T05:23:11.000Z"
    },
    "company": {
        "name": "Twilio",
        "link": "https://www.linkedin.com/company/twilio-inc-"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "San Francisco",
        "region": "CA",
        "postal_code": "94121",
        "street_address": null,
        "latitude": 37.78008,
        "longitude": -122.42016
    }
}