{
    "job": {
        "title": "Lead Site Reliability Engineer (REMOTE)",
        "industry": "Information Technology and Services,Computer Software,Financial Services",
        "description": "If you are a Lead Site Reliability Engineer looking for fully remote work, please read on! We are a publicly traded, leading industrial technology company with roots in North America and Europe, along with a team of 12k+ employees. We're on a quest to become the #1 company in our sector and are looking for someone to Lead our new SRE Team to build fault tolerant systems and reliable software to help us design, deploy, scale, and maintain highly available distributed sensory networks and companion cloud applications. What You Will Be Doing Develop applications from customer services side/liability - that gear towards application transactions and less in application infrastructure Incident response and problem management towards application development and monitoring Contribute to a light amount of application development, working very closely with development teams on reliability / observability. Provide reasoning about application architecture as well as be comfortable looking at code and offering feedback on how it can be improved to increase reliability. Participate and lead incident resolution efforts and subsequent postmortems. Work laterally with our other engineering teams to identify root causes, characterize and track problems and collaborate to address them Defining required performance and expected load, taking actions to address disruptions and monitoring operation. What You Need for this Position 5+ years working experience using either one: Python, C++, Java, Go, or C# Good blend of Software Development + Operations (DevOps) Azure (deploying / operating solutions) Incident response and problem management Docker/Kubernetes Bonus Points For Experience leading small teams IoT (Internet of Things) networks Kubernetes, Terraform Experience with highly available distributed systems at scale. What's In It for You Fully REMOTE HUGE room for growth Competitive pay + up to 20% bonus + Generous benefits (Health, Dental, Vision, Life, AD&D, HSA Accounts) Stock purchase Plans Healthy work/life balance So, if you are a Lead Site Reliability Engineer looking for a change - please apply today - INTVs are being scheduled! Email Your Resume In Word To Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also: Bobby.June@Optello.com Please do NOT change the email subject line in any way. You must keep the JobID: linkedin : BJ1-1640247 -- in the email subject line for your application to be considered.*** Bobby June - Recruiting Manager - Optello Applicants must be authorized to work in the U.S. Optello is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-06T17:46:32.000Z"
    },
    "company": {
        "name": "Optello",
        "link": "https://www.linkedin.com/company/optello-us"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Atlanta",
        "region": "GA",
        "postal_code": "30355",
        "street_address": null,
        "latitude": 33.748547,
        "longitude": -84.3915
    }
}