{
    "job": {
        "title": "Senior Product Manager - Data Governance",
        "industry": "Computer Software",
        "description": "Who we are: BigID’s data intelligence platform enables organizations to know their enterprise data and take action for privacy, protection, and perspective. BigID empowers customers to know their data, take action from their data, and unleash the value of their data. Headquartered in New York City with a worldwide presence, we are building a global team with a passion for innovation and next-gen technology with R&D in the heart of Tel Aviv. BigID has been recognized for its data intelligence innovation as a World Economic Forum Technology Pioneer, named to the 2020 Forbes Cloud 100, a Business Insider 2020 AI Startup to Watch, and an RSA Innovation Sandbox winner. At BigID, our team is the foundation of our success. Join a people-centric culture that is fast-paced and rewarding: you’ll have the opportunity to work with some of the most talented people in the industry who value innovation, integrity, and teamwork. Who we seek: As a Senior Product Manager for Data Governance applications you will be a core member of the Data Apps product team and will help envision, design, develop and deliver data governance products to the market. What you’ll do: Lead the product activities for our rapidly growing Data Governance applications - from vision to implementation, defining the product roadmap, working with engineering to build new solutions, and communicating with various internal stakeholders to ensure product success. Collect, prioritize, and create product requirements for new features. Work closely with our UX designers to create wireframes for your product. Lead sprint planning sessions, establishing clear goals for the development teams' forthcoming sprint based on the organization’s most urgent priorities Work with the engineering teams to help them clearly understand the requirements and estimate development time for each story and epic. Prioritize escalated bugs based on severity criteria Conduct regular customer calls deriving customer insights and tie those insights to business plans, product roadmaps, and to the prioritization processes. Perform ongoing analysis and research of customer requests, competitor capabilities, and industry trends in order to define the next product capabilities Enable the field and train the support team on new features and changes Prioritize escalated bugs based on severity criteria Support customer calls deriving customer insights and tie those insights to business plans, product roadmaps and to prioritization process. Perform ongoing analysis and research of customer requests, competitor capabilities, and industry trends in order to define the next set of capabilities Requirements: 3 of experience in Product Management roles from a leading company - a must Data Governance background and usage of Data Governance tools is a strong advantage Analytical orientation and strong problem solving skills Accountability, self-motivation and ability to work autonomously Uncover and understand customer needs and translate them into requirements Team player. Ability to thrive in a fast-paced, startup environment. Business minded and able to incorporate user and business needs into the decision-making process. Excellent presentation and written and verbal communications skills Bachelor's degree in CS, Engineering, or related experience preferred. What’s in it for you?! Our people are the foundation of our success, and we place a high priority on offering a wide range of benefits that make our team happier and healthier. Equity participation - everyone shares in our success Open vacation policy - take it when you need it Flexible work arrangements - we are all grown-ups Medical, Dental, Vision, 401k Our Values: We look for people who embody our values - Care, Do, Try & Shine. Care - We care about our customers and each other Do - We do what it takes to make a positive impact Try - We try our best and we don’t give up Shine - We shine and make it our mission to always stand out Diversity & Inclusion: All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, or any other applicable legally protected characteristics in the location in which the candidate is applying. Come as you are.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-25T17:28:08.000Z"
    },
    "company": {
        "name": "BigID",
        "link": "https://www.linkedin.com/company/bigid"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "New York City Metropolitan Area",
        "region": null,
        "postal_code": "10021",
        "street_address": null,
        "latitude": 40.748295,
        "longitude": -73.98556
    }
}