{
    "job": {
        "title": "Machine Learning Ops Engineer",
        "industry": "Marketing and Advertising,Information Technology and Services,Financial Services",
        "description": "Refer A Friend Company Description McDonald’s is proud to be one of the most recognized brands in the world, with restaurants in over 100 countries and billions of customers served each year. As the global leader in the food service industry, we have a legacy of innovation and hard work that continues to drive us. Today, we are growing with velocity and are focused on modernizing our experiences, not to make a different McDonald’s, but to build a better McDonald’s. We are moving fast and are adding to our best-in-class team. Joining McDonald's means thinking big every day and preparing for a career that can have impact around the world. We are customer obsessed, committed to being leaders, and believe we are better when we work together. Over the last couple years, we’ve launched home delivery, modernized our restaurant experience through digital enhancements and have so much more to come. We are dedicated to using our scale for good: good for people, our industry and the planet. From ambitious recycling initiatives and balanced sourcing efforts to our partnership with Ronald McDonald House Charities, we are constantly improving. We see every single day as a chance to have a genuine impact on our customers, our people and our partners. Our new, state-of-the-art headquarters is located in the booming West Loop area in the heart of downtown Chicago. It's set up to be a global hub that cultivates innovation. Take a class at Hamburger University, sample future menu items in our Test Kitchen, and utilize the latest technology to communicate with your team around the globe! Our office helps us connect with each other like never before. Participate in monthly organized events, enjoy massive outdoor spaces, an 8000 square foot gym, and an onsite McDonald's serving international favorites. Job Description</strong As Machine Learning Ops engineer in our Global Technology Data & Analytics team, you’ll be working with an outstanding global team of data engineers, data scientists and other product managers to build cutting edge analytics solutions and applications. It is an exciting time at McDonald’s as we are growing our analytics and ML engineering capabilities and team. What you will do? Design, build and the ML Ops framework and set up cloud platform components for data science models to deploy, scale and ensure ongoing monitoring Develop CI/CD pipeline and automation for data ingestion and model deployment Collaborate with data scienstists, data engineers and architects to define and implement technical architecture blueprint for AI/ML solutions Build and maintain tools and infrastructure for data processing for AI/ML development initiatives Develop and update technical documentation for senior leaders and colleagues to serve as a reference guide Qualifications</strong Required Skills 3+ years in DevOps, Data Engineering and ML background with Cloud platforms 3+ years of experience with MLOps tools such as MLFlow and Kubeflow 3+ years of experience in Python scripting and analytics platforms like Databricks or Sagemaker Bachelor’s degree in engineering, statistics, or other field with a quantitative component is required; Master’s degree preferred. Strongly Preferred Skills Hands-on experience with modern machine learning libraries, frameworks, and technologies Ability to leverage critical thinking and analytical skills to improve business outcomes Excellent written and verbal communication skill Self-motivated with ability to set priorities and mentor others in a performance driven environment. Experience with continuous integration and deployment (CI/CD) frameworks. Additional Information</strong McDonald’s is committed to providing qualified individuals with disabilities reasonable accommodations to perform the essential functions of their jobs. Additionally, if you (or another applicant of whom you are aware) require assistance accessing or reading this job posting or otherwise seek assistance in the application process, please contact recruiting.supportteam@us.mcd.com McDonald’s provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to sex, sex stereotyping, pregnancy (including pregnancy, childbirth, and medical conditions related to pregnancy, childbirth, or breastfeeding), race, color, religion, ancestry or national origin, age, disability status, medical condition, marital status, sexual orientation, gender, gender identity, gender expression, transgender status, protected military or veteran status, citizenship status, genetic information, or any other characteristic protected by federal, state or local laws. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training. Nothing in this job posting or description should be construed as an offer or guarantee of employment. ll your information will be kept confidential according to EEO guidelines.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-04T02:21:18.000Z"
    },
    "company": {
        "name": "McDonald's",
        "link": "https://www.linkedin.com/company/mcdonald%27s-corporation"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Chicago",
        "region": "IL",
        "postal_code": "60654",
        "street_address": null,
        "latitude": 41.88323,
        "longitude": -87.6324
    }
}