{
    "job": {
        "title": "Senior Software Engineer – C",
        "industry": "Information Technology and Services,Computer Software,Computer Networking",
        "description": "Job Title: Senior Software Engineer – C Location: Milwaukee, WI (Onsite from Day 1) Duration: Long Term Contract Role & Responsibilities Design, development, testing, debugging and documentation activities for projects. Work on projects that require configuration and code customizations in software products. Expand existing and create software to meet the changing needs of industry. Travel to site during software commissioning phases to ensure that integration testing and site acceptance testing is completed as required Provide mentorship and training to software team Travel is approximately ~30% Technical Knowledge In-depth understanding of Software and IT/hardware setup including network configuration Experience with C and C++ Programming Experience in development of multithreaded applications using C Knowledge of interposes communications and thread synchronization Knowledge and understanding of Database Design and Programming (Microsoft SQL, Oracle) Knowledge and understanding of Windows Server General knowledge of Web Services (SOAP, REST), Socket Programming Familiarity with Jira and Confluence Experience with GitLab, Sub-Version General understanding and knowledge of Virtualization (VMWare, etc.) Education And Skill Requirements Bachelor's degree in Computer Science / Electronics 5+ yrs of software development and/or programming experience Knowledge of industrial automation a plus You can also apply via: - http://jobd.info/?id=urJRMB Recruiter Details Praveen Rao (302) 214-0551 praveen_us@falconsmartit.com Find all current job openings at our Career Page https://www.falconsmartit.com/FalconCareer.html Follow us on LinkedIn for Job Opportunities https://www.linkedin.com/company/falconsmartit/",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-20T22:42:26.000Z"
    },
    "company": {
        "name": "Falcon Smart IT (FalconSmartIT)",
        "link": "https://uk.linkedin.com/company/falconsmartit"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Dover",
        "region": "DE",
        "postal_code": "19901",
        "street_address": null,
        "latitude": 39.15883,
        "longitude": -75.52114
    }
}