{
    "job": {
        "title": "Site Reliability Engineer",
        "industry": "",
        "description": "Site Reliability Engineer / Sr DevOps Engineer Location – Seattle, WA – Remote OK Duration – 12 months Required: •\tBachelor's degree in CS or a related STEM engineering field strongly preferred •\tRelevant certifications are a plus •\t8-10+ years of Site Reliability / DevOps Engineering •\tExpertise in AWS / Azure •\tExpertise in Kubernetes, kOps, & Helm 3. •\tIstio service mesh experience is strongly preferred. •\t•Experience with Infrastructure as Code IIAC) required. •\tSpecifically we are looking for Terraform •\tFluency in at least one language required: Python, C#, JAVA. Should have strong API experience. •\tExperience working in SOA and 12 factor app methodology •\tStrong leadership, initiative taking, and capacity for decision making •\tExpert knowledge in any or all of these is a huge plus: Prometheus Operator, Grafana, Loki, ELK Stack, OpenTelemetry, Jaeger/OpenTracing •\tParticipate in the on-call rotation What You'll Do •\tWork across teams to completely automate everything we do •\tDrive and own best practices with automation, be passionate and proactive •\tApproach alerting, monitoring, and log aggregation with an eye toward flexibility and insight-driven metrics •\tCollaborate with the teams to ensure ongoing infrastructure management/automation (IAC), CI/CD pipeline construction in collaboration with the Release Engineering team, monitoring, and maintenance •\tEnable our engineering teams to deliver high quality software, fast, well tested, in a highly repeatable way •\tCreate automated tool sets to deploy, measure, solidify and observe our infrastructure •\tOngoing study and implementation of the industry's latest best practices and drive those within the company •\tParticipate in the on-call rotation",
        "employment_type": "CONTRACTOR",
        "date_posted": "2021-08-18T19:20:22.000Z"
    },
    "company": {
        "name": "OrgSpire Inc",
        "link": "https://www.linkedin.com/company/orgspire-inc"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 120,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "United States",
        "region": null,
        "postal_code": "99999",
        "street_address": null,
        "latitude": 39.50355,
        "longitude": -99.0183
    }
}