{
    "job": {
        "title": "DevOps Engineer",
        "industry": "",
        "description": "What we’re looking for: We are looking for a passionate DevOps Engineer based in Denver, who will join a newly created Cloud and Platforms team who are responsible for the operation, architecture, security, scalability and governance of the AWS environment for a high performing product team. Continual learning and exploring of better approaches to problems are in our nature and you will have the opportunity to take a role in the adoption of best practices, standards and cutting-edge tools as the team grows. Who we are: Half of all SME’s fail in the first two years and lack of marketing capability is a consistent issue in the organisations that fail. Metigy is changing that paradigm on a global scale. Metigy is the world’s leading AI-powered Digital Marketing solution made for SMEs. Metigy is all about making the challenging yet critical elements of the marketing, easy and fun! Our platform integrates with the leading social and digital marketing platforms, Facebook, LinkedIn, Twitter, Google, and provides the Strategy in the form of Insights, Recommendations and Decision support so even an inexperienced marketer can master marketing and grow their brand. Digital marketing has never been more important. This is an exciting time to join Metigy as we are growing quickly! We have just completed a major capital raise and we are scaling globally and this means that there are lots of opportunities for you to have an influence and impact on our business. We aim to have a positive impact on the day to day work of our team, customers and the environment. What you will do: Manage the operational aspects of our existing products and platforms and ensure the security, governance, reliability and performance of products and platforms. Build and maintain systems that will monitor all aspects of the application and the infrastructure. Monitor and manage infrastructure to support 24/7 availability and respond to operational incidents. Assist development team with deployment strategy and capacity planning across development, staging and production environments. Work with the development team to deploy and manage tools that support SDLC automation, configuration management, and release management. Development of scripted deployments using Infrastructure as Code (IaC) and use of automated deployment tools. Development and maintenance of Continuous Integration/Continuous Delivery (CI/CD) pipelines. Development of documentation and knowledge-base articles to support the use of the platform. Participate in an on-call roster. What we’re looking for in you: Team player with experience of working in a DevOps culture. Good experience with Amazon Web Services (AWS): EC2, RDS, Lambda, API Gateway, DynamoDB, SQS, SNS, Step Functions, Kinesis, S3, VPCs. Good knowledge and experience of AWS Security best practices. Certifications in AWS an advantage. Infrastructure as code skills: Hashicorp Terraform, AWS CloudFormation or AWS CDK. Experience with cloud monitoring and log management solutions. Experience with revision control systems such as BitBucket. Expertise in Continuous Integration/Continuous Delivery (CI/CD) pipelines and associated tooling. Knowledge and exposure of container technology and orchestration is a plus. Customer focused, friendly, and approachable. Great communication skills and ability to contribute to ongoing product, project and organisational technical directions. Excellent problem solving skills, taking responsibility to own issues, until full resolution. Ability to adapt to a rapidly changing and growing environment. You are highly autonomous but able to work collaboratively with engineering, design and product teams. Attention to detail, the courage to innovate and fail, learning from the experience. Excellent verbal and written communication skills. What is on offer: A fantastic challenge to contribute to a great Australian scaleup taking on the world An enjoyable work environment A competitive salary and benefits The scaleup lifestyle including the ability to collaborate in the office and work remotely the rest of the week Options plan for passionate people after a qualifying period This is a permanent full-time position",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-24T01:25:59.000Z"
    },
    "company": {
        "name": "Metigy",
        "link": "https://au.linkedin.com/company/metigy"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Denver",
        "region": "CO",
        "postal_code": "80247",
        "street_address": null,
        "latitude": 39.738453,
        "longitude": -104.984856
    }
}