{
    "job": {
        "title": "Data Analyst",
        "industry": "Staffing and Recruiting",
        "description": "This Data Analyst will be responsible for collecting, analyzing, and offers transparency into customer behavior and business performance. Essential duties and responsibilities include but not limited to: • Strong analytic skills and ability to develop dashboard and reports using Tableau to enable customers to analyze data and make business decisions. • Ability to work iteratively and converts business requirements quick prototypes with different Visualization options • Ability to understand core business questions needing answered • Ability to write custom calculations (or queries) within the data visualization tool Tableau. • Solid understanding of Tableau presentation and data layer and implementation of Security with Tableau • Experience in rolling out Tableau as Self-service solution for large number of users • Hands on experience in Tableau reporting, Tableau server management • Experience in building Integration of Tableau with like MS SQL • Ability to consult business users to build Tableau dashboards • This role will require collaboration with end users, project stakeholders, and support partners to identify needs, goals, metric measurements, and business models which will result in easy-to-understand interfaces and enable end users to quickly identify key themes within the data",
        "employment_type": "CONTRACTOR",
        "date_posted": "2021-10-05T17:42:24.000Z"
    },
    "company": {
        "name": "US Tech Solutions",
        "link": "https://www.linkedin.com/company/us-tech-solutions"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Boise",
        "region": "ID",
        "postal_code": "83712",
        "street_address": null,
        "latitude": 43.61579,
        "longitude": -116.20158
    }
}