{
    "job": {
        "title": "Life Science Data Scientist / BioTech",
        "industry": "Staffing and Recruiting",
        "description": "A Well-Funded BioTech start-up in the heart of Redwood city is looking for a driven Bioinformatics engineer to join the team. As a member of the bioinformatics algorithm team, you will be empowered to develop algorithms, statistical methods, and build out our bioinformatics infrastructure You’ll be contributing to software systems, data platforms, and externally facing applications that empower this start-ups customers to gain insight into the systemic workings of the human biome. Required Skills & Experience PhD (or equivalent) in relevant discipline focus on life science tools and applications (0-8 years) Demonstrated understanding of algorithms and statistical methods in proteomics, genomics and/or genetics Expertise in software development (Java, C++, C#, Python and/or R) and demonstrated ability to write readable, well-documented, and unit-tested code Strong written and oral communications skills, with demonstrated experience in cross-functional and timely communication Strong and collaborative work ethic; must be a self-starter and persistent in achieving objectives to support Seer's scientific and business goals Must work well in a small team setting, with ability to work independently and collaboratively, while meeting scheduled deadlines in a fast-paced environment Highly organized, exceptional attention to detail, and strong proficiency in documentation skills What You Will Be Doing Support proteomics and multi-omics data discovery activities through the design and delivery of novel algorithms, statistical methods, tools and techniques Apply novel methods to internal and external data to demonstrate impact Work closely with the Data Engineering, Software, Machine Learning, Mass Spectrometry, Assay, Materials Technology, Marketing groups Present results in external venues such as conferences and webinars. Provide training and advice to scientists on optimal use of key data and analysis Promote a culture of knowledge sharing across domains to proactively support sharing of best practices among informatics and science teams Daily Responsibilities 80% New Development 20% Testing and Operations The Offer Competitive Salary: Up to $150K/year, DOE Early Stage Start-Up Options Package Medical and Dental Insurance Unlimited PTO Flexible WFH policy Applicants must be currently authorized to work in the United States on a full-time basis now and in the future. No Sponsorship or C2C at this time Motion Recruitment network, provides IT Staffing Solutions (Contract, Contract-to-Hire, and Direct Hire) in major North American markets. Our unique expertise in today’s highest demand tech skill sets, paired with our deep networks and knowledge of our local technology markets, results in an exemplary track record with candidates and clients. Posted By: Breann Gonzalez",
        "employment_type": "CONTRACTOR",
        "date_posted": "2021-08-05T09:30:49.000Z"
    },
    "company": {
        "name": "Motion Recruitment",
        "link": "https://www.linkedin.com/company/motion-recruitment-partners"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Menlo Park",
        "region": "CA",
        "postal_code": "94029",
        "street_address": null,
        "latitude": 37.45322,
        "longitude": -122.18322
    }
}