{
    "job": {
        "title": "Site Reliability Engineer",
        "industry": "Information Technology and Services",
        "description": "We are looking to on board a DevOps engineer to help us with deployment pipeline construction. This role will also include provisioning, configuration and management of cloud native resources. The candidate will need to work with core app engineering teams, gather their requirements and help implement them through the deployment pipeline. The candidate is required to have sound knowledge of DevOps, reliability, and security best practices and be able to guide the team on the optimal approach to accomplish their requirements. Location: NY Area preferred. Remote candidates may be expected to visit NY office periodically (1/2 a quarter) post-COVID relaxations. Term : Contract with option to hire. Starting contract period will be 6 months. Required Skills: Experience working with CI/CD tools like Jenkins, Ansible, puppet, Drone, Terraform. Application secret management and configuration management Knowledge of application containerization using Beanstalk, GKE, Docker etc. Knowledge of AWS Cloud – IAM, EC2, RDS, Lambda, Kinesis, Elastic search, CloudWatch, etc. Experience in provisioning of cloud resources through CI/CD pipeline Setting of application health checks on tools like New Relic, Sumo Logic, Data dog etc. Understanding of Virtual VPC setup and networking. Excellent communication and stakeholder management skills. -- RiVi Group",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-02T18:34:44.000Z"
    },
    "company": {
        "name": "RiVi Consulting Group L.L.C",
        "link": "https://www.linkedin.com/company/rivi-consulting-group-l-l-c"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "New York",
        "region": "United States",
        "postal_code": "13856",
        "street_address": null,
        "latitude": 42.93923,
        "longitude": -75.62005
    }
}