{
    "job": {
        "title": "Software Engineer--Full Stack",
        "industry": "Information Technology and Services,Computer Software,Computer &amp; Network Security",
        "description": "Imagine a world dedicated to Security Without Compromise. Synack, headquartered in Silicon Valley with regional offices around the world, protects leading global organizations by reducing companies' security risk and increasing their resistance to cyber attack. How do we do this? By utilizing the world's best and most trusted team of ethical hackers who test through our powerful and controlled platform to deliver real security without compromise. At Synack, we aren't afraid to think outside the box or take on big challenges. Backed by top-tier venture capital firms including Kleiner Perkins Caufield & Byers, Microsoft, and Google Ventures, Synack's mission is to leverage global security talent coupled with advanced technology to help enterprises discover security vulnerabilities before they become business problems. Discover the possibilities at Synack! This remote role is a unique opportunity to help build platforms that will revolutionize cyber security. As a Full Stack Engineer, you will have no shortage of interesting and challenging projects to work on! You love to learn, are excited about cybersecurity and want to be part of our fast-paced, collaborative team making an immediate impact by building scalable web applications. Sounds interesting? Keep reading… Here's What You'll Do Build a cutting edge enterprise-ready web platform with an API-first approach that is used by security researchers from all over the world Build scalable and highly performant applications Work within a outcome-led team to understand the high level vision of the requirements, and implement a delightful user experience for the researchers and customers Develop software on our stack that is primarily written in Ruby on Rails and Javascript Demonstrate leadership qualities with willingness to mentor peers and drive product development Communicate effectively to the team and participate in design and code reviews Here's What You'll Need BS degree in CS or equivalent experience 3+ years designing and building dynamic production solutions 3+ years in Python, Ruby on Rails, PHP, or Java--Go knowledge is a plus but you can learn it here! 1+ years using ReactJS/Redux or other JavaScript frameworks and library Adept with various database systems such as MySQL, PostgreSQL Ready to join us? Synack is committed to embracing diversity. Our people are our strength. Each addition to our team is an opportunity to grow and diversify our ideas, experiences, and viewpoints. We strive to be inclusive of Race, Ethnicity, Religion, Sex, LGBTQ+, Veterans, Disabilities, and Age. Synack welcomes you!",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-19T11:26:16.000Z"
    },
    "company": {
        "name": "Synack, Inc.",
        "link": "https://www.linkedin.com/company/synack-inc-"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Redwood City",
        "region": "CA",
        "postal_code": "94064",
        "street_address": null,
        "latitude": 37.4805,
        "longitude": -122.21528
    }
}