{
    "job": {
        "title": "Data Scientist",
        "industry": "Financial Services",
        "description": "Job Description The Purpose of Your Role Fidelity Workplace Investing is seeking a Data Scientist to support our Customer Inclusion initiatives. This position will work with technical professionals in data science and with managers of market research and product development teams. The assignments may include exploratory analysis, feature engineering, cluster analysis, predictive analytics, causal inference, and presentation of findings. As Data Scientists, we support projects across many areas and ensure the highest degree of quality. You must be a great teammate who thrives in a small, highly effective work environment and communicates with confidence to all levels of Workplace Investing. The ideal Data Scientist handles projects from start to finish. i.e., they can work with market research on survey design, gather required data in any shape and size, process the data, analyze them graphically and statistically, draw useful and unique insights, package the information into effective presentations, and present results to colleagues and business partners. The Skills You Bring Data extraction and feature engineering for processing and transforming data into relevant features. Statistical and data science programming with proficiency in Python or R. Quantitative research, including survey design and analysis, factor and principle components analysis, experimental design, causal inference, or other related fields. Exploratory data analysis, statistical graphics, and effective data visualization. Committed to continuous learning and able to pick up new knowledge quickly. Excellent verbal and written communication skills, especially regarding technical communication. Able to communicate technical information to individuals at all levels of technical expertise. E ducation Master’s Degree in a quantitative or computational field (e.g. Statistics, Computer Science, Data Science, Machine Learning, Economics, Operations Research, or Applied Mathematics), with applied research experience. Master’s Degree in a social or biological science field (e.g. Biology, Bioinformatics, Sociology, or Psychology) with quantitative research experience. How Your Work Impacts the Organization As a Data Scientist in Fidelity Workplace Investments, you will use analytics to help Fidelity product owners and technologists identify underserved segments in Fidelity’s customer base. You will assist in designing solutions for those individuals and measuring success for products that are launched. This is a growing and critical element of Fidelity’s business strategy. Company Overview At Fidelity, we are passionate about making our financial expertise broadly accessible and effective in helping people live the lives they want! We are a privately held company that places a high degree of value in creating and nurturing a work environment that attracts the best talent and reflects our commitment to our associates. We are proud of our diverse and inclusive workplace where we respect and value our associate for their unique perspectives and experiences. For information about working at Fidelity, visit FidelityCareers.com. Fidelity Investments is an equal opportunity employer. Accommodation Language To Initiate a Request For An Accommodation Please Contact The Following Fidelity will reasonably accommodate applicants with disabilities who need adjustments to participate in the application or interview process. For roles based in the US: Contact the HR Leave of Absence/Accommodation Team by sending an email to accommodations@fmr.com, or by calling 800-835-5099, prompt 2, option 2 For roles based in Germany: Contact accomodationsgermany@fmr.com For roles based in Ireland: Contact accomodationsireland@fmr.com Certifications Company Overview At Fidelity Investments, our customers are at the heart of everything we do. As a privately held company with a rich 75-year history, our mission has remained the same since our founding: to strengthen the financial well-being of our clients . We help people invest and plan for their future. We assist companies and non-profit organizations in delivering benefits to their employees. And we provide institutions and independent advisors with investment and technology solutions to help invest their own clients’ money. Join Us At Fidelity, you’ll find endless opportunities to build a meaningful career that positively impacts peoples’ lives, including yours. You can take advantage of flexible benefits that support you through every stage of your career, empowering you to thrive at work and at home. And you don’t need a finance background to succeed at Fidelity—we offer a range of opportunities for learning and growth so you can build the career you’ve always imagined. We welcome associates from different backgrounds and with different perspectives to help us innovate and make a difference for our customers and our communities. We invite you to Find Your Fidelity at fidelitycareers.com. Fidelity Investments is an equal opportunity employer. We believe that the most effective way to attract, develop and retain a diverse workforce is to build an enduring culture of inclusion and belonging. Fidelity will reasonably accommodate applicants with disabilities who need adjustments to participate in the application or interview process. To initiate a request for an accommodation, contact the HR Leave of Absence/Accommodation Team by sending an email to accommodations @fmr.com, or by calling 800-835-5099, prompt 2, option 2.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-28T15:28:58.000Z"
    },
    "company": {
        "name": "Fidelity Investments",
        "link": "https://www.linkedin.com/company/fidelity-investments"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Durham",
        "region": "NC",
        "postal_code": "27717",
        "street_address": null,
        "latitude": 35.99695,
        "longitude": -78.899025
    }
}