{
    "job": {
        "title": "Senior Engineer, Software Engineering",
        "industry": "Financial Services,Information Technology and Services,Internet",
        "description": "Our Purpose We work to connect and power an inclusive, digital economy that benefits everyone, everywhere by making transactions safe, simple, smart and accessible. Using secure data and networks, partnerships and passion, our innovations and solutions help individuals, financial institutions, governments and businesses realize their greatest potential. Our decency quotient, or DQ, drives our culture and everything we do inside and outside of our company. We cultivate a culture of inclusion for all employees that respects their individual strengths, views, and experiences. We believe that our differences enable us to be a better team – one that makes better decisions, drives innovation and delivers better business results. Job Title Senior Engineer, Software Engineering Overview Push Payments Development team owns a number of applications, primarily focusing on the Mastercard Send application. Mastercard send is an API based application which primarily focuses on P2P and Disbursement transactions and is heavily integration with Mastercard core applications. Responsible for the analysis, design, development and delivery of software solutions. Develop, customize, and test applications to integrate to MasterCard’s specifications. Provide leadership, mentoring, and technical training to other team members Do you want to be a part of a collaborative team environment? Are you motivated to stay on the cutting edge of digital payments technology? Role Accountable for systems development prioritized initiatives supporting Mastercard Send Plan, design and develop technical solutions and alternatives to meet business requirements in adherence with MasterCard standards, processes and best practices. Adapt to the technical artifact templates per the needs of the project and technology. Contribute ideas to help ensure that required standards and processes are in place. Research and evaluate current and upcoming technologies and frameworks. Participate in PoCs (Proof of Concept) and help the Department with selection of Vendor Solutions, Technologies, Methodologies and Frameworks. All About You Must be high-energy, detail-oriented, proactive and have the ability to function under pressure in an independent environment Possesses strong communication skills -- both verbal and written – and strong relationship, collaborative skills and organizational skills Bachelor’s degree, or foreign equivalent, in Computer Science, Information Technology or Engineering Advanced level work experience in job offered, or as Software Engineer, Technology Lead, or related qualifying experience must include. Willingness and ability to learn and take on challenging opportunities and to work as a member of matrix based diverse and geographically distributed project team. Experience with Digital payments such as P2P payment and/or disbursements Advanced Experience With The Following Java Objected Oriented analysis and design using common design patterns Spring Spring boot Web services Agile Development environment REST JSON Apache Junit Maven Angular Micro services Soap UI Log4j Tomcat Test automation frameworks PCF/Azure Due to COVID-19, most of our employees are working from home. We’ve implemented a virtual hiring process and continue to interview candidates by phone or video and are onboarding new hires remotely. We value the safety of each member of our community because we know we’re all in this together. Mastercard is an inclusive Equal Employment Opportunity employer that considers applicants without regard to gender, gender identity, sexual orientation, race, ethnicity, disabled or veteran status, or any other characteristic protected by law. If you require accommodations or assistance to complete the online application process, please contact reasonable.accommodation@mastercard.com and identify the type of accommodation or assistance you are requesting. Do not include any medical or health information in this email. The Reasonable Accommodations team will respond to your email promptly. Corporate Security Responsibility All Activities Involving Access To Mastercard Assets, Information, And Networks Comes With An Inherent Risk To The Organization And Therefore, It Is Expected That The Successful Candidate For This Position Must Every person working for, or on behalf of, Mastercard is responsible for information security. Abide by Mastercard’s security policies and practices; Ensure the confidentiality and integrity of the information being accessed; Report any suspected information security violation or breach, and Complete all periodic mandatory security trainings in accordance with Mastercard’s guidelines.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-23T06:25:59.000Z"
    },
    "company": {
        "name": "Mastercard",
        "link": "https://www.linkedin.com/company/mastercard"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "O'Fallon",
        "region": "MO",
        "postal_code": "63304",
        "street_address": null,
        "latitude": 38.808643,
        "longitude": -90.69996
    }
}