{
    "job": {
        "title": "Machine Learning Engineer / Data Scientist",
        "industry": "",
        "description": "Machine Learning Engineer / Data Scientist Clairways is building technologies for smart monitoring of respiratory health. 1 in 8 people suffers from a chronic respiratory disease, such as asthma, COPD, or cystic fibrosis, and treatment of these diseases currently is hindered by the limited respiratory data available to inform both drug development and disease management decisions. Our technologies help obtain this data and improve the health of people living with respiratory diseases. Clairways is seeking a machine learning and data science engineer to support the development of edge machine learning algorithms for our novel wearable respiratory monitor. As part of this role, the ML engineer will work on the backend data infrastructure as well as pipelines for model generation, continuous integration and deployment (MLOps). Requirements Advanced degree in computer science, math, statistics or related discipline. Strong programming experience in Python and C/C++. Hands-on experience in on Machine/Deep Learning projects, specifically with audio and/or video data. Familiarity with machine learning frameworks such as PyTorch and Tensorflow. Extensive data modeling and data architecture skills. Great communication skills, both written and verbal. Strong cross-discipline collaboration skills. Extra Experience with EdgeML Experience with AWS Cloud Computing Services (EC2, S3, Lambda, etc.) Knowledge of distributed computing systems like Hadoop & Spark. Experience in deployment of machine learning based solutions Audio signal processing Location Lebanon, New Hampshire 03766, United States Website www.clairways.com",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-23T22:03:03.000Z"
    },
    "company": {
        "name": "Clairways",
        "link": "https://www.linkedin.com/company/clairways"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Lebanon",
        "region": "NH",
        "postal_code": "03784",
        "street_address": null,
        "latitude": 43.642426,
        "longitude": -72.250595
    }
}