{
    "job": {
        "title": "Software Engineer",
        "industry": "Information Technology and Services,Computer Software,Internet",
        "description": "Team OMG OrderMyGear is the industry leader in technology for the team gear and promotional product space. OMG continues to push boundaries, shaping the future of group online commerce. We approach challenges as opportunities, and we are continuing to build a Team of OMG’ers who work hard, welcome change, and live out our Magic. Come join us at OMG! You can play a pivotal role in this rapidly changing industry as we scale our platform and improve the eCommerce experience for our clients and their customers. Our Magic TEAM IS EVERYTHING We Invest in Each Other We Create Solutions We Enjoy the Ride EMBRACE IT. OWN IT. ALL IN. Engineering @ OMG As a Software Engineer, you will be part of a growing development Team and directly impact the development process and our culture. We are building our platform with tools like Docker, Kubernetes, Go, PHP, Node, React, and other exciting technologies — we believe in picking the right tool for the job. Day in the Life You will work closely with a Team to understand feature requests, help plan development work, and implement software solutions You will implement fixes to existing software defects You will be proactive in solving problems and comfortable in moving quickly Requirements What You Need Degree in Computer Science or equivalent 3 to 5 years of experience building web apps. We will be most interested in checking out what you have built Experience with the above-listed technologies is a plus, but most important to us is the ability to pick up new tools and languages quickly and the proven desire to do so Somebody who asks a lot of questions, is confident not knowing everything, and is more likely to ask for help and collaborate than go at it alone Track record of solving problems and owning your vision You need to be crisp and detail-oriented, and willing to own an outcome and run with it, without somebody telling you exactly how to get there A scrappy, get stuff done attitude that completes high-quality projects quickly Experience in eCommerce is a plus U.S. Citizen or Permanent Resident status required Visa Sponsorship not available OrderMyGear provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, sexual orientation, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation, and training. Benefits Some of the Perks Competitive benefits & PTO 401(k) with employer match Paid parental leave Wholesale discount to name brands In-office benefits Catered lunches & breakfasts Company happy hours and outings Casual office atmosphere & one block from Deep Ellum Fully stocked kitchen Commuter benefits",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-20T03:35:53.000Z"
    },
    "company": {
        "name": "OMG",
        "link": "https://www.linkedin.com/company/ordermygear"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Dallas",
        "region": "TX",
        "postal_code": "75342",
        "street_address": null,
        "latitude": 32.777977,
        "longitude": -96.79621
    }
}