{
    "job": {
        "title": "Site Reliability Engineer",
        "industry": "Consumer Services,Financial Services,Information Technology and Services",
        "description": "Company Description As the world's leader in digital payments technology, Visa's mission is to connect the world through the most creative, reliable and secure payment network - enabling individuals, businesses, and economies to thrive. Our advanced global processing network, VisaNet, provides secure and reliable payments around the world, and is capable of handling more than 65,000 transaction messages a second. The company's dedication to innovation drives the rapid growth of connected commerce on any device, and fuels the dream of a cashless future for everyone, everywhere. As the world moves from analog to digital, Visa is applying our brand, products, people, network and scale to reshape the future of commerce. At Visa, your individuality fits right in. Working here gives you an opportunity to impact the world, invest in your career growth, and be part of an inclusive and diverse workplace. We are a global team of disruptors, trailblazers, innovators and risk-takers who are helping drive economic growth in even the most remote parts of the world, creatively moving the industry forward, and doing meaningful work that brings financial literacy and digital commerce to millions of unbanked and underserved consumers. You're an Individual. We're the team for you. Together , let's transform the way the world pays. Job Description The Site Reliability Engineering (SRE) is a critical part of our Visa Cloud platform strategy. As an Site Reliability Engineer, you have a mindset to maximize system availability through both proactive and reactive means: you build robust technical support and automation to eliminate or minimize incidents, as well as investigate and resolve issues in response to live incidents. You are comfortable working with software engineering teams and supporting their demanding needs to ensure the security, availability and performance of the platform. You will join an established Cloudview - Site Reliability Engineering team. Essential Functions You will identify and support all request performed via Visa Cloud Platform services (IaaS/PaaS/Kubernetes as a service) You will respond and resolve incidents, problem and user queries through proper analysis Rotating weekly SOW responsibilities, that involves daily troubleshooting of incidents to ensure SLAs and SLOs are met Partner with software and systems engineers across the organization to produce and roll out fixes Provide guidance to other team members on managing end-to-end availability and performance of mission critical services To tackle assignments with minimal supervision Strong communication skills with a strong sense of urgency and attention to details Qualifications Basic Qualifications 5 years of relevant work experience with a Bachelor’s Degree or at least 2 years of work experience with an Advanced degree (e.g. Masters, MBA, JD, MD) or 0 years of work experience with a PhD Strong experience in Linux and Windows systems to troubleshoot issues Ability to script/debug in Shell/PowerShell or any basic coding experience Expert knowledge in CI/CD and related tools Preferred Qualifications Knowledge of relational and non-relational databases, including creating and running queries [MySQL and NOSQL] Experience with various middleware products such as Redis, Kafka, Tomcat, Nginx Experience with configuration management tools such as Chef/Ansible Experience with monitoring tools and handle application/system alerts Working knowledge with OpenShift or Docker or Open Source Kubernetes Have an urge to document all the things so you don't need to learn the same thing twice Have an enthusiastic, go-for-it attitude. When you see something broken, you can't help but fix it!! Work Hours Additional Information Incumbent must make themselves available during core business hours. Travel Requirements This position requires the incumbent to travel for work 5% of the time. Physical Requirements This position will be performed in an office setting. The position will require the incumbent to sit and stand at a desk, communicate in person and by telephone, frequently operate standard office equipment, such as telephones and computers, reach with hands and arms, and bend or lift up to 25 pounds. Visa is an EEO Employer. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability or protected veteran status. Visa will also consider for employment qualified applicants with criminal histories in a manner consistent with EEOC guidelines and applicable local law. Job Number: REF32890L",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-25T07:32:45.000Z"
    },
    "company": {
        "name": "Visa",
        "link": "https://www.linkedin.com/company/visa"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Austin",
        "region": "TX",
        "postal_code": "78745",
        "street_address": null,
        "latitude": 30.264978,
        "longitude": -97.7466
    }
}