{
    "job": {
        "title": "Data Scientist (100% Remote)",
        "industry": "",
        "description": "What We Do We make STEM education accessible and affordable to the world, and propel the next generation of leaders in the field of science, math, engineering and technology. We are an AI short-form video platform helping students gain mastery through consumption of bite-size, authentic, practical and conceptual content that is 100% relevant in their STEM journey.  We are a community of educators and students.  We deliver a personalized AI tutor to every student, powered by millions of hours of proprietary video training data from 30k+ of the world’s best educators. Who We Are We are a mission-driven, high-growth, series-A venture-backed team of 30 and growing, helping +20 million students counting. We have developed the most comprehensive video STEM library in the world, with 2 million pieces of content, with the goal of amassing significantly more for the benefit of all students. We strive to empower every student with their own personalized AI tutor, eliminating barriers of cost, place and time. We are backed by top tier investors and have just closed our Series A round. Your Role Numerade seeks a Data Scientist to build and lead their Data Science Group applying machine learning methods to meet this challenge, in close collaboration with working partners across the company.  You will push the boundaries of leveraging data to improve student and educator success. Responsibilities • Identify opportunities for personalization using behavioral user research and machine learning techniques • Develop new algorithmic recommendation strategies based on this research • Communicate results and impact to product and newsroom stakeholders • Turn models into data products, collaborate with engineering and business teams Technical Qualifications • PhD, MS, or 3+ years research experience in computational social science, applied mathematics cognitive and neural sciences, economics, information retrieval, statistics, or another quantitative/computational discipline • Experience designing performance metrics and using machine learning for feature engineering • Experience communicating technical concepts to expert and lay audiences • 2+ years coding experience, Python preferred • Experience in data engineering, including SQL and manipulating large structured or unstructured datasets for analysis • Familiarity with experimental design a plus • Experience with recommendation systems and personalization a plus • Familiarity with modeling behavioral/user data a plus • Experience using NLP methods a plus • Experience building statistical inferential models a plus • Experience with building data products, either internal or consumer-facing a plus Non-Technical • Commitment to the Numerade mission of democratizing STEM education and closing the education opportunity gap. • Excellent analytical and problem-solving skills • Strong oral and written communication skills • Excitement about using Machine Learning to drive product development • A passion for empirical research and for answering hard questions with data • Proven record of solving challenging problems in academia and/or industry • Eagerness to collaborate with both technical and non-technical colleagues in content, product management, marketing, and executive leadership groups • Ability to gauge the complexity of machine learning problems and a willingness to execute simple approaches for quick effective solutions as appropriate Numerade is an equal opportunity employer and encourages all applicants to apply without regard to gender, race, religion, sexual orientation, or any other classification which is protected by applicable law. Benefits Medical, dental, and vision 100% covered for you and dependents The ability to work FT and remotely L&D opportunities and stipend Seniority Level: BOE",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-31T21:35:54.000Z"
    },
    "company": {
        "name": "Numerade",
        "link": "https://www.linkedin.com/company/numerade"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Los Angeles Metropolitan Area",
        "region": null,
        "postal_code": "90021",
        "street_address": null,
        "latitude": 34.073666,
        "longitude": -118.23985
    }
}