{
    "job": {
        "title": "Developer III - Data Engineer, IS Core Services",
        "industry": "Logistics and Supply Chain,Human Resources,Financial Services",
        "description": "Company Description “We’re not in the shipping business; we’re in the information business” -Peter Rose, Expeditors Founder Global supply chain management is what we do, but at the heart of Expeditors you will find professionalism, leadership, and a friendly environment, all of which foster an innovative, customer service-based approach to logistics. 18,000 trained professionals 300+ locations worldwide Fortune 500 Globally unified systems Job Description “Velocity, Variety, and Volume” - those are three ‘V’s of the Big Data that our global logistics company, Expeditors, is handling daily while moving freight from all over the world. We invite you to an exciting opportunity to become part of a Big Data development team to help build a data lake environment and to support users through ingesting, analyzing, and visualizing Expeditors’ Big Data. You will be working with highly skilled software development engineers using Event-Driven Architecture, Domain Driven Design, and Event Sourcing. If you are a data geek and excited about big data related technologies, we would like to talk to you about this great opportunity. Qualifications MINIMUM QUALIFICATIONS 5+ years of professional software development experience. Object-oriented programming and component-based development with Java/Python. Experience working with both structured and unstructured data, with a high degree of SQL knowledge. Experience designing and implementing scalable ETL/ELT processes. Experience in modeling data for low latency reporting. Expertise with Big Data ecosystem services, such as Spark/SparkSQL, Kafka, Apache NiFi, Hadoop/Hive, MongoDB, HBase, and Kafka Streams. Experienced in Modern Big Data Analytics using Data Lakes, Spark, and different file formats like Avro, JSON, and Parquet. Experience working with large cloud data lakes. Hands-on experience with Databricks, building data pipelines. Performance tuning, troubleshooting and diagnostics, process monitoring, and profiling. Ability to work in a fast-paced environment with evolving requirements and capability goals. Appetite for learning new & emerging technologies. Strong problem-solving skills and communication skills. Self-motivated, driven, and independent individual. Desired Qualifications BS in Computer Science or similar, or comparable work experience. Prior experience with any cloud stack, preferably Azure. Prior experience with open source Apache projects. Understanding of reporting tools such as Power BI/MicroStrategy/Tableau/ etc. Experience with orchestrating complex data pipelines using tools like Azure Data Factory or Apache Airflow. Experience with large-scale data processing, complex event processing, stream processing. Experience working with CI/CD pipelines, source code repositories, and operating environments. Understanding containerization, virtualization, and cloud computing. Experience working in the Scrum Agile software development framework. Demonstrated expertise in Linux. Additional Information Expeditors Offers Excellent Benefits Paid Vacation, Holiday, Sick Time Health Plan: Medical, Prescription Drug, Dental and Vision Life and Long Term Disability Insurance 401(k) Retirement Savings Plan Employee Stock Purchase Plan Training and Personnel Development Program All your information will be kept confidential according to EEO guidelines. Successful candidates must pass a background check.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-06T00:00:00.000Z"
    },
    "company": {
        "name": "Expeditors",
        "link": "https://www.linkedin.com/company/expeditors"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Seattle",
        "region": "WA",
        "postal_code": "98133",
        "street_address": null,
        "latitude": 47.60323,
        "longitude": -122.33028
    }
}