{
    "job": {
        "title": "Site Reliability Senior Engineer",
        "industry": "Financial Services",
        "description": "You won’t just shape the world of software. You’ll shape the world of life, work and play. Our Software Engineers not only understand how technology works, but how that technology intersects with the people who count on it every day. Today, innovative ideas, insight and new perspectives are at the core of how we create a more powerful, personal and fulfilling experience for all our customers. So if you’re interested in a career creating breakthrough software and making an impact on an audience of millions, look no further. You won’t just keep up, you’ll break new ground. Here’s Just Some Of What You’ll Be Doing There are hundreds of opportunities to make your mark on technology and life at American Express. Taking your place as a core member of an agile team driving the latest development practices Writing code and unit tests, working with API specs and automation Identifying opportunities for adopting new technologies Leading a team of engineers that delivers knowledge management solutions to businesses worldwide Qualifications - Internal BS or MS degree in computer science, computer engineering, or other technical discipline - or equivalent industry experience. 4-5 years of software development experience 4-5 years of operational experience managing and operating mission critical systems and infrastructure. Extensive experience operating and maintaining mission critical systems applying Site Reliability principles. Strong experience in applications and infrastructure with high throughput and performance. Passionate about meeting key system indicators including SLAs, SLIs, SLOs. Extensive experience in designing and implementing large scale platforms with high resiliency, availability, and reliability. Experience with interfacing, configuring, and troubleshooting docker Container Runtimes and Runtime interfaces (cri-o, containerd, runC, crun, etc.) Experience with micro services architectures and its operational challenges is preferred. Ability to effectively interpret technical and business objectives and challenges and articulate solutions. Willingness to learn new technologies and exploit them to their optimal potential Enterprise application/framework incident management Every member of our team must be able to demonstrate the following technical, functional, leadership and business core competencies, including: Broad knowledge of infrastructure automation technologies like ansible, chef, puppet, bash, containers. Broad knowledge of CNCF and Kubernetes ecosystem and how to leverage Kubernetes to drive automation and reduce toil. Passionate about state-of-the-art visibility: Logging, tracing, Monitoring, alerting, dashboarding, and timeseries metrics. Broad knowledge of infrastructure design, including networking, storage and compute. Programming Languages and Frameworks Required: Golang, Java, Docker Kubernetes Analytical Thinking Employment eligibility to work with American Express in the U.S. is required as the company will not pursue visa sponsorship for these positions American Express is an equal opportunity employer and makes employment decisions without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, disability status, age, or any other status protected by law.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-10T02:10:46.000Z"
    },
    "company": {
        "name": "American Express",
        "link": "https://www.linkedin.com/company/american-express"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 48,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Phoenix",
        "region": "AZ",
        "postal_code": "85009",
        "street_address": null,
        "latitude": 33.448204,
        "longitude": -112.072586
    }
}