{
    "job": {
        "title": "Site Reliability Engineer",
        "industry": "Financial Services",
        "description": "The Site Reliability Engineer (SRE) position requires a mix of strategic engineering and design along with hands-on, technical work. An ideal candidate will have experience in being a Systems Administrator that has moved on to DevOps/Automation in their career, and have coding skills to automate tasks and build tools to help with our service operations. The SRE will configure, tune, and troubleshoot multi-tiered systems to achieve optimal application performance, stability and availability. The SRE will work closely with the software engineers, infrastructure and network engineers to deploy and maintain our services. Technical and Professional Expertise Demonstrated knowledge of TRIRIGA system administration, configuration, development, including lease accounting functionality and BIRT reports Passion for problem solving Excellent communication (written and verbal), presentation, and interpersonal skills Professional judgement demonstrated by decision making and prioritization skills Experience and familiarity with Tririga BOs, Form Building, Portals, Workflows Designing, Modifying State Families, Navigations and Contact Roles Setup, Tririga Business Connect, Outbound/Inbound integrations. Experience with the IBM Tririga platform including application development (workflows and object maintenance), API integration development and support. Ability to see and address problem trends Self-directed and comfortable with working in a fast-paced, results-oriented, and often ambiguous environment Take pride in your work, show focus, high attention to detail, and build quality Critical thinking and proactive problem solving Work with the TRIRIGA development team to answer questions and provide guidance on options of how to best implement solutions Work with the TRIRIGA development team to determine a Level of Efforts (LOE) Work with the business sponsor to develop test cases and answer questions Work with the TRIRIGA development team to answer questions and provide guidance on options of how to best implement solutionsProvide users applications support for helpdesk tickets escalated to you; if needed, triage and collect more information before escalating to a project manager. Aid IT project managers in troubleshooting, operations, testing, and implementation. Follow-up on open tickets with users after a change has been completed to see if their issues have been resolved. Follow-up with project managers on open tickets in their queues. Preferred Technical And Professional Expertise Bachelor's degree in Computer Science, Management Information Systems or related discipline / equivalent experience Operate solutions with technologies such as Java, PHP, PowerShell, RESTful API, JavaScript, Bash Script, IBM Tririga, Apache, IIS, OKTA SSO, Service-now, and PHP. Experience with IBM TRIRIGA Knowledge of SRE Knowledge of DEVOPS Knowledge of Agile practices JPMorgan Chase & Co., one of the oldest financial institutions, offers innovative financial solutions to millions of consumers, small businesses and many of the world's most prominent corporate, institutional and government clients under the J.P. Morgan and Chase brands. Our history spans over 200 years and today we are a leader in investment banking, consumer and small business banking, commercial banking, financial transaction processing and asset management. We recognize that our people are our strength and the diverse talents they bring to our global workforce are directly linked to our success. We are an equal opportunity employer and place a high value on diversity and inclusion at our company. We do not discriminate on the basis of any protected attribute, including race, religion, color, national origin, gender, sexual orientation, gender identity, gender expression, age, marital or veteran status, pregnancy or disability, or any other basis protected under applicable law. In accordance with applicable law, we make reasonable accommodations for applicants' and employees' religious practices and beliefs, as well as any mental health or physical disability needs. Equal Opportunity Employer/Disability/Veterans",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-10T14:36:44.000Z"
    },
    "company": {
        "name": "JPMorgan Chase &amp; Co.",
        "link": "https://www.linkedin.com/company/jpmorganchase"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Plano",
        "region": "TX",
        "postal_code": "75093",
        "street_address": null,
        "latitude": 33.019695,
        "longitude": -96.697586
    }
}