{
    "job": {
        "title": "Software Engineer I",
        "industry": "Biotechnology,Pharmaceuticals",
        "description": "Position Summary As a Software Engineer, you will be a part of a collaborative team that develops with others in Resilience to provide applications and solutions for instruments and analytical software for novel therapeutics. This role will work with stakeholders to develop software-based solutions to manufacturing challenges and develop next-generation therapies and instruments. You will join a dynamic, fast-paced organization and team developing innovative solutions, and you will need to work independently in a collaborative team. Resilience is looking for intelligent, motivated software engineers who enjoy taking on complex challenges, work well in an agile, dynamic environment, and care about high-quality engineering best practices. Job Responsibilities Develop software (Python, C#) to interface, control, and monitor manufacturing instruments, quality assurance equipment, and visualization tools for analytical analysis. Developing applications that are cloud-focused with Gather requirements and generate specifications for software application systems. Contribute to the improvement of our Software Development Life Cycle. Comfortable working in a fast-paced Agile team environment Contribute towards investigation and resolution of technical problems Innovate at the SW component level and influence decisions in subsystem architecture and design. Contribute towards unit testing, continuous integration, and deployment activities Qualifications Strong knowledge of programming with C#, Java, or other object-oriented languages Strong understanding of scripting languages, including Python and bash Understanding of object-oriented analysis and design Proven ability to self-manage and have an ability to deal well with ambiguity and work independently and as a multidisciplinary analytical research team member in a fast-paced environment. Background knowledge in computational biology, immunology, wet-lab experimental procedures, and data analysis is a plus. Preferred Experience BSc/MS: 1-2 years of experience or Ph.D. in a scientific-analytical field, e.g., computer science, bioinformatics, data science, or neurology. Experience with source control management repositories (such as GIT, SVN, etc.) and Configuration Management Knowledge and experience with cloud application development",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-10-01T17:47:11.000Z"
    },
    "company": {
        "name": "Resilience",
        "link": "https://www.linkedin.com/company/weareresilience"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 12,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "California",
        "region": "United States",
        "postal_code": "93266",
        "street_address": null,
        "latitude": 37.254673,
        "longitude": -119.61728
    }
}