{
    "job": {
        "title": "Data Scientist - REMOTE",
        "industry": "",
        "description": "Eight Sleep is looking for a mobile-focused Data Scientist to help launch a new business intelligence effort. This role will largely focus on data pipeline and data warehouse issues while also supporting advances in customer lifecycle marketing, business intelligence platform, customer lifetime value, customer segmentation, user flow, on-site creative analysis, A/B testing, etc. How you'll contribute Use data exploration techniques to discover new correlations in sleep and wearable data Design and implement algorithms that power our sleep intelligence impact the life of our customers every day Contribute to product decisions by providing context via data and metrics analysis What you'll need to succeed 3+ years of hands-on experience with data science or analytics in a business context 2+ years of experience working with Python in a production environment 2+ years of SQL experience Machine Learning and statistical modeling experience preferred Why you’ll love Eight We’re a tight-knit, passionate team that’s working to improve people’s lives by improving the way they sleep Leadership is committed to employees’ wellness and career development You’ll get a better night sleep every night; all full-time employees receive the Pod Flexible, generous PTO 100% employer contribution for medical/dental/vision insurance At Eight Sleep we continually celebrate the diverse community different individuals cultivate. As an equal opportunity employer, we stay true to our values by ensuring everyone feels they can flourish and grow. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-03T14:10:54.000Z"
    },
    "company": {
        "name": "Eight Sleep",
        "link": "https://www.linkedin.com/company/eight--"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "New York",
        "region": "United States",
        "postal_code": "13856",
        "street_address": null,
        "latitude": 42.93923,
        "longitude": -75.62005
    }
}