{
    "job": {
        "title": "Remote Recruiting Project Manager",
        "industry": "Staffing and Recruiting",
        "description": "Remote Recruiting Engagement / Project Manager Join a company that truly understands their customer’s business needs and delivers unparalleled results. Who We Are. We are an experienced team of professionals ready to seamlessly assist with our clients recruiting project(s). Our results driven recruitment model offers tremendous flexibility over costly traditional recruitment methods. We invest in our clients so they can be successful. We spend the time and make the effort to know their business and understand their hiring needs in detail so we can quickly identify and screen top-tier talent for them to make the best hire. We offer a remote workforce and partner with clients nationwide both at headquarter locations and satellite / plant locations. Who You Are. As our Engagement Manager, you will function as the voice of your customer. You will be responsible for strengthening relationships with clients while managing internal resources to meet delivery needs. You will indirectly lead the service team to ensure successful project completion while providing a seamless extension to the client’s internal Human Resources / Talent Acquisition team. As an Engagement Manager, you will oversee several projects simultaneously, provide daily project updates, evaluate delivery goals and customer requirements, as well as analyze industry trends and conduct competitive assessments. Engagement Managers are passionate about meeting customer needs and are exceptional communicators who conduct business with uncompromising professionalism and integrity. Major Duties and Responsibilities: ·        Manage each project effectively to meet or exceed client expectations ·        Serve as the “voice of the customer” when communicating with candidates about the clients’ corporate culture and position requirements ·        Serve as the team lead/point of contact for intake meetings and status calls with clients ·        Participate as a true extension of the client’s hiring team by listening to their needs, gaining a true understanding of their corporate culture and successfully presenting those needs to Mj3 Partner’s internal teams in order to ensure accurate project execution ·        Participate in and coordinate sourcing and recruiting efforts for the most effective candidate outreach using our proven systems and processes ·        Engage, qualify and submit candidates for assigned positions ·        Anticipate the needs and concerns of the client and address them proactively ·        Seek frequent client feedback regarding submitted candidates and the level of satisfaction with our service. Update them on the progress and goal status ·        Maintain open lines of communication with clients and address trends, issues / concerns, or changing requirements directly. Update the internal team accordingly ·        Create, update, and distribute project plans ·        Generate and review client-facing reports and deliver in a timely manner as agreed upon with the clients ·        Up-sell and expand existing business by generating additional positions and/or cross selling different services when appropriate to meet client needs, resources, and budgets ·        Participate in client meetings as necessary ·        Work closely with upper management to ensure the scope and direction of each project is on schedule, and address any obstacles as needed ·        May perform other duties as assigned Required Skills and Experience: ·        Bachelor’s degree or equivalent work experience ·        2+ years of full-cycle recruiting exp ·        2+ years of experience sourcing qualified candidates based on a job requisition using LinkedIn Recruiter ·        Proficient in creating Boolean Search Strings from scratch to source qualified candidates ·        2+ years of external client project management experience ·        Open to potential contract work ·        Proven ability to recognize ways to grow the business, improve services, and minimize client cost per hire ·        Ability to indirectly manage, supervise and lead others to achieve common goals ·        Prior experience using an Applicant Tracking System ·        Intermediate experience with Microsoft Office suite applications ·        Strong multi-tasking competency and the ability to work well under pressure ·        Excellent verbal and written communication skills ·        Exceptional organizational skills ·        Critical thinking / problem solving skills Preferred Skills and Experience: ·        5+ years of overall professional experience in a similar industry. (Human Resources or recruiting strongly preferred ·        Prior agency experience preferred ·        Prior WebEx experience (MSTeams, Zoom, Gotomeeting) What it’s Like to Work Here We are a team driven by Customer Service and we pride ourselves on delivering outstanding services to our clients. We measure ourselves by successful project engagements and repeat business. We understand the potential impact an unfilled position can have on our clients and we strive to introduce fully-qualified and interview ready candidates into the process swiftly. Just as no two candidates are the same, no two days at Mj3 Partners is the same. You will be challenged to meet the goal of your client in a fast-paced, but fun and flexible environment. We are committed to finding the right fit for our clients and candidates and the right work-life balance for our employees. What We Offer. In addition to training and career advancement opportunities, we offer competitive salaries, flexibility in work schedules, remote work and a generous paid time off package. We offer a retirement plan with a company match, ST/LT Disability, and Life Insurance. We also continually examine our employee benefit offering and look for new benefits and programs to add which are in high demand by our employees. Mj3 is the ideal environment for professionals that are self-motivated and looking for the optimal work/life balance. Think You’ve Got What it Takes? If you’re ready to have some fun, focus on results, work with a dynamic professional team and drive for the pursuit of quality and excellence in everything you do, we want you to join us. Mj3 Partners provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability or genetics.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-25T17:24:15.000Z"
    },
    "company": {
        "name": "Mj3 Partners, Inc.",
        "link": "https://www.linkedin.com/company/mj3-partners-inc-"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "United States",
        "region": null,
        "postal_code": "99999",
        "street_address": null,
        "latitude": 39.50355,
        "longitude": -99.0183
    }
}