{
    "job": {
        "title": "Software Engineer",
        "industry": "",
        "description": "Denver, Colorado (preferred) Or Remote We’re committed to building a world where everyone, everywhere has access to care that works. A world where a better future for healthcare means leveraging the power of information and technology—and celebrating those who make change possible. To get there, we’re creating an environment where you have the support, tools and resources that inspire the kind of groundbreaking thinking that will bring this vision to life. Join us to create what’s next for health— a purpose-built digital platform that drives 365 healthcare transformation by connecting the global health ecosystem to insights from peers and thought leaders, professional development tools, networking opportunities and curated content — anytime, anywhere. Your Challenge: The Software Engineer builds software functionality and participates actively in the delivery team by taking on development responsibilities for the entire tech stack. The Software Engineer works on a cross-functional team and contributes across several other technical activities such as DevOps and quality of the product. The Software Engineer collaborates closely with teammates across disciplines including DevOps, quality, product, and design to drive positive business outcomes. They will have a real passion for development and a demonstrated appetite for continual learning, typically manifest in their community contributions (e.g., open source work, publishing / speaking on technical ideas) What you will need to be successful: The things that you will tackle: Build applications ensuring that the code follows latest coding practices and industry standards Design and develop the business logic and backend systems as we scale through our MVP and beyond Work closely with team mates to build a quality system end-to-end Write unit, integration tests and functional automation Develop high quality, well documented, and efficient code Challenge ideas and opinions to avoid pitfalls and inefficient solutions Build using modern design patterns and architectural principles Support product owner in defining future stories and tech lead in defining technical designs What you will need to be successful: 0 – 3 years of experience with software development Seen as a keen learner within the technical components of the domains/products Passionate to learn new technologies and strives towards cross-functional development Experience writing and utilizing autonomous services oriented RESTful API services and performance tuning large scale apps Ability to write effective unit, integration, and API tests Exposure to HTML, CSS/LESS/SCSS/etc., JavaScript, and responsive design Experience in the JavaScript ecosystems, such as React, Node, TypeScript, etc Intermediate understanding of technical best practices to support Agile development What else will help you be successful: Mobile development experience with either native or web-to-native tooling and frameworks Experience with database systems, with knowledge of SQL and NoSQL stores (e.g. MySQL, Oracle, MongoDB, Couchbase, etc.) Why we love our workplace, and why you will, too: Fun, collaborative and winning team environment. Flexible working arrangements. Competitive pay and comprehensive healthcare coverage. Generous paid time off, including time off to volunteer! Wellbeing programs to support all of your emotional, physical and financial needs. Emphasis on continuous learning and development. Are you a Changemaker? We’ll do amazing things for healthcare. We are an Equal Opportunity Employer: Vets/Disabled",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-20T00:50:11.000Z"
    },
    "company": {
        "name": "Anonymous",
        "link": "https://www.linkedin.com/company/anon-crypto"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Denver",
        "region": "CO",
        "postal_code": "80247",
        "street_address": null,
        "latitude": 39.738453,
        "longitude": -104.984856
    }
}