{
    "job": {
        "title": "Sr. Data Scientist",
        "industry": "",
        "description": "Senior Data Scientist New York, NY Magid is disrupting the entertainment industry with our approach to data gathering, analysis and analytical tool- building. Do you know the fundamentals of how to use data to make a case? If so, we need you to be a part of it! EmotionalDNA® discarded old assumptions about what market research can and cannot do, and now we're providing data-driven guidance for the critical issues facing our clients. EmotionalDNA® is applicable whenever people care about what they consume–and that covers a lot of territory! Currently we have a heavy, but not exclusive concentration in entertainment, and we are building out other areas with high potential. Key Responsibilities and Essential Functions The Scientist’s work will include: Learn enough about EmotionalDNA® to make independent, creative contributions to analysis and tools that drive client ROI, including building new predictive models and impactful decision-driving visualizations. Creative thinking should also be applied to new eDNA-drive products and solutions. Contribute to our data pipeline architecture including productizing your machine learning models. Leverage your data science skills to support research projects on both eDNA and Global Media & Entertainment. Serve as an internal consultant in ideation and pitching new Magid data science initiatives with senior management and business development. Attend and present at knowledge transfer sessions, learning from senior research staff to boost company-wide expertise in areas such as domain knowledge, soft skills, and technical abilities. No \"mindless number crunching\". Every analysis needs to be thoughtful, and every analysis could potentially inform the direction of the EmotionalDNA® suite of products and offerings. Job Qualifications: Required Master’s degree with a quantitative focus (Statistics, Computer Science, Mathematics, Economics, Psychology, Physics etc.) and two years of experience; OR 5 years of practical experience. Python programming (not solely analytical) experience (Minimum 3 years) Applied quantitative reporting/analysis, not necessarily in Python: 3 years SQL programming experience: 3+ years Understanding of and comfort with machine learning and statistical techniques (e.g. predictive modeling, cluster analyses, hypothesis testing, etc.) Dashboarding experience on any platform (Tableau, Power BI, Dundas, etc.) Version control experience (Git) Strong stakeholder management skills Experience presenting analytical projects to high level stakeholders and clients Experience using survey data to create predictive models Time series experience (e.g. ARIMA, Panel regression, etc.) Nice to Haves (But not Required) Market research experience (especially in media & entertainment) NLP experience Experience with quantitative analysis on alternative media (podcasts, YouTube videos) Experience working directly with clients to solve their business problems with data Data engineering experience, particularly with Apache Airflow About Magid: Magid lives in the cross-section of human behavior and business strategy, delivering courageous thinking that shapes better experiences, products and services. Since 1957, thousands of local and global brands in over 40 countries have engaged with Magid for bold ideas that have helped achieve innovation and success. We are passionately curious and driven by our pursuit to improve the human experience with every engagement. We offer competitive compensation, medical, dental, long and short-term disability, 401k and more. Magid provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability or genetics. Contact information: careers@magid.com",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-06-23T20:25:56.000Z"
    },
    "company": {
        "name": "Magid",
        "link": "https://www.linkedin.com/company/magid"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "New York City Metropolitan Area",
        "region": null,
        "postal_code": "10021",
        "street_address": null,
        "latitude": 40.748295,
        "longitude": -73.98556
    }
}