{
    "job": {
        "title": "Data Scientist",
        "industry": "Biotechnology,Information Technology and Services,Computer Software",
        "description": "The ideal candidate's favorite words are learning, data, scale, and agility. You will leverage your strong collaboration skills and ability to extract valuable insights from highly complex data sets to ask the right questions and find the right answers. Collaborate with data scientists/ engineers/ stewards on data extraction, cleaning and visualization. Implement and optimize decision science models based on structured and unstructured data. And work in cross geography team environment in the delivery of analytic software prototypes. Responsibilities Develop, test and produce advanced analytical methods in the agricultural domain. Collaborate with data scientists/engineers/stewards on data extraction and data cleaning. Design, implement and optimize statistical and machine learning models based on structured and unstructured data. Work closely with the software engineering team, data engineers and business representative in the delivery of analytic software. Qualifications Fluency in Python or another high-level programming language Experience developing statistical, and machine learning models Ph.D in related field (Statistics, Geo-statistics, Mathematics, or closely related field) Preferred Skills: Previous exposure in agricultural/biological scientific data Experience working with environmental data Familiarity working with geospatial data Familiarity with deep learning architectures *Ideally - we would like someone who can work in person, after offices reopen, and it is deemed safe to do so, but we WILL consider remote working for the right candidate",
        "employment_type": "CONTRACTOR",
        "date_posted": "2021-08-02T22:00:21.000Z"
    },
    "company": {
        "name": "neteffects",
        "link": "https://www.linkedin.com/company/neteffects"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Greater St. Louis",
        "region": null,
        "postal_code": "63101",
        "street_address": null,
        "latitude": 38.62262,
        "longitude": -90.192986
    }
}