{
    "job": {
        "title": "Software Engineer, New Grad (Bachelor's or Masters)",
        "industry": "Information Technology and Services,Computer Software,Internet",
        "description": "You're Brilliant. We're Hiring. You are an amazing software engineer that loves taking new ideas and algorithms and applying them in creative ways. We are a small, fast growing start-up, eager to build meaningful, everyday apps at scale. Our first product is Sunshine Contacts, but we are excited about building so much more with your help. We are passionate about making the mundane magical: building everyday apps that put people first and quietly solve problems using sophisticated technology. As an early team member, we want people who are excited to build applications with very little formal direction. We are not partial to specific languages or technologies. If you are a software engineering generalist, this is the role for you! If working in a fast-paced environment where you will play a key role both in experimentation and in implementation sounds interesting to you, please consider applying! Requirements If you are a recent graduate or have 1-3 years of full-time work experience BS, MS degree in Computer Science or related technical discipline, or equivalent experience Interest in the consumer space, willingness to roll-up sleeves and do hands-on development on day one Full stack development experience preferred. Given we are a small team today, you should be willing to work across the stack and learn new technologies if needed Experience with quick prototyping and working through ambiguities. We are defining our product specs through innovation and improvisation from every member of team Solid understanding of object-oriented programming and familiarity with various design and architectural patterns Ability to think critically about products and to shape technical and product strategy Good written and spoken communication skills Under normal circumstances employees must be able to and willing to lawfully work out of our downtown Palo Alto, California office. However, under the current circumstances remote work is being accommodated in order to comply with safety measures. People matter to us a lot. Just celebrating diversity isn’t enough -- we commit to unabashedly tailoring our hiring practices, our processes, and our culture to foster an inclusive workplace for people of all backgrounds. Sunshine is proud to be an equal opportunity employer working to raise the standards of diversity in tech.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-25T21:55:12.000Z"
    },
    "company": {
        "name": "Sunshine",
        "link": "https://www.linkedin.com/company/sunshineinc"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 12,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Palo Alto",
        "region": "CA",
        "postal_code": "94310",
        "street_address": null,
        "latitude": 37.445103,
        "longitude": -122.16036
    }
}