{
    "job": {
        "title": "Software Engineer",
        "industry": "Information Technology and Services,Computer Software,Hospital &amp; Health Care",
        "description": "Company Description PayScale is the world leader in modern compensation software. Our rich data and unique algorithms power the world’s largest real-time database of salary profiles, giving both employers and employees immediate visibility into the right pay for any position. We are bringing the dark art of compensation into the light by helping more than 6,500 businesses to stay competitive in the labor market and retain and manage their largest investment: their people. We’re disrupting the compensation industry and are looking to bring on talented professionals with diverse perspectives. We foster a playful work atmosphere where highly motivated individuals can be truly innovative. Are you bright, tenacious, and inventive? If so, PayScale may be the perfect place for you to grow your career! We are a fast-growing Warburg Pincus portfolio company who is thrilled to have brought the MarketPay product into our suite of offerings in 2016, and started a strategic alliance with Mercer in 2017. We can't wait for you to join us! Job Description What We Do: Our team supports the millions of users that visit our site every month and builds features that contribute towards fair pay. Our team is metrics driven and projects are prioritized based on how much they can impact our company wide goals. Do you want to make a huge impact while working on hard technical problems? What You Do: We are looking for a Software Engineer to help us lead the way and would love to welcome you to the team! Day-in-the-Life: As a Software Engineer, a typical day may include the following… Drive key decisions on architecture and implementation of services and data processes required to support millions of users. Innovate to keep the bar higher for the team and the engineer organization as a whole. Provide quality and thoughtful feedback on peer code reviews. Collaborate with product managers, data analysts and other engineers to show our users meaningful data. First Year In Role Month 3: You understand the tech stack and code base your team owns. You are tackling small to medium size stories with some help and guidance from the team. Month 6: You understand all the major features your team owns and can pitch in pretty much anywhere. You still need to ask questions but you're able to take a story and deploy your changes to production with ease. Month 12: You are a veteran. You're very active in design discussions, and continually share your knowledge and experience with the rest of the team. You understand the other parts of the tech org well and can have an impact outside your team. People come to you with questions and you're regularly pitching ideas to the rest of the org. Qualifications You have 3+ years experience in software development. Experience with one or more front-end framework (React, Angular) You have previous experience in C# or other OOP languages. Skills You have experience launching high performance and scalable services and applications into cloud platforms. You have working knowledge of relational and no-SQL databases. You have familiarity/experience with unit testing and crafting testable code. You are able to explain technical concepts to developers, project managers, and technical managers. You have the ability and desire to work with a team of people solving complex problems that often require independent research with minimal supervision. You have excellent problem solving and critical thinking skills Tools & Technologies We're Using We write all our back-end code in C#. We use React as our front-end framework We work in Azure utilizing technologies such as Functions, Blob Storage, SQL and more. We use TeamCity and Octopus for our build and deploy pipeline and host most of our stuff on Kubernetes We track all our work in Jira and store all our git repositories in Bitbucket. Additional Information Meet Your Manager: Prior to PayScale, I spent 10 years at various startups. It was a busy time, but I learned a lot about how to take a raw idea and turn it into a reality. I was attracted to PayScale by the people and the chance to slow down a little bit. PayScale has provided the opportunity for me to grow and expand my impact on the org. I don’t have a particular management style per say but I think candor, empathy and transparency goes a long way. Additional Information PayScale provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, gender, sexual orientation, national origin, age, disability, genetic information, marital status, amnesty, or status as a covered veteran in accordance with applicable federal, state and local laws. PayScale complies with applicable state and local laws governing non-discrimination in employment in every location in which the company has facilities. Benefits We Offer Unlimited Paid Time Off policy 100% company paid medical/vision/dental/prescription premiums for employees (50% for eligible dependents and partners) Four Flexible Spending Account (FSA) options for pre-tax employee allocations towards: Medical, Dependent Care (can be used towards day care costs!), Parking, Tansit. Long Term Disability, Short Term Disability, and Company-paid Life Insurance Generous Parental Leave, 4-12 weeks 10 paid holidays! Summer office closure, entire week of July 4th 401k with company match, vests immediately Perks Casual dress code (JSS - Jeans, shorts, and sandals welcome!) Onsite gym Onsite lockers, showers, and clothes dryer Bike storage Coworkers you actually like... Gender neutral bathrooms on most floors Mothers' Room Sitting-Standing ergo friendly desks Weekly company sponsored happy hours Fido Fridays (our canine colleagues join us the first Friday of every month. WOOF!)",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-27T02:07:20.000Z"
    },
    "company": {
        "name": "Payscale",
        "link": "https://www.linkedin.com/company/payscale"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Boston",
        "region": "MA",
        "postal_code": "02118",
        "street_address": null,
        "latitude": 42.358994,
        "longitude": -71.05863
    }
}