{
    "job": {
        "title": "Software Engineer, Platforms &amp; Infrastructures, Proactive",
        "industry": "Consumer Electronics",
        "description": "Summary Have you ever received a phone call from someone you don't know but your phone does? Booked a flight and and it was magically added to your calendar? Made dinner plans in Messages and got a suggestion to turn on Do Not Disturb before the event? We are just beginning to add intelligence across our products and we need your help. You will join a team who builds intelligent features, making the system faster and smarter, while respecting user privacy. Your ideas will impact hundreds of millions of people worldwide. Key Qualifications Ability to write reliable, resilient, performant and well-tested code Strong problem solving and debugging skills Outstanding communication and presentation skills Strong computer science fundamentals required - no matter how you got them Experience with macOS/iOS development is a plus Experience in ML or NLP is a plus Experience with web development technologies and scripting languages is a plus Description We are a growing, talented, and motivated team focused on building intelligent features across Apple products. These features make users more efficient by predicting and accelerating the user experience while respecting privacy. We collaborate with many different teams at Apple to create groundbreaking technology. We will consider candidates with exceptional track records, as well as candidates who are early in their careers and exhibit strong potential for growth. You enjoy creating elegant and compelling solutions, applying innovative technology in the service of human-centered design. You will build prototypes and have a say in what features we build. You will touch various parts of our code base: from optimizing memory and CPU usage to designing APIs, from implementing efficient data structures and minimizing IO to designing solid testable architectures or concurrent systems. You will be able to work on our full stack, ranging from internal tools development, to shipping code that runs on the devices you use every day. You will have an opportunity to learn from others and grow. To succeed in this role, you must be a strong programmer and a creative problem solver who thrives in a fast-paced environment, working across teams and organizations. You love building elegant user experiences, tackling hard problems, and you have a passion for the customer experience. You enjoy learning new things and you possess strong skills in object-oriented software design and debugging. You are excited about developing new features, maintaining existing code, fixing bugs, and contributing to overall system design. Education & Experience B.S or M.S in Computer Science, or equivalent experience Role Number: 200232354",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-01T07:39:40.000Z"
    },
    "company": {
        "name": "Apple",
        "link": "https://www.linkedin.com/company/apple"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Cupertino",
        "region": "CA",
        "postal_code": "95014",
        "street_address": null,
        "latitude": 37.319313,
        "longitude": -122.02927
    }
}