{
    "job": {
        "title": "Machine Learning Engineer",
        "industry": "Computer Software,Information Technology and Services,Internet",
        "description": "Description Machine Learning (ML) has been strategic to Amazon from the early years. We are pioneers in areas such as recommendation engines, product search, eCommerce fraud detection, and large-scale optimization of fulfillment center operations. The ML team within AWS provides opportunities to innovate in a fast-paced organization that contributes to game-changing projects and technologies that get deployed on devices and the cloud. The ML Solutions Lab focuses on helping customers solve their most pressing business problems using ML. Team is looking for a skilled ML Engineer with software development experience across the entire machine learning lifecycle. As a ML Engineer you will work with the AWS customers, ML scientists, AWS product teams and the field teams to design and develop advanced proof-of-concept ML solutions for our customers in the areas such as drug discovery, customer segmentation, fraud prevention, capacity planning, predictive maintenance, pricing optimization, call center analytics, player pose estimation, event detection, and virtual assistant, among others. The Primary Responsibilities Of This Role Are To Interact with customer directly to understand the business problem, help and aid them in implementation of their ML ecosystem Work closely with account team, research science and product engineering teams to drive model implementations and development of new solutions Architect and develop scalable and cost-effective solutions utilizing multiple AWS AI/ML services that will be deployed and integrated in the customer environment. Use ML tools, such as Amazon SageMaker, Rekognition, Textract, Forecast and Amazon Simple Storage Service, to provide a scalable cloud environment for our customers to label data, build, train, tune and deploy their models About Us Inclusive Team Culture Here at AWS, we embrace our differences. We are committed to furthering our culture of inclusion. We have ten employee-led affinity groups, reaching 40,000 employees in over 190 chapters globally. We have innovative benefit offerings, and host annual and ongoing learning experiences, including our Conversations on Race and Ethnicity (CORE) and AmazeCon (gender diversity) conferences. Amazon’s culture of inclusion is reinforced within our 14 Leadership Principles, which remind team members to seek diverse perspectives, learn and be curious, and earn trust. Work/Life Balance Our team puts a high value on work-life balance. It isn’t about how many hours you spend at home or at work; it’s about the flow you establish that brings energy to both parts of your life. We believe striking the right balance between your personal and professional life is critical to life-long happiness and fulfillment. We offer flexibility in working hours and encourage you to find your own balance between your work and personal lives. Mentorship & Career Growth Our team is dedicated to supporting new members. We have a broad mix of experience levels and tenures, and we’re building an environment that celebrates knowledge sharing and mentorship. Our senior members enjoy one-on-one mentoring and thorough, but kind, code reviews. We care about your career growth and strive to assign projects based on what will help each team member develop into a better-rounded engineer and enable them to take on more complex tasks in the future. Basic Qualifications 2+ years of non-internship professional software development experience Programming experience with at least one modern language such as Java, C++, or C# including object-oriented design 1+ years of experience contributing to the architecture and design (architecture, design patterns, reliability and scaling) of new and current systems. Bachelor's degree in Computer Science, Engineering, Mathematics, or a related field 1+ years of experience developing large-scale production Machine Learning systems in public cloud (AWS or equivalent) Position requires travel of up to 25%. Preferred Qualifications Masters degree in computer science, or related technical, math, or scientific field Programming experience with Python Hands on experience building deep learning models (e.g., CNN, RNN, LSTM) using frameworks like MXNet, Tensorflow, Caffe, Torch, Theano or similar. Experience or familiarity with Docker, Kubernetes and the container ecosystem. Experience with data processing, Spark, Kafka and Scala. Experience building (not just using) information retrieval systems, content storage, indexing and retrieval at web-scale Knowledge of professional software engineering practices & best practices for the full software development life cycle, including coding standards, code reviews, source control management, build processes, testing, and operations Excellence in technical communication with peers and non-technical cohorts. Strong sense of ownership, urgency, and leadership abilities in an engineering environment in driving operational excellence and best practices. Amazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please visit https://www.amazon.jobs/en/disability/us. Company - Amazon Dev Center U.S., Inc. Job ID: A1708018",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-09-01T21:25:41.000Z"
    },
    "company": {
        "name": "Amazon",
        "link": "https://www.linkedin.com/company/amazon"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Boston",
        "region": "MA",
        "postal_code": "02118",
        "street_address": null,
        "latitude": 42.358994,
        "longitude": -71.05863
    }
}