{
    "job": {
        "title": "Site Reliability Engineer",
        "industry": "Computer Software",
        "description": "Airtable is a mission-critical system for a diverse set of teams and industries. We build our platform to scale, stay resilient, and deliver delightful user experience all around. Our infrastructure requires thorough thinking, deep research into how things work, and rigorous coding. Our mission is ambitious, but we like to keep our infrastructure simple. As one of the first dedicated site reliability engineers at Airtable, you will play a critical role in scaling and refining our operational practices. Site reliability engineering begins with building solid automation across the software delivery process, including configuration, provisioning, testing, deployment, and beyond. SREs will also work with software engineers to help understand the way their code behaves in production, and build nontrivial internal tooling to enable this. We also strive for a strong security posture, and SRE will help define and implement operational practices that protect our users. Lastly, of course, our operations team is the last line of defense when incidents happen, and SREs will be part of the team that responds to them. What You'll Do Automate everything: deploys, rollbacks, database provisioning, failovers, and everything in between. Design and implement monitoring tooling across the stack, and optimize systems for uptime, performance, and reliability based on the data gathered by this tooling. Design and write tests that investigate how our infrastructure handles failure and scaling. Research hot-off-the-press CVEs and implement best practices. Build occasional product features as appropriate. Write solid, maintainable code (including a lot of JavaScript) for all of the above. Manage our Elasticsearch cluster Who You Are You're painfully thorough, whether it's scripting bulletproof deployment automation, writing a recovery playbook that an engineer can follow without fail at 3 a.m., or digging into logs and monitoring data to find the root of a problem. You're OK carrying a pager and take it seriously, but you take pride when the pager hasn't rung in the past week. You've worked with Linux, containers/namespaces, and system automation tools for Unix and cloud platforms. You have 5+ years of relevant technical experience, including significant experience with site reliability/devops or server infrastructure engineering.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-09-06T18:10:11.000Z"
    },
    "company": {
        "name": "Airtable",
        "link": "https://www.linkedin.com/company/airtable"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "San Francisco",
        "region": "CA",
        "postal_code": "94121",
        "street_address": null,
        "latitude": 37.78008,
        "longitude": -122.42016
    }
}