{
    "job": {
        "title": "Corporate Recruiter",
        "industry": "Internet",
        "description": "Whatfix is looking for a stellar Corporate Recruiter to join our Talent Acquisition team in North America.  We are growing quickly, and our hiring in North America is set to grow exponentially. Who are we? Whatfix is the #1 Digital Adoption Platform (DAP) for Enterprises. We are changing the way Enterprises train and support their end-users on Applications. We provide companies with a SaaS platform that accelerates their employees' learning of new applications, by giving them guided tutorials in the application.  The platform also provides continuous on-demand support for end-users, again within the application, in a guided manner. The product helps to accelerate product adoption, and is redefining the way companies onboard, train, and provide support to users. Over 100 Fortune 1000 enterprises worldwide trust Whatfix to reduce the time-to-value of business applications and improve users productivity and performance. We are looking for exceptionally talented and motivated individuals to help us build the world’s best software at scale for thousands of clients. Join us as we reinvent the product adoption cycle. What sets us apart from the rest? $140million in funding, most recently a $90mm Series D from investors like Sequoia Capital, SoftBank, Stellaris, Cisco, and Eight Roads With over 100 of the Fortune 1000 already onboard as customers, Whatfix has been named among the top 20 B2B tech companies alongside the likes of Adobe, PayPal, and Cisco Whatfix is on pace to grow over 100% this year: Our most recent quarters had exponential sales growth - Q1 ‘21 had 2.4x the sales from Q1 ‘20 and Q2 ‘21 had 2.6x the sales from Q2 ‘20 Gartner and Everest Research recognize Whatfix as a Global Market Leader in the digital adoption space Customer rating of 4.7+ on platforms like G2 Crowd & Gartner Peer Insights “Hustle Mode ON” is something we live by. About the Role Whatfix is growing quickly, and as a result, we are looking to grow our talent acquisition team in North America. Reporting to the Lead Go-to-Market Recruiter, the Corporate Recruiter will work closely with the leaders of our GTM functions, such as Marketing, Sales & Business Development, Account Management, Sales Engineering and Customer Success to build recruiting strategies and execute upon them. You should be comfortable operating as a full-cycle individual contributor, from sourcing to offer negotiation. Duties and Responsibilities: Partner with hiring managers, business unit heads, and HR/TA team to recruit and hire the best talent in market Manage the full-cycle recruiting process for specific GTM roles in North America Collaborate with Hiring Managers across departments like Marketing, Account Management, Sales & Business Development, Sales Engineering, and Customer Success to define role requirements, interview processes, hiring criteria, and to negotiate offers Create unique and robust search strategies to identify and attract the best talent Develop innovative ways to raise the bar on how Whatfix recruits talent Lead calibration sessions with hiring managers and business unit leaders during the interview process, incorporating feedback into the search on an interactive basis Balance providing a high touch experience throughout the entire recruiting process with both internal stakeholders and candidates, while continuously keeping the pipeline active and meeting your hiring goals Use data and metrics reporting to drive continuous process and strategy improvement Collaborate in the development of strategies that influence and attract the right talent to join Whatfix at the right time Qualifications 3+ years of experience recruiting best-in-market talent for a fast-paced, high growth technology company Previous experience recruiting for Sales, Partnership, Customer Success, Marketing, Tech roles and related functions is highly preferred Strong stakeholder management skills - ability to manage competing priorities across different hiring levels Ability to prioritize between multiple jobs and competing priorities Strong client focus and commitment to continuous improvement Strong research skills Self-directed and proactive High Emotional Quotient (EQ) and ability to navigate nuance Ability to execute innovative sourcing strategies Ability to learn and leverage stellar negotiation skills Proven track record and success recruiting in a technology product company Model the behaviors of a true team player and be a guardian of the Whatfix culture Detail-oriented and comfortable using applicant tracking systems like Recruiterbox Ability to find humor in the most mundane days BS/BA degree preferred Experience recruiting within the Enterprise Software sector preferred Industry knowledge in Software, Web 2.0, SaaS / Cloud, Startups, etc. is preferred Perks / Benefits Unlimited PTO policy Medical, Dental, and Vision coverage 401 K Plan Free parking onsite We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-25T17:24:32.000Z"
    },
    "company": {
        "name": "Whatfix",
        "link": "https://www.linkedin.com/company/whatfix"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "San Jose",
        "region": "CA",
        "postal_code": "95148",
        "street_address": null,
        "latitude": 37.334793,
        "longitude": -121.888145
    }
}