{
    "job": {
        "title": "Lead Data Scientist - Operations Research",
        "industry": "Chemicals,Pharmaceuticals,Biotechnology",
        "description": "Bayer is a global enterprise with core competencies in the Life Science fields of health care and agriculture. Its products and services are designed to benefit people and improve their quality of life. At Bayer you have the opportunity to be part of a culture where we value the passion of our employees to innovate and give them the power to change. Lead Data Scientist - Operations Research Your Tasks And Responsibilities The primary responsibilities of this role, Lead Data Scientist, are to: Be accountable for the conception, architecture, engineering and delivery of leading-edge Data Science solutions to business partners working in local and global teams; Function as a subject matter expert and Data Science Ambassador while fostering internal and external partnerships for collaborative initiatives; Consult and assemble large, complex data sets (text, time series, imagery) into a useful format for analysis; Use advanced mathematical models, machine learning algorithms, operations research techniques and strong business acumen to deliver insight, recommendations and solutions; Contribute to the development of code, bioinformatic analyses pipelines, computational tools, and databases for mining and visualizing large genomic data sets; Be responsible for leading initiatives within the Data Science Community and serve as an extended council member; Be responsible for guiding others (direct or indirect), sets strategy, identifies technical gaps, applies data science acumen to unsolved business goals, prioritizes and allocates resources; Contribute to the building the US Data Science Community by assisting with recruitment, development and retention of high performing individuals; Develop Code (5-10%); Work on Stats/Modeling Research (20-25%); Domain knowledge and consult Industry Experts (35-40%); Provide Technical Guidance and Leadership to others on the team (30-40%). Who You Are Your success will be driven by your demonstration of our LIFE values. More specifically related to this position, Bayer seeks an incumbent who possesses the following: Required Qualifications: Bachelor’s degree with at least 12 years of experience or Master’s degree with at least eight years of experience or Ph.D. degree with at least five years of experience; Educational preparation or applied experience in Machine Learning, Electrical/Industrial Engineering, Operation Research, Statistical Genetics, Statistics, Biostatistics, Bioinformatics, Genomics, Computational Biology, Applied Mathematics, Computer Science or other related quantitative discipline; Expert level of proficiency in computational skills, including a deep understanding of advanced analytics techniques and emerging forms of analytics; Strong level of experience building data models using R, Python or other statistical and/or mathematical programming packages; Expert level of proficiency in Machine learning algorithms and concepts; Professional expertise in competencies in linear modeling, scientific modeling and development and application of increased domain knowledge; Proficiency in standard suite and/or modeling theories; Extensive experience in successful delivery of valuable analysis through application of domain knowledge; evidence of strong business acumen; Demonstrates advanced business acumen, people and project leadership competencies and technical expertise; Excellent communication skills with the ability to communicate complex qualitative analysis in a clear, precise and actionable manner and deliver presentations to large audiences, executive leadership and externally at conference and collaborations. YOUR APPLICATION Bayer offers a wide variety of competitive compensation and benefits programs. If you meet the requirements of this unique opportunity, and you have the \"Passion to Innovate\" and the \"Power to Change\", we encourage you to apply now. To all recruitment agencies: Bayer does not accept unsolicited third party resumes. Bayer is an Equal Opportunity Employer/Disabled/Veterans Bayer is committed to providing access and reasonable accommodations in its application process for individuals with disabilities and encourages applicants with disabilities to request any needed accommodation(s) using the contact information below. Location: United States : Missouri : Creve Coeur Division: Enabling Functions Reference Code: 448301 Contact Us Email: hrop_usa@bayer.com",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-27T05:25:38.000Z"
    },
    "company": {
        "name": "Bayer",
        "link": "https://de.linkedin.com/company/bayer"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 144,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Creve Coeur",
        "region": "MO",
        "postal_code": "65064",
        "street_address": null,
        "latitude": 38.661064,
        "longitude": -90.42915
    }
}