{
    "job": {
        "title": "Data Analyst - Finance",
        "industry": "Online Media",
        "description": "Jellysmack is the global creator company that detects and develops the world's most talented video creators on social media. We're an optimistic crew who naturally goes the extra mile, has a glass-half-full mindset, and sees challenges as opportunities. We look for positive people who think outside the box, are inventive, bold, lead change, and believe that teamwork matters. The Role Jellysmack is seeking a highly motivated and organized Data Analyst to join our Strategic Finance team. This individual  will be part of a team of data analysts and data scientists and be the gatekeeper for the organization's data so that stakeholders can understand the data and use it to make strategic business decisions. Requirements: The Responsibilities The Data Analyst will also be responsible for : Translate business requests into data analysis Clean and prepare data to compute KPIs and perform analysis, Analyse datasets to uncover trends, patterns, and insights that facilitate help in decision making (help guide the strategic planning, use existing data to forecast future performance, etc.) Maintain and update the finance related data model based on stakeholders' needs Distribute the data to the stakeholders (SQL queries, dashboards, collaborate with the Business Analysts) Document various processes so that other members of the organization understand how insights were gathered. Mentor junior Data Analysts in the team The Qualifications Graduate level degree with a minimum 3 years of experience in a similar role Strong skills in SQL and Python for data analysis Prior experience in Finance is required Ability to design Data Models and to effectively implement the data storage from all kind of sources (google spreadsheets, monday boards, etc) Solid quantitative and analytical skills Strong skills in SQL and Python for data analysis Highly organized and able to prioritize Bonus point if experience in Financial OKR Data Modeling Fluency in at least two of the following languages : English, Kosovar, French, Corsican, SQL or Python (we do have teams and analysts that can speak all of them!) Benefits: The Location Jellysmack believes in a flexible work environment in which anyone can work from anywhere. This is why we've implemented our flexible location philosophy, meaning you get the best of both worlds: you can choose to work from home and /or  from our offices in Paris, New York, Los Angeles and Corti. In order to make sure you get the best working environment, you will get a $300 / EUR 250 allowance to get set up! The Perks Early Summer release Fridays Paid volunteering: 1 day dedicated to supporting a cause of your choice Company sponsored wellness programs and events Competitive Healthcare coverage 401K match The Difference Our commitment to diversity and inclusion at Jellysmack, we believe that the best ideas come from the diverse cultures of our team members. Our commitment to inclusion across race, gender, age, religion, identity, and experience drives us forward every day. Creating a work culture that is safe and comfortable for our people to flourish is our main focus. The Company Jellysmack's story started in 2016, and since then, our unrivaled platform optimizes and distributes video content across social media platforms and allows creators to reach genuine new fans with zero effort. We are the only company building the hyper-engaged communities that every creator dreams of because, first and foremost, we are creators too. Creatives ourselves, we're home to over 250 influential creators, including Derek Deso, Karina Garcia, Brad Mondo, MrBeast, Bailey Sarian, Patrick Starrr, and PewDiePie. Jellysmack optimizes, operates, and distributes creator-made video content to Facebook, Instagram, Snapchat, TikTok, Twitter, and YouTube. The company's creator strategy builds upon its success in scaling its own original content channels in beauty (Beauty Studio), soccer (Oh My Goal), gaming (Gamology), and more. Through the power of our data, we maximize reach and revenue so our creators stay focused on their passion—creating the best content for their global fan bases. We turn that passion into a brand and that brand into an empire. Ready to be part of a great human adventure? We're dedicated to making the best working environment possible for our people. All you have to do is apply; we are ready to let you show off your talent!",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-09-02T05:44:52.000Z"
    },
    "company": {
        "name": "Jellysmack",
        "link": "https://www.linkedin.com/company/jellysmack"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "New York",
        "region": "NY",
        "postal_code": "10132",
        "street_address": null,
        "latitude": 40.713047,
        "longitude": -74.00723
    }
}