{
    "job": {
        "title": "Software Quality Assurance Engineer",
        "industry": "Logistics and Supply Chain",
        "description": "What We Do And Why Everstream Analytics delivers a range of predictive analytics solutions that enable supply chain and logistics professionals around the world to get in front of costly delays and disruptions. For far too long, companies have been playing a never-ending game of catch-up with events outside their control – weather, supplier issues, port strikes, political unrest, a global pandemic… you name it. If you want to get ahead of it all, you’ve got to think bigger, see further, and act sooner. That’s the Everstream Analytics approach. Through our unique capabilities, companies like Google, Schneider Electric, Unilever, and Campbell’s can grow and protect more revenue. Our ability to deliver uniquely valuable insights comes from our world-class team, the support of our strategic partners and Investors and what we’ve learned from our clients through developing data-driven solutions for global brands. Everstream Analytics. Get in front of what’s ahead.TM OUR VALUES We recognize that to consistently deliver value to our clients we need to be outward looking and highly collaborative. The foundation for this is our culture, which emphasizes three core values: Trust, Transparency and Respect. We hold each other to these values and expect our clients to do so as well. OUR HISTORY Everstream’s power to deliver comes from the merger of two companies with unique capabilities and histories of groundbreaking innovation: Riskpulse and Resilience360. Riskpulse was created in 2007 to help companies combat the growing challenges of weather-related business continuity challenges. In 2015 Riskpulse merged with Earthrisk, adding advanced environmental data science capabilities, and setting the foundation for our advanced predictive analytics that we deliver today. Resilience360 was incubated in DHL’s Global Innovation Center in 2012 following global catastrophes in 2011 to help DHL’s clients be better prepared for and responsive to supply chain disruptions and has grown into the leading supply chain risk management platform. In 2018 Columbia capital committed $21 million to the growth of Resilience360 through organic growth and acquisitions and in 2019 led the acquisition of Riskpulse with Greenspring Associates joining the associated funding round. DHL remains a major shareholder. The two companies, teams and solutions came together in 2020 and in 2021 were relaunched as Everstream Analytics. Thanks to our remarkable people we are at the forefront of change and bringing cutting-edge products and services to market. We focus on growth, so our people, our business, and our customers can achieve their full potential. Our culture is cultivated from resiliency, responsiveness and critical thinking and are integrated into every aspect of what we do. If you share in our passion to revolutionize the supply chain industry with disruptive technology, we want you to fast-forward your career at Everstream Analytics. JOIN OUR TEAM Everstream Analytics is looking for a(n) Software Quality Assurance Engineer to join our Product Management team. This position will report directly to the Senior Manager Product Management for the global region. As a member of Product Management, you will join a passionate team of high performers, creating a disruptive, customer centric Supply Chain Risk Management product. Position Overview As a Software Quality Assurance Engineer at Everstream Analytics you will collaborate with other Product Management team members and cross-functional teams to support Product Management programs that build sustainable business operations. You’ll apply your skills and abilities to create a new chapter in Supply Chain Risk Management and end to end Supply Chain visibility. Principal Accountabilities Review user interfaces for consistency and functionality Identify any potential problems that users might encounter Perform manual and automated testing Develop standards and procedures to determine product quality Document test cases Record test progress and results Code automated tests Create test plans Discover bugs within product Drive innovation and streamline overall testing processes Identify, isolate, and track bugs throughout testing Research and analyze product features being tested Research new tools, technologies, and testing processes Knowledge, Skills And Abilities Educational background in Computer Science, preferably Bachelors’ degree or equivalent First experience in web front-end test automation (e.g. Selenium, Cypress) Good understanding of front-end web development (HTML5,CSS/SASS, REACT) Capability in leading the ideation, technical approach and launch of digital products First Experience in Supply Chain Risk Management Methodologies, Business Continuity Management, Insurance or Security Management is an advantage Competence in optimizing user experience through intuition, qualitative research and customer feedback. “Customer first” attitude Ability to act in a global environment, with understanding of cultural related differences and behaviors Ability to work in a fluid and fast paced environment, managing large degrees of uncertainty English: Proficient, both oral and written Authorized to work in the United States without the need for current or future sponsorship by the company What We Offer Effective your first day: Full medical, vision, and dental (100% paid employee only coverage) 100% Remote role with flexible business hours and home office accommodations including laptop, docking station, monitor, and keyboard/mouse 15 days vacation (accrual begins on date of hire and increases with tenure thereafter), 40 hours of sick time, and 8 paid holidays Up to 2 weeks of paid parental leave 401(k) retirement savings plan with a company match up to 4% Access to over 500 eLearning courses on topics such as project management, leadership, and effective communication Insights and experience in a hyper-growth, SaaS venture Equal Employment Opportunity and Diversity We are committed to equal-employment principles, and we recognize the value of committed worksite employees who feel they are being treated in an equitable and professional manner. We strive to find ways to attract, develop and retain the talent needed to meet business objectives, and to recruit and employ highly qualified individuals representing the diverse communities in which we live.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-09-02T06:09:44.000Z"
    },
    "company": {
        "name": "Everstream Analytics",
        "link": "https://www.linkedin.com/company/everstreamai"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Plantation",
        "region": "FL",
        "postal_code": "33004",
        "street_address": null,
        "latitude": 26.128277,
        "longitude": -80.24237
    }
}