{
    "job": {
        "title": "Software Engineer",
        "industry": "Hospital &amp; Health Care,Information Technology and Services",
        "description": "Description At NRC Health, we promise to help our customers bring H uman U nderstanding to healthcare for their patients and communities. Our associates are at the heart of delivering that promise, so we promise that same H uman U nderstanding to each other. Come where culture is everything. As An Associate, You Innovate with us to move healthcare forward. Give back to the community with volunteer time off. Fit your role and do what you love. Grow and develop along a career path designed by you. Support one another – no one says, “That’s not my job.” Play hard at beer:30 and team outings – we have a lot to celebrate. Let life happen with 4+ weeks time off, a flexible work environment, and dress for your day attire. Live healthy with a comprehensive healthcare plan and wellness program. Who we want Do you write fast, clean, beautiful code? Are you comfortable working across the full stack, SQL included? Do you thrive in a collaborate environment where all team members are empowered to design and deliver solutions to end-users? Do you enjoy being a feature developer that works with existing code and systems ? Are you highly proficient in at least one object-oriented programming language, preferably C#? Do you look forward to the mix of working with existing code and creating new things from scratch? What you will do As a Software Engineer, you will be responsible for working with stakeholders and the development team to define, build and deliver software solutions. While we won’t ask you to whiteboard a red-black tree, you do need to be strong in object-oriented design, data structures, algorithms, and run-time analysis. You are highly collaborative with a strong independent drive to see solutions through to implementation. You can look at an existing component or system, understand how it works and know what changes need to be made in order to satisfy the feature request. Additionally, you’re a strong communicator that works effectively with non-technical business partners to inform product and business solutions. What you need Bachelor's degree in relevant technical field or equivalent experience 1 + years of experience using a t least one object-oriented programming language ( C# preferred) Experience working in a collaborative environment using agile methodology Experience working with relational databases Advanced proficiency with at least one object - oriented programming language (C# preferred) Would be nice 1 + years’ experience working on a professional development team Experience in web development with a strong understanding of HTML and CSS Strong understanding of MVC, OOP design, data structures, and algorithms Familiarity with AWS technologies such as EC2, RDS, Lambda, Docker/ECS/ Fargate or SQS is a plus Familiarity with client-side web frameworks such as AngularJS or EmberJS is a plus Familiarity with ETL technologies like SSIS, Kettle or similar is a plus Have Purpose. Think B oldly. Feel C onnected . Be U nderstood.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-10-18T05:44:23.000Z"
    },
    "company": {
        "name": "NRC Health",
        "link": "https://www.linkedin.com/company/national-research-corporation"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 12,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Lincoln",
        "region": "NE",
        "postal_code": "68583",
        "street_address": null,
        "latitude": 40.8136,
        "longitude": -96.70261
    }
}