{
    "job": {
        "title": "Drainage Engineer Supervisor - Transportation Infrastructure",
        "industry": "Construction,Civil Engineering,Transportation/Trucking/Railroad",
        "description": "ATS Job ID- R119734, Job Location- US-IN-Indianapolis Minimum Clearance Required To Start Not Applicable/None Job Description Drainage Engineer Supervisor – Transportation Infrastructure - Indiana/Ohio/Kentucky/TN ( Flexible location basis) Opportunity Are you an experienced Drainage Engineer, seeking a supervisory / management role ? Our Parsons Indianapolis office has is seeking to hire a highly experienced Drainage Engineer Supervisor for our Transportation Infrastructure Practice in the Ohio/Indiana/Kentucky region . This role will support transportation projects work in these states and Tennessee. This role can be based in any of these regional market locations. Working with Parsons means being with a global team that has worked on award-winning programs and embraces new technologies to keep us at the forefront of the transportation market. In this role, you will lead a team of professionals overseeing drainage and hydrology components of multiple transportation projects in Indiana and the Midwest Region. We are respected by our clients as an organization with strong technical skills, solid project delivery, and excellent performance and are seeking an individual that embraces technology and creative solutions to enhance our performance. We have a great history of success with INDOT and growing business markets in Ohio. Our experience includes delivering multi-million dollar Design/Build projects and a stable Design/Bid/Build project backlog. Responsibilities In this role, you will act as the primary interface with internal Project Manager and Discipline leads and supervise all Drainage/Hydrology aspects of major Transportation projects with the clients and JV partners on both conventional and design/build projects in the Midwest Region. You will be a key member of our Road/Highway Practice to assist in executing these projects across Indiana and the Midwest. You will be responsible to develop the drainage scope and fee and provide staffing for project assignments both large and small. Projects may include hydrologic analysis, inlet design, storm sewer design, ditch and channel design, cross drain design, retention/detention basin design, and bridge hydraulics. As a leader, you must be able to demonstrate excellent design expertise in these areas, as well as mentor and lead engineers in the preparation of plan documents and reports, such as storm-water plans, drainage criteria documentation, drainage design reports, and bridge hydraulic reports. You will be responsible for overseeing the civil design team’s technical deliverables and meeting project schedules from design through construction, as necessary. Using your technical expertise, you will ensure the highest quality of engineering is put forth to meet all design criteria requirements. Reviews work produced to ensure that applicable codes, standards, and procedures are followed and quality is acceptable. Supervises the production of project drawings and design calculations. Promotes technical excellence on the project, including furthering the Quality Improvement Process. Ensures that adequate checking is performed in accordance with discipline checking policy and procedures. Ensures that discipline design work is coordinated with project staff and Engineers from other disciplines by maintaining clear and frequent communications. Maintains affiliation with professional societies to keep abreast of current technologies. Performs other responsibilities associated with this position as may be appropriate. Qualifications Bachelor's degree in Civil or Structural Engineering (or a related field) is required 12+ years or more of related work experience in Drainage/Hydrology design, including project management or supervisory/managerial experience of engineers, and designers Proficiency utilizing Microstation or AutoDesk CAD platforms Experience Supporting Road & Highway Projects Is Essential Experience with drainage software including HY8, HEC-RAS, Bentley StormCAD, PondPack and CivilStorm, FHWA Hydraulic Toolbox, NRCS WinTR20 Professional Engineer (PE) registration is required Experience directing work involving complex technical situations. Excellent written and oral communications skills",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-15T18:33:02.000Z"
    },
    "company": {
        "name": "Parsons Corporation",
        "link": "https://www.linkedin.com/company/parsons"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 144,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Indianapolis",
        "region": "IN",
        "postal_code": "46203",
        "street_address": null,
        "latitude": 39.76845,
        "longitude": -86.15621
    }
}