{
    "job": {
        "title": "Video Machine Learning Algorithm Engineer",
        "industry": "Consumer Electronics",
        "description": "Summary Imagine what you could do here! At Apple, new insights have a way of becoming extraordinary products, services, and customer experiences very quickly. Do you bring passion and dedication to your job? If so, we are looking for individuals like you. We are looking for talent who will join us to craft the future of video. Our team develops cutting edge technology and system that enable intelligent and interactive video experience in Apple’s media products, such as Photos, Camera, FaceTime, AirPlay, SideCar, TV+, etc. You will work closely with a group of highly motivated specialists to develop exciting machine learning technologies that will make a huge impact in the products. Key Qualifications Strong experience in video and machine learning algorithm development Deep understanding in neural network, strong experience in designing and optimizing networks Strong programming, debugging and problem solving skills Creative and detail-oriented Strong communication skills You are upbeat, adaptable, and results oriented with a positive attitude Description As a video machine learning algorithm engineer in our team, you will be responsible for developing machine learning technologies, implementing and optimizing the solution, and shipping it in the products. You will be responsible for developing new algorithms, improving existing ones, designing neural network architectures, training, implementing, integrating and optimizing networks, etc. Education & Experience MS Computer Science or MS Electrical Engineering or equivalent Additional Requirements Nice to have but not required: Experience developing real-time and low latency video system solutions Experience in training data acquisition and management Role Number: 200269294",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-17T16:39:38.000Z"
    },
    "company": {
        "name": "Apple",
        "link": "https://www.linkedin.com/company/apple"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Cupertino",
        "region": "CA",
        "postal_code": "95014",
        "street_address": null,
        "latitude": 37.319313,
        "longitude": -122.02927
    }
}