{
    "job": {
        "title": "Site Reliability Engineer",
        "industry": "Information Technology and Services,Computer Software,Financial Services",
        "description": "Title: Site Reliability Engineer Years of Experience Desired: 3+ years of professional work experience. Location: Fully Remote Salary: Depending on experience, competitive compensation. We are a Cybersecurity leader in our field. Our team leads the fight in securing important data and applications wherever they reside. Our solutions identify, evaluate, and eliminate new and upcoming threats so you never have to worry about delivering your product or service to your customers. We provide security on all fronts for thousands of enterprises and millions of people daily. You can focus on what you do best and leave us to securing your data. What You Will Be Doing Contribute to the architecture, implementation, and automated deployment of modern, cloud native applications. Set up monitoring for the health of both build and production systems and create automated alerts for outages or degraded performance. Containerize complex virtual runtime environments. Expand and streamline complex CI/CD pipelines that drive frequent, high-quality product releases. Automate all mission-critical tasks and processes. What You Need for this Position 3+ years of senior admin responsibility for AWS Services (auto-scaling highly available deployments of network, compute, storage, database, monitoring resources) in a production environment. Experience building and sharing responsibility for the uptime of production, cloud-native application architectures. Cloud Native application architectures utilizing FaaS, service meshes/proxies, etc. Terraform, AWS CloudFormation, etc. Experience building and managing custom Docker images and containers. Hands-on experience with Kubernetes and related tools/components. Experience with git-based repos and complex, auto-scaling CI/CD pipelines. Familiarity with Python and at least one other development or scripting language (C/C++, Go, JavaScript/NodeJS, PHP, etc.) BSc or MSc in computer science or a related degree. What's In It for You Stability, the company is an industry leader in their space! 100% fully remote, even after Covid-19 restrictions lift. Competitive Compensation + Bonus Amazing Benefits (Medical, Dental, and Vision), 401K, & PTO So, if you are a Site Reliability Engineer with experience, please apply today! Apply directly to this job opening here! Or E-mail directly for more information to Marcus.Quigley@Optello.com Email Your Resume In Word To Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also: Marcus.Quigley@Optello.com Please do NOT change the email subject line in any way. You must keep the JobID: linkedin : MQ1-1640686 -- in the email subject line for your application to be considered.*** Marcus Quigley - Executive Recruiter - Optello Applicants must be authorized to work in the U.S. Optello is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire. Optello will consider for Employment in the City of Los Angeles qualified Applicants with Criminal Histories in a manner consistent with the requirements of the Los Angeles Fair Chance Initiative for Hiring (Ban the Box) Ordinance.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-23T13:20:02.000Z"
    },
    "company": {
        "name": "Optello",
        "link": "https://www.linkedin.com/company/optello-us"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Los Angeles",
        "region": "CA",
        "postal_code": "90101",
        "street_address": null,
        "latitude": 34.05224,
        "longitude": -118.24335
    }
}