{
    "job": {
        "title": "Site Reliability Engineer - Senior",
        "industry": "Nonprofit Organization Management,Health, Wellness and Fitness,Hospital &amp; Health Care",
        "description": "Job Description The Site Reliability Engineer is responsible for supporting the infrastructure, services and continuous integration (CI) and continuous delivery (CD) pipelines that host enterprise solutions at Intermountain Healthcare. This position will ensure our systems are healthy, automated and secure. Position Purpose The site reliability engineer will help to implement and maintain the CI/CD software stack , identify areas for improvement, bring a big picture vision, make recommendations and implement solutions. The ideal candidate for this role has a passion for automation, always keeps security in mind, and can implement best practices to further our mission. A background in computer science fundamentals allows the site reliability engineer to apply coding principles and best practices to Intermountain’s systems, infrastructure and automation initiatives, embodying an 'infrastructure as code' approach. This role needs to be proficient in current testing methodologies and believe in an effective and efficient engineering approach that reduces bugs and stress. The Site Reliability Engineer is expected to collaborate with technical staff, management, and business operations staff throughout all phases of the software development life cycle in order to deliver durable solutions to complex businesses problems according to agreed upon timelines and budgets to support the mission, vision, and values of Intermountain Healthcare. The SRE role is a high-level contributor and is expected to be proficient in both software development skills and system administration. Responsible for implementing and/or integrating new products, processes, methodologies, frameworks, and technologies in the CI/CD space. Works independently with minimal oversight and direction. Provides guidance, input, and instruction to lower level technical professionals. Creates low-level solutions architecture diagrams, technical diagrams, and software development lifecycle diagrams that illustrate the CI/CD solutions. Communicates in an effective and professional way with customers both inside and outside of the company. Deploying new tools to support our systems and services in an automated fashion. The site reliability engineer needs to excel in an environment that is constantly changing and are comfortable working on projects where the requirements are updated often. Has a natural aptitude to being tasked with a new technology that no one is competent with yet, and within a matter of days, become skilled enough to create deliverables and meet the needs of the business and the project. Scope The senior level role typically works on complex projects. Essential Job Duties Deploys new tools to support systems and services in an automated fashion. Monitors site reliability and system health Creates and implements tools to manages the alerting of critical problems and errors Implements system wide reliability metrics to enable gathering data for troubleshooting of all kinds Understanding of server administration and monitoring tools: Linux administration Atlassian Suite Application performance monitoring suites Package management Backup strategies Centralized log management solutions Develops code automation solutions (experience coding in at least one of the following languages): Bash / Shell Scripting Works As a Subject Matter Expert And Demonstrates An Understanding Of Cloud Architecture, SaaS And PaaS Solutions (experience In At Least One Of The Following) Microsoft Azure Amazon Web Services Google Cloud Platform Must Meet One Of The Following Minimum Requirements Bachelor's degree in computer science, information technology or other technology focused field of study with at least five years of professional software engineering experience. Degree must be obtained through an accredited institution. Education or experience is verified. OR Nine years of equivalent technical experience including three years of professional software engineering experience. Three year of experience with multiple technologies, processes and environments with a proven ability to support operations (e.g. service-oriented architectures, highly available systems, scalable, and secure solutions, client-server, web, mobile, interactive and batch applications, release and configuration management, cloud development and deployment strategies, devops culture). Experience developing code in at least two of the following: Bash / Shell Scripting Experience In At Least Two Of The Following Microsoft Azure Amazon Web Services Google Cloud Platform Physical Requirements Interact with others requiring the employee to communicate information. Operate computers and other IT equipment requiring the ability to move fingers and hands. See and read computer monitors and documents. Remain sitting or standing for long periods of time to perform work on a computer, telephone, or other equipment. Preferred Qualifications Ability to effectively prioritize and execute tasks in a high-pressure environment is crucial. Advanced knowledge of performance, scalability and system architecture with an eye toward avoiding and reducing technical debt. Four years of healthcare related software development and/or system administration experience. Proven analytical and problem-solving abilities. Able to learn, understand, and apply new technologies. Strong written and verbal communication skills. Strong interpersonal and customer service skills. Highly self-motivated and directed. Keen attention to detail. Proven experience working in product driven environment. Knowledge of applicable data privacy practices and laws. Strong skills with Docker or container technologies. An understanding of Kubernetes, or AKS. Experience with Bamboo, Chef, Azure DevOps or any other industry proven CI/CD tool. No Additional Description Available Physical Requirements: Location: World Trade Center Work City Salt Lake City Work State Utah Scheduled Weekly Hours 40",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-05T05:37:15.000Z"
    },
    "company": {
        "name": "Intermountain Healthcare",
        "link": "https://www.linkedin.com/company/intermountain-healthcare"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 108,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Salt Lake City",
        "region": "UT",
        "postal_code": "84101",
        "street_address": null,
        "latitude": 40.758476,
        "longitude": -111.888145
    }
}