{
    "job": {
        "title": "Machine Learning Engineer - Computer Vision",
        "industry": "",
        "description": "Builders and Fixers Wanted! Ephesoft provides intelligent document processing solutions with industry-leading technology to help enterprises maximize their productivity. Using AI and patented machine learning technology, Ephesoft’s platform captures data from documents, enriches it with context and amplifies the power of that data, adding intelligence to accelerate any business process and drive successful digital transformation. Thousands of customers worldwide use Ephesoft to save costs, improve accuracy and fuel their journey towards the autonomous enterprise. Ephesoft is headquartered in Irvine, Calif., with regional offices throughout the US, EMEA and Asia Pacific. To learn more, visit ephesoft.com. Job Description Ready to invent the future? Ephesoft is immediately hiring a talented, driven Machine Learning Engineer with a focus in computer vision to play a key role in developing a high-profile AI platform in use by organizations around the world. The ideal candidate will be a talented generalist with strong core competencies in designing computer vision solutions and writing production-quality code. This position is an early-career opportunity for candidates with a strong educational background and some practical experience in machine learning who are looking for opportunities to hone their skills as well as learn and master new ones. You may be a good fit for this role if you: Enjoy wearing hats... Many, many hats. You will develop code, tune existing models, work with cloud resources and build ML systems that won’t exist anywhere else. Can be honest with your own work. Sometimes we will build industry-leading products and sometimes our ideas will flop. You will build many custom and meaningful metrics to help determine what our clients immediately use and what is tabled for later. Have a strong aversion to explicit “for loops” and comprehensions in your ML code. Determining how to make ML products performant and accurate is a big part of our work. Like having friends. Our workflow means constant collaboration with software engineers to bring ML prototypes into production Enjoy watching the fruits of your labor flourish. You will own projects from conception to data gathering to production Would like to teach and learn from your colleagues about ML best practices Like Legos. You will develop ML libraries and utilities in Python that will be stacked on and used across many code bases You will bring to this role: Love for solving problems and working in a small, agile environment. Dedication to maintaining a fun, friendly and collaborative work environment Hunger for learning new skills and sharing your findings with others. Deep knowledge of both traditional and deep learning approaches in computer vision Practical experience in implementing machine learning solutions Minimum Required Qualifications BA/BS degree in a related technical field or direct professional experience in computer vision not less than 2 years 1+ years experience or at least one internship focused on computer vision Experience in one or more general purpose programming languages (Python, C++, Java, R) Experience with numerical and data science libraries (scikit-learn, Pandas, NumPy, kernlab, etc.) Experience with at least one major deep learning framework (TensorFlow, MXNet, PyTorch, Caffe, etc.) Experience with data visualization libraries (gglot2, matplotlib, seaborn, etc.) Deep knowledge of common computer vision problems and their solutions (semantic segmentation - FCNN, object detection - FRCNN/SSD/etc., image registration - homography) Familiarity with version control systems (GitHub, Bitbucket, TFS, etc.) A portfolio showcasing at least one high quality computer-vision related project you have developed Bonus Qualifications Advanced degree (MS/MA/PhD) in machine learning, computer vision or data science 2+ years of industry experience developing and building computer vision solutions Experience implementing state-of-the-art deep learning models for object detection, semantic segmentation and/or image classification Experience implementing data pre-processing pipelines Experience with AWS, Google Cloud, Azure or other cloud-based platforms Deep understanding of machine learning algorithm internals Advanced knowledge of Python, data structures and how to build high performance systems Additional information Ephesoft is proud to be an Equal Opportunity Employer. This role can be located in either our Irvine, California, Boise, Idaho offices or remote in the United States. Candidates outside of the United States will not be considered. All your information will be kept confidential according to EEO guidelines. Agency candidates will not be considered for this role. Agencies should carefully follow our guidelines at ephesoft.com/careers.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-19T17:14:24.000Z"
    },
    "company": {
        "name": "Ephesoft, Inc.",
        "link": "https://www.linkedin.com/company/ephesoft-inc"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 12,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "United States",
        "region": null,
        "postal_code": "99999",
        "street_address": null,
        "latitude": 39.50355,
        "longitude": -99.0183
    }
}