{
    "job": {
        "title": "Machine Learning Engineer (NLP)",
        "industry": "Health, Wellness and Fitness",
        "description": "About us At Ginger, we believe that everyone deserves access to incredible mental healthcare. Our on-demand system brings together behavioral health coaches, therapists, and psychiatrists, who work as a team to deliver personalized care, right through your smartphone. The Ginger app provides members with access to the support they need within seconds, 24/7, 365 days a year. Millions of people have access to Ginger through leading employers, health plans, and our network of partners. Ginger has been recognized by The World Economic Forum as a Technology Pioneer and by Fast Company as one of the Most Innovative Companies in Healthcare. About the role We are looking for an outstanding candidate who has worked in machine learning and is passionate about helping people be their best selves. You will be working closely with our data science, product, engineering and care teams. Key responsibilities will include building and maintaining machine learning models that move the needle for the company. What you'll do As a core part of a close-knit data science team you’ll: Design, train and validate algorithms to derive as much actionable information from our data (text, media, activity etc) as possible. Engineer informative NLP features that allow us to summarize salient passages, infer quality of care, etc. Develop and deploy algorithms that boost coach and clinician awareness of member goals, status, history and probable future conditions Write new algorithms to recommend specific personalized health-promoting content (e.g. modules in the app) based on a range of features Integrate streaming activity and sleep data directly from the phone or via services to expand our capacity to provide meaningful insight and care. Collaborate with engineers to integrate algorithms efficiently with backend production services Work with product team to define solutions and integrate them into the roadmap Help us scale our services using GPUs and modern distributed processing tools in the cloud (AWS) Dig into data with ad hoc analysis as necessary for technical, clinical, customer etc needs Improve and help define the data team’s processes and tooling See that we remain at the bleeding edge of advanced analytical capability in our effort to provide unparalleled levels of personalized care. Employ data to keep our eyes on the prize: improved mental-health outcomes for all members. Necessary Skills: Machine Learning 2+ years Data Science 1+ years Python 2+ years Natural Language Processing (NLP) 1+ years Foundation in statistics Mathematically fluent Masters in technical field or experiential equivalent Preferred Skills: Modern NLP tools such as spaCy, CoreNLP, Gensim, NLTK 1+ years Deep net ML development experience using PyTorch, TensorFlow, etc. Distributed ML via Spark or similar ML on GPUs Deploying to production systems with active customers Python 4+ years Numpy/Scipy/Pandas 2+ years Deep learning for text understanding and generation Amazon Web Services (AWS) 1+ years Docker AWS Lambda, Sagemaker Strong on Stats Strong data visualization skills Time Series Analysis Experience in the healthcare space",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-10-04T20:48:22.000Z"
    },
    "company": {
        "name": "Ginger",
        "link": "https://www.linkedin.com/company/carebyginger"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 48,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "United States",
        "region": null,
        "postal_code": "99999",
        "street_address": null,
        "latitude": 39.50355,
        "longitude": -99.0183
    }
}