{
    "job": {
        "title": "Data Scientist",
        "industry": "Electrical/Electronic Manufacturing,Information Technology and Services,Computer Software",
        "description": "Job Description Position Title: Data Scientist Position Description: Protingent Staffing has an exciting opportunity for a Data Scientist opportunity with our client located in San Francisco bay area. Job Requirements As a Data Scientist you will work with a product team to design, develop, and launch efficient and reliable data pipelines to move, analyze, and model data and to provide intuitive analytics from large and complex datasets. A strong systematic mind is a priority, as well as the ability to communicate clearly in multiple technical contexts. The ideal candidate should be passionate about finding insights in large datasets, while maintaining attention to database architecture, data reliability, efficiency, and quality. As we are continually releasing new features and products, the ability to construct elegant system-level data architecture is expected. Discover datasets that could help in solution development Data curation, analysis, quantitative modeling Validation and quality assurance of data, models and results Deploy and implement solutions in collaboration with product team Interact with the product team on current and upcoming user requirements Job Qualifications Masters or Ph.D. in Sciences, Mathematics or Engineering, especially numerical methods and simulations. Strong background in database management solutions, familiarity with databases such as MySQL and Oracle Large-scale data processing and implementing batch processing pipelines in HPC or cloud architecture Background in Statistics is expected, and Experience with Machine Learning is a bonus Experience with Cloud Computing environments (AWS, GCloud, Azure) is a plus About Protingent: Protingent is a niche provider of top Engineering and IT talent to Software, Electronics, Medical Device, Telecom and Aerospace companies nationwide. Protingent exists to make a positive impact and contribution to the lives of others as well as our community by providing relevant, rewarding and exciting work opportunities for our candidates. Benefits Package: Protingent offers competitive salary, 100% paid health insurance, education/certification reimbursement, pre-tax commuter benefits, Paid Time Off (PTO) and an administered 401k plan.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-20T06:08:33.000Z"
    },
    "company": {
        "name": "Protingent",
        "link": "https://www.linkedin.com/company/protingent"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Mountain View",
        "region": "CA",
        "postal_code": "94040",
        "street_address": null,
        "latitude": 37.39008,
        "longitude": -122.08139
    }
}