{
    "job": {
        "title": "Junior Data Center Engineer/Linux",
        "industry": "Staffing and Recruiting",
        "description": "A SaaS company in Center City Philadelphia is looking to bring on a Junior Datacenter Engineer to join the team of about six other Engineers. This environment is primarily a Linux (CentOS/Debian) shop, so you should have experience troubleshooting hardware, managing Servers (upgrades), scripting with Bash, SAN platforms, Virtualization, and more. This position is perfect for someone looking to grow into more of a Linux Engineer or Cloud Engineer. This company offers a ton of growth, training, ability to work on new technology, excellent work life balance and full benefits. Required Skills & Experience At least 1+ year in IT Production experience with Linux Servers and Hardware Virtualization including VMware and any Cloud platforms such as GCP, AWS or Azure SAN - EMC, NetApp, etc. Excellent troubleshooting skills Scripting Bash and Python What You Will Be Doing Tech Breakdown 100% Datacenter Daily Responsibilities 100% Hands on The Offer Competitive Salary: Up to $80K/year, DOE You Will Receive The Following Benefits Full Medical, Dental and Vision Matching 401k Excellent PTO Growth/training Applicants must be currently authorized to work in the United States on a full-time basis now and in the future. We are excited to officially release our 2020 Tech Salary Guide! This resource features localized tech salaries for 12 different cities. You’ll find the data to guide your job search here. Download Motion Recruitment’s 2020 Salary Guide today! https://hubs.ly/H0nmhDT0 Posted By: Shawna Dunleavy",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-22T01:08:19.000Z"
    },
    "company": {
        "name": "Motion Recruitment",
        "link": "https://www.linkedin.com/company/motion-recruitment-partners"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 12,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Philadelphia",
        "region": "PA",
        "postal_code": "08051",
        "street_address": null,
        "latitude": 39.95106,
        "longitude": -75.16562
    }
}