{
    "job": {
        "title": "Data Scientist",
        "industry": "Information Technology and Services",
        "description": "Interested in joining a growing SaaS company AND work remotely? We are partnering with a quickly growing SaaS company in the real estate and sustainability space. The software delivers tools for gathering and monitoring sustainability data. This high energy environment is focused on collaboration and rewarding employees’ hard work. We are seeking a skilled Data Scientist to join their team! This role works within the organization and within their software to determine the questions that need answers, and then identifies new and novel solutions to solve the problem. The Data Scientist is responsible for applying data mining techniques, performing statistical analysis, and building high quality prediction systems. Key Responsibilities: Data Analysis & Validation ●       Apply various quantitative methods to analyze and interpret the company’s data ●       Clean, transform, and organize data for analysis and ensure its quality ●       Interpret trends and patterns in data ●       Work with key stakeholders and team members to gather and understand how data is used and identify best practices ●       Assemble large, complex sets of data that meet non-functional and functional business requirements, conduct complex data analysis and report on results ●       Combine raw information from different sources and prepare data for prescriptive and predictive modeling Communication and Education ●       Communicate complex analyses in a clear and actionable manner to stakeholders across the organization ●       Serve as a science liaison within the organization and externally through customer engagements ●       Compile technical and high level supporting documentation to ensure understanding across teams and consistency of practices ●       Support and influence conversations and decisions regarding product defining, planning and design ●       Identify new business questions where the data science team can add value Statistical Learning Models ●       Design, test, verify and implement production ready data pipelines and machine learning models ●       Identify the appropriate data and methodologies to use based on the need ●       Work with development teams to implement data science models as services Requirements: ●       Graduate degree in STEM or Economics ●       1-3 years experience working in applied math, computer science, statistics, or related quantitative field ●       Professional experience in Python and database programming ●       A combination of professional or educational experience (whether formal or informal) that affords you with the knowledge, skills, and abilities above This is an exciting, fully remote opportunity to grow your career in a progressive organization! This position offers a salary of $105-$145K, depending on experience! Please apply on-line at www.aimhiredenver.com for immediate consideration. AimHire is an Equal Opportunity/Affirmative Action Employer. Keywords: data science, data scientist, python, data modeling, predictive analysis, data mining, statistical analysis",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-15T19:40:56.000Z"
    },
    "company": {
        "name": "AimHire",
        "link": "https://www.linkedin.com/company/aimhire"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 12,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Denver",
        "region": "CO",
        "postal_code": "80247",
        "street_address": null,
        "latitude": 39.738453,
        "longitude": -104.984856
    }
}