{
    "job": {
        "title": "Data Scientist",
        "industry": "Financial Services,Information Services,Information Technology and Services",
        "description": "The Team: Bloomberg's Management Reporting & Analysis' (MR&A) Data Science Solutions Team is entrusted to continually improve the ability to make data-driven decisions for Bloomberg's senior management, Product and Sales teams. Our team arms Sales and other client-facing teams with data to optimize their prospecting and retention efforts. We enable Product teams to build better products by providing them with deep insights into customer behavior and helping them prototype and develop ML-based products. We also build products utilizing usage data to improve our customer\"s experience. And that's just a sampling of projects from a \"typical\" week! The Role: We are looking for an experienced data scientist to join our team. You will work alongside engineers, product managers, sales managers and data scientists from across the organization to tackle complex business problems. You will be responsible for using our extensive data sources to provide both rapid solutions to urgent business questions as well as building products that serve internal/external clients. You'll be encouraged to use the right tool for the job and connect with a variety of partners. Technical Qualifications: 2+ years of work experience (or advanced degree) in the use of statistical analysis and machine learning techniques (e.g. regression, clustering, time series, etc.) 2+ years of coding experience, preferably in Python Experience in constructing complex queries in SQL and in pyspark/pandas Experience with data visualization toolkits and graphics generation Experience with Excel and presentation software Experience testing and validating statistical hypotheses We'd Love To See: Experience with command line and GIT Experience with Hadoop/Hive/Postgresql Experience with NLP methods Experience putting machine learning methods into production Experience with experimental design Experience building web apps, html, css, etc Non-technical Qualifications: Ability to work with and explain technical concepts to non-technical stakeholders Outstanding ability to break down large, sophisticated business problems into discrete, achievable steps Ability to lead and balance multiple projects A passion for solving business problems and making an impact If this sounds like you: Apply - if we believe you're a good match, we'll get in touch with you to let you know the next steps. In the meantime watch this proud reminder of our purpose: https://vimeo.com/263526877 Bloomberg is committed to diversity. It drives our innovation. At Bloomberg, you'll have the opportunity to go above and beyond and to take risks. You'll be a part of an organization that is entering new markets, launching new ventures, and pushing boundaries. Our ever-expanding array of technology, data, news, and media services champions innovation and empowers clients -- and offers nearly limitless opportunities for career growth. We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. We bring out the best in each other.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-21T06:07:39.000Z"
    },
    "company": {
        "name": "Bloomberg LP",
        "link": "https://www.linkedin.com/company/bloomberg-lp"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "New York",
        "region": "NY",
        "postal_code": "10132",
        "street_address": null,
        "latitude": 40.713047,
        "longitude": -74.00723
    }
}