{
    "job": {
        "title": "Commercial Sales Administrator",
        "industry": "",
        "description": "Old Mill Brick is disrupting a growing industry with consumer-first innovation. We are seeking a resourceful individual who wants to make an impact at our company and grow with the company. We are seeking a Commercial Support Administrator to help grow our commercial sales channel. The Commercial Sales Administrator is responsible for handling all inside sales and customer support functions including providing minor technical support, building and maintaining strategic relationships with key decision makers and resolving customer problems. Location: Based in Bluffdale, UT (Salt Lake City area) Essential Job Functions and Responsibilities: Perform all commercial customer service related duties including, but not limited to answering phones, generating quotations, computer entry of orders/debits/credits/returns, providing shipment confirmations, sales orders, invoices and memos. Update customer relationship management system (CRM - Zendesk Sell), capturing all pertinent customer and project data and coordinating with outside sales force. Efficiently manage inbound phone calls to ensure timely handling and accurate routing of transfers. Follow up on outstanding leads, quotes and samples. Maintain organized customer files, hard copies and electronic files as required. Demonstrate personal ownership and accountability for assigned tasks and follow through. Professionally communicate with both customers and cross-functional internal team members. Act as the internal subject matter expert for all commercial issues. Attend training sessions and travel with experienced company personnel to learn company products/systems, procedures, culture and philosophy of dealing with customers. Implement pricing policies within market segments as directed. Maintain project tracking files and competitive pricing files. Assist in the development of key specification tools and marketing tools that can increase sales and specifications of all Old Mill products. Investigate, document, and report all complaints and claims for service and coordinate with management. Perform other duties as assigned. Job Requirements/Skills: Experience in customer service or inside sales. Excellent written, problem-solving, and verbal communication. Customer Service, bookkeeping, or administrative experience. Desire to learn and grow professionally. Ability to cold call by phone and secure sales/opportunities on targeted lead lists. High level of self-motivation. Excellent interpersonal skills. Team cooperation – maintain positive, cooperative attitude with all employees and customers. Proficiency with MS office suite with intermediate level proficiency in Excel. Strong organizational and time management skills. Intermediate knowledge of and functional proficiency in use of CRM systems. Physical ability to lift, move and carry up to 50 pounds. Valid driver’s license, current automobile insurance, clear credit report and a good driving record. Spanish language proficiency (written and verbal) highly preferred. Minimum Educational Requirements: ·        High School Diploma required; Bachelor’s degree preferred. Travel: ·        As needed for industry events or customer support",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-25T17:29:31.000Z"
    },
    "company": {
        "name": "Old Mill Brick",
        "link": "https://www.linkedin.com/company/old-mill-brick"
    },
    "education": {
        "required_credential": "high school"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Bluffdale",
        "region": "UT",
        "postal_code": "84088",
        "street_address": null,
        "latitude": 40.489628,
        "longitude": -111.94002
    }
}