{
    "job": {
        "title": "Data Engineer",
        "industry": "",
        "description": "Job Summary: The Data Engineer is responsible for the implementation and maintenance of the data warehouse, and associated extract-transform-loads (ETLs). The Data Engineer will be an integral part of modernizing USA Swimming’s data culture and ensuring data is accurately and properly exposed to end users. Essential Duties/Responsibilities: Participate in architectural discussions to create and maintain optimal modern data pipeline architecture amidst ever-changing business needs. Build the infrastructure required for optimal extraction, transformation, and loading of data from a wide variety of data sources using structured query language (SQL) and Azure technologies. Design and build Azure Logic Apps to automate programs. Expose data to end users using Data Warehouse and Power BI, or other modern reporting and visualization platform. Work with internal and external stakeholders to assist with data-related technical issues and data quality issues. Optimize data delivery and re-design infrastructure for greater scalability. Implement effective metrics and monitoring processes. Fulfill internal and external custom SQL requests. Answer membership and times data-related customer service questions from members. Understand USA Swimming’s complex business rules to ensure accurate execution of tasks. Qualifications: Required to be fully vaccinated against Covid-19 upon hire Bachelor’s Degree in computer science, data science, information management, related field or equivalent Master’s Degree Preferred Minimum 3 years working experience in a professional environment Willing to relocate to Colorado Springs, CO 2+ years of experience with Azure services: Azure Data Factory, Synapse Analytics, Azure SQL DB, Azure Databricks, ML Studio, Azure Data Lake, etc. 2+ Experience developing and deploying ETL solutions on Azur Experience with Azure performance and monitoring tools Experience with data visualization tools (Tableau, Power BI, etc.) Knowledge of OLAP data models, including snowflake and star schemas and cube design Excellent communication (written and oral) and interpersonal skills Excellent organizational, multi-tasking, and time-management skills Ability to work across departments and in a team setting to help achieve desired goals and outcomes. Proven ability to work creatively and analytically in a problem-solving environment Preferred: Swimming experience/knowledge of USA Swimming Salary & Benefits: Salary Range for this position is $68,000 - $78,000 / year Benefits available include: Medical, dental and vision Company paid short-term and long-term disability Company paid life insurance Parental leave 401(k) w/ match after 1 year of service Profit sharing and safe harbor match after 2 years of service EAP PTO 12 paid holidays",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-10-05T17:44:19.000Z"
    },
    "company": {
        "name": "USA Swimming",
        "link": "https://www.linkedin.com/company/usa-swimming"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Colorado Springs",
        "region": "CO",
        "postal_code": "80908",
        "street_address": null,
        "latitude": 38.835224,
        "longitude": -104.8198
    }
}