{
    "job": {
        "title": "Sr. Engineer, Kubernetes Platform-2",
        "industry": "Financial Services,Information Technology and Services,Internet",
        "description": "Our Purpose We work to connect and power an inclusive, digital economy that benefits everyone, everywhere by making transactions safe, simple, smart and accessible. Using secure data and networks, partnerships and passion, our innovations and solutions help individuals, financial institutions, governments and businesses realize their greatest potential. Our decency quotient, or DQ, drives our culture and everything we do inside and outside of our company. We cultivate a culture of inclusion for all employees that respects their individual strengths, views, and experiences. We believe that our differences enable us to be a better team – one that makes better decisions, drives innovation and delivers better business results. Job Title Sr. Engineer, Kubernetes Platform-2 Overview Distributed Platforms represents the next phase in the advancement of our digital transformation and is a significant evolution for MasterCard. We continue to grow our Platform as a Service organization to support aggressive growth plans. MasterCard is seeking a Sr. Software Engineer to be part of implementation of Kubernetes Service as well as other core services need to operationalize Kubernetes. This position requires a working knowledge of what it takes to stand up on-prem/off Platforms like Kubernetes and understands how elastic runtimes support distributed compute and storage needs. Responsibilities The Cloud Platforms team is responsible for the day to day maintenance and operation of various cloud platforms and their supporting services. Cloud Platform Engineers are engaged in the project lifecycle as infrastructure is designed and ultimately inherit responsibility of the new environment. The primary responsibility of the team is to react to incidents in cloud, PaaS, Kubernetes and pipeline infrastructure platforms. Secondary objectives of the team are to improve the resiliency of systems through active contribution back to design as well as automating repetitive tasks. Requires a moderate understanding of various platforms used for delivery of traditional and cloud services. Requires the ability to write automation code to remediate repeat issues. Requires a working understanding of Continuous Delivery principals, software development methodologies and infrastructure automation. This is a “hands on” role that deals with reacting to and proactively avoiding issues with infrastructure platforms used for delivery of cloud services. Do you enjoy creating code-based solutions to replace manual processes? Are you the type of person that will drive the solution and team in the best direction instead of the easiest? Experiences Expert understanding of Operational duties Working knowledge of target platforms (Kubernetes, Helm, Kustomize, KubeCTL, RKE, KubeADM) Familiarity with Gateways, API technology and basic knowledge of traffic flows inside a Kubernetes Platform. Good understanding of container life cycle management Highly attuned to security needs and best practices Ability to write quality automation code in more than one language Familiarity with running AI/ML workloads in Kubernetes platform is a Big Plus Any Kubernetes Certification is a BIG Plus. Prior experience with Cloud Native Architecture and development Excellent communication / presentation skills Due to COVID-19, most of our employees are working from home. We’ve implemented a virtual hiring process and continue to interview candidates by phone or video and are onboarding new hires remotely. We value the safety of each member of our community because we know we’re all in this together. Mastercard is an inclusive Equal Employment Opportunity employer that considers applicants without regard to gender, gender identity, sexual orientation, race, ethnicity, disabled or veteran status, or any other characteristic protected by law. If you require accommodations or assistance to complete the online application process, please contact reasonable.accommodation@mastercard.com and identify the type of accommodation or assistance you are requesting. Do not include any medical or health information in this email. The Reasonable Accommodations team will respond to your email promptly. Corporate Security Responsibility All Activities Involving Access To Mastercard Assets, Information, And Networks Comes With An Inherent Risk To The Organization And Therefore, It Is Expected That The Successful Candidate For This Position Must Every person working for, or on behalf of, Mastercard is responsible for information security. Abide by Mastercard’s security policies and practices; Ensure the confidentiality and integrity of the information being accessed; Report any suspected information security violation or breach, and Complete all periodic mandatory security trainings in accordance with Mastercard’s guidelines.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-23T06:22:32.000Z"
    },
    "company": {
        "name": "Mastercard",
        "link": "https://www.linkedin.com/company/mastercard"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "New York",
        "region": "NY",
        "postal_code": "10132",
        "street_address": null,
        "latitude": 40.713047,
        "longitude": -74.00723
    }
}