{
    "job": {
        "title": "Software Engineer",
        "industry": "Staffing and Recruiting,Financial Services,Information Technology and Services",
        "description": "Selby Jennings is working with a high level banking institution to find the best technology talent to build their FinTech team. They have multiple teams hiring for various roles with full-time opportunities. Read below for the responsibilities and qualifications of the role to see if it’s a good fit for you. Responsibilities: Own your system as you write new code/APIs and have a large impact on different products Entrepreneurial approach to problem solving and solution development Assist in defining the technical architecture of mission critical systems Find and implement new technology and research to further develop the systems you’ve created Qualifications: Bachelor’s or Master’s degree in Computer Science or relevant field At least 1-6 years of experience as a professional software engineer Mastery of Java technologies Strong understanding of modern software architecture Experience with full-stack JS, React, Node.js, and others Others to be considered: AWS experience Big data technology experience (kafka or hadoop) Previous financial experience Made it this far? Take the time to apply and submit your resume!",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-15T18:43:18.000Z"
    },
    "company": {
        "name": "Selby Jennings",
        "link": "https://uk.linkedin.com/company/selby-jennings"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 12,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Dallas",
        "region": "TX",
        "postal_code": "75342",
        "street_address": null,
        "latitude": 32.777977,
        "longitude": -96.79621
    }
}