{
    "job": {
        "title": "Senior Data Scientist",
        "industry": "Marketing and Advertising,Online Media,Internet",
        "description": "The Role Wpromote is looking for a Senior Data Scientist to join our Product Development team! In this role, you’ll partner cross-functionally with Engineering, Product, and Reporting Solutions to design machine learning workflows and statistical models that extract key insights from troves of marketing data. Your solutions will scale as productized apps used by our industry-leading marketers to unlock new performance opportunities for our clients. You will have the opportunity to challenge the limits of what’s possible with data science and performance marketing, designing novel solutions through Computer Vision, Time Series Analysis, Optimal Experimental Design, Recommendations, etc., using supervised and unsupervised methods including Deep Learning, Bayesian Modeling, and Graph Neural Nets. You Will Be Working closely with Product Management to identify high impact business problems that can be solved by data science and machine learning methods Designing, prototyping, building, and testing Developing scalable, efficient, and automated workflows that can analyze large amounts of data from various sources Integrating scalable workflows in production as part of a software engineering team Maintaining data science and machine learning workflows by fixing bugs or improving the model performance if required Articulating complex, technical results and methods to internal stakeholders Occasionally join client meetings to understand client data problems and propose innovative solutions Proactively bring issues and problems to the attention of the team and propose and implement innovative solutions to solve them. You Must Have Degree in Computer Science, Engineering, Statistics, Economics or any related quantitative discipline preferred M.S. +4 years of experience or B.S. + 6 years of relevant experience Strong programming skills in Python & SQL Demonstrable successes in delivering data-driven products, including being involved in all aspects of the product development life cycle A deep understanding of statistical modeling and machine learning techniques An understanding of state-of-the-art machine learning algorithms and packages Strong working knowledge with large data sets, preferably in the digital marketing domain Experience with cloud OLAP database platforms such as BigQuery and Snowflake Working experience in developing and deploying to cloud providers such as AWS and Google Cloud Platform Strong communication skills, to both technical and non-technical audiences Ability to work beyond familiar algorithms - to get out of one’s comfort zone and earnestly seek to integrate the best solutions to business challenges Sincere interest in working towards the data-driven future of digital marketing within a fast-growing organization Nice To Have Solid knowledge working with marketing and/or user acquisition data across a variety of industries Working experience with data visualization or BI solutions, such as Tableau, Looker, or Google Data Studio Work experience within the digital advertising or MarTech field This position may be performed remotely anywhere within the United States except CO, OH, HI, AK, NV, WA. This position is not eligible for immigration sponsorship",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-03T03:44:19.000Z"
    },
    "company": {
        "name": "Wpromote",
        "link": "https://www.linkedin.com/company/wpromote"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 72,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "United States",
        "region": null,
        "postal_code": "99999",
        "street_address": null,
        "latitude": 39.50355,
        "longitude": -99.0183
    }
}