{
    "job": {
        "title": "Site Reliability Engineer",
        "industry": "",
        "description": "Summary Location: Pasadena CA and Austin TX As Site Reliability Engineer you will be responsible for ensuring the scalability, availability, and security of a large-scale, globally distributed hybrid cloud infrastructure. Requirements BS in Computer Science or equivalent experience Strong knowledge of Linux/Unix System internals Experience in troubleshooting and performance tuning of large-scale systems System automation experience A thorough understanding of how the internet works Experience in operating, troubleshooting and scaling production systems Writing code is strongly emphasized Experience in web application stacks, proxies, load balancers and firewalls AWS experience is a plus Benefits Competitive salary and bonus program in an entrepreneurial environment Top-notch health, dental, and vision insurance 401k plan with matching contribution Professional Training Generous paid time off plan plus paid holidays Frequent company sponsored lunches, happy hours, fun events, and plenty of snacks and drinks Casual work environment Supplyframe is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, protected Veteran status, or any other characteristic protected by law.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-17T19:45:00.000Z"
    },
    "company": {
        "name": "Supplyframe",
        "link": "https://www.linkedin.com/company/supplyframe"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Pasadena",
        "region": "CA",
        "postal_code": "91122",
        "street_address": null,
        "latitude": 34.14955,
        "longitude": -118.14145
    }
}