{
    "job": {
        "title": "Technical Associate",
        "industry": "Semiconductors",
        "description": "Spectra-Physics, Ophir and Newport are brands within the MKS Instruments Light & Motion division. We provide a full range of solutions including lasers for precision industrial and scientific research applications, laser and LED measurement, beam profiling, precision motion control, optical tables and vibration isolation systems, photonics instruments, opto-mechanical components and optical elements. MKS Light & Motion solutions enhance our customers’ capabilities and productivity in the semiconductor, industrial technologies, life and health sciences, research and defense markets. Are you naturally curious? So are we at MKS. Our collective curiosity drives us to be an innovation leader in many industries. Our products drive technology advancements across a wide range of applications such as 5G, augmented/virtual reality, autonomous vehicles, clean drinking water and space exploration. We are a team of collaborators who value fresh thinking and believe in mutual respect, constructive candor, diversity and inclusion. As a valued and trusted partner to our customers, we are continually pushing the boundaries of possibility. We believe in creating technology that transforms our world and are looking for like-minded individuals to join our team. If this is appealing to you, we want to meet you. We are looking for a Technical Associate to support manufacturing engineering for optical fabrication.  This will be a hands-on role immersed in day to day operations and will routinely use a variety of manufacturing equipment.  In this role you will: Perform functions associated with all manufacturing operations, including working with engineers in set-up and calibration tasks, as well as performing rework and quality testing related to the production of parts, components, subassemblies, and final assemblies. Use programs to collect and evaluate operating data to conduct on-line adjustments to products, instruments or equipment. Determine and may assist in developing methods and procedures to control or modify the manufacturing process. Work with engineers in conducting experiments. Assist in the development, set-up and documentation needed for fixtures. Assist in the support of new and existing products including preparing and maintaining work instructions, ordering materials and providing basic manufacturing engineering support. What will you bring to the team, along with your passion for optical fabrication is: 3+ year of optics industry experience.  Knowledge of optical metrology techniques and specifications is preferred. Hands-on experience with optics and optics fabrication methods. Ability to read mechanical and assembly drawings. Experience supporting new product development is preferred. LEAN manufacturing is preferred. Intermediate knowledge of standard software used for reports and documentation (Word, Excel, PowerPoint). MKS Instruments, Inc. is an Affirmative Action and Equal Opportunity employer. We solicit and hire applicants regardless of race, color, national origin, sex, religion, age, disability, veteran status, sexual orientation, gender identity, or any other protected category. Our policy is to employ the most qualified applicants. We conduct background checks and drug screens, in accordance with company policies and federal and state guidelines. Globally, our policy is to recruit individuals from wide and diverse backgrounds. However, certain positions require access to controlled goods and technologies subject to the International Traffic in Arms Regulations (ITAR) or Export Administration Regulations (EAR). Applicants for these positions may need to be “U.S. persons.” “U.S. persons” are generally defined as U.S. citizens, noncitizen nationals, lawful permanent residents (or, green card holders), individuals granted asylum, and individuals admitted as refugees. MKS Instruments, Inc. is an equal opportunity employer. We solicit and hire applicants regardless of race, color, national origin, sex, religion, age, disability, veteran status, sexual orientation, gender identity, or any other protected category. Our policy is to employ the most qualified applicants. We conduct background checks and drug screens, in accordance with company policies and federal and state guidelines.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-18T22:06:21.000Z"
    },
    "company": {
        "name": "MKS Instruments",
        "link": "https://www.linkedin.com/company/mks-instruments"
    },
    "education": {
        "required_credential": null
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Irvine",
        "region": "CA",
        "postal_code": "92717",
        "street_address": null,
        "latitude": 33.68591,
        "longitude": -117.82472
    }
}