{
    "job": {
        "title": "Software Engineer I - Front End",
        "industry": "Computer Software,Information Technology and Services,Marketing and Advertising",
        "description": "Blucora has a bold aspiration: we are committed to giving all people the tools needed to lead healthy financial lives - tools often reserved for the wealthy. We now turn to the next leg, developing the technological tools that make our vision of financial health for all a reality. Atypical for the financial services industry, we take a contemporary approach to strategy and product development that is founded in user insights, rapid testing, and a singular focus on driving end-user value. Since charting new territory on a daily basis is part of everyone's job at Blucora, we've attracted team members who thrive on the challenge, encourage each other, and are passionately committed to the goal. If you agree that problem-solving is a team sport, and feel energized by a good debate, deep-dive research, or a fun night out with colleagues, we might be the right firm for you! Position Summary TaxAct, a subsidiary of Blucora and sister company to Avantax Wealth Management & Avantax Planning Partners is seeking a Software Engineer I - Front End that will serve as a technical contributor toward the implementation and management of the website and digital marketing strategies for TaxAct. This role will support a data-driven MarTech team, leveraging best-in-class tools and techniques to audit, develop and enhance the technology that drives digital experiences in mobile, app, and web. This includes core contribution to the creation of the TaxAct website, landing page, and other content experiences. The role requires a combination of strong analytical, technical, and problem-solving skills. Essential Duties & Responsibilities Seeking a passionate and creative individual who can successfully execute the following duties and responsibilities: Lead the implementation and development of core functionality that will be used across TaxAct online shopping experiences. Manage CMS content development for marketing-oriented site content including home page, landing page, and in product content; maintenance of the content model and other related responsibilities. Manage the implementation of website A/B testing program including but not limited to the translation of a test plan into a fully configured, QAed deployment with measurement of final results. Work closely with internal media team to define, develop and deploy measurement techniques for digital marketing and paid media campaigns within the Tag Management System. Partner with the Marketing Brand team to drive implementation of on-site strategies. Work closely with the Advanced Analytics team for the support of diagnostic, QC review of tracking associated with Data Science and Data Visualization projects. Partner with front-end website development team on annual website rollover and maintenance duties. Conduct thorough and rigorous testing and validation of data within marketing technology platforms. Be customer-obsessed (both internal customers and the TaxAct customers) to create an environment focused on overarching marketing goals, delivering innovative products and services to support the initial onsite and tax filing experiences. Strong collaborator who partners with internal team and coordinates across teams of engineering, QA, architecture, and other stakeholders. Partner with the engineering and architecture teams to collaborate on future design and ensure the team is delivering against that future state. Other job duties as designed. Education & Experience Bachelors degree in Engineering, Computer Science or certification from a professional programming course/school (relevant professional level experience considered in lieu of a degree). Recent college graduate candidates will be considered given alignment with related internships and coursework. Experience with modern web development - focus on frontend capabilities (Javascript, React, CSS, HTML). The ideal candidate has exposure to Tag Management (ex: Google Tag Manager, Tealium, or Adobe Dynamic Tag Management). Proficiency with source control including Git. Strong analytical skills, attention to detail. Knowledge of Salesforce Cloud or other enterprise platforms is a plus. Experience with PHP programming on WordPress websites is a plus. Prior experience working with CMS, A/B testing, and/or Heat Map testing tools is a plus. Knowledge of Design Thinking methodologies is a plus. Prior experience working with AWS technologies is a plus. Background knowledge of ADA/SEO is a plus. Physical Demand & Work Effort Keying/typing, standing, walking. Sitting for an extended period. Constant mental and/or visual attention; the work is either repetitive or diversified requiring constant alertness in an office environment. The job is typically performed under comfortable working conditions; any disagreeable elements are generally absent during the normal performance of the job. Compliance with company attendance standards. Comprehensive Benefits We offer a competitive salary, outstanding benefits package that includes medical, dental, vision, life insurance, paid vacation and sick days, paid holidays, tuition reimbursement, and 401(k) with company match. #TaxAct At Blucora, we believe our work benefits from the diverse perspectives of our employees. As such, Blucora welcomes and celebrates diversity and inclusion and is committed to equal opportunity employment. At Blucora, you can expect a supportive, open, and inclusive atmosphere and a team that values your contributions. Blucora, Inc. and its subsidiaries, Avantax Wealth Management, Avantax Planning Partners (formerly HK Financial Services), and TaxAct are committed to providing an environment of mutual respect where equal employment opportunities are available to all applicants without regard to race, color, religion, sex, national origin, age, physical and mental disability, marital status, sexual orientation, gender identity, veteran status, and any other status protected under federal or state law. Blucora considers information gathered in the hiring process, including information on this application, confidential, and only shares it on a need-to-know basis or as required by law. If you need assistance or accommodation due to a disability, you may contact us at HR@Blucora.com or by calling 972-870-6000 to speak with a member of the HR Talent Acquisition team.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-02T16:36:38.000Z"
    },
    "company": {
        "name": "TaxAct",
        "link": "https://www.linkedin.com/company/taxact"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Dallas",
        "region": "TX",
        "postal_code": "75342",
        "street_address": null,
        "latitude": 32.777977,
        "longitude": -96.79621
    }
}