{
    "job": {
        "title": "Data Scientist, Experimentation",
        "industry": "Hospitality",
        "description": "Evolve is a hospitality company with a mission to make renting a vacation home easy for everyone. Thanks to an unapologetic passion for hospitality, we now support over 15,000 properties in over 750 markets across North America. We enjoy earning each guest and owner's business - all while having some fun along the way. Why this role As a tech-enabled disruptor in the vacation rental industry, our ability to confidently and quickly learn from experiments across business functions is rapidly becoming an indispensable lever to future growth. In this role, you’d be a key voice in defining the future of experimentation at Evolve, tackling the most challenging problems around scalability and statistical robustness, and expanding current methodology to learn in new areas of the business. Come join our fast-paced growth-stage culture working alongside other talented data professionals in an environment that invites and necessitates professional growth and learning. What You’ll Do Develop experimentation capabilities to meet growing demand across domains Help design and prioritize experiments that maximize impact potential Challenge the status quo to establish best-in-class practices that augment how we learn from experiments Deepen working relationships with business and engineering teams to lower the barrier to test ideas and build trust in results Effectively communicate complex and ambiguous information to technical and non-technical stakeholders Innovate on existing strategies by researching and applying techniques from other leading data science teams outside of Evolve What Makes You a Great Fit Bachelor’s degree in Computer Science, Statistics, or related quantitative field, Masters or PhD preferred 2+ years of data science related work Programming experience with Python and SQL, ideally in a full-stack machine learning setting Software development understanding to be able to create high-quality, reproducible code Strong knowledge of experimental methodologies for working with a long tail of heterogeneous inventory that varies with respect to seasonality, market demand, and additional attributes Proven track record of using data science techniques to make a clear business impact and iteratively improving over time Experience working in a collaborative environment and communicating effectively with a variety of stakeholders An entrepreneurial mentality that can help define product strategy and produces great work with minimal supervision Location Evolve has a flexible working environment so teammates can work remotely anywhere in the state of Colorado, in our beautiful downtown Denver office, remotely or a hybrid of both! We're currently all working remotely and will be opening up the office in the near future for our in office and hybrid options. Compensation For this role our salary range is $95,000 to $115,000 depending on relevant experience. Total Rewards at Evolve At Evolve, we care for our teammates by supporting their physical, mental, and financial wellbeing through a comprehensive Total Rewards Program. Industry competitive pay, including equity in the company for all Evolvers Health insurance package options that include 100% employer paid HDHP plan and two PPO plan options for you and your dependents Employer-paid dental, and vision, for you and your qualified dependents Paid life insurance, short-term disability, and long-term disability coverage 401(k) with a 4% match that vests immediately PTO, sick days, and paid Parental Leave Rich learning and development program for Evolvers But wait, there’s more… optional benefits offered include commuter benefits, pet insurance and travel perks. About Us Opportunity: Our leadership and management teams are dedicated to creating meaningful learning and growth opportunities for all Evolvers, as well as providing clear expectations and continuous feedback. Community: It’s easy to make friends at Evolve. We support maintaining a strong community through our teammate-led groups focused on learning, inclusion, environmental wellness, and more. Transparency: Every month, our leadership team shares how the company is performing, explaining where we’re headed next, and recognizing team members for jobs well done. Values: They mean more to Evolve than just bullets on a page, they drive our daily decisions and impact how we work as a hospitality company. Earn It Build Loyalty One Interaction at a Time Communicate Often, Honestly & Directly Embrace Change Stay Hungry & Humble Care Be Efficient Take Risks Learn Every Day Have Some Fun Along the Way Which value sounds the most like you? Evolve is an equal opportunity employer. We believe that a diverse work environment is a successful work environment so all qualified candidates will be considered for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-24T05:09:35.000Z"
    },
    "company": {
        "name": "Evolve",
        "link": "https://www.linkedin.com/company/evolve-vacation-rental"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Pueblo-Cañon City Area",
        "region": null,
        "postal_code": "81001",
        "street_address": null,
        "latitude": 38.27385,
        "longitude": -104.52035
    }
}