{
    "job": {
        "title": "Software Engineer - Machine Learning",
        "industry": "",
        "description": "The Company We are an early stage company building the next generation digital shopping platform from the ground up. Our vision is to create a highly differentiated and personalized experience for consumers that revolutionizes the way people shop. We have an incredible team and venture investors. Come join the fun! Goal of Job You will be responsible for applying AI, machine learning and data mining techniques to build the next generation shopping experience. You will be part of a team solving hard problems like personalization, ranking, search, semantic understanding of text and image data, and inferring style preferences. We believe that the shopping experience can be fundamentally improved by using AI and you will be responsible for bringing this vision to life. Responsibilities Design, build, train and test Machine Learning models to push state of the art forward in Computer Vision, NLP, Recommender Systems. Write production-level code to convert your ML models into working pipelines/realtime serving. Run A/B tests, analyze results and make data driven decisions for various features. Prototype and launch ideas to push the boundary on consumer shopping experience. Build the underlying frameworks and pipelines to be able to apply machine learning to different problems across the product. Experience Required B.S. in Computer Science/Engineering or related technical discipline with 4+ years experience in AI/ML/data mining. MS/Phd in Computer Science preferred. Familiarity with deep learning algorithms and frameworks like TensorFlow, PyTorch, Keras, and various state of the art models like Resnet50, InceptionV3, BERT etc. Accomplished coder with experience in Python/Go and comfortable working across the stack. Passion to learn and invent the state of the art in computer vision. Passion for applying AI/ML to real world problems. You are interested in solving consumer problems end-to-end. Our Values Critical thinking - we use judgement in making key decisions, we are innovative and deep thinkers, we are deliberate and produce high quality work Helpfulness and transparency - we support each other by providing context and feedback, we operate with respect towards our customers, partners and team, we are open to giving and receiving feedback with the intention of improving how we function Operate as an owner - we are deeply invested in the success of the company and its customers, we do what’s right, not what’s easy, we spend carefully and know that any success is tied to what is best for our customers Pronto - we operate with a sense of urgency, have a GSD mentality, we are open to change as business needs evolve, and we embody grit and tenacity",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-04T20:43:50.000Z"
    },
    "company": {
        "name": "THE YES",
        "link": "https://www.linkedin.com/company/the-yes"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 48,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "San Francisco Bay Area",
        "region": null,
        "postal_code": "94112",
        "street_address": null,
        "latitude": 37.39271,
        "longitude": -122.042
    }
}