{
    "job": {
        "title": "Junior Web Developer",
        "industry": "",
        "description": "We are currently looking for Jr. WordPress Web Developers who are passionate, innovative and motivated to make a difference. Responsibilities include: The developer’s primary focus will be to assist the development team in developing WordPress sites, testing, deployment, and site updates. Utilize HTML / CSS to troubleshoot and edit issues and updates to sites through the production lifecycle. Continue to learn best practices for developing responsive websites and WordPress themes. Desired Skills & Experience : Ability to communicate and work in a team environment. Must have experience working with WordPress. Organizational skills, work management, ability to prioritize, identify, and resolve issues. Qualifications : Thorough knowledge of HTML(5), CSS(3), WordPress Solid understanding of responsive design and development practices Experience in web development industry Knowledge of cross-browser testing and common issues. Ability to use Photoshop. Company Perks: Bonuses Incredible company culture with laid-back atmosphere Company events throughout the year Work with a great team of people Full benefits package including medical, vision, dental and 401K",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-17T07:34:00.000Z"
    },
    "company": {
        "name": "1Point21 Interactive",
        "link": "https://www.linkedin.com/company/1point21-interactive"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Orlando",
        "region": "FL",
        "postal_code": "32817",
        "street_address": null,
        "latitude": 28.589708,
        "longitude": -81.24801
    }
}