{
    "job": {
        "title": "Associate Software Engineer, Full Stack",
        "industry": "Information Technology and Services,Computer Software,Internet",
        "description": "Job Description Department: Engineering Reports To: VP of Engineering Yardstik is a new venture-backed software company based in Minneapolis that was recently recognized as a Best Place to Work and received Minne Inno’s Fire Award in the “Growing” category. We’re on a mission to bring more security and safety to the internet economy. The world of background screening, certification, and training has lacked innovation and we’re here to change that for our customers. The team we have in place brings dozens of years of experience in SaaS and helping start-ups become forever companies. We’re looking for awesome people to come help us reach new heights and fulfill our mission. Here’s the high-level Yardstik is looking for a talented Full Stack Associate Software Engineer to help build out our platform. Your duties will include collaborating with other engineers to implement new features for our UI (react, express, node), internal and external back-end APIs (Ruby on Rails, Postgres), along with various other microservices (Typescript, NestJS) that comprise the Yardstik platform using modern cloud technologies (AWS, Docker). You are the right candidate for this role if you have completed training in software engineering and have the skills to hit the ground running. You must be a self-starter who is eager to learn, comfortable with uncertainty, and can demonstrate knowledge of programming and development practices. Our technology stack and development processes include the following: Backend & Platform Restful APIs, GraphQL AWS, k8s Ruby-on-Rails, Typescript, Express, Node Postgres, Redis, RabbitMQ SPAs, Microservices Client-Side React, SASS Material UI React Testing Library, Jest Dev Process Scrum-based agile approach with Continuous Delivery Modern use of tools and documentation; GitHub, Clubhouse.io, OpenAPI 3.0 Here's what’s expected of you: Perform coding, debugging testing & troubleshooting Implementing unit, integration, and end-to-end testing Self-motivated ability to learn new technologies and skills Participate in code reviews by receiving & providing feedback Participate in Scrum Process as member of the Team Your experience might look something like this: a background in the frontend, backend, or full-stack development an ability to take initiative and learn new technologies joy for being part of a highly collaborative, remote-friendly work environment an affinity for wearing many hats from an engineering perspective a passion for working in a fast-paced and rewarding startup environment Technical Qualifications: Proficiency in at least 1 high-level software development language Formal software engineering education, related experience, or a combination of both Experience with data storage technologies Passionate about problem solving Capacity to learn quickly What we Offer: Company Health Insurance Plan 401k Retirement Plan Health Savings Account Liberal Vacation Policy Opportunity to accelerate your career Company stock options and the education to understand what those mean for you. Equal Employment Opportunity Yardstik is an equal opportunity employer. All employment decisions are based on business needs, job requirements, and individual qualifications without regard to age, color, disability, equal pay/compensation, genetic information, national origin, pregnancy, race, religion, retaliation, sex (including sexual orientation and gender identity), sexual harassment or veteran status. Yardstik will not tolerate discrimination or harassment based on any of these characteristics. Powered by JazzHR kKYTXv34XO",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-12T07:16:42.000Z"
    },
    "company": {
        "name": "Yardstik",
        "link": "https://www.linkedin.com/company/yardstik"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Edina",
        "region": "MN",
        "postal_code": "55340",
        "street_address": null,
        "latitude": 44.91049,
        "longitude": -93.34866
    }
}