{
    "job": {
        "title": "Senior Service Management Consultant - ServiceNow Developer - Core",
        "industry": "Information Technology and Services",
        "description": "Full-time Requirement for Senior Service Management Consultant - ServiceNow Developer - Core Job Title: Senior Service Management Consultant - ServiceNow Developer - Core Location: North Atlanta, GA Duration: Full-time Travel: 25% Job Description: Responsibilities (developer/senior) In collaboration with Service Integration and Management consultants, will assist clients in the implementation of Service Management practices based on our Clent and industry standards. Is be responsible for leveraging IT Service Management and other IT Practices to optimize, transform, and ensure IT Organizations are compliant, efficient, and effective using the ServiceNow platform. Assists ServiceNow System Administrators, SI Process Consultants and Business Analysts with incident resolution, as needed Co-Designs and develops new ServiceNow applications and services Assists ServiceNow Business Analyst in estimating release level of effort Provides mentoring and guidance for ServiceNow System Administrators Takes ownership of complex business requirements and works them to completion Required: •Experience in advanced administering Now Platform •Enterprise and/or IT Service Management •Scripting – JavaScript, Web Services, HTML, CSS, Jelly) •Understanding Agile and SCRUM •Ability to work with a remote team, requiring ability to communicate well via phone and email (writing skills) •Strong attention to detail •Knowledge and work experience in JavaScript/ Angular/ AngularJS Desired: •Demonstrable experience in JavaScript coding (optional) •Experienced in working with relational databases (optional) •Experienced in working with LDAP, AD, SSO, Email Infrastructure, Web Services (optional) Certifications •ServiceNow System Administration certificate (optional) •ServiceNow Training completed for GRC Module; Certification preferred •ITIL Foundation Certified (optional) •ServiceNow Implementation Specialist certificate (optional) •ServiceNow Scripting certificate (optional) •Application Creation in ServiceNow Thanks & Regards, Bandari KavithaSree Aptino, Inc. (817) 494-0926 Ext: 111 kbandari@aptino.com www.aptino.com A",
        "employment_type": "CONTRACTOR",
        "date_posted": "2021-07-21T01:57:39.000Z"
    },
    "company": {
        "name": "Aptino, Inc.",
        "link": "https://www.linkedin.com/company/aptino"
    },
    "education": {
        "required_credential": null
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "King of Prussia",
        "region": "PA",
        "postal_code": "19406",
        "street_address": null,
        "latitude": 40.08832,
        "longitude": -75.382126
    }
}