{
    "job": {
        "title": "Retail Data Analyst - Store Labor",
        "industry": "Retail",
        "description": "Guitar Center embodies the world of creativity and music by encouraging staff to find their own individual sound. Our mission is to develop and nurture lifelong musicians and make a difference in the world by enabling musicians and non-musicians alike to experience the joy that comes from creating music. We believe in creating inclusive environments that put our customers first all the while fulfilling our mission. As our Retail Reporting Analyst, you will be responsible for handling all data and system-related reporting to promote growth and improved performance in all programs managed by the Store Operations team all while supporting our culture of integrity, inclusion, musical passion, and respect. A few special characteristics that make our Retail Reporting Analysts successful : Analytical Skills: Able to explore information, data, and reports, and other items in order to identify issues and extract meaningful insights, which can be used to better understand and improve business performance. Collaboration: Able to develop cooperation and teamwork while participating in a group, working toward solutions that generally benefit all involved parties. Initiative: Able to identify opportunities & issues and follow through on work activities to capitalize or resolve Able to take positive, innovative action without being requested to do so. Attention to Detail: You can multi-task and work on multiple projects all while maintaining a high level of attention to detail, leaving no stone unturned. Ensuring all reports and data analysis created is accurate. Interpersonal Communication: Able to communicate through various means (verbal, written, and presentation) with diverse individuals. Able to interact with internal and external stakeholders at all levels in a clear, concise, positive, and courteous manner. Organizational Skills: Able to utilize time, energy, and resources to manage priorities independently such as projects, staying on track, and achieving goals. Technology Skills: Able to navigate and learn new technology systems, equipment, and computer programs needed to fulfill communication, customer service, and business needs & expectations. As Our Retail Reporting Analyst, You Will Get To Produce Retail performance reports for field leadership, and provides insight, strategies, and actionable recommendations to drive top-line sales and EBITDA growth. Conduct Retail and Services performance deep-dive reporting, analyze data, and provides improvement recommendations. Produce ad hoc reporting or provide insights as requested for Support Center teams including finance, marketing, SPG, services, and operations. Help manage retail store incentive structure by running analyzing and presenting data findings to leadership. Sponsor & produce business requirements for new or updated automated reporting. Work with Retail Operations to identify sales outreach or system enhancement opportunities, recommending changes to existing processes where needed to adapt to ongoing changes in the field. Consult IT and/or surrounding teams on all projects related to sales systems functionality and retail sales data and provide recommendations for improvement. Find and monitor the correction of existing bugs or flaws in reporting logic or retail systems functionality. Additional duties as assigned. Requirements 3+ years conducting retail sales analysis. 3+ years researching complex data. Intermediate proficiency with SQL and VBA. Skilled proficiency in Microsoft Office suite (Excel, Outlook, PowerPoint, Word) Preferences Bachelor's Degree in Business, Finance, Economics, or related field. Previous experience presenting data analysis and findings to stakeholders. Intermediate understanding of point-of-sale systems.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-20T06:05:28.000Z"
    },
    "company": {
        "name": "Guitar Center",
        "link": "https://www.linkedin.com/company/guitar-center"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Westlake Village",
        "region": "CA",
        "postal_code": "91363",
        "street_address": null,
        "latitude": 34.14381,
        "longitude": -118.799644
    }
}