{
    "job": {
        "title": "Data Scientist, Product Analytics",
        "industry": "Internet",
        "description": "About TikTok TikTok is the leading destination for short-form mobile video. Our mission is to inspire creativity and bring joy. TikTok has global offices including Los Angeles, New York, London, Paris, Berlin, Dubai, Mumbai, Singapore, Jakarta, Seoul and Tokyo. What You'll Do - Work with the product team to size the potential impact of \"problems-to-solve\" for our business - Develop comprehensive product metrics and quantitative measurement structure based on product stages and business purposes. - Implement standardized product reports, ad hoc queries, and data related projects - Design and implement reporting dashboards and the associated data pipeline to deliver insights and improve the workflows of internal teams - Partner closely with key stakeholders to optimize overall product adoption and performance driven growth. Provide suggestions for improvements to align with the business goal - Measure and visualize the effectiveness of product updates, conduct research and analysis on various business processes to identify business problems, and further provide optimization suggestions to improve operating efficiency Who We're Looking For - 2+ years industry experience - Bachelor's degree or equivalent practical experience - Ability to conduct rigorous analysis and communicate conclusions to both technical and non-technical audiences - Experience in business analysis, and product analysis - Proficiency in SQL, Python - Solid communication and collaboration skills with the ability to work effectively with internal teams in a cross-cultural and cross-functional environment - Proven ability to succeed in an innovative and fast-paced environment Even better if: - Master's degree in data analytics related fields - Product management experience is a plus",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-09-01T06:09:11.000Z"
    },
    "company": {
        "name": "TikTok",
        "link": "https://www.linkedin.com/company/tiktok"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Los Angeles",
        "region": "CA",
        "postal_code": "90101",
        "street_address": null,
        "latitude": 34.05224,
        "longitude": -118.24335
    }
}