{
    "job": {
        "title": "Machine Learning Engineer - Health ML",
        "industry": "Internet",
        "description": "The Health ML engineering team is responsible for building scalable detection systems that keep spam, manipulation, and abuse at bay. We use ML and relevance techniques to make Twitter safer and to limit the spread of misinformation on the platform. Our team works across the product to detect abusive and spammy users and content, increase action on bad actors, drive changes in user behavior, and detect and remediate accounts that are violating the terms of service on Twitter. We develop, maintain, and contribute to several machine learning models and systems, including Models that detect unwanted interactions Models to prioritize human review of accounts violating Twitter's policies to more quickly take action and limit their damage Detection of bots that misuse the platform or spread misinformation Detection of repeat abusive offenders who create new accounts after being suspended Real-time rule engines and clustering systems to identify and action on clusters of bad actors at scale Teams Who Are Hiring Platform Manipulation Aiming to stop adversarial efforts to manipulate our platform & mitigate attempts to artificially amplify or suppress information or manipulate people’s experience on Twitter. Account Integrity Guard the safety, security and credibility of Twitter accounts by ensuring bad actors are unable to create and/or sustain accounts on the platform, or compromise accounts belonging to organic users. Civic Integrity Protect and promote the health of public conversation on Twitter, as it relates to a specific civic event or broader civic engagement. Abusive Interactions Ensuring Twitter is a safe space for public conversation (safe from severe abusive interactions) to enable users’ healthy participation. Misinformation Reducing creation and remediate consumption of misleading information in order to eliminate its potential harm to Twitter users. What You’ll Do Although you will work on cutting-edge problems, this position is not a pure research position. You will participate in the engineering life-cycle at Twitter, including designing distributed systems, writing production code and data pipelines, conducting code reviews and working alongside our infrastructure and reliability teams. You’ll apply data science, machine learning, and/or graph analysis techniques to a variety of modeling and relevance problems involving users, their social graph, their tweets, and their behavior. Qualifications Who You Are You’re a relevance engineer, applied data scientist, or machine-learning engineer who wants to work on exciting algorithmic and deep infrastructure issues to improve the health of the public conversation on Twitter. You’re experienced at solving large scale relevance problems and comfortable doing incremental quality work while building brand new systems to enable future improvements. You are experienced in one or more of the following machine learning (including deep learning), information retrieval, recommendation systems, social network analysis. You are a strong technical advocate with a background in Java, C++, or Scala, and Python. Experience with a number of ML techniques and frameworks, e.g. data discretization, normalization, sampling, linear regression, decision trees, deep neural networks, etc. 3+ years experience with one or more DL software frameworks such as Tensorflow, PyTorch, Theano You strive to find the right balance between moving fast to deliver quality improvements to users and accumulating technical debt that drags down productivity. You have a collaborative working style with a strong focus on disciplined execution and results. You like to ground decisions in data and reasoning and solve root causes of problems rather than surface issues. You are adept at communicating relevant information clearly and concisely. You look ahead to identify opportunities and thrive in a culture of innovation. Requirements B.S. M.S. or PhD in Computer Science or Machine Learning related degree; or equivalent work experience in the field Experience leading and delivering effective security or ML solutions for large scale production use cases.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-06T07:17:33.000Z"
    },
    "company": {
        "name": "Twitter",
        "link": "https://www.linkedin.com/company/twitter"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "San Francisco",
        "region": "CA",
        "postal_code": "94121",
        "street_address": null,
        "latitude": 37.78008,
        "longitude": -122.42016
    }
}