{
    "job": {
        "title": "Regulatory Operations Associate II",
        "industry": "Biotechnology,Hospital &amp; Health Care,Pharmaceuticals",
        "description": "Description Position at Regulatory Professionals Bring your Passion! Regulatory Professionals, a division of Premier Research, is a consultancy firm specializing in drug, biologics and device regulatory affairs. Our purpose as a company is to support our clients by furthering the development of human therapeutics that will benefit the health and well-being of patients around the world. With a presence in the US, EU, Canada and Japan we are growing and looking for talented people to grow our business, advance the goals of our clients and contribute to our unique culture. Our focus is to provide strategic and tactical support in all aspects of regulatory affairs, including preclinical, CMC and clinical development for drugs, biologics, devices, and combination products. We are seeking a talented Regulatory Operations Associate II to join our growing team at RPI! This position is an office based position located in Newark, CA. The Regulatory Operations Associate II (ROA II) is responsible for preparing and reviewing documents and compiling/QC auditing submissions for regulatory applications. This role ensures that all electronic regulatory submissions performed on behalf of Regulatory Professionals and Corporate clientele are in compliance with FDA/EMA regulations. The ROA II exercises judgment within defined procedures and practices to determine appropriate actions and resolve a variety of issues. What You Will Be Doing Create and format basic to advanced documents utilizing internal processes and tools, to perform the activities pertaining to electronic publishing to meet required standards and technical requirements within specified timelines Coordinate and electronically publish components of basic to semi-complex Regulatory Agency submissions, including INDs and amendments, annual reports, safety reports, etc. Perform the QC for all applications, amendments and supplements prior to submitting to Agency Perform quality checks of others’ work Participate in the interpretation and implementation of new health agency guidelines and rules relevant to regulatory submissions Participate in department projects that improve the department systems and processes Assist in the writing and reviewing of Regulatory Operations work practices Assist, in collaboration with regulatory operations team and sponsors, with regulatory submission timelines in accordance with project plans You'll Need This To Be Considered Bachelor’s degree, or international equivalent from an accredited institution, in Science/Technology, or an equivalent combination of education and experience BA/BS degree and 2 - 5 years direct experience, or 4+ years of Regulatory Operations experience within the pharmaceutical or biotech industry Intermediate skills in the use of Microsoft Office Word, Adobe Professional, and Toolbox Experience in eCTD publishing tool(s) such as docuBridge, Global Submit and/or eCTDXpress for submissions Current knowledge of electronic document and submission requirements applicable to the US, EU, and global regulatory environments, possess a good understanding of industry legislation and best practices Experience in web-based content and document management environments and file transfer sites (e.g., Egnyte, EDMS solutions) Ability to appropriately handle confidential and highly sensitive material",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-25T17:27:40.000Z"
    },
    "company": {
        "name": "Premier Research",
        "link": "https://www.linkedin.com/company/premier-research"
    },
    "education": {
        "required_credential": "high school"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Newark",
        "region": "CA",
        "postal_code": "94560",
        "street_address": null,
        "latitude": 37.540813,
        "longitude": -122.033394
    }
}