{
    "job": {
        "title": "REMOTE Lead Site Reliability Engineer",
        "industry": "Information Technology and Services,Computer Software,Financial Services",
        "description": "If you are a Lead Site Reliability Engineer with experience, please read on! Top Reasons to Work with Us Our mission is to replace classic college-level textbooks, homework, and lab assignments with interactive and animated online textbooks that allow instructors to modify content and monitor student participation/performance. Currently, we are used in over 600 universities by over 4500k students and offer the excitement of a young, energetic startup environment with a masterfully engineered platform and high-demand content for the STEM college market. What You Will Be Doing As the Lead Site Reliability Engineer on our team, you will be responsible for creating and owning production infrastructure and services. This infrastructure includes multiple Kubernetes clusters, CI/CD solutions, and deployment of security tooling to protect student data. You will be critical in the scaling of our educational products to hundreds of thousands of students. Responsibilities Hands on work with production Kubernetes clusters. Upgrades, deployment, network/configuration, tooling, etc. Own the infrastructure projects end-end Build observability into our applications to monitor and self-heal Work directly with application engineers to support, enhance, and maintain end-to-end CI/CD test driven deployment pipelines. Improve internal and external security infrastructure, audit trails, etc. What You Need for this Position Must Have BS in related field OR equivalent professional experience 5+ years of site reliability engineering experience in a production Kubernetes environment Team leadership experience Programming: Python, Go, or Java Distributed Systems experience AWS infrastructure DevOps tools: docker, terraform, helm Nice To Have Infrastructure-as-code cyber-security experience What's In It for You Competitive Salary DOE Comprehensive Benefits Package Very Flexible Hours Generous PTO 401K Remote work So, if you are a Lead Site Reliability Engineer with experience, please apply today! Email Your Resume In Word To Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also: Kurt.Holzmuller@Optello.com Please do NOT change the email subject line in any way. You must keep the JobID: linkedin : KH4-1643257 -- in the email subject line for your application to be considered.*** Kurt Holzmuller - Associate Manager - Optello Applicants must be authorized to work in the U.S. Optello is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-20T13:09:55.000Z"
    },
    "company": {
        "name": "Optello",
        "link": "https://www.linkedin.com/company/optello-us"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Los Gatos",
        "region": "CA",
        "postal_code": "95030",
        "street_address": null,
        "latitude": 37.22134,
        "longitude": -121.97964
    }
}