{
    "job": {
        "title": "Software Sr Engineer",
        "industry": "Financial Services,Investment Management,Banking",
        "description": "Job Description Important Note: During the application process, ensure your contact information (email and phone number) is up to date and upload your current resume when submitting your application for consideration. To participate in some selection activities you will need to respond to an invitation. The invitation can be sent by both email and text message. In order to receive text message invitations, your profile must include a mobile phone number designated as “Personal Cell” or “Cellular” in the contact information of your application. At Wells Fargo, we are looking for talented people who will put our customers at the center of everything we do. We are seeking candidates who embrace diversity, equity and inclusion in a workplace where everyone feels valued and inspired. Help us build a better Wells Fargo. It all begins with outstanding talent. It all begins with you. Technology sets IT strategy; enhances the design, development, and operations of our systems; optimizes the Wells Fargo infrastructure; provides information security; and enables Wells Fargo global customers to have 24 hours a day, 7 days a week banking access through in-branch, online, ATMs, and other channels. Our mission is to deliver stable, secure, scalable, and innovative services at speeds that delight and satisfy our customers and unleash the skills potential of our employees. Selected individual will be responsible for being a technical expert, innovator, and strategic thought leader within a specified technology engineering discipline such as applications, network, information security, database, operating systems, or web technologies. Translates advanced technology experience, an in-depth knowledge of the organizations tactical and strategic business objectives, the enterprise technological environment, the organization structure, and strategic technological opportunities and requirements into technical engineering solutions. Acts as an expert resource for architects in the development of target architectures. Maintains knowledge of industry best practices and new technologies and recommends innovations that enhance operations and/or provide a competitive advantage to the organization. Develops standards and best practices and for engineering complex, large scale technology solutions to address highly complex and typically cross-organizational issues, while maintaining broad knowledge of other technology engineering disciplines and partnering with other key experts. Maintains knowledge of industry best practices and new technologies and recommends innovations that enhance operations and/or provide a competitive advantage to the organization. May represent Wells Fargo to external industry groups, influencing industry standards. Provides expert counsel to senior technology leadership and advises and mentors others with the goal of knowledge transfer Required Qualifications 7+ years of software engineering experience Desired Qualifications An industry-standard technology certification Strong verbal, written, and interpersonal communication skills A Master's degree or higher Ability to assess issues, make quick decisions, implement solutions, and influence change Strong customer relationship management skills Excellent verbal, written, and interpersonal communication skills Other Desired Qualifications 7+ years of application/infrastructure production support and engineering experience 7+ years of build-deploy automation and configuration experience within the Linux and Unix environment 7+ years of scripting and automation experience 7+ years of technical troubleshooting experience 5+ years of experience leading multiple implementations 5+ years of technical documentation and publication experience 5+ years of Linux experience 5+ years of IBM Identity Management Tools experience 5+ years of experience managing Management tools connections to multiple database platforms (MongoDB, SQL Server, Oracle, DB2 5+ years of experience managing secure transfer protocol (NDM, SFTP, etc…) 5+ years of experience in a Dev/Ops environment Relationship Management experience with organizational partners and customers ISIM Foundations Badge Certified BCP Certified 7+ Years of experience implementing changes, and strong knowledge of Wells Fargo change management process 5+ years of experience with Web Services 5+ years of experience managing Management tools connections to multiple database platforms (MongoDB, SQL Server, Oracle, DB2 5+ Years Shell scripting Ability to communicate confidentially and professionally Experience building partnerships and consulting effectively with leadership Ability to influence and collaborate at all internal organizational levels Ability to influence and build relationships with LOB stakeholders, technology CIO leadership, external service providers, and architecture teams Advanced scripting skills specifically around automation, log rotation, data collection, error collection and alerting Experience with Agile Scrum (Daily Standup, Sprint Planning and Sprint Retrospective meetings) and Kanban Basic Understanding of Java Exposure to Windows Servers Experience with eSAR certifications Disclaimer All offers for employment with Wells Fargo are contingent upon the candidate having successfully completed a criminal background check. Wells Fargo will consider qualified candidates with criminal histories in a manner consistent with the requirements of applicable local, state and Federal law, including Section 19 of the Federal Deposit Insurance Act. Relevant military experience is considered for veterans and transitioning service men and women. Wells Fargo is an Affirmative Action and Equal Opportunity Employer, Minority/Female/Disabled/Veteran/Gender Identity/Sexual Orientation. Benefits Benefits Summary Visit https://www.wellsfargo.com/about/careers/benefits for benefits information. Reference Number 5595959-13",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-25T17:49:04.000Z"
    },
    "company": {
        "name": "Wells Fargo",
        "link": "https://www.linkedin.com/company/wellsfargo"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 84,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Philadelphia",
        "region": "PA",
        "postal_code": "08051",
        "street_address": null,
        "latitude": 39.95106,
        "longitude": -75.16562
    }
}