{
    "job": {
        "title": "AWS Cloud Engineer, Senior",
        "industry": "Information Technology and Services,Defense &amp; Space,Computer Software",
        "description": "Job Number: R0114409 AWS Cloud Engineer, Senior The Challenge As a Cloud Engineer on our team, you have the chance to shape the future of a DoD program and their software development ecosystem as we design, build and maintain one of largest DevSecOps platform in the Cloud. We’re looking for an engineer who can create advanced, enterprise solutions in the Cloud that will serve as the software tools baseline for hundreds of applications. As a Cloud engineer on our team, you’ll work with the client to architect, secure, and deploy Cloud systems to fit the business needs. You’ll recommend tools and capabilities based on your research of the current environment and knowledge of various on-premise, Cloud-based, and hybrid resources. You’ll work with clients and fellow engineers and information assurance team members to inform strategy and architecture design in a highly collaborative, fast-paced environment. This is an opportunity to stay on top of the latest Cloud resources as you prototype using multiple techniques and new technologies. Join our team as we transform IT systems by taking advantage of Cloud technology. This position is open to remote delivery anywhere within the U.S., to include the District of Columbia. Empower change with us. You Have 5+ years of experience with AWS Cloud engineering, management, maintenance, or architecting Experience with working with networking, security groups, or policy management in relation to Cloud resources across multiple operating systems, including UNIX, Linux, or Windows Experience with kubernetes or OpenShift, Ansible, and Terraform Ability to obtain a security clearance BA or BS degree Nice If You Have Experience with using Agile or DevOps methodologies for designing, developing, or delivering using appropriate automation techniques and tools Knowledge of DoD accreditation processes Ability to work through challenging security requirements and maintain compliance Ability to work with and influence software development teams Secret clearance Security+, Azure or GCP Certification Clearance Applicants selected will be subject to a security investigation and may need to meet eligibility requirements for access to classified information. Build Your Career A challenging and dynamic work environment isn’t all we have to offer. When you join Booz Allen, you’ll have access to: experts in virtually every field a culture that focuses on supporting our employees opportunities that provide stability while offering a variety You’ll also be exposed to a wealth of training resources through our Digital University, an online learning portal featuring more than 5000 functional and technical courses, certifications, and books. Build your technical skills through hands-on training on the latest tools and tech from our in-house experts. Pursuing certifications that directly impact your role? You may be able to take advantage of our tuition assistance, on-site bootcamps, certification training, academic programs, vendor relationships, and a network of professionals who can give you helpful tips. We’ll help you develop the career you want as you chart your own course for success. We’re an EOE that empowers our people—no matter their race, color, religion, sex, gender identity, sexual orientation, national origin, disability, veteran status, or other protected characteristic—to fearlessly drive change.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-09-02T06:10:39.000Z"
    },
    "company": {
        "name": "Booz Allen Hamilton",
        "link": "https://www.linkedin.com/company/booz-allen-hamilton"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "McLean",
        "region": "VA",
        "postal_code": "22101",
        "street_address": null,
        "latitude": 38.93759,
        "longitude": -77.18378
    }
}