{
    "job": {
        "title": "Site Reliability Engineer, Apple Pay",
        "industry": "Consumer Electronics",
        "description": "Summary The Apple Pay Site Reliability Engineering Team is hiring for multiple roles focused on the front line customer experience and the back end integration of Apple systems with our Network and Banking partners. As part of this follow-the-sun team, you’ll have peers based in Europe and the US, ensuring timely support for our US customers around the clock, and a positive work-life balance for you. You’ll be joining a team of world class engineers and interacting on a daily basis with teams that span across Apple including iOS software and hardware engineering, Apple Online Store, Apple Retail and our network and banking partners. Key Qualifications Ability to take full responsibility for a project from top to bottom, with feedback from developers, Project Managers, and DevOps In-depth and proactive communication skills around status of projects Proficiency as a Systems Engineer or Network Engineer required. Experience with hands-on engineering in Java or another object oriented language preferred Experience with relational databases and No-SQL preferred Experience supporting mission-critical customer facing systems in production environments is required Experience with proactive alerting and monitoring systems, such as Nagios and Splunk is preferred Background in information security risk management is preferred Description You already know this… every issue counts. A single ticket can be the key to discovering an issue impacting thousands of people. And now that you’ve found it, you can’t wait to resolve it. You also know that owning the quality of an application is about separating the signal from the noise. Finding that signal is what motives you. When you find it, your next step is to roll up the sleeves and start coding. As a member of the Apple Pay SRE team, you’re expected to help us design the next generation of Apple Pay for our customers. You’ll be involved in all phases and layers of the application, and have a direct impact on the experience of millions of customers. Education & Experience BS degree in computer science or equivalent industry experience Role Number: 200238591",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-10-17T05:21:05.000Z"
    },
    "company": {
        "name": "Apple",
        "link": "https://www.linkedin.com/company/apple"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Raleigh",
        "region": "NC",
        "postal_code": "27699",
        "street_address": null,
        "latitude": 35.781303,
        "longitude": -78.64168
    }
}