{
    "job": {
        "title": "Software Engineer Agile Developer ",
        "industry": "Computer Software",
        "description": "Agile Systems Engineer/Software Engineer We are looking for an Agile Systems Engineer/Software Engineer to join our client's team based in Chantilly, VA. As Agile Systems Engineer, you will provide support and execution of agile software development activities for IPOs and programs, assist Release Train Engineers to ensure the IPO/program Backlog list is current, complete and accurately reflects the mission owner’s priorities, assist in capturing new requirements, validating them through the needs and collection management engineering board, and mission owners prioritization. As a Senior Software Engineer, you are supposed to provide software engineering services to support quarterly deployments of the software baseline - new capabilities, adaptive maintenance, and hardware recapitalization, ensure the complexity of the systems and the criticality of the mission for tasking is managed by applying a systematic, engineering approach to the design. Position Requirements Skills: TS/SCI clearance, Agile, software  engineering, microservices, cloud, virtual machines, software deployment, LINUX, MBSE Bachelor’s degree or higher in Engineering, Computer Science, Information Technology, Management Information Systems, or related STEM degree. Mid-level experience in Agile Software development methodologies. Senior-level experience deploying microservices into cloud environments. Senior-level experience using software development tools to estimate functions points, estimate complexity, develop virtual machines, cloud environments. Senior-level experience with a history of successful software deployments. Preferred: Master’s degree or higher in Engineering, Computer Science, Information Technology, Management Information Systems, or related STEM degree. Senior-level experience in designing, maintaining and recapitalizing IT systems. Senior-level experience in refactoring, containerization and hosting applications in a LINUX platform and infrastructure as a service environment. Demonstrated experience with MBSE, processes, tools and languages. Mid-level experience in curating Backlog lists. Certified SAFe Agilist. Key responsibilities Ensure RPE and sprints are planned, developed and executed IAW SAFe framework. Ensure the backlog list is current and prioritized IAW product Owner priorities. Assist the Government Program Manager in overseeing the RPE and sprint to ensure the Solution and design architecture requirements are implemented. Ensure the Developer captures the implementation in MBSE model and is provided to the Government to update the Government models, Digital Thread and Digital Twin.Ensure the RPE and sprints build to test and incorporate agile principles of lean traceability of defined requirements through test plans and test procedures. Determine operational feasibility by evaluating analysis, problem definition, requirements, solution development and proposed solutions. Document and demonstrate solutions by developing documentation, flowcharts, layouts, diagrams, charts, code comments and clear code. Develop software solutions by studying information needs; studying systems flow, data usage and work processes; investigating problem areas. Tailor and deploy software tools, processes and metrics as needed. Provide information by collecting, analyzing and summarizing development and service issues. Automate tasks through appropriate tools and scripting. Develop architectures that are inherently secure, robust, scalable, modular, and API-centric. Provide software design recommendations to the program manager and Chief Software Engineer. Coordinate software development activities within product lines. Perks and Benefits: 3 weeks of PTO All federal holidays (typically 10) 50% match on health, vision, and dental insurance 401 k Certification/education reimbursement Flexible Spending Accounts AD&D Life insurance Short/Long-term disability",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-14T17:17:01.000Z"
    },
    "company": {
        "name": "Employa",
        "link": "https://www.linkedin.com/company/employa-llc"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Virginia",
        "region": "United States",
        "postal_code": "23038",
        "street_address": null,
        "latitude": 37.512905,
        "longitude": -78.697624
    }
}