{
    "job": {
        "title": "Data Scientist",
        "industry": "Marketing and Advertising,Information Technology and Services,Internet",
        "description": "We are seeking a data mining scientist to provide applied research and data modeling expertise in this area. This is an exciting position, providing the candidate the unique opportunity to solve critical retail problems in an e-commerce marketplace using statistical methodologies, data modeling and machine learning. Work with business partners to support overall eBay business optimization; Apply advanced statistical/econometric modeling tools to develop robust predicative models to support business initiatives; Conduct and manage applied research and modeling work in the areas of supply & demand gap, trending, seasonality, event inventory recommendation, …etc. Utilize data mining technologies and various data sources like eBay user behavior data, inventory data, transaction data in both batch and real time mode. Provide complete solutions to business problems using data mining techniques, statistics and data analysis. Learn from the world class expertise in the data and science areas Job Requirements MS degree or PhD (preferred) in Computer Science, Statistics, Mathematics, or equivalent is required for this position Broad experience with various modeling algorithms, data mining tools, data analysis tools, and statistical packages Expertise with applying predictive modeling techniques (model training, logistic regression etc), statistics and information retrieval methods to real-world data Superior communications skills, both verbal and written Attention to detail and data accuracy. Extensive experience with large data sets and data manipulation. Knowledge of SQL, R, Hadoop is preferred. About EBay eBay Inc. (NASDAQ: EBAY) is a global commerce leader including the Marketplace, StubHub and Classifieds platforms. Collectively, we connect millions of buyers and sellers around the world, empowering people and creating opportunity through Connected Commerce. Founded in 1995 in San Jose, Calif., eBay is one of the world’s largest and most vibrant marketplaces for discovering great value and unique selection. Benefits are an essential part of your total compensation for the work you do every day. Whether you’re single, in a growing family, or nearing retirement, eBay offers a variety of comprehensive and competitive benefit programs to meet your needs. Including maternal & paternal leave, paid sabbatical, and plans to help ensure your financial security today and in the years ahead because we know feeling financially secure during your working years and through retirement is important. Here at eBay, we love creating opportunities for others by connecting people from widely diverse backgrounds, perspectives, and geographies. So, being diverse and inclusive isn’t just something we strive for, it is who we are, and part of what we do each and every single day. We want to ensure that as an employee, you feel eBay is a place where, no matter who you are, you feel safe, included, and that you have the opportunity to bring your unique self to work. To learn about eBay’s Diversity & Inclusion click here: https://www.ebayinc.com/company/diversity-inclusion/ eBay Inc. is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, national origin, sex, sexual orientation, gender identity, veteran status, and disability, or other legally protected status. If you are unable to submit an application because of incompatible assistive technology or a disability, please contact us at talent@ebay.com. We will make every effort to respond to your request for disability assistance as soon as possible. For more information see: EEO is the Law Poster and EEO is the Law Poster Supplement This website uses cookies to enhance your experience. By continuing to browse the site, you agree to our use of cookies View our privacy policy and accessibility info",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-24T00:00:00.000Z"
    },
    "company": {
        "name": "eBay",
        "link": "https://www.linkedin.com/company/ebay"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "San Jose",
        "region": "CA",
        "postal_code": "95148",
        "street_address": null,
        "latitude": 37.334793,
        "longitude": -121.888145
    }
}