{
    "job": {
        "title": "Data Scientist (junior)",
        "industry": "Marketing and Advertising",
        "description": "At PMX, the Decisioning team is looking for a talented junior Data Scientist for an exciting opportunity to be involved with building out a predictive analytics framework. Candidates considered based on their ability to prototype highly parallelized scripts related to solutions anticipating behavior and deriving insights from big data. As well as their ability to manage research projects resulting in real world project and data pipelines that support data products. Responsibilities Prototype, design and implement machine learning, natural language processing and predictive analytics scripts in python Design APIs that will enable streamlined operation of end-to-end frameworks Data wrangle large datasets for purposes of universal schema and feature engineering Work with client teams on discovery work to identify inefficient process(es) that can be automated Work with data engineers to optimize code base for parallel architecture Work with data engineers on bug fixes, client enhancement requests and code optimization Processing, cleansing, and verifying the integrity of data used for analysis To enjoy being challenged and solve complex problems on a daily basis Excellent oral and written communication skills Ability to work in teams and collaborate across multiple teams Communicate concisely and persuasively with engineers and product managers Qualifications Bachelor’s Degree in Computer Science/Engineering/Data Science Experience with Python, data pre-processing, machine learning APIs () and NLP APIs (nltk, genism, spaCy) Knowledge of statistics and probability theory Additional Information All your information will be kept confidential according to EEO guidelines.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-30T20:51:56.000Z"
    },
    "company": {
        "name": "Publicis Media",
        "link": "https://uk.linkedin.com/company/publicismedia"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "New York",
        "region": "NY",
        "postal_code": "10132",
        "street_address": null,
        "latitude": 40.713047,
        "longitude": -74.00723
    }
}