{
    "job": {
        "title": "Leading digital advertising firm in the Buffalo area seeking a talented Software Engineer!",
        "industry": "Information Technology and Services,Computer Software",
        "description": "Software Engineer This Jobot Job is hosted by Brett Tolmie Are you a fit? Easy Apply now by clicking the \"Apply\" button and sending us your resume. A Bit About Us Leading technology company in the Buffalo/Clarence area seeking a talented Software Engineer! Our client is a very well-established mid-sized technology firm and they were actually responsible for creating the first centralized digital media network. For over 25 years they have been growing their client base to more than two thousand organizations including financial institutions, colleges and universities, Fortune 500 enterprises, and numerous retail and media companies. Their team consists of many talented yet very down to earth people who pride themselves on providing an excellent experience to our clients and therefore they do everything in their power to keep them very happy at work and because of this, they have a tremendously stable and fun working environment. Currently they are looking for a Software Engineer who will have direct responsibility for the design, development and evolution of web page environments that deliver modern, engaging and dynamic customer experiences. Job Details Is your background a fit? Apply if you meet this criteria Develops and maintains complex frontends with a focus on user experience. Design, build and maintain API infrastructure that allows for standard integration methodology between applications. Communicate ideas and set direction on projects with a focus on solving business challenges. Own and manage all phases of the software development lifecycle. Develops and maintains backend systems. Bachelor's Degree in Information Technology or related field with 5+ years of experience in Computer Science, Information Technology or related field. Or Master's Degree in Information Technology or related field with 2+ years of experience. Java, JSP, JavaScript, CSS, HTML, Spring boot, Angular and other JavaScript frameworks. Knowledge of building restful APIs for internal and external products. Experience operating at all levels of the stack, debugging problem from UI to backend systems. Interested in hearing more? Easy Apply now by clicking the \"Apply\" button.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-20T00:00:00.000Z"
    },
    "company": {
        "name": "Jobot",
        "link": "https://www.linkedin.com/company/jobot"
    },
    "education": {
        "required_credential": null
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Clarence Center",
        "region": "NY",
        "postal_code": "14032",
        "street_address": null,
        "latitude": 43.0104,
        "longitude": -78.63719
    }
}