{
    "job": {
        "title": "Data Analyst",
        "industry": "Marketing and Advertising,Computer Software,Internet",
        "description": "Angi® is the home for everything home. From repairs and renovations to products and financing, Angi is transforming every touch point in home services. With over 25 years of experience and a network of nearly 250,000 pros, we have helped more than 150 million people with their home needs. Our products and technology help our customers love where they live while helping small businesses grow and thrive. We believe the home is the most important place on earth and we are at the beginning of our ambitious journey to redefine how people care for their homes - join us! About the role: The Data Analyst is responsible for maintaining, improving, and creating tools and processes to be used by the Angi's Client Success and Sales Originations teams. This role will sit in our Indianapolis, IN headquarters. What you'll do: Prepare organizational sales reports, charts, and graphs in support of the sales department Work directly with sales and leadership to set reporting requirements for their needs Collect and analyze data from multiple databases including Microsoft excel, SQL, and Salesforce.com and additional sources to evaluate current and historical trends daily Create various reports for internal departments Proactive monitoring data within CRM Maintain and execute daily and bi-weekly responsibilities Lead by example, maintaining a positive, cooperative attitude especially in times of change/challenge Perform related duties as required or assigned Who you are: Possess a Bachelor's degree or better in Finance, Business Analytics, Economics or a related field, is preferred Have previous business analyst experience (preferred) Have strong experience with MS Office, particularly Excel Have working knowledge of Salesforce and SQL is a plus Have the ability to effectively communicate orally and in writing with co-workers, management team, other Departments, vendors, and outside agencies, including being sensitive to professional ethics Have the ability to work in a metric driven environment and remain goal oriented Posses skills in complex problem solving, judgment, critical thinking and decision making Highly organized with an emphasis on accuracy and timeliness, and have attention to detail to accurately follow procedures Ability to maintain self-motivation and work alone with minimum supervision, and with others in a team environment, occasionally under time pressure and on several tasks at the same time Have the ability to sit the entire work day viewing a computer monitor Have the ability to work occasionally more than 40 hours a week, evenings, and weekends to meet deadlines Compensation & Benefits: This position will be eligible for a competitive year end performance bonus & equity package. Full medical, dental, vision package to fit your needs Flexible vacation policy; work hard and take time when you need it Pet discount plans & retirement plan with company match (401K) The rare opportunity to work with sharp, motivated teammates solving some of the most unique challenges and changing the world",
        "employment_type": "PART_TIME",
        "date_posted": "2021-07-30T05:12:35.000Z"
    },
    "company": {
        "name": "HomeAdvisor",
        "link": "https://www.linkedin.com/company/homeadvisor"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Indianapolis",
        "region": "IN",
        "postal_code": "46203",
        "street_address": null,
        "latitude": 39.76845,
        "longitude": -86.15621
    }
}