{
    "job": {
        "title": "Software Engineer, Email Integrations",
        "industry": "Marketing and Advertising,Computer Software,Internet",
        "description": "You're a front end developer who knows a really good email when you see one. If tags don’t scare you, we’d love to chat. We’re looking for a team member to help us create personalized, dynamic emails. Your HTML/CSS virtuosity lets you explore the vast potential of translating static assets from our in-house Design Studio into dynamic, great looking, interactive experiences across industries. Responsibilities Create dynamic emails that work across email clients, devices, and browsers Translate static assets from the Design Studio into logical, programmatic GoLang HTML templates Conduct appropriate testing and document findings Become fluent with our internal framework Work and communicate well cross-functionally Qualifications HTML and CSS expertise; JavaScript and jQuery experience a plus Experience with Adobe CC; Sketch experience is a plus A passion for new technologies, unconventional thinking, and pushing boundaries in email marketing Good analytical and problem solving skills when troubleshooting device and browser issues, with attention to details Ability to work autonomously and effectively prioritize and execute tasks Wunderkind is proud to be an equal opportunity workplace. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or Veteran status. JOIN US ON OUR MISSION Wunderkind (formerly BounceX) is a leading performance marketing engine that delivers tailored experiences at scale. Digital businesses use Wunderkind to remember who users are better than ever before, allowing them to deliver high-performing, one-to-one messages on websites, through emails and texts, and in ads at a scale that’s not otherwise possible. Wunderkind drives $1.2 billion dollars annually in directly attributable revenue for top eCommerce brands like Uniqlo, Sonos and HelloFresh, often ranking as a top-3 revenue channel in their own analytics. Wunderkind is maniacally obsessed with ROI and aims to be the infrastructural interface between individuals and brands in a world where consumers choose what they want, from whom, and when. Having raised over $44.9 million in funding from proven firms like Battery Ventures, Cross Creek Advisors and Primary Ventures, Wunderkind was named the Fastest Growing Software Company in America by Inc Magazine. With headquarters in New York and London, Wunderkind has been recognized by Glassdoor and Crain's for its exceptional culture and being one of the top places to work in the country. The company recently signed both the White House Equal Pay Pledge and the United Nations Women's Empowerment Pledge and continues to set the bar as a pioneer in technology innovation and workplace inclusion initiatives. What bonds our community together is our commitment to 5 Core Values: Come Hungry Carry Each Other Drive Undeniable Performance Respect People, Privacy, Ideas Bounce Back Come join us on our mission.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-22T01:43:56.000Z"
    },
    "company": {
        "name": "Wunderkind (Formerly BounceX)",
        "link": "https://www.linkedin.com/company/wunderkind-formerly-bouncex"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Indianapolis",
        "region": "IN",
        "postal_code": "46203",
        "street_address": null,
        "latitude": 39.76845,
        "longitude": -86.15621
    }
}