{
    "job": {
        "title": "Senior Site Reliability Engineer, SRE",
        "industry": "Internet",
        "description": "Company Description Twitter is what’s happening and what people are talking about right now. For us, life's not about a job, it's about purpose. We feel real change starts with conversation. Here, your voice matters. Come as you are and together we'll do what's right (not what's easy) to serve the public conversation. Job Description Who We Are SREs (Site Reliability Engineers) work on improving the availability, scalability, performance and reliability of Twitter’s production services. Our core infrastructure receives hundreds of millions of tweets per day and serves tens of billions of API requests. We also serve over 2+ billion search queries per day, render 100M+ ad impressions, and process hundreds of terabytes of log and interaction data daily! What You’ll Do As a member of the organization you will be dedicated to improving the reliability of our end-to-end platform. Your work will integrate directly with Twitter's products. You will investigate sophisticated and difficult operational issues; from the software, systems, automation, and process perspectives. You will understand the challenges around integrating disparate infrastructures into a new facility, processes and procedures. This is an opportunity to work with open-source technologies and the wider SRE community, and actively participate in the vision to move away from high operational cost tasks such as break/fix, cluster migrations, new service buildouts, abuse, etc. Our team contributes to services that can shrink and expand based on demand, self heal, automatically rollout, etc. Responsibilities Include (but Limited To) Performing deep dives into both systemic and latent reliability issues; partnering with software and systems engineers across the organization to produce and roll out fixes. Tackling issues across the entire stack hardware, software, application and network. Driving standardization efforts across multiple fields and services in conjunction with embedded SREs throughout the organization. Mentoring SREs on standard methodology for everything from supervising to fixing complex code issues. Identifying and leading opportunities to improve automation for the company; scoping and building automation for deployment, management and visibility of our services. Participating in code reviews for projects primarily written in Java and Scala, built on open source libraries such as Finagle, and running on both physical and virtualized platforms. Representing the SRE organization in design reviews and operational readiness exercises for new and existing services. Qualifications Who You Are - You Have An understanding of systems and application design, including the operational trade-offs of various designs. A practical knowledge of various aspects of service design like messaging protocols & behavior, caching strategies and software design practices. A deep understanding of shell scripting and at least one higher-level language (Python or Scala preferred). Demonstrated knowledge & experience of Linux servers, specifically RHEL/CentOS, TCP/IP, HTTP, and experience supporting multi-tier web application architectures. Experience in handling services in a large scale environment. Practical experience in Java or Scala. Work well with and be able to influence a myriad of personalities at all levels. Ability to prioritize tasks and work independently. Adaptability and are able to focus on the simplest, most efficient & reliable solutions. A track record of successful practical problem solving, excellent written and social communication, and documentation skills. A B.S. in computer science or similar field or comparable experience. Desired Experience Ability to lead technical teams through design and implementation across an organization. Experience with existing open source projects such as Scribe, ZooKeeper and Apache Mesos.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-31T01:16:57.000Z"
    },
    "company": {
        "name": "Twitter",
        "link": "https://www.linkedin.com/company/twitter"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "San Francisco",
        "region": "CA",
        "postal_code": "94121",
        "street_address": null,
        "latitude": 37.78008,
        "longitude": -122.42016
    }
}