{
    "job": {
        "title": "Sr. Software Engineer | VMC on Dell EMC - Opportunity for Working Remotely",
        "industry": "Information Technology and Services,Computer Software,Financial Services",
        "description": "Are you passionate about building great products? Want to be a part of the exploding Edge and IoT market? Want to be part of a new initiative enabling hybrid cloud? Our team is looking for experienced software development engineers and operations leaders to join the team. VMware Cloud on Dell EMC combines the simplicity and agility of the public cloud with the security and control of on-premises infrastructure, delivered as-a-service to data center and edge locations. This fully-managed VMware service provides simple, secure, and scalable infrastructure for customer’s on-premises datacenter and edge locations. This unique approach empowers the customer to focus on business innovation and differentiation, while VMware operates the entire infrastructure end-to-end. For more information - see here - https://www.vmware.com/products/vmc-on-dell-emc.html VMware Cloud on Dell EMC is a highly scalable SaaS service and provides an easy to use on-prem hyper-converged infrastructure (HCI) developed in partnership with Dell and integrated with industry-leading VMware infrastructure products - vSphere, vSAN, NSX and Velocloud.” As a key contributor in our cloud team, you will play an instrumental role in understanding customer use cases and defining the end–to-end behavior of the solution. This solution will involve developing a highly scalable SaaS service, an easy-to-use on-prem hyper-converged infrastructure (HCI) with industry-leading software-defined networking solution, NSX, and also include our SD-WAN solution, Velocloud. Roles & Responsibilities Contribute to end-to-end architecture, and build a scalable and highly available SaaS solution Provide technical leadership to team members and be a strong team player. Become the subject matter expert and truly understand what customers need from this product. Understand different subsystems and bring them together to form a meaningful solution to the customer Collaborate with project team members and cross-functional product teams. Embody principles of service ownership, be a champion for continuous delivery and test automation Architect, Build & manage SaaS Service platform with 99.99% uptime Required Skills Experience in working with world-class software development teams and projects through multiple releases. Experience with Java, Python, or GO Hands-on experience with development projects using RESTful APIs, SpringBoot, horizontal scalability, micro services, high availability principles. Solid background in OOP, object and data modeling using SQL and NoSQL databases Excellent communication skills essential Preferred Skills Experience using container technologies, and developing services on the cloud Experience with automation tools like Jenkins, GitLab CI Strong understanding of one or more of the key areas of the solution like distributed computing, networking, storage, virtualization NOTE: We are recruiting for several different levels! For COLORADO Candidates ONLY: This position has a base salary starting at 95,000. Bonus, commission, and/or equity may be eligible for this position. Additional benefits for this position can be found at https://benefits.vmware.com/. *Note: Disclosure of Colorado pay and benefits required per sb19-085. Category : Engineering and Technology Subcategory: Software Engineering Experience: Business Leadership Full Time/ Part Time: Full Time Posted Date: 2021-07-09 VMware Company Overview: At VMware, we believe that software has the power to unlock new opportunities for people and our planet. We look beyond the barriers of compromise to engineer new ways to make technologies work together seamlessly. Our cloud, mobility, and security software form a flexible, consistent digital foundation for securely delivering the apps, services and experiences that are transforming business innovation around the globe. At the core of what we do are our people who deeply value execution, passion, integrity, customers, and community. Shape what’s possible today at http://careers.vmware.com. Equal Employment Opportunity Statement: VMware is an Equal Opportunity Employer and Prohibits Discrimination and Harassment of Any Kind: VMware is committed to the principle of equal employment opportunity for all employees and to providing employees with a work environment free of discrimination and harassment. All employment decisions at VMware are based on business needs, job requirements and individual qualifications, without regard to race, color, religion or belief, national, social or ethnic origin, sex (including pregnancy), age, physical, mental or sensory disability, HIV Status, sexual orientation, gender identity and/or expression, marital, civil union or domestic partnership status, past or present military service, family medical history or genetic information, family or parental status, or any other status protected by the laws or regulations in the locations where we operate. VMware will not tolerate discrimination or harassment based on any of these characteristics. VMware encourages applicants of all ages. Vmware will provide reasonable accommodation to employees who have protected disabilities consistent with local law.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-09T20:12:44.000Z"
    },
    "company": {
        "name": "VMware",
        "link": "https://www.linkedin.com/company/vmware"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Denver",
        "region": "CO",
        "postal_code": "80247",
        "street_address": null,
        "latitude": 39.738453,
        "longitude": -104.984856
    }
}