{
    "job": {
        "title": "Sr Machine Learning Data Engineer",
        "industry": "Information Technology and Services,Staffing and Recruiting,Financial Services",
        "description": "Overview The Data Science & Platform Engineering Department leads the development of The Client’s crop design platform, which combines machine learning and big data with genome editing and plant biology to accelerate and simplify the product development process. The team partners with the Research & Development teams on the development of a portfolio of offerings (commercial, product, or platform related) that meet the needs of The Client’s business units. Position Summary The successful candidate has prior Machine Learning and Data Engineering experience (building & productionizing models) experience with exposure to multiple programming languages and technical platforms. Write, test, debug, and maintain software based on the requirements provided and with direction or guidance from more senior members of the team. Generate code adhering to standards as defined by the software team, document action items for development, participate in effective code reviews, and actively participating in team meetings. Follow standard and effective software development methodologies and release processes. You Will The Client requires a dedicated and experienced machine learning data engineer with exposure to geospatial or analytical domains to enable applications in that space. Design, build, and maintain efficient, reusable, and reliable Python code Work with users to understand end-user requirements, formulate use cases, and translate them into pragmatic and effective technical designs Enable creative scalable engineering solutions for data gathering and integration for structured and unstructured data sets Automate & orchestrate Client pipelines Monitor, optimize, and maintain Client solutions Engineer cloud deployed software solutions to enable data and analytics pipelines Continuously improve and maintain code quality through writing unit tests, automation and code reviews Contribute ideas to help improve our technology, coding standards and products EDUCATION HS/ GED Experience 6+ years work experience building and deploying software 3+ years experience in Python 3+ years of experience in experience building scalable data, feature engineering, & Client pipelines to meet analytical business problems Experience with developing or deploying MLOps systems or developing libraries or tools to accelerate Data Scientist day-to-day work. Solid OOP and software design knowledge - can write software that’s extensible, reusable, and meets desired architectural objectives Experience with AWS cloud platform or other cloud platforms Relational databases & SQL Familiarity with Linux / Unix environments Additional Skills Experience with geospatial data systems a plus Should have exposure to Agile Self-motivated to learn new knowledge and techniques Strong customer focus Collaborative Ability to focus and work independently with little direction Preference Given to Applicants with the Following Experience with GIT, Docker, Web services, geospatial data Experience with DevOps, MLOps, & Cloud Security best practices Experience with Data Catalogs, Data Lakes, & Feature Store Data Modeling Neteffects Neteffects processes visas and green cards* Upon hire neteffects can provide AWS training via neteffects university* We’re committed to empowering each individual who works with us to take charge of their career. You won’t be alone on your journey. Our dedicated team is here to serve you as a partner in the process. What We Offer For You Interview preparation Resume review and recommendations LinkedIn review Local job market information, trends, and insights Access to networking events Informational career centric seminars. Neteffects Consultant Care Program Keeping in Touch: Whether it’s a quick call or email, coffee or lunch, our check-ins support as much or as little interaction as you’d prefer. We’re here if you need us. Events: Neteffects participates in a number of events each year and hosts some employee-only social gatherings. Remarketing: When your project is nearing completion, we’ll partner with you to get you ready to engage in your next consulting opportunity through Neteffects. From resume review, to interview preparation and offer negotiation; we’ll work hard to help you excel. Neteffects Benefits: Neteffects is about celebrating technology and the pro's that come with it. We offer a very competitive benefits package, which includes Medical, Dental, Vision, Life, 401k, and more. We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.",
        "employment_type": "CONTRACTOR",
        "date_posted": "2021-06-19T04:50:14.000Z"
    },
    "company": {
        "name": "inSync Staffing",
        "link": "https://www.linkedin.com/company/insync-staffing"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 72,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Creve Coeur",
        "region": "MO",
        "postal_code": "65064",
        "street_address": null,
        "latitude": 38.661064,
        "longitude": -90.42915
    }
}