{
    "job": {
        "title": "Junior Software Engineer (Python)",
        "industry": "Information Technology and Services",
        "description": "Software Engineer Marietta, GA Contract to Hire Brooksource is looking for several Software Engineers to join their Fortune 18 Retail client's Enterprise Data Warehouse team. As a Software Developer you will be working alongside a balanced team of engineers to support all Applications supporting our client's data. You will also have the opportunity to leverage Machine Learning and Data Science tools/technologies. Requirements: 0 - 3 years of experience in a development role, at the enterprise-level. This could be either internship or professional job experience Computer Science or related degree with a technical foundation, problem solving skills and a passion for learning new technologies Additional technologies expected to have exposure to: SQL, GCP, Javascript, React, Kubernetes, Databases Basic understanding of Machine Learning and Data Science is a plus Responsibilities: Responsible for programming and customizing applications on the EDW space. Take business requirements and develop the total technical design for assigned projects and ensure proper usage as part of the design efforts in building a system to be put into production. Conduct appropriate test reviews on assigned projects as necessary and present findings and offer solutions to management Training will be provided through paired programming Perks of the Opportunity: Work for the #1 Home Retailer in the World 100% Remote Top 50 Most Innovative Companies by Fast Company Ability to work directly with the business and have direct input on the specifications of the product you are developing Receive a consistent weekly paycheck, holiday pay, and health benefits through Brooksource We are an equal opportunity employer and value diversity at our company. We do not discriminate based on race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status.",
        "employment_type": "CONTRACTOR",
        "date_posted": "2021-08-31T00:54:24.000Z"
    },
    "company": {
        "name": "Brooksource",
        "link": "https://www.linkedin.com/company/brooksource"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Atlanta",
        "region": "GA",
        "postal_code": "30355",
        "street_address": null,
        "latitude": 33.748547,
        "longitude": -84.3915
    }
}