{
    "job": {
        "title": "Sr Data Scientist",
        "industry": "Banking",
        "description": "Description This Senior Data Scientist will be responsible for developing analytical insights and/or statistical models that optimize business and marketing spend, identify new business/marketing opportunities and/or provide strategic direction to senior management. This position will collaborate directly with business partners to play a key role in the development and application of models, insights and data intelligence that supports business and marketing programs, customer analytics and operational improvements. Primary Responsibilities Include Researching growing market trends and mine the Citizens data intelligence to develop new insights that can guide the strategic direction of the Citizens Bank lines of business Analyzing current business processes and programs and developing models/strategies/insights that can lead to a more optimal business performance and spend of marketing dollars. Documenting and communicating technical/analytic results for a non-technical audience Required Skills/Experience Qualifications 3 - 7 years of experience in Analytics/Database Marketing, with experience in Financial Services preferred 3 - 7 years of experience in SAS and/or related programming languages Strong written and verbal communication skills required with an ability to successfully communicate analytic results, business insights and resulting business implications to non-technical business partners Ability to work in a team environment and collaborate with colleagues who have a background in statistics, database development/maintenance, and information technology Strong programming skills and ability to utilize a variety of data/analytic software languages/tools (e.g., SQL, SAS, R, Python, Splus, etc.) Deep knowledge of a variety of statistical concepts and procedures, including: generalized linear models, machine learning algorithms, experimental design, stochastic processes, markov process modeling, response surface methodology, and statistical graphics Education, Certifications And/or Other Professional Credentials Master's Degree in Statistics/Mathematics/Applied Math required, PhD preferred Hours & Work Schedule Hours per Week: 40 Work Schedule: Monday-Friday 8am-5pm Why Work for Us At Citizens, you'll find a customer-centric culture built around helping our customers and giving back to our local communities. When you join our team, you are part of a supportive and collaborative workforce, with access to training and tools to accelerate your potential and maximize your career growth. Equal Employment Opportunity Citizens, its parent, subsidiaries, and related companies provide equal employment and advancement opportunities to all colleagues and applicants for employment without regard to age, ancestry, color, citizenship, physical or mental disability or perceived disability, ethnicity, gender, gender identity or expression, genetic information, genetic characteristic, marital or domestic partner status, victim of domestic violence, family status/parenthood, medical condition, military or veteran status, national origin, pregnancy/childbirth/lactation, colleague’s or a dependent’s reproductive health decision making, race, religion, sex, sexual orientation, or any other category protected by federal, state and/or local laws. Equal Employment and Opportunity Employer/Disabled/Veteran Citizens is a brand name of Citizens Bank, N.A. and each of its respective affiliates. 211736",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-09-08T03:10:05.000Z"
    },
    "company": {
        "name": "Citizens",
        "link": "https://www.linkedin.com/company/citizens-bank"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Columbus",
        "region": "OH",
        "postal_code": "43272",
        "street_address": null,
        "latitude": 39.96276,
        "longitude": -82.99629
    }
}