{
    "job": {
        "title": "Data Scientist",
        "industry": "Nonprofit Organization Management,Health, Wellness and Fitness,Hospital &amp; Health Care",
        "description": "Description The Data Scientist works independently using a robust math toolbox to discover solutions for a diverse portfolio of interesting and challenging problems. The Data Scientist develops, implements, and monitors advanced analytic, medical informatics, and predictive modeling tools for health care programs. The scientist normally works Monday through Friday day-light business hours or as needed. Responsibilities Responsible for conceiving, planning, designing, developing and validating robust algorithms for use in analyzing health care models. Consults with and provides guidance on the selection and use of modeling software and programs. Execution of all phases of quantitative research projects: identifying the business problem, data exploration, modeling, communication of final results. Design, develop, and implement health care analytic and biomedical modeling programs. Implements plans for capturing and creating new data elements, working with Health Plan CIO and IT staff. Qualifications Advanced degree in a quantitative discipline such as Bio-informatics, Statistics, Applied Mathematics, Operations Research, Economics, Decision Science, Health Services Research or related field. - Ph.D. highly preferred. Three or more years experience in quantitative methods or other relevant work Strong mathematics and science background with sound analytical/computational skills and proficiency in pattern recognition and classification. Experience with machine learning models highly desired. Knowledge of statistical and reporting methodologies. Database knowledge for data management is highly desired. Proficiency in statistical programming languages such as, but not limited to: MATLAB, Mathematica, SAS, R, or Statistica Ability to design programs to analyze complicated scenarios. Excellent written and oral communication skills. Person must demonstrate a high degree of professionalism, enthusiasm and initiative on a daily basis. Ability to work in a fast-paced environment a must. Attention to detail is critical to the success of this position. Licensure, Certifications, And Clearances Act 31 Child Abuse Reporting with renewal Act 33 with renewal Act 34 with renewal Act 73 FBI Clearance with renewal UPMC is an Equal Opportunity Employer/Disability/Veteran Total Rewards More than just competitive pay and benefits, UPMC’s Total Rewards package cares for you in all areas of life — because we believe that you’re at your best when receiving the support you need: professional, personal, financial, and more. Our Values At UPMC, we’re driven by shared values that guide our work and keep us accountable to one another. Our Values of Quality & Safety, Dignity & Respect, Caring & Listening, Responsibility & Integrity, Excellence & Innovation play a vital role in creating a cohesive, positive experience for our employees, patients, health plan members, and community. Ready to join us? Apply today.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-09T00:00:00.000Z"
    },
    "company": {
        "name": "UPMC",
        "link": "https://www.linkedin.com/company/upmc"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Pittsburgh",
        "region": "PA",
        "postal_code": "15235",
        "street_address": null,
        "latitude": 40.44217,
        "longitude": -79.99496
    }
}