{
    "job": {
        "title": "Software Developer I",
        "industry": "Information Technology and Services,Computer Software,Internet",
        "description": "Job Responsibilities Review and document existing application code Provide maintenance support to existing systems Develop new high quality back-end systems Perform new application development Automation of development tasks Interface with BA’s for requirement gathering Define functional design for requirements implementation Critical systems development Database structure definition Integration with legacy data & application s Perform other duties as required and assigned by manager and upper management. Follow legal policies as directed. Job Requirements Strong understanding of Object Oriented design and programming. Experience with Java SE 5.0 or Java EE 5.0. SQL experience. 1+ year of development experience Experience with Object Relational Mapping (ORM), preferably Hibernate. Experience using web presentation technologies such as JSP, JSF, Ajax, Jamon, Velocity, or FreeMarker. Use of IDEs such as Eclipse or IntelliJ. Experience building unit tests using JUnit. Experience using Source control systems like SVN or CVS Skills XML and related technologies such as XSD, JAXB, XSLT, etc. E xperience with Object Relational Mapping (ORM), preferably Hibernate. Experience using web presentation technologies such as JSP, JSF, Ajax, Jamon, Velocity, or FreeMarker. Use of IDEs such as Eclipse or IntelliJ. Education Bachelor’s degree or U.S. equivalent in Computer Applications, Computer Engineering, Computer Science, Information Systems, Information Technology, or a related field or equivalent. Certifications Physical Requirements This position requires the incumbent to sit, stand and perform general office functions. The incumbent may also be required to lift up to 25 pounds occasionally. Bending, stooping and reaching are also frequently required. Equal Employment Opportunity It is our policy to provide equal employment opportunity for all applicants and associates.  This policy includes our commitment to ensure that all employment decisions are made without regard to race, color, religion, gender, national origin, disability, pregnancy, veteran status (including Vietnam era veterans), age, sexual orientation, gender identity, or any other non-job-related characteristic protected by law. Who We Are Just a few minutes from Salt Lake City and Utah’s ski slopes, Overstock is an original resident of “ Silicon Slopes ”, one of the fastest growing technology hubs in the country. We’re a passionate group of collaborative problem solvers and creative innovators, working on cutting-edge technology. From building award-winning retail applications (with amazing AR functionality ) to creating leading blockchain and machine learning technologies, each of us embodies a unique value and contributes a diverse perspective to the team. What We Offer 401k (6% match) Flexible Schedules Onsite Health Clinic Tuition Reimbursement, Leadership Development Program, & Mentorship Program Onsite Fitness Center with group fitness classes and trainers Onsite Cafe with additional Coffee Shop and Juice Bar Onsite Greenhouse, providing fresh fruits & vegetables for our cafe Overstock Women's Network (OWN) And More… Benefits vary based on position, tenure, location, and employee election Physical Requirements This position requires you to sit, stand and perform general office functions. You may also be required to lift up to 25 pounds occasionally. Bending, stooping and reaching are also frequently required. Equal Employment Opportunity It is our policy to provide equal employment opportunity for all applicants and associates.  This policy includes our commitment to ensure that all employment decisions are made without regard to race, color, religion, gender, national origin, disability, pregnancy, veteran status (including Vietnam era veterans), age, sexual orientation, gender identity, or any other non-job-related characteristic protected by law. Back to Overstock Careers",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-21T02:11:03.000Z"
    },
    "company": {
        "name": "Overstock.com",
        "link": "https://www.linkedin.com/company/overstock-com"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 12,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Midvale",
        "region": "UT",
        "postal_code": "84047",
        "street_address": null,
        "latitude": 40.610794,
        "longitude": -111.90804
    }
}