{
    "job": {
        "title": "Senior Embedded Software Engineer",
        "industry": "Staffing and Recruiting",
        "description": "Senior Embedded Software Engineer Location: San Francisco Bay Area - Flexible hybrid onsite/remote schedule Opportunity to join an innovative tech company within the Autonomous Vehicle space, working on full lifecycle Software Development for the company's next generation products. As a Senior Software Engineer, you will be responsible for developing reliable C++ (Embedded/Linux) Software to a high standard set by the company and industry. This will involve all stages from early development of prototypes, through to testing and ensuring manufacturability of the final products. The company have some very ambitious growth plans, making this a great time to join for your personal career development! The ideal candidate will have experience in: Working in Embedded systems environment Extensive C/C++ development Linux development. Yocto experience is desirable Degree in relevant discipline You will be working closely with the Hardware team (Electrical/PCB design Engineers), so a basic understanding of reading schematics and board layout would be desirable. The company offer a very competitive compensation as well as a comprehensive benefits package. If you're looking for a new challenge and a chance to progress you skills and career further, APPLY now!",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-10-05T17:28:27.000Z"
    },
    "company": {
        "name": "SGI",
        "link": "https://uk.linkedin.com/company/source-group-international"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "San Francisco Bay Area",
        "region": null,
        "postal_code": "94112",
        "street_address": null,
        "latitude": 37.39271,
        "longitude": -122.042
    }
}