{
    "job": {
        "title": "100% REMOTE Machine Learning Engineer - Python, AWS",
        "industry": "Computer Software",
        "description": "If you are a Machine Learning Engineer with Python & AWS experience, please read on! Job Title: Machine Learning Engineer - Python, AWS Job Location: Hollywood, CA - open to 100% REMOTE candidates Compensation: $120K - $140K+ base Depending on Experience plus equity! Our company develops AI based dental technology designed to identify pathological issues in real-time and with quality precision. Our company's technology recognizes and measures dental pathologies, restorative features and natural anatomy, enabling clinicians, practice owners, labs and insurers to elevate the efficiency, accuracy and consistency of dental healthcare. Top Reasons to Work with Us Competitive Compensation ($120K - $140K+ base salary DOE) plus equity! 100% REMOTE or hybrid work option Comprehensive benefits package including stock options, medical/dental/vision benefits, 401K, & unlimited vacation policy Technical ownership - The chance to join an early HealthTech startup team and help scale our infrastructure! Our series A funding was led by Top VCs including David Sacks from Craft Ventures! What You Will Be Doing Design, develop, and maintain new features and improvements for our existing machine learning applications Interface with the machine learning and product teams to design and build new applications which serve our core product set Work with big data for machine learning applications and write optimized queries for the same Work with the machine learning team to define and enforce data collection standards Work with engineering to improve and maintain a rapidly growing datastore Perpetually work to identify and improve usability in all of our applications What You Need for this Position B.S., M.S. or Ph.D. degree in computer science or a related field with 3+ years of experience with the following: Python Experience building automation tools, preferably for Machine Learning applications SQL and the ability to write efficient, performant queries Linux Amazon Web Services (AWS) Open source frameworks like Tensorflow, TFX, PyTorch, Caffe etc. Docker Preferred Medical Imaging experience CPU / GPU optimization experience Kubernetes experience So, if you are a Machine Learning Engineer with Python & AWS experience, please apply today! or send an updated copy of your resume to Mike.Vandenbergh@CyberCoders.com for immediate consideration! Email Your Resume In Word To Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also: Mike.Vandenbergh@CyberCoders.com Please do NOT change the email subject line in any way. You must keep the JobID: linkedin : MV1-1642119 -- in the email subject line for your application to be considered.*** Mike Vandenbergh - Lead Recruiter - CyberCoders Applicants must be authorized to work in the U.S. CyberCoders, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire. CyberCoders will consider for Employment in the City of Los Angeles qualified Applicants with Criminal Histories in a manner consistent with the requirements of the Los Angeles Fair Chance Initiative for Hiring (Ban the Box) Ordinance.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-19T00:00:00.000Z"
    },
    "company": {
        "name": "CyberCoders",
        "link": "https://www.linkedin.com/company/cybercoders"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "West Hollywood",
        "region": "CA",
        "postal_code": "90069",
        "street_address": null,
        "latitude": 34.090683,
        "longitude": -118.37175
    }
}