{
    "job": {
        "title": "Senior Product Engineer - RF / MEMS - Test Validation",
        "industry": "Information Technology and Services,Computer Software,Financial Services",
        "description": "If you are a Senior Product Engineer with RF or MEMS experience, please read on! We are an established Digital Micro Switch technology company creating a scalable product development platform to create ground-breaking changes in high-powered switching applications in the world of Industrial Power Electronics, Communications and Internet of Things (IoT). Our product in 99x more reliable and functional than the competition, and we guarantee our product up to 3 BILLION cycles. No other product/company out there comes close to this kind of guarantee on switching products. Top Reasons to Work with Us We are now in a phase of significant growth, doubling the company as we move to our Series C round of funding, and are on target to triple our revenue quarter-over-quarter. What You Will Be Doing Innovation and problem solving in RF Power Systems manufacturing, test, quality, & supplier assessment and development Analyze manufacturing test data to drive design improvements of HW or test automation to improve yield Interface as the central resource with design, test, application, software and marketing teams as the product(s) move from design to completion and distribution product engineering tasks such as studies and reviews on quality as well as driving yield improvement and cost reduction projects Developing production and characterization test specifications yield enhancement, test time reduction What You Need for this Position Detailed knowledge and experience with RF or MEMS switches Test Validation Semiconductor Yield Analysis Product Characterization MEMs manufacturing yield improvement Switches Rf Analog Ic So, if you are a Senior Product Engineer with RF or MEMS experience, please apply today! Email Your Resume In Word To Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also: Richard.Marion@Optello.com Please do NOT change the email subject line in any way. You must keep the JobID: linkedin : RM2-1636217 -- in the email subject line for your application to be considered.*** Richard Marion - Recruiting Manager - Optello Applicants must be authorized to work in the U.S. Optello is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-31T07:12:13.000Z"
    },
    "company": {
        "name": "Optello",
        "link": "https://www.linkedin.com/company/optello-us"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Irvine",
        "region": "CA",
        "postal_code": "92717",
        "street_address": null,
        "latitude": 33.68591,
        "longitude": -117.82472
    }
}