{
    "job": {
        "title": "Software Engineer",
        "industry": "Marketing and Advertising,Information Technology and Services,Computer Software",
        "description": "Our Company Changing the world through digital experiences is what Adobe’s all about. We give everyone—from emerging artists to global brands—everything they need to design and deliver exceptional digital experiences! We’re passionate about empowering people to create beautiful and powerful images, videos, and apps, and transform how companies interact with customers across every screen. We’re on a mission to hire the very best and are committed to creating exceptional employee experiences where everyone is respected and has access to equal opportunity. We realize that new ideas can come from everywhere in the organization, and we know the next big idea could be yours! The Opportunity Do you thrive on solving hard problems at scale? Do you want to build cloud-native systems that work seamlessly across devices? Are you interested in defining the future of marketing by making it fast, fun, and frictionless to create and deliver Marketing Campaigns? Most of all, are you passionate about helping enterprise improve user experience. We are a team of passionate storytellers, technology innovators, and change agents. We build infrastructure to enable our clients in providing the best user experience to their customers. Building on success of Adobe Experience Platform, we provide solutions to build tools that allows them to reach and communicate with end-users What Will You Do Build, Develop, Test & Deploy micro-services for Marketing tools Design Services that scale horizontally, perform at high throughput and low latencies. Participating in all aspects of software development activities, including design, coding, code review, unit/integration testing, bug fixing, and code/API documentation. Working in cross-functional teams to ensure superb end-to-end user experience for customers. Fast prototyping of ideas and concepts and researching latest industry trends. What You Need To Succeed BS + 4 yrs experience or MS + 2yrs experience in Computer Science or relevant field Experience building web services in Java/Scala, RESTful API's Experience in web server technologies: HTTP servers, . Experience working with streaming technologies like Kafka. Experience using NoSQL datastores, and data access patterns and strategies. Experience building highly scalable and performance focussed applications Proven ability to develop robust, efficient, high-quality code. Ability to troubleshoot and resolve problems using appropriate tools and techniques. Knowledge of modern development patterns: Agile, CI/CD, Kubernetes, micro-services achitecture Knowledgeable of secure, scalable, and highly available service development practices. Team player with a thirst to learn, sense of urgency, and ownership, and thrives in a fast-paced environment. Excellent written and verbal communication skills. Ability to learn quickly and adapt to changing priorities and requirements Self-starter requiring minimal direction",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-15T22:01:21.000Z"
    },
    "company": {
        "name": "Adobe",
        "link": "https://www.linkedin.com/company/adobe"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 48,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "San Jose",
        "region": "CA",
        "postal_code": "95148",
        "street_address": null,
        "latitude": 37.334793,
        "longitude": -121.888145
    }
}