{
    "job": {
        "title": "Sr. Site Reliability Engineer",
        "industry": "Information Technology and Services",
        "description": "As a SRE you are a bridge between development and operations by applying a software engineering mindset to infrastructure services. The SRE is focused on the overall reliability and availability of the enterprise cloud and must understand complex enterprise networks, their dependencies, design, and build. The SRE will identify and reduce manual processes and apply industry incident management, change management, and DevOps concepts. You will be part of a small family and have huge impact on their opportunities for growth. Job Responsibilities: Maintain service stability and reliability by working with internal teams and external vendor partners Have a complete understanding of operational tools and concepts, such as alerting, monitoring, logging, and health checks Work with and lead other team members by staying informed of industry innovation, knowledge transfer, and develop team members Identify opportunities for system improvement and process improvement and partner vendors Design, plan, build, and implement monitoring tools that promote visibility, transparency, and early detection in a complex technical environment Ability to handle multiple priorities and troubleshoot complex issues quickly and successfully Partner with ITSM Sr. Manager on post-incident reviews by putting actions into place to prevent recurring incidents Be a technology evangelist for the organization Participate in on-call rotation for level 3 support escalations Required Qualifications: 2-3 years of experience on any cloud platform Hands on experience of writing code in C#, .net or Java, Heavy SQL, SSRS Solid understanding and experience in data structures, algorithms, and software design Experience with virtual VPN connectivity, network ports, and firewalls Experience in troubleshooting relational databases and distributed platforms Highly skilled in identifying performance bottlenecks, identifying abnormal system behavior, and resolving root cause of service issues Experience in Incident Management and ITIL Service Operations Must be able to work in a collaborative cross-functional team environment Strong interpersonal skills Understanding of the CI/CD lifecycle Working knowledge of source control systems such as git Preferred Qualifications: AWS Certification as Cloud Practitioner, Architect Associate, Developer Associate Experience working with globally distributed teams Enjoys mentoring and guiding teammates Experience working with healthcare technologies ITIL Foundations certification We are looking for someone who is local to the Lynchburg, VA metro ideally and may consider remote candidates.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-02T13:37:46.000Z"
    },
    "company": {
        "name": "Charter Solutions",
        "link": "https://www.linkedin.com/company/charter-solutions"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Lynchburg",
        "region": "VA",
        "postal_code": "24503",
        "street_address": null,
        "latitude": 37.414345,
        "longitude": -79.1432
    }
}