{
    "job": {
        "title": "Account Manager",
        "industry": "Chemicals,Plastics",
        "description": "Are you interested in joining a winning team? A team whose employees are empowered to make a difference? Our culture is one of honesty, integrity and transparency with an emphasis on safety, health and environmental performance. On our team people are acknowledged for embracing new ideas that help create real value for customers. Let’s get there together. INEOS Composites is a global chemicals business with sales volume of 320 kte and revenue in excess of $1 billion. The Composites business has 6 manufacturing operations in the US, 1 in Brazil, 4 in Europe, 2 in China along with offices and headquarters in Ohio, Barcelona and Shanghai. The Composites Business primary products include unsaturated polyester resins (UPRs), vinyl ester resins (VERs) and gel coats. INEOS has an exciting opportunity for an Account Manager to join our INEOS Composites business. This role will act as the voice of the customer to the organization, and also the voice of the organization to the customer, Grow profitable sales in their assigned territory/accounts. Primary role to negotiate contracts/sales agreements with existing and prospective customers, utilizing sales management resources, where necessary. Single point of accountability for the customer interface. **The ideal candidate will be based in NC and will be responsible for portions of TN, NC, SC, GA, WV, VA. Responsibilities include: Maintain existing sales and identify new opportunities •          Gain knowledge of customer’s business •          Develop key relationships at all level of customer •          Identifying customer expectations and matching them to Ineos capabilities •          Utilize internal systems to develop an offer and prepare for customer negotiation. •          Successfully negotiate sales agreements, utilizing sales management resources, where necessary Meet established annual objectives to deliver volumes and margins for their assigned territory •          Ability to effectively utilize Ineos forecasting tools •          Negotiate pricing at market-based accounts •          Develop realistic forecasts •          Clear understanding of customer’s markets that could affect forecast/delivery of plan •          Monitor results and develop options for management consideration of corrective action •          Identify market conditions and competitive activity affecting plan delivery. Develop/maintain strong customer relationships, and increase customer loyalty and customer satisfaction. •          Become a source of industry information to the customer •          Listen to customer needs/concerns and recommend timely solutions •          Be proactive, not reactive to market conditions, •          Communication, communication, communication •          Encourage Ineos to provide an “easy to do business with environment” •          Utilize Ineos resources appropriately to continuously create value in the customer relationship Ensure customer responsibilities of relationship are met •          Accurate and timely input of forecasts/order placement •          Payment of invoices within established terms •          Increase utilization of rail fleet, by ensuring timely release of railcars from customer’s facilities. The ideal candidate will possess the following: Bachelor’s degree A minimum of 5 years of value added selling ideally within the chemical industry. Knowledge of gel-coats, fiberglass, polyester resin is strongly desired. Ability to listen and develop solutions Strong relationship building ability",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-25T17:24:28.000Z"
    },
    "company": {
        "name": "INEOS Composites",
        "link": "https://www.linkedin.com/company/ineoscomposites"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Charlotte",
        "region": "NC",
        "postal_code": "28241",
        "street_address": null,
        "latitude": 35.223785,
        "longitude": -80.84114
    }
}