{
    "job": {
        "title": "Data Scientist",
        "industry": "Computer Software",
        "description": "Keap liberates and empowers entrepreneurs to strengthen families, communities and economies. Our leading Sales and Marketing Automation platform is built on 20 years of experience working with over 200,000 entrepreneurs to grow sales and save time in the process. We're growing fast and have big goals. At Keap, we help small businesses succeed. We don’t just say that, we mean it and we do it every day. We want you to bring the hustle, grit, and passion to everything you do here. You will be expected to take high ownership and improve yourself constantly. You will be held accountable to our 7 Core Values and will be expected to hold your teammates accountable as well. The values are what unify us and allow us to make the impact that we do. They are crucial in our mission to become the undisputed champion of small business success. Together...we will replenish the middle class, we will elevate the worldwide economy, we will inspire kids to dream of becoming entrepreneurs. The Role As a Data Scientist at Keap, you will apply statistical methods to solve problems, improve decision making, and help our business grow. This includes defining business problems, wrangling relevant data, feature engineering, developing models, productionizing models, monitoring model performance, and sharing findings with our business partners. The Team The Data Science & Analytics team works closely with multiple teams across Keap. We build systems to ensure accurate reporting and provide useful analysis to our business stakeholders. We also support experiments across the company and build data products, including predictive models that are used for decision making. Responsibilities Identify opportunities across the business and in our products for data science solutions to provide value. Build those solutions leveraging: Your expertise in statistical modeling and machine learning Domain knowledge Our in-house data infrastructure or external data sources Appropriate tools Maintain and improve our data infrastructure, re-use where possible. Sound data analysis to extract actionable insights for stakeholders and to inform future projects. Qualifications 3+ years of experience doing quantitative analysis, preferably for a technology company on a Business Intelligence, Marketing, Product, Customer Service or Data Science team. Ability to frame business problems in terms of data science solutions. Ability to work effectively with stakeholders to build relationships across departments. Ability to explore data independently, and develop models in Python (or equivalent, say R). Can work quickly to develop a proof of concept. Strong knowledge of statistics, inference, and machine learning. Awareness of background assumptions and limitations of data. Ability to present analysis findings to both technical and non-technical audiences and to write up analysis results. Experience writing maintainable code in Python/R or other languages, proficiency in SQL. Experience with Data Visualization tools (we use Looker). Knowledge of GCP is a plus. Intellectually curious, open to learning and teaching others. Interest in Bayesian methods or causal inference is a bonus. Formal training in Math, Physics, Statistics, Economics, Computer Science, or another quantitative field. This position is located at our Chandler, AZ office at 1260 South Spectrum Blvd. Chandler AZ 85286 At Keap, we celebrate diversity and inclusion for the benefit of our employees, our products, our community, and to help small businesses succeed. We do not discriminate based on race, color, ethnicity, ancestry, national origin, religion, sex, gender, gender identity, gender expression, sexual orientation, age, disability, veteran status, marital status or any legally protected status.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-24T01:51:37.000Z"
    },
    "company": {
        "name": "Keap",
        "link": "https://www.linkedin.com/company/keap-growing"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Chandler",
        "region": "AZ",
        "postal_code": "85226",
        "street_address": null,
        "latitude": 33.302284,
        "longitude": -111.8401
    }
}