{
    "job": {
        "title": "Data Scientist",
        "industry": "Telecommunications",
        "description": "Company Description B-Yond develops AI-based network automation software, delivered via an open platform, enabling Telcos to embrace web scale operational models as they move to 5G and Edge Cloud. Job Description Data Science – Computer Vision: You will be working with an enthusiastic team of sports aficionados and a professional league team in developing the next generation of analytics and computer vision based machine learning models for an immersive player experience to elevate their game to the next level. You will be making an impact for player development and the coaching process at the highest level of sports. What success looks like... Success will be measured by your ability to participate in additional B.Yond projects, by contributing towards our IP portfolio and working with our innovation team while still ensuring customer satisfaction. What makes it rewarding… It is a good opportunity to expand in new emerging technologies. Being a part of this rising company will lead you to empower yourself and become a part of this journey by helping you develop new innovative skills and pushing your limits. Qualifications The values we share… DREAM B-YOND. Forward-Thinking, Creative, Boldly Imaginative. Be AUTHENTIC. Transparent, Genuine, Self-Confident. DEBATE ANYONE. Fearlessly Vocal, Intellectually Stimulating, Thoughtfully Contrarian. B-UNSTOPPABLE. Resilient, Relentlessly Driven, Persistent. CARE to CREATE WISDOM. Non-judgmental, Thoughtful, Empowering. The Skills and Background You Will Bring... Master’s degree in Computer science, Statistics, Mathematics, or related fields and academic training in Machine Learning/Deep learning Proficiency in Python, Open CV, Computer Vision techniques and Image Processing Knowledge of C++. Geometric math knowledge as related to Computer Vision. 2 years experience in hands on coding machine learning models and dealing with image data Experience with Tensorflow, Pytorch, Opencv Project experience with deep learning algorithms with computer vision Experience using version control. Additional Information When applying for the job, take the opportunity to tell us in five sentences or less what makes you the best candidate for this position and for our company, and why B-Yond is a fit for you. Please Note: This job description is not intended to be a complete list of all responsibilities, duties or skills and due to the changing nature of the job is subject to review and change at any time, with or without notice. B-Yond uses E-verify and third party background check services, including drug screening, as part of the hiring process.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-05T16:49:56.000Z"
    },
    "company": {
        "name": "B-Yond",
        "link": "https://www.linkedin.com/company/b-yond"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Greater Phoenix Area",
        "region": null,
        "postal_code": "85003",
        "street_address": null,
        "latitude": 33.44547,
        "longitude": -112.06631
    }
}