{
    "job": {
        "title": "Application Engineer",
        "industry": "Electrical/Electronic Manufacturing,Construction,Mechanical or Industrial Engineering",
        "description": "Job Summary Client located just west of Chicago is looking for an Applications engineer in the automation industry. This individual will have experience with automated systems primarily in the Material Handling field. This individual will be the technical liaison between sales and the customer. Salary will be based on experience. Bachelors in Engineering Experience designing automated systems Experienced in Microsoft products location: Melrose Park, Illinois job type: Permanent salary: $70,000 - 100,000 per year work hours: 8am to 4pm education: Bachelors Responsibilities Develop Automated Systems used in the material handling industry Create proposal documents that fully describe and define the solution. Compile, review, and process incoming information and specifications for new projects. Assist Sales Engineers and our customers by answering technical questions related to our products. Review and integrate internal documents. Qualifications Experience level: Education: Bachelors Skills Electrical Engineering Electrical Engineering Controls Manufacturing Robotics PLC Electrical Engineering Mechanical Engineering material handling (1 year of experience is required) Equal Opportunity Employer: Race, Color, Religion, Sex, Sexual Orientation, Gender Identity, National Origin, Age, Genetic Information, Disability, Protected Veteran Status, or any other legally protected group status.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-20T06:12:42.000Z"
    },
    "company": {
        "name": "Randstad USA",
        "link": "https://www.linkedin.com/company/randstadusa"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 12,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Melrose Park",
        "region": "IL",
        "postal_code": "60164",
        "street_address": null,
        "latitude": 41.89343,
        "longitude": -87.85661
    }
}