{
    "job": {
        "title": "Lead Software Engineer Director (AWS, MERN, .NET, Java)",
        "industry": "Insurance",
        "description": "Company Summary Taking care of our customers, our communities and each other. That’s the Travelers Promise. By honoring this commitment, we have maintained our reputation as one of the best property casualty insurers in the industry for over 160 years. Join us to discover a culture that is rooted in innovation and thrives on collaboration. Imagine loving what you do and where you do it. Target Openings 1 Job Description Summary Travelers is seeking a Lead Software Engineer to join our organization as we grow and transform our Technology landscape. Individual will complete expert software end to end engineering tasks including designing, developing, analyzing, configuring, testing, debugging, troubleshooting, documenting, health monitoring/alerting, and implementing based on user or system specifications for impactful and high-visibility initiatives. Individual will also plan and execute at a strategic level, lead the design, development and implementation of significantly complex, unscoped problems that extend beyond the confines of a team and establish software engineering best practices and standards. Primary Job Duties & Responsibilities Set technical direction and effectively influences across multiple teams to improve the overall quality of engineering practices and skill sets. Align work with business and engineering priorities to realize meaningful impact. Build, maintain, and utilize partnerships ensuring the best use of overall resources. Provide technical leadership, foster a team environment, and provide mentorship and feedback to technical resources. Apply knowledge of current industry trends and techniques to formulate solutions within the context of assigned efforts. Ensure team's work complies with Travelers standards, processes, and protocols. Provide consistent performance feedback and coaching to staff. Seek opportunities to expand technical knowledge and capabilities. Minimum Qualifications Bachelor's degree in Computer Science or a related field, or its equivalent in work experience. Five years of programming/development experience. One year of experience of technical leadership. Education, Work Experience, & Knowledge Seven years of programming/development experience plus two years prior technical leadership experience preferred. Job Specific Technical Skills & Competencies Preferred experience with public cloud (preferably AWS). Preferred experience with MERN stack. Preferred experience developing services using .NET or Java, using REST framework. Preferred experience with Mulesoft. Delivery Advanced delivery skills including the ability to examine and assess the effectiveness of software design strategies and methodologies across an organization, the ability to devise, apply, and share ways to ensure the quality, production readiness, and continued health of complex computer systems, the ability to incorporate awareness and understanding of work happening outside of the team, and the ability to develop widely used technical metrics that enable engineers to better understand and deliver their work. Domain Expertise Demonstrated track record of domain expertise including the ability to leverage expertise to improve company level capabilities within domain, consult on business priorities and optimize value by identifying business aligned solutions and thoughtfully and practically introduce concepts and technologies from the industry. Problem Solving Strong problem solver who creates architecture that is particularly robust against single points of failure, both in terms of systems and people and looks ahead 6-12 months to identify areas of need and turns this into action. Communication Strong communicator who possesses the ability to describe technology concepts in ways the business can understand, document effectively so that systems/architectures can be maintained or built upon, collaborate across disparate groups, helping to identify common goals and gain consensus, adapt language to meet the needs of various levels of technical and non-technical audiences and model and assist others in the practice of mindful communication, active listening, and messaging. Leadership Advanced leadership skills including the ability to leverage internal networks across engineering and engage with other leaders to solve problems and develop strong credibility throughout the company as well as choose the most critical engineering challenges and work to improve the entire engineering organization by teaching others and sharing knowledge while creating opportunities for others to showcase and develop skills. Employment Practices Travelers is an equal opportunity employer. We value the unique abilities and talents each individual brings to our organization and recognize that we benefit in numerous ways from our differences. If you are a candidate and have specific questions regarding the physical requirements of this role, please send us an email so we may assist you. Travelers reserves the right to fill this position at a level above or below the level included in this posting.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-14T17:04:21.000Z"
    },
    "company": {
        "name": "Travelers",
        "link": "https://www.linkedin.com/company/travelers"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 84,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Hartford",
        "region": "CT",
        "postal_code": "06156",
        "street_address": null,
        "latitude": 41.765774,
        "longitude": -72.673355
    }
}