{
    "job": {
        "title": "Data Scientist",
        "industry": "Staffing and Recruiting",
        "description": "Are you a Senior Data Scientist that wants to work in one of the hottest startups in NYC right now? A company that was just voted one of the best places to work for in NYC? How about being part of a close knit Data Science team, building the infrastructure for Machine Learning models to run off? Sounds awesome right! Keep reading... What's The Job? As the first Senior Data Scientist at you'll help reinvent how people shop by building machine learning-based recommendations systems using large amounts of data to predict user behavior. This is a highly visible and impactful role and you will be collaborating daily with the data engineering team, product teams and other functional areas. Who Are We? We create 'white-label' personalized e-commerce solutions for our clients to achieve predictable and recurring revenue. We enable our clients to move away from transactional commerce, and instead offer a true relationship commerce that their customers can't live without. We are 75+ team members right now, and are looking to scale to over 100 in the next 12 months as our growth / client acquisition demands it. We are located in downtown Manhattan, close to all the major subway lines. What Skills Do You Need? • 3+ years of experience in a data science role helping companies innovate products forward using machine learning • Excellent knowledge of Machine Learning/Statistical Modeling & Testing • Python • MA/MS in statistics, mathematics, computer science, economics, or another quantitative field Nice to haves: • Experience with R • Experience with GCP, Spark • E-Commerce experience • SaaS experience Compensation • $130k - 180k base salary. • Fully Remote • Substantial stock grants. • Awesome benefits package including unlimited PTO! • Lots of company wide outings and perks to keep things fun!",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-20T14:50:03.000Z"
    },
    "company": {
        "name": "Averity",
        "link": "https://www.linkedin.com/company/averity"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "New York City Metropolitan Area",
        "region": null,
        "postal_code": "10021",
        "street_address": null,
        "latitude": 40.748295,
        "longitude": -73.98556
    }
}