{
    "job": {
        "title": "Data Scientist",
        "industry": "Information Services,Information Technology and Services",
        "description": "Core Responsibilities: Development and implementation of state of the art statistical and machine learning models to enable predictive and prescriptive strategies Develop and improve performance models using machine learning for any instrumented piece of equipment and buildings, including specific components/subsystems (compressors, heat exchangers, pumps, coils and/or fans). Develop and enhance data driven models to support building models calibration, uncertainty and sensitivity analyses. Develop and implement forecasting and prediction strategies, to enhance the quality of physics based models. Provide recommendations and selection on the optimized data visualization capabilities, for a given data set Test and evaluate the quality of algorithms using statistical methods. Interface with engineers and modelers to create and improve understanding of predictive and descriptive models. Network across the organization to identify and communicate opportunities to apply data science and machine learning to product design and processes Mentor and guide other team members and colleagues in the domain area. Promote the use of data based modeling and simulation within the organization via value benefit analysis and similar demonstrations. Develop and maintain external collaborations to build and leverage cutting-edge capabilities. Participate and present in internal and external forums and conferences, related to data science and analytics. Document work per established internal standards and suggest improvements to procedures. Develop a clear understanding of customer requirements and meet or exceed those expectations. Conceptualize & develop project ideas leading to new advanced capability development in related domain areas to keep TT to the leading edge of technology. Lead internal tactical and strategic projects and reports project progress for quality, deliverables and cost. Potential future travel up to 5-10% Qualifications: Master's Degree in Mathematics, Computer Science, Data Science or Statistics 3+ years of experience applying data-driven modeling Demonstrated work or educational history in engineering and/or engineering related disciplines, including but not limited to differential equations, heat transfer, electrical engineering, controls, HVAC, IoT or embedded technologies highly preferred Leadership experience is a plus Key Competencies: Intermediate knowledge in at least two of the following technologies: R, Python, SQL, MATLAB and ability to adapt to new technologies, as necessary. Familiarity with tools such as Alteryx, SAS, Tableau, RapidMiner is a plus. Understanding of engineering data and physics-based models and simulations. Sufficient knowledge of machine learning modeling techniques, and experience visualizing model outputs for engineers, customers and stakeholders. Communicate compellingly. Convert insights from analytics to stories. Be an advocate for data science and machine learning, and how to create new capabilities and drive transformation. Experience in statistical inference, unsupervised machine learning, supervised machine learning, reliability/survivability models, and/or predictive maintenance. Basic experience with neural nets, cross validation, hyperparameter tuning is desired. Good understanding of large-scale data mining and machine learning techniques for clustering, classification, regression, and anomaly detection. Ability to manipulate and visualize both structured and non-structured datasets. Advanced knowledge of database systems including relational, column store and data marts Strong written & verbal English communication skills to interface effectively with team members, customers and stakeholders (senior leaders) in North America and other parts of the world.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-15T17:10:01.000Z"
    },
    "company": {
        "name": "ManpowerGroup",
        "link": "https://www.linkedin.com/company/manpowergroup"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Minneapolis",
        "region": "MN",
        "postal_code": "55440",
        "street_address": null,
        "latitude": 44.977486,
        "longitude": -93.264366
    }
}