{
    "job": {
        "title": "Sr Field Thermal Engineer",
        "industry": "Computer Hardware,Electrical/Electronic Manufacturing,Information Technology and Services",
        "description": "Are you ready for a change? At ZT Systems, we put People First, and from day one our team members make a difference. A fast-growing key player in a multibillion-dollar market, ZT designs and builds hyperscale compute and storage solutions for the world’s largest datacenter customers. We are passionate about teamwork, and the consistent high quality of our solutions differentiates us in the minds of our customers. Here at ZT, we recognize hard work, commitment, leadership, and results, and we truly believe that behind every quality solution is a team of highly talented individuals. Join us and become part of an industry-leading team that transforms ideas into reality. About The Role The Field Thermal Engineer is responsible for assisting in the development of key thermal components & systems from concept to engineering release of new products. The focus is on running server system thermal tests using data acquisition equipment, thermal stress test software and external power control equipment. The thermal engineer troubleshoots thermal and/or airflow issues in new and existing product lines using empirical data and commercial CFD software. The Thermal engineer plays an active role in developing thermal components using 3D CAD software and advanced engineering analysis. In addition, the thermal engineer provides regular Q&A and on-site support to ZT Systems’ manufacturing engineering group as well as technical support for customers. What You Will Do Support engineering team by loading, testing and validating thermal solutions for rack mount servers Troubleshoot thermal and/or airflow issues in new and existing product lines Work with the engineering team to optimize thermal performance of servers using empirical data and bench test methods Optimize airflow speed, volume and flow paths to meet customer and components requirements Support custom engineering projects that require hands on ability to interconnect complex server systems Produce thermal reports from experimental data and testing/modeling experience Coordinate ECO (Engineering Change Order) process for and provide validation for design modifications Analyze and solve technical problems/issues in a fast paced environment Produce engineering documents that include design drawings, installation manuals, etc. Support procurement team to identify and manage 3rd party vendors What You Bring BS or MS in Mechanical Engineering Minimum 3 years of experience in a similar role or relative internship experience Basic knowledge of heat transfer and fluid mechanics Commercial CFD Software skills (FloTherm preferred) 3D CAD Software skills (SolidWorks or ProE) Advanced engineering analysis ability (stress, fatigue, vibration) LabVIEW skills preferred Solid background in manufacturing environment Proactive, team oriented and results driven mindset ZT Systems offers a highly competitive salary commensurate with work experience and/or education, an excellent benefits program that includes a 401(k) plan, health and dental insurance, and paid time off. We are an Equal Opportunity Employer (EOE) and do not discriminate against otherwise qualified applicants on the basis of race, color, creed, religion, ancestry, age, gender, marital status, national origin, disability [i] or handicap, or veteran status. ZT Systems is a Drug-Free Workplace.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-24T01:16:45.000Z"
    },
    "company": {
        "name": "ZT Systems",
        "link": "https://www.linkedin.com/company/zt-systems"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Seattle",
        "region": "WA",
        "postal_code": "98133",
        "street_address": null,
        "latitude": 47.60323,
        "longitude": -122.33028
    }
}