{
    "job": {
        "title": "Senior Scientist (Enzymology)",
        "industry": "Biotechnology",
        "description": "Pacific Biosciences is seeking a Scientist/Senior Scientist (level commensurate with experience) to work in an interdisciplinary team developing biochemical reactions for our DNA sequencing system. Duties primarily include laboratory work along with experimental design, data analysis, and presentation of results with limited supervision. Candidates experienced with DNA-protein or RNA-protein complexes and/or polymerases will be given priority. As they design and interpret experiments at PacBio, the Scientist will be able to draw on a rich collection of single-molecule, mutational, structural and biochemical studies. Position Requirements: PhD in Biochemistry, Molecular Biology, Biophysics, or a related field Technical proficiency in general laboratory practices and record keeping Experience with biochemical assay development and execution Ability to manage multiple projects simultaneously Effective communication and the ability to work within a collaborative team environment High level of curiosity and a desire to learn more about the fundamentals of biochemical reactions and enzyme function Applicants, please answer the following in your cover letter: Describe an exciting scientific problem that you have worked on and what aspects of it you found most appealing. What aspects of PacBio technology are you most interested in? All listed tasks and responsibilities are deemed as essential functions to this position; however, business conditions may require reasonable accommodations for additional tasks and responsibilities. All qualified applicants will receive consideration for employment without regard to race, sex, color, religion, national origin, protected veteran status, or on the basis of disability, gender identity, and sexual orientation.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-30T23:59:16.000Z"
    },
    "company": {
        "name": "Pacific Biosciences",
        "link": "https://www.linkedin.com/company/pacific-biosciences"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Menlo Park",
        "region": "CA",
        "postal_code": "94029",
        "street_address": null,
        "latitude": 37.45322,
        "longitude": -122.18322
    }
}