{
    "job": {
        "title": "Global Revenue Management Data Scientist",
        "industry": "Machinery,Mechanical or Industrial Engineering,Human Resources",
        "description": "Job Description Principle Accountabilities Analyze and make recommendations on all facets of the strategic revenue management framework through the sales, marketing, business support and finance organizations in targeted KCP markets. Lead change management plans and execution with all levels of appropriate functions within the $3.5B KCP business Lead the development of insight lead capability change plans to ensure a successful price model evolution. Ensure organizational visibility into pricing execution progress and ongoing success to the pricing strategy. Engage necessary stakeholders throughout the organization to develop recommended path forward to accelerate implementation, remedy issues, and/or seize opportunities. Collaborate with KCP business support organization to drive appropriate development and define tactical execution plans as it pertains to revenue optimization strategy changes. Provide advice, counsel, and financial/business expertise to KCP regional VP’s, regional revenue transformation leaders, regional sales leaders, country managers, and finance to enhance good decision making and maximize sales and corresponding operating profit. Develop plans and manage the process to build the capabilities of regional and country sales around the concepts of more effective revenue management, with a particular emphasis on price action. Provide input to the optimal design of growth incentive and sales incentive plans across each region to maximize ROI. Ensure application of established corporate financial & internal controls within his/her area of responsibility. Communicate fully with superiors, subordinates, peers and others who have a need to know. Be informative without being obtrusive or vexatious. Communicate in a way that is timely, yet prompt; complete, yet concise; and clear, yet responsive. Willingness and ability to travel internationally up to 25% of the time. Qualifications/Experience Masters of Science in Data Analytics/Applied Statistics or a related field required 3+years of business analysis role using latest data mining and analysis techniques. B2B experience is preferred but not required Either Business Analysis, Pricing or Management Consulting background preferred with a combination most desirable. Ability to work across the business tool landscape particularly with SAP, Microsoft Office and advanced excel features such as Micro and Power Pivot. Preferred Skills Strong analytic and data mining skills. Proven experience using Tableau, Power Pivot; data extraction tools such as SQL and statistical analytic tools such as R, SAS or SPSS Must have strong written and verbal communication skills and appropriate executive presence required for effective interactions with senior members of the KCP Global leadership team and regional sales leadership. Bring your fresh perspectives to work The world is changing before our eyes, and we are out there, ready to hit every curve ball that comes our way. Your input, insights, ideas, and perspectives will make you an important part of our success. We support diversity by empowering all employees to shape their futures and ours through promotion and personal growth. If you have an open, exploratory mind, get in touch. Global VISA and Relocation Specifications: Primary Location USA-GA-Atlanta-Roswell Additional Locations Worker Type Employee Worker Sub-Type Regular Time Type Full time",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-09-02T06:03:00.000Z"
    },
    "company": {
        "name": "Kimberly-Clark",
        "link": "https://www.linkedin.com/company/kimberly-clark"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Roswell",
        "region": "GA",
        "postal_code": "30076",
        "street_address": null,
        "latitude": 34.021652,
        "longitude": -84.36167
    }
}