{
    "job": {
        "title": "Test and Evaluation Engineer",
        "industry": "Aviation &amp; Aerospace",
        "description": "ASEC is currently searching for a Test and Evaluation (T&E) Engineer that requires the demonstrated knowledge and ability to apply basic theory and technical procedures to non-standard and routine applications. The work requires selection and application of standard engineering techniques, procedures, and criteria, using judgement and ingenuity in making minor adaptations and modifications. The T&E Engineer will perform work which involves conventual types of plans, investigations, surveys, configurations, or equipment. The IDEA Lab is developing a software system called the Distributed Training Network Guard (DTNG). This system is a controlled interface whose purpose is to bridge simulation training enclaves while segregating and protecting data on a need-to-know basis. The system software includes several executables that validates and verifies the simulation training data against data format specifications and rule sets that determine if the simulation data may be passed as received, passed with changes per the rule set, or blocked from passing to the receiving enclave. These assessments are made in both directions. The data format specifications and rule sets are developed by DTNG software developers in accordance with the customer’s requirements and security classification guides. Requirements Education: Bachelor’s degree in Engineering, or equivalent technical degree from an ABET-accredited institution. Experience: Four (4) years of experience in test and evaluation. Preferred direct experience in one or a combination of the following areas: training systems, aircraft system/subsystem development test and evaluation, or software and hardware for software application development. Required Clearance: This position is subject to a government security investigation and must meet eligibility requirements for access to classified information. This position requires an ACTIVE SECURITY CLEARANCE. Tasks and Responsibilities: Responsible for the overall verification and validation of the software system as well as the DTNG rule set software. Develop and document Software Acceptance Test Plan for customer rule sets and DTNG software system. This includes all test phases from initial software development lab-based testing using test tools and harnesses, and the integration testing with the actual training devices. Develop and document detailed software test procedures for rule sets and DTNG software system. Test procedures must be written in detail from initial software development lab-based testing to all software requirements using test tools and harnesses. Test tools and harnesses included GOTs products such as Next Generation Threat System (NGTS) scenarios as well as IDEA lab developed tools and programs. Integration test procedures to be used in the training environment with actual training devices will also need to be written. Rule set test procedures must be written in such detail so as to verify all possible rule decision paths have been covered. Create simulation scenarios for the test tools/harnesses to drive test procedures. Document the test case traceability to the requirements specifications to ensure all requirements have adequate coverage. Work with Development team as well as training device owners to schedule testing resources. Develop test verification and validation schedules to ensure adequate access to required personnel and training assets for all testing phases. Testing resources range from in-house lab resources to off-site distributed training centers ono base. Document test results in detail, creating a body of evidence for system and rule set assessment and authorization by a third-party evaluator. Traceability of results to log files from all tools and harnesses used within the test is required as part of the body of evidence. Prepare and present all materials required for the pre and post testing Systems Engineering Technical Review (SETR) events (i.e., Test Readiness Review, System Verification Review). Provide T&E input to other SETR events (e.g. System Requirements Review, Preliminary/Critical Design Review) as required. Skills and Qualifications: Excellent verbal and written communication skills. Excellent interpersonal and customer service skills. Detail oriented. Ability to organize and prioritize tasks. Demonstrated critical thinking and problem-solving skills. Proficient with Microsoft Office Suite to include: Outlook, Excel, Word and PowerPoint. Experience utilizing software tools for engineering. Ability to adapt to evolving technology. We recruit, employ, train, compensate, and promote the most qualified persons for employment without regard to race, color, religion, sex, national origin, ancestry, age, marital status, sexual orientation, gender identity and expression, disability, veteran status, genetic information, or any other status protected by law. ASEC will not discharge or in any other manner discriminate against employees or applicants because they choose to inquire about, discuss, or disclose their own compensation or the compensation of another employee or applicant. If you’d like more information about your EEO rights as an applicant under the law, please click here: http://www.dol.gov/ofccp/regs/compliance/posters/pdf/eeopost.pdf",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-15T18:40:31.000Z"
    },
    "company": {
        "name": "Aviation Systems Engineering Company",
        "link": "https://www.linkedin.com/company/aviation-systems-engineering-company"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 48,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Orlando",
        "region": "FL",
        "postal_code": "32889",
        "street_address": null,
        "latitude": 28.53833,
        "longitude": -81.378876
    }
}