{
    "job": {
        "title": "Software Engineer",
        "industry": "Computer Software,Internet,Financial Services",
        "description": "About Us On the off chance you've thought about insurance, it's likely because you've insured something you love, not because you loved your insurance company. Metromile is out to change that. As an insurtech powered by data science and customer-centric design, we're building a community of drivers who come for the savings and stay for the experience. With technology at its core, Metromile is reimagining insurance to make it fairer and actually delightful. We're obsessed with savings, service, and features -- street sweeping alerts, monthly mileage summaries, fuel trackers and more -- that engage a customer all along their journey. We're on the forefront of disrupting a $250 billion auto insurance category that has gone unchanged for over 80 years. Metromile's diverse team combines the best of Silicon Valley technologists with veterans from Fortune 500 insurers and financial services giants. This management structure ensures that the business is focused on growth, customer experience and technology innovation while also balancing unit economics and profitability. The team is growing quickly across its San Francisco, Tempe, and Boston offices. Our customer service, claims, and sales teams are all based in-house in the US. Thanks to what makes us different -- our people and our technology -- we've been honored with a slew of awards. A few recent ones include: named a Benzinga \"Best Insurtech\" finalist, a Top Company to Work For , one of the Healthiest Employers in Phoenix , and a Best Place to Work . And, our CEO was recognized as a 2020 40 under 40 . About The Role You will Work as a part of a small cross-functional team on high-impact projects across the company Collaborate closely with product and design teams to understand the needs of our users and develop solutions that serve those needs Build robust web applications using modern libraries and tooling Facilitate quality by writing unit tests and participating in code reviews Help architect a modular and easily maintainable application infrastructure using sensible and appropriate technologies Own your own microservice from the ground up as we build Metromile 2.0 backend infrastructure About You: 4+ years of hands-on development experience working on consumer-facing products Experience working with Java Knowledge of relational (MySQL/Postgres) and non-relational databases Experience with Spring or other modern Java frameworks Experience with AWS and services built on top of it Understanding of SDLC and desires to improve process Nice to Have: Ability to take a project from scoping requirements through production launch Experience with JavaScript, HTML, & CSS Experience with Angular, React, Vue or other modern component-based frameworks A solid understanding of performance and efficiency concepts. A strong customer orientation What's In It For You Competitive salary Stock options for every employee Excellent benefits package (health, dental, vision, 401K) Well-being reimbursement, includes home office equipment Flexible paid vacation program Flexible scheduling/hours Remote work options 13 paid holidays - 2 of which are flex 12 paid weeks of leave for child birth/adoption Annual anniversary gifts (5 yr. - 6 week paid sabbatical) If you got to this point, we hope you're feeling excited about the role. Even if you don't feel that you meet every single requirement, we still encourage you to apply. We're eager to meet people that believe in Metromile's mission and can contribute to our team in a variety of ways – not just candidates who check all the boxes. Metromile is committed to building a diverse, inclusive and equitable culture at all levels. We nurture a sense of community by investing in one another's unique backgrounds and experiences to drive business success and positively influence our services and products. Metromile is proud to be an equal opportunity employer. We will not discriminate against any applicant or employee on the basis of age, race, color, ethnicity, national origin, citizenship, religion, creed, sex, sexual orientation, gender, gender identity, or expression (including against any individual that is transitioning, has transitioned, or is perceived to be transitioning), marital status or civil partnership/union status, physical or mental disability, medical condition, pregnancy, childbirth, genetic information, military, and veteran status, or any other basis prohibited by applicable federal, state or local law. Pursuant to the San Francisco Fair Chance Ordinance, we will consider for employment qualified applicants with arrest and conviction records.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-17T05:03:52.000Z"
    },
    "company": {
        "name": "Metromile",
        "link": "https://www.linkedin.com/company/metromile"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 48,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "San Francisco",
        "region": "CA",
        "postal_code": "94121",
        "street_address": null,
        "latitude": 37.78008,
        "longitude": -122.42016
    }
}