{
    "job": {
        "title": "Senior Campus Network Engineer",
        "industry": "Information Technology and Services,Computer Software,Internet",
        "description": "Essential Job Duties Responsible for the health and stability of the infrastructure supporting the campus networks and telephony systems. Ensure all systems are performing and functioning properly. Plan, configure, and roll out new sites and configurations. Plan, configure, and roll out upgrades and vulnerability remediation to production systems. Monitor systems to optimize performance and to initiate recovery action after system failures. Support remote locations. Work quickly, methodically, and efficiently through projects, assigned tasks, and troubleshooting of issues. Establishes and controls systems access and security. Prepares and maintains system layout documentation as well as troubleshooting guides. Point of contact and responsible for all service tickets. Evaluates network and telecommunications hardware and software. Assist with internal network issues and support where needed. Keeping up with relevant technologies, trends, and skills. Recommend and implement automation tools and workflows. Assist in training and instruction of other team members regarding technologies currently in use and being evaluated. Participate in 24x7 on-call rotation. Follow legal policies as directed. Perform other duties as required and assigned by manager and upper management. Job Requirements Solid working understanding of networking technologies and associated protocols including, but not limited to OSPF, BGP, STP, 802.11, 802.1x, DHCP, DNS, SIP, and SCCP. Solid working understanding of firewall technologies. A minimum of 3-4 years’ experience in supporting corporate networks. Experienced with configuration of various network routing and switching technologies. Experienced with VPN technologies and the ability to implement SSL VPN. Ability to perform work on network equipment that is 30+ feet above the ground. Ideal candidate is a strong team player, quality conscientious, has excellent analytical, written, and verbal communication skills, and is highly self-motivated. Skills Strong team and people skills required. Ability to work in a group and individually. Solid understanding of data/voice networking. Experienced with command line and GUI network device configuration. Experienced with Cisco Unified Communications Manager and associated technologies. Experienced with wireless and firewall technologies. Experienced with Windows, Linux, and Mac operating systems. Experienced with network technologies including, but not limited to switching, access control, voice, wireless, DNS, and DHCP. Experienced with network automation tools and techniques. Education A Bachelor’s degree in Information Technology or equivalent experience required. Certifications Certifications are not required. Physical Requirements This position requires the incumbent to sit, stand and perform general office functions. The incumbent may also be required to lift up to 25 pounds occasionally. Bending, stooping and reaching are also frequently required. Equal Employment Opportunity It is our policy to provide equal employment opportunity for all applicants and associates.  This policy includes our commitment to ensure that all employment decisions are made without regard to race, color, religion, gender, national origin, disability, pregnancy, veteran status (including Vietnam era veterans), age, sexual orientation, gender identity, or any other non-job-related characteristic protected by law. Who We Are Just a few minutes from Salt Lake City and Utah’s ski slopes, Overstock is an original resident of “ Silicon Slopes ”, one of the fastest growing technology hubs in the country. We’re a passionate group of collaborative problem solvers and creative innovators, working on cutting-edge technology. From building award-winning retail applications (with amazing AR functionality ) to creating leading blockchain and machine learning technologies, each of us embodies a unique value and contributes a diverse perspective to the team. What We Offer 401k (6% match) Flexible Schedules Onsite Health Clinic Tuition Reimbursement, Leadership Development Program, & Mentorship Program Onsite Fitness Center with group fitness classes and trainers Onsite Cafe with additional Coffee Shop and Juice Bar Onsite Greenhouse, providing fresh fruits & vegetables for our cafe Overstock Women's Network (OWN) And More… Benefits vary based on position, tenure, location, and employee election Physical Requirements This position requires you to sit, stand and perform general office functions. You may also be required to lift up to 25 pounds occasionally. Bending, stooping and reaching are also frequently required. Equal Employment Opportunity It is our policy to provide equal employment opportunity for all applicants and associates.  This policy includes our commitment to ensure that all employment decisions are made without regard to race, color, religion, gender, national origin, disability, pregnancy, veteran status (including Vietnam era veterans), age, sexual orientation, gender identity, or any other non-job-related characteristic protected by law. Back to Overstock Careers",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-27T05:34:36.000Z"
    },
    "company": {
        "name": "Overstock.com",
        "link": "https://www.linkedin.com/company/overstock-com"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Midvale",
        "region": "UT",
        "postal_code": "84047",
        "street_address": null,
        "latitude": 40.610794,
        "longitude": -111.90804
    }
}