{
    "job": {
        "title": "AWS DevOps/Site Reliability Engineer",
        "industry": "Computer Software",
        "description": "AWS DevOps/Site Reliability Engineer Location: US - Hoffman Estates IL, Austin TX, San Jose CA, Portland OR Power the Possibilities The CDK Global technology team is looking for collaborative innovators who are passionate about making their mark on emerging enterprise software products. We’re building and developing cloud technology for the automotive retail industry that will change the landscape for automotive dealers, original equipment manufacturers (OEMs) and the customers they serve. Be Part of Something Bigger Each year, more than three percent of the U.S. gross domestic product (GDP) is attributed to the auto industry, which flows through our customer, the auto dealer. It’s time you joined an evolving marketplace where research and development investment is measured in the tens of billions. It’s time you were a part of something bigger. We’re expanding our workforce – engineers, architects, developers and more – onboarding early adopters who can optimize, pivot and keep pace with ever-evolving development roadmaps and applications. Join Our Team Growth potential, flexibility and material impact on the success and quality of a next-gen, enterprise software product make CDK an excellent choice for those who thrive in challenging, fast-paced engineering environments. The possibilities for impact are endless. We have exceptional opportunities to evolve our industry by driving change through new technology. If you’re ready for high-impact, you’re ready for CDK. Role: Responsible for driving run-book automation for applications that are or have migrated to AWS. Implement solutions that support financial governance and tech debt governance that address technical or support gaps in product deployment environments. Write deployment pipelines Assist application teams with automating their production support run-books (automate everywhere) Assist application teams when they have issues using AWS services are not are fully up to speed in their use. Hands on development of automation solutions to support application teams. Define and maintain minimum application deployment standards (governance, cost management and tech deb perspective) Optimizing and tuning designs based on performance and root cause analysis Analysis of existing solutions alignment to infrastructure standards and providing feedback to both evolve and mature the solution. Essential Duties & Responsibilities: This is a hands-on role where the candidate is expected to take on technical tasks where in depth knowledge on usage and architectural best practices of AWS/public cloud technologies is important: EKS RDS Lambda Load Balancing (ALB/ELB) EC2 EBS S3 Service Meshes VPC and Availability Zone architectures AWS Identity and Access Management Scripting and development; preferred Python & Java languages Broad understanding/experience across full stack infrastructure technologies Site Reliability Engineering practices Github/Artifactory/Bamboo/Terraform Database solutions (SQL/NoSQL) Containerization Solutions (Docker, Kubernetes) DevOps processes and tooling Hypervisor (VMware) and Virtualization technologies Message queuing, data streaming and caching solutions Micro-service architecture Networking principles and concepts In depth knowledge of server based operating systems (Windows/Linux) and Web Services (IIS, Apache) Experience of designing, optimizing and troubleshooting public cloud platforms associated with large, complex application stacks Have clear and concise communication and be comfortable working with at all levels in the organization Capable of managing and prioritize multiple projects with competing resource requirements and timelines Years of Experience: 10 yrs+ working in an IT Infrastructure related role along with associated design experience. 5 yrs+ working in the AWS public cloud environment 3-5 years as a Site Reliability and/or DevOps Engineer supporting JVM-based Applications AWS DevOps Professional certification preferred Experience with Infrastructure as code (CloudFormation, Terraform) CDK Global knows you have passions outside of work. You have family, friends, sporting events, and lots of things going on. That’s why we offer a comprehensive benefits package to not only take care of you but your family as well. All of our benefits are effective the first day of employment including 401K matching, paid time off to re-energize, donate your time to volunteer in your community, and tuition reimbursement to name a few. At CDK, we pride ourselves on having a diverse workforce. We value and celebrate the uniqueness of individuals and the different perspectives they provide. We offer equal opportunity employment regardless of race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability status, age, marital status, or protected veteran status.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-17T15:10:00.000Z"
    },
    "company": {
        "name": "CDK Global",
        "link": "https://www.linkedin.com/company/cdknorthamerica"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 120,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Austin",
        "region": "TX",
        "postal_code": "78746",
        "street_address": null,
        "latitude": 30.264978,
        "longitude": -97.7466
    }
}