{
    "job": {
        "title": "Senior Software Engineer - Company was founded remotely -REMOTE",
        "industry": "Computer Software",
        "description": "We were founded in April 2020 on a simple premise: people want to buy from stores that are run by people in their community. They want their money to benefit their local economy by shopping locallyand the more accessible and convenient it is, the more frequently they'll choose to do so. If you are a Senior Software Engineer with experience, please read on! What You Will Be Doing Partner with fellow software engineers to design, build, test, deploy, and maintain our software Be an active champion for high quality software development Be an active contributor in shaping and evolving our product What You Need for this Position JavaScript graphql Tailwind What's In It for You Excellent compensation package! World class team! 100% Work from Home! So, if you are a Senior Software Engineer with experience, please apply today! Email Your Resume In Word To Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also: Ryan.Mottley@CyberCoders.com Please do NOT change the email subject line in any way. You must keep the JobID: linkedin : RM7-1649068 -- in the email subject line for your application to be considered.*** Ryan Mottley - Executive Recruiter - CyberCoders Applicants must be authorized to work in the U.S. CyberCoders, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-09-02T05:28:12.000Z"
    },
    "company": {
        "name": "CyberCoders",
        "link": "https://www.linkedin.com/company/cybercoders"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Austin",
        "region": "TX",
        "postal_code": "78746",
        "street_address": null,
        "latitude": 30.264978,
        "longitude": -97.7466
    }
}