{
    "job": {
        "title": "Senior Software Engineer",
        "industry": "Information Technology and Services,Computer Software,Computer &amp; Network Security",
        "description": "About Onelogin OneLogin, the leader in Unified Access Management, connects people with technology through a simple and secure login, empowering organizations to access the world™. We are headquartered in San Francisco, California. The OneLogin Unified Access Management (UAM) platform is the key to unlocking the apps, devices, and data that drive productivity and facilitate collaboration. OneLogin serves businesses and partners across a multitude of industries, with over 2,500 customers worldwide. We are proud that Gartner has named us a Leader in the 2020 Magic Quadrant for Access Management. For more information, visit www.onelogin.com, Blog, Facebook, Twitter, or LinkedIn. About The Role Working on intellectually satisfying problems for a sophisticated product solving real problems for our customers Enjoying a friendly work environment where you can grow (a lot!) Working with highly skilled engineers from around the world Building and designing secure, scalable, and reliable microservices in cloud SaaS environment (We use AWS) Redesigning or splitting the legacy monolith into more maintainable services Thinking out-of-the-box to come up with a solution to problems that do not seem to have one Continuously trying new technologies and applying them if they make sense and solve customer problems Owning technical design for projects of moderate complexity, and understands the tradeoffs in creating good software in their area Designing technical documentation Mentoring and supporting people within the team/organization About You 4+ years of experience writing maintainable efficient code (school, open source contribution or training counts here) Security-first mindset Empathy for the users of your software Experience working in Cloud or other large scalable environments Understanding of best practices in RESTful APIs design Willingness to speak and be heard while considering different perspectives Able to be productive in multiple languages, if you already know Ruby / Rails, Javascript / NodeJS it’s a plus Ability to quickly learn and be productive in new technologies Knowledge and interest in security, identity, access management, or authentication Knowledge of SQL and general database architecture Legal - eligibility to work in the United States/ other countries (visa’s) What’s In It For You Join a small, close-knit team with the ability to impact highly visible products already trusted by millions Award-winning company culture, strong local leadership, and great career development opportunities Competitive salary plus great perks including equity, full insurance (medical, dental, & vision), unlimited time off, and flexible WFH policies Engineering Achievements Turbo-charged user data mappings between services by 20x - going from hours for 100k users to minutes Boosted platform reliability getting 99.995% able to handle two million requests per minute for a single tenant Hydraboost Blog Shipped 4 new API services in the previous year Recently launched Smart Hooks - Our exciting new low/no code offering Smart Hooks Blog Our core values Security first - We make it our #1 priority to protect data and privacy. From the way we work to the technology we provide, security is top of mind Customer focused - We design for, listen to and partner with customers to come up with smart solutions that drive business value Collaborative - We take bold steps and work together to thrive across boundaries. We drive productivity as we grow as one team Accountable - We get things done and take ownership in our work. Showcasing consistent quality and pride to perform at the highest levels Creative - We embody creativity in everything we do. We embrace a diversity of ideas. We execute with ingenuity, flexibility, and agility Bring your design, collaboration, and problem-solving skills from IT or another profession. We value employees with different backgrounds, education, experience, and perspective and strive to create an inclusive and welcoming work environment. OneLogin is proud to provide equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability or genetics. If you’d like more information about your EEO rights as an applicant, please email recruitingteam@onelogin.com",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-09-12T05:00:04.000Z"
    },
    "company": {
        "name": "OneLogin",
        "link": "https://www.linkedin.com/company/onelogin"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 48,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "San Francisco",
        "region": "CA",
        "postal_code": "94121",
        "street_address": null,
        "latitude": 37.78008,
        "longitude": -122.42016
    }
}