{
    "job": {
        "title": "Site Reliability Engineer",
        "industry": "Biotechnology",
        "description": "WHO WE'RE LOOKING FOR We build culture one hire at a time. Our constant pursuit of a better tomorrow starts with talking to you. Our goal is simple. We want to build great teams: the kind of teams people want to be a part of, and the kind of teams TMRW can’t live without. Great teams do things individuals could never dream of. And they have more fun doing it. We want to learn more about you and the kind of team culture you can help us create. We’re interested in who you are and what you can do. We’re even more interested in who you can partner with, learn from, teach, and inspire. We’re looking for curious learners, passionate problem-solvers, and trusted teammates who bring that extra dose of contagious energy. THE OPPORTUNITY AT HAND The TMRW Life Science Site Reliability Engineer will be responsible for supporting TMRW’s cloud infrastructure and services. You will be responsible for supporting Linux and Kubernetes based deployments and Google Cloud. You’ll be faced with a variety of challenges and provided opportunities for learning and growth. OUR EXPECTATIONS OF YOU You’ll write and maintain helm charts and help maintain the CI/CD pipeline You’ll help manage resources in TMRW’s cloud infrastructure including virtual machines, cloud databases, message queues, and Kubernetes clusters You’ll assist with monitoring using Prometheus, Elasticsearch, Icinga, and other tools You’ll assist in documenting procedures for our information technology infrastructure, and keep abreast of new technological developments, including security vulnerabilities You’ll perform daily system monitoring, problem determination, and resolution, and manage performance tuning, upgrades, and maintenance You’ll write tooling to reduce toil and automate repetitive tasks You’ll help develop runbooks in order to meet TMRW’s SLOs You’ll do meaningful work that will have a positive impact on the world WHAT YOU'LL NEED TO SUCCEED You have a Bachelor’s Degree or equivalent experience You have 3+ years of practical experience supporting Kubernetes You have 7+ years of practical experience supporting Linux You have 3+ years of practical experience with cloud-based infrastructure You have demonstrated experience writing code in bash, golang, or python You have experience with monitoring tools such as Prometheus and Elasticsearch You have experience configuring and maintaining CI/CD pipelines as well as with gitops practices for managing infrastructure You’re an excellent communicator and consider yourself to be highly organized Familiarity with Java, HIPAA, Icinga, SaltStack, Google Cloud, Terraform or Gitlab is a plus You’re naturally curious with a strong desire to learn WHO WE ARE TMRW safeguards the world’s most precious cells for life. The TMRW platform revolutionizes the management, identification, and storage of fertility cells, replacing the manual and analog methods that have remained largely unchanged since IVF was first used in animal husbandry more than 50 years ago. Developed in partnership with leading fertility doctors and embryologists, TMRW’s technology will play a central role in the conception of tens of millions of people in the coming years by reducing the risk of loss or misidentification of the priceless cells used in IVF. Our automation eliminates error-prone manual tasks in the embryology lab, allowing embryologists to focus on the most skilled and technical aspects of their work. The TMRW team includes many of the world’s most celebrated pioneers in clinical medicine, reproductive biology, embryology, and cryogenic biobanking who have synthesized their collective knowledge, vision, and experience in the development of the TMRW platform. We’ve brought together a diverse, cross-disciplinary team to achieve our mission — and we’re always looking for more innovators to join us in creating a better tomorrow. At TMRW we know that cultivating diversity and fostering an inclusive work environment is critical to our impact and success. We offer equal opportunity employment and create an environment where no individual is advantaged or disadvantaged because of their background.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-09-30T00:32:50.000Z"
    },
    "company": {
        "name": "TMRW Life Sciences",
        "link": "https://www.linkedin.com/company/tmrw-life-sciences-inc"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 84,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "United States",
        "region": null,
        "postal_code": "99999",
        "street_address": null,
        "latitude": 39.50355,
        "longitude": -99.0183
    }
}