{
    "job": {
        "title": "Data Strategy Data Scientist",
        "industry": "Banking,Financial Services,Investment Banking",
        "description": "Jefferies is seeking a Data Scientist to join the Data Strategy team within Equity Research. Responsibilities Will Include Work closely with Head of Data Strategy in creation of fundamental models, design of data tools, coordination with global sector team, evaluation of external alternative data vendors and ad-hoc research projects. Interact with key data partners to communicate business cases, company drivers and other KPI's relevant to fundamental stock evaluation. Query, transform, combine and expand datasets to assist teams in knowledge extraction. Interface with data vendors, internal research teams, internal sales and trading personnel, and external institutional investors. Conceive and executing on differentiated research projects across sectors and data types. Key Qualifications 4+ years of experience within consulting, data research, data science or similar roles. Advanced STEM degree such as data science, computer science, engineering or statistics preferred Prior experience in a strategic, quantitative or risk role is desirable. Deep knowledge of data science programming languages is required (such as R, Python, SQL, Scala) Knowledge of cloud computing environments is helpful. Knowledge of fundamental financial modeling is not a must but helpful. Keen interest in the “data economy” within financial services. Motivated, intelligent, curious, hard-working, team player",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-25T17:21:41.000Z"
    },
    "company": {
        "name": "Jefferies",
        "link": "https://www.linkedin.com/company/jefferies"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 48,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "San Francisco",
        "region": "CA",
        "postal_code": "94121",
        "street_address": null,
        "latitude": 37.78008,
        "longitude": -122.42016
    }
}