{
    "job": {
        "title": "Jr. Software Engineer",
        "industry": "Information Technology and Services",
        "description": "Jr. Software Engineer Location: Hybrid/Remote, with 1-2 Days potentially in McLean, VA Us Citizenship required Project and Opportunity Overview We are currently searching for Software Engineers to be part of our IT consulting team to support a variety of commercial and government clients. The successful candidate should be open to new challenges supporting leading Path clients. Position Requirements Demonstrated prior experience (potentially course work) performing coding/programming/software development tasks in Java. Experience with Java Applications and or Java Frameworks (Spring, etc...) Strong technical and communications skills. Excellent interpersonal and team building skills with the ability to work independently as well as in a team environment. Must be detail oriented with strong organization skills with the ability to manage, prioritize, and multi-task on multiple project work streams. Ability to solve problems at a tactical and functional level, have excellent oral and written communication skills, a solid work ethic and unquestioned integrity. Self-motivating, entrepreneurial spirit with the ability to be resourceful and take initiative. Be able to implement software both as a team and independently Basic understanding of software engineering concepts and methodologies Ability to program, implement, test, and document software solutions Ability to process large data flows US Citizenship required. Background check required. Nice to have, but not required Web automation experience Financial banking knowledge TSYS data conversion Extract Transform Load (ETL) data transformation Requirements: Years of Experience: This position is open to candidates with 0 to 5 years prior work experience Education Requirements: B.S. in a technical field such as Computer Science or Engineering Benefits: Leading Path is an award-winning Information Technology and Management Consulting firm focused on providing solutions in process, technology, and operations to our government and Fortune 500 clients. We offer a professional and supportive family-friendly work environment with a strong work-life balance. Leading Path provides a comprehensive and competitive benefits package, 401K, tuition reimbursement and opportunities for professional growth and advancement.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-18T13:24:23.000Z"
    },
    "company": {
        "name": "Leading Path Consulting",
        "link": "https://www.linkedin.com/company/leading-path-consulting-llc"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "McLean",
        "region": "VA",
        "postal_code": "22101",
        "street_address": null,
        "latitude": 38.93759,
        "longitude": -77.18378
    }
}