{
    "job": {
        "title": "Senior Software Engineer",
        "industry": "Maritime",
        "description": "Required Skills Bachelor's degree in Computer Science, Math, Physics, Engineering, or similar field Proficiency and minimum 10 years of programming experience in C#. NET with WPF , must be recent experience Proficiency working with Visual Studio Proficiency working with both relational & non-relational databases ( SQL server and MongoDB ) Proficiency with several development tool chains and Integrated Development Environments Experience interfacing with APIs (including REST) Proficiency using Windows operating systems and familiarity with embedded systems Experience with Agile design process and using tools like Jira Experience with version control software (e.g. Bitbucket) Experience with test frameworks and continuous integration processes such as Jenkins and Circle CI Strong written and oral communication skills Organized, detail-oriented and pro-active Self-starter with previous engineering team experience, positive attitude who can work with little supervision Desired Skills Previous development experience in industrial systems, autonomous control, automation or robotics Front-end web/javascript/mobile experience Front-end React Native, TypeScript experience Experience with Nautical industry and charting Experience with Linux systems Familiarity with basic electronics Our client is a well-established startup, and the leader in pioneering autonomous control and advanced perception systems for the maritime industry. The company is looking to hire The Software Developer/Engineer to design, develop, test, and integrate software algorithms, applications, APIs, and graphical user interfaces for autonomous and unmanned surface vessel control & monitoring systems. Few facts about our client Specializing in Autonomous control and Navigation Systems for boats and ships Raised $20M in funding in 2020 Opened waterfront Boston; Hamburg, Germany; and Esbjerg, Denmark, offices Received class and regulatory approval of wireless helm system for U.S. - flagged ATBs Established a global dealer program to sell products Job Description The successful candidate will become a critical member of our technical team involved with all aspects of control system development for remotely operated and autonomous vessels. The software developer/engineer leads module-level design and development tasks with no supervision, conducts QA/QC testing at all phases of integration, and assists with system-level testing, trialing, and verification. This position reports to the User Interface Engineering Team Lead. Responsibilities Participate as a multidisciplinary engineering team member Design, develop, test, and integrate Microsoft Windows and web-based Applications Design, develop, test, and integrate graphical cross-platform user interface applications Maintain software documentation and assist in the development of user documentation Participate in field testing on the boats Interface with electrical engineers, control engineers, web engineers, and mechanical engineers The candidate must be eligible to work in the United States – U.S. citizen or Green card holder. This position is based in Boston, MA. Occasional travel may be required to participate in cross-team design reviews and testing on the vessel. About Employa: Apply to this position with Employa and get brand new hiring experience Employa is a smart recruiting assistant that connects tech talents with the best employers to make the hiring process fast and easy for both sides. Employa AI driven engines eliminate biases and limitations of human-to-human interaction, so candidates can always make sure that their CVs will be delivered, considered and evaluated properly. It also enables candidates to track the hiring progress and improve their ranking for the position by answering additional questions from the potential employer.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-14T17:16:13.000Z"
    },
    "company": {
        "name": "Employa",
        "link": "https://www.linkedin.com/company/employa-llc"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Massachusetts",
        "region": "United States",
        "postal_code": "01721",
        "street_address": null,
        "latitude": 42.172356,
        "longitude": -71.605
    }
}