{
    "job": {
        "title": "AWS/Data Engineer (AWS Certified)",
        "industry": "",
        "description": "Job description Do you love a career where you Experience, Grow & Contribute at the same time while earning at least 10% above the market? If so, we are excited to have bumped onto you. Learn how we are redefining the meaning of work , and be a part of the team raved by Clients, Jobseekers and Employees. Client Video Testimonials : https://bit.ly/31Z3zwI Jobseeker Video Testimonials : https://bit.ly/3wDzNf4 Employee Glassdoor Reviews : https://bit.ly/3rYzHuX If you are an Data Engineer (AWS Certified) and looking for excitement, challenge and stability in your work, then you would be glad to come across this page. We are an IT Solutions Integrator/Consulting Firm helping our client hire the right professional for an exciting long term project. Here are few details. Check if you are up for maximizing your earning/growth potential, leveraging our D* isruptive Talent Solution.* Title: Cloud Data Engineer Location: Plano, TX / Richmond, VA / Chicago, IL ( Remote until September, 2021 ) Duration: Long term contract Compensation: Based on Experience * AWS (Associate or Solutions Architect) Certification is mandatory * Only W2 candidates WHAT YOU WILL BE DOING: Create and maintain optimal data pipeline architecture, Assemble large, complex data sets that meet functional / non-functional business requirements. Identify, design,and implement internal process improvements: automating manual processes, optimizing data delivery, re-designing infrastructure for greater scalability, etc. Build the infrastructure required for optimal extraction, transformation, and loading of data from a wide variety of data sources using SQL and AWS ‘Big data’ technologies. Build analytics tools that utilize the data pipeline to provide actionable insights into customer acquisition, operational efficiency and other key business performance metrics. Work with stakeholders including the Executive, Product, Data and Design teams to assist with data-related technical issues and support their data infrastructure needs. Create data tools for analytics and data scientist team members that assist them in building and optimizing our product into an innovative industry leader. Requirements YOU: (Required Skills) Have 3 plus years experience with each of AWS EMR, EC2, Spark, Redshift and RDS. Have 10 plus years of Software Engineering experience. Have 3 plus years experience in SQL, REST API, Data Streaming. AWS (Associate or Solutions Architect) Certification is mandatory IT WOULD BE GREAT IF YOU: Have strong experience in Python Scripting Have experience with Docker, Redshift, Snowflake, Streaming Data apps exposure. Have knowledge of Kafka, any CI/CD tools, Terraform or Cloudformation Benefits WHAT'S IN IT FOR YOU: Optimal combination of Excitement, Challenge and Growth Stable: long term assignment Experience working for a reputable Firm Visit us at http://alignity.io/careers. Alignity Consulting is an Equal Opportunity Employer, M/F/V/D. CEO Message: https://bit.ly/2PJUZzz Client Testimonial: https://bit.ly/31Z3zwI Candidate Testimonial: https://bit.ly/3wDzNf4 Glassdoor reviews : https://bit.ly/3rYzHuX",
        "employment_type": "CONTRACTOR",
        "date_posted": "2021-08-18T22:03:31.000Z"
    },
    "company": {
        "name": "Alignity Consulting",
        "link": "https://www.linkedin.com/company/alignity"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 120,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Plano",
        "region": "TX",
        "postal_code": "75093",
        "street_address": null,
        "latitude": 33.019695,
        "longitude": -96.697586
    }
}