{
    "job": {
        "title": "Machine Learning/Reinforcement Learning Software Engineer (Engineer Software 3) - 2633",
        "industry": "Information Technology and Services,Defense &amp; Space,Computer Software",
        "description": "A division of Huntington Ingalls Industries Defense & Federal Solutions Defense & Federal Solutions, a business group within Huntington Ingalls Industries’ Technical Solutions division, helps solve tough national security challenges for the Department of Defense, the intelligence community and federal civilian agencies. Our expert capabilities include intelligence, surveillance and reconnaissance (ISR), and cyber; secure enterprise IT engineering and operations; military training and simulation; logistics management and integrated product support; and fleet maintenance, modernization, repair and sustainment. Job Description HII-Technical Solutions Division (HII-TSD) is currently seeking a Software Developer/Engineer with expertise in artificial intelligence/machine learning (AI/ML) efforts; specifically focused on Reinforcement Learning. The project this role will support is a rapid development and deployment effort to develop counter UAS (CUAS) technology for a critical US Department of Defense customer. We are looking for a multi-skilled software developer to join the team to assist in delivering critical AI/ML/RL enabled solutions. A developer joining the project team will learn about the complex multi-disciplinary mission as well as engage with a highly-skilled engineering team delivering a cutting-edge solution to the end customer. Essential Job Responsibilities As part of a small internal team, you will play a key role in the software design, development, testing and support for a counter-UAS tool designed to both automatically react to UAS within range and advise a user which action to take. Collaborate with a diverse team of engineers from the company, government customer, and various vendors, working in a dynamic and fast-paced environment to meet evolving requirements. Develop reinforcement learning to model behaviors in a Unity engine based simulator. Create and train models capable of evaluating and issuing appropriate course of action recommendations. Assist in the development of evaluation metrics to assess the effectiveness of AI/ML algorithms in the presentation of CoA options to the warfighter. Designs and develops system architectures and AI/ML models. Designs, develops, documents, tests and debugs applications software and systems that contain logical and mathematical solutions. Conducts multidisciplinary research and collaborates with equipment designers and/or hardware engineers in the planning, design, development, and utilization of electronic data processing systems for product and commercial software. Determines computer user needs; analyzes system capabilities to resolve problems on program intent, output requirements, input data acquisition, programming techniques and controls; prepares operating instructions; designs and develops compilers and assemblers, utility programs, and operating systems. Ensures software standards are met. Minimum Qualifications 5 years relevant experience with Bachelors in related field; 3 years relevant experience with Masters in related field; 0 years relevant experience with PhD or Juris Doctorate in related field; or High School Diploma or equivalent and 9 years relevant experience. Experience working as part of a technical engineering team. AI/ML experience (specifically Reinforcement Learning) Experience with standard machine learning techniques, tools and frameworks (Python and its associated libraries) including but not limited to: pandas, numpy, Tensorflow, keras, Pytorch, Torch, etc. Applies extensive technical expertise, and has full knowledge of other related disciplines. Able to communicate effectively and clearly present technical approaches and findings. Develop technical solutions to complex problems which require the regular use of ingenuity and creativity. Clearance: Must possess a SECRET clearance and be eligible to upgrade to a Top Secret. Preferred Requirements Master’s degree in engineering, computer science, or other related technical field Procedural Environment Creation experience Experience using Reinforcement Learning with drones/vehicles Experience applying Reinforcement Learning in Unity (preferred) or Unreal environments Experience developing a Machine Learning (ML) pipeline from data collection to model training to model deployment Experience analyzing large scale data from a variety of sources Design, validation, and characterization of algorithms and/or systems Redis/NoSQL experience Geospatial experience Version control experience, git preferred Experience with UAVs/CUAS TS/SCI preferred The position is based out of Fairfax, VA or Annapolis Junction, MD office. Telecommuting may be approved for this position. Physical Requirements Adequate visual acuity and manual dexterity for meeting the requirements Software Engineer family. Huntington Ingalls Industries is America’s largest military shipbuilding company and a provider of professional services to partners in government and industry. For more than a century, HII’s Newport News and Ingalls shipbuilding divisions in Virginia and Mississippi have built more ships in more ship classes than any other U.S. naval shipbuilder. HII’s Technical Solutions division provides a wide range of professional services through its Fleet Support, Mission Driven Innovative Solutions, Nuclear & Environmental, and Oil & Gas groups. Headquartered in Newport News, Virginia, HII employs more than 42,000 people operating both domestically and internationally. Huntington Ingalls Industries is an Equal Opportunity/Vets and Disabled Employer. U.S. Citizenship may be required for certain positions.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-06-24T04:19:51.000Z"
    },
    "company": {
        "name": "HII Technical Solutions, a division of Huntington Ingalls Industries",
        "link": "https://www.linkedin.com/company/hii-technical-solutions"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Fairfax",
        "region": "VA",
        "postal_code": "22003",
        "street_address": null,
        "latitude": 38.847122,
        "longitude": -77.30631
    }
}