{
    "job": {
        "title": "(USA) Senior Data Engineer",
        "industry": "Information Technology and Services,Retail,Financial Services",
        "description": "Position Summary... What You'll Do... Senior Data Engineer Data Strategy: Understands, articulates, and applies principles of the defined strategy to routine business problems that involve a single function. Data Transformation and Integration: Extracts data from identified databases. Creates data pipelines and transform data to a structure that is relevant to the problem by selecting appropriate techniques. Develops knowledge of current data science and analytics trends. Data Source Identification: Supports the understanding of the priority order of requirements and service level agreements. Helps identify the most suitable source for data that is fit for purpose. Performs initial data quality checks on extracted data. Data Modeling: Analyzes complex data elements, systems, data flows, dependencies, and relationships to contribute to conceptual, physical, and logical data models. Develops the Logical Data Model and Physical Data Models including data warehouse and data mart designs. Defines relational tables, primary and foreign keys, and stored procedures to create a data model structure. Evaluates existing data models and physical databases for variances and discrepancies. Develops efficient data flows. Analyzes data-related system integration challenges and proposes appropriate solutions. Creates training documentation and trains end-users on data modeling. Oversees the tasks of less experienced programmers and stipulates system troubleshooting supports. Code Development and Testing: Writes code to develop the required solution and application features by determining the appropriate programming language and leveraging business, technical, and data requirements. Creates test cases to review and validate the proposed solution design. Creates proofs of concept. Tests the code using the appropriate testing approach. Deploys software to production servers. Contributes code documentation, maintains playbooks, and provides timely progress updates. Problem Formulation: Translates business problems within one's discipline to data related or mathematical solutions. Identifies what methods (for example, analytics, big data analytics, automation) would provide a solution for the problem. Shares use cases and gives examples to demonstrate how the method would solve the business problem. Applied Business Acumen: Provides recommendations to business stakeholders to solve complex business issues. Develops business cases for projects with a projected return on investment or cost savings. Translates business requirements into projects, activities, and tasks and aligns to overall business strategy. Serves as an interpreter and conduit to connect business needs with tangible solutions and results. Recommends new processes and ways of working. Data Governance: Establishes, modifies, and documents data governance projects and recommendations. Implements data governance practices in partnership with business stakeholders and peers. Interprets company and regulatory policies on data. Educates others on data governance processes, practices, policies, and guidelines. Provides recommendations on needed updates or inputs into data governance policies, practices, or guidelines. Demonstrates up-to-date expertise and applies this to the development, execution, and improvement of action plans by providing expert advice and guidance to others in the application of information and best practices; supporting and aligning efforts to meet customer and business needs; and building commitment for perspectives and rationales. Provides and supports the implementation of business solutions by building relationships and partnerships with key stakeholders; identifying business needs; determining and carrying out necessary processes and practices; monitoring progress and results; recognizing and capitalizing on improvement opportunities; and adapting to competing demands, organizational changes, and new responsibilities. Models compliance with company policies and procedures and supports company mission, values, and standards of ethics and integrity by incorporating these into the development and implementation of business plans; using the Open Door Policy; and demonstrating and assisting others with how to apply these in executing business processes and practices What You’ll Do Direct root cause analysis of critical business and production issues. Lead and direct large-scale, complex, cross-functional projects. Be a technical lead and drive the team towards building a highly scalable and performing Container platform. Bring new ideas for product enhancement. Promote and support company policies, procedures, mission, values, and standards of ethics and integrity. Help to define the Data Engineer strategy. Ability to learn and adapt new technologies, passion for continuous improvement. Interact and work with multiple cross functional teams. What You Need To Be Successful In The Role A multi-skilled SAP HANA professional with good Techno-Functional expertise. Extensive practical knowledge of SAP GL and Purchasing Modules and worked greatly in HANA, BW on HANA, BODS interfaces & S/4 HANA. Prior Data Engineering experience at a startup, or mid to large sized corp. Proficient oral and written communication skills. Prior experience developing or working, with hands on experience building, running and deploying application with Cloud technologies such as Microsoft Azure, Google Cloud Platform. Prior experience developing or working with CI/CD or GitOps systems is highly desired. Ability to learn and adapt new technologies, passion for continuous improvement. Exposure to continuous build and continuous integration tools. Ability to deliver in Agile method (Kanban or SCRUM). Experience consuming ReST APIs. Experience developing containerized cloud applications. Data engineering, database engineering, business intelligence, or business analytics, ETL tools and working with large data sets in the cloud Data Modeling: Analyzes complex data elements, systems, data flows, dependencies, and relationships to contribute to conceptual, physical, and logical data models. Develops the Logical Data Model and Physical Data Models including data warehouse and data mart designs. Defines relational tables, primary and foreign keys, and stored procedures to create a data model structure. Architectural Design, develop, implement and tune distributed data processing pipelines that process large volume of data; focusing on scalability, low -latency, and fault-tolerance in every system built. Demonstrates expertise in writing complex, highly-optimized queries across large data sets to write data pipelines and data processing layers. Proven, working expertise with Big Data Technologies Hadoop, HDFS, Hive, Spark Scala/PySpark, and SQL. Knowledge and experience in Kafka, Storm, Druid and Presto with Hands-on experience of Spark and knowledge of cloud systems are added advantage. We’d Love To See Excellent understanding of designing and building scalable, high availability, distributed (multi-tiered), and concurrent applications. Expertise with RDBMS (Oracle, SQL Server, MySQL) with excellent understanding of transaction management and performance tuning. SAP HANA, SAP BW and S/4 previous experience. Experience with distributed databases like Cassandra, Cosmos, MongoDB. Excellent understanding of non-SQL databases. Experience using messaging systems like Kafka, ActiveMQ; solid understanding of enterprise service patterns. Minimal Qualification Bachelor’s degree in Computer Science and 3 years' experience in data engineering or related field. 5 years’ experience in data engineering or related field. Master's degree in Computer Science and 1 year’s experience in data engineering or related field. Minimum Qualifications... Outlined below are the required minimum qualifications for this position. If none are listed, there are no minimum qualifications. Option 1: Bachelor’s degree in Computer Science and 3 years' experience in software engineering or related field. Option 2: 5 years’ experience in software engineering or related field. Option 3: Master's degree in Computer Science and 1 year’s experience in software engineering or related field. 2 years' experience in data engineering, database engineering, business intelligence, or business analytics. Preferred Qualifications... Outlined below are the optional preferred qualifications for this position. If none are listed, there are no preferred qualifications. Data engineering, database engineering, business intelligence, or business analytics, ETL tools and working with large data sets in the cloud, Master’s degree in Computer Science or related field and 3 years' experience in software engineering Primary Location...805 SE MOBERLY LN, BENTONVILLE, AR 72712, United States of America",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-27T05:19:38.000Z"
    },
    "company": {
        "name": "Walmart",
        "link": "https://www.linkedin.com/company/walmart"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Bentonville",
        "region": "AR",
        "postal_code": "72716",
        "street_address": null,
        "latitude": 36.37187,
        "longitude": -94.20272
    }
}