{
    "job": {
        "title": "Entry Level - Associate Data Scientist (Commercial)",
        "industry": "Computer Hardware",
        "description": "Introduction As an Associate Data Scientist at IBM, you will help transform our clients’ data into tangible business value by analyzing information, communicating outcomes and collaborating on product development. Work with Best in Class open source and visual tools, along with the most flexible and scalable deployment options. Whether it’s investigating patient trends or weather patterns, you will work to solve real world problems for the industries transforming how we live. Your Role and Responsibilities Work You Could Do As An Associate Data Scientist Implement and validate predictive and prescriptive models, create and maintain statistical models with a focus on big data. Incorporate a variety of statistical and machine learning techniques in your projects. Write programs to cleanse and integrate data in an efficient and reusable manner. Use leading edge and open-source tools such as Python, R, and TensorFlow, combined with IBM tools and our AI application suites. Work in an Agile, collaborative environment, partnering with other scientists, engineers, consultants and database administrators of all backgrounds and disciplines to bring analytical rigor and statistical methods to the challenges of predicting behaviors. Communicate with internal and external clients to understand and define business needs and appropriate modelling techniques to provide analytical solutions. Evaluate modelling results and communicate the results to technical and non-technical audiences. Locations: Atlanta, GA Cambridge, MA Chicago, IL Dallas, TX Houston, TX New York, NY San Francisco, CA Washington DC Required Technical and Professional Expertise Ability to look at things differently, debug, troubleshoot, design and implement solutions to complex technical issues. Strong technical and analytical abilities, a knack for driving impact and growth, and experience with a programming/scripting in a language such as Java or Python. Basic understanding of statistical programming in a language such as R, Python, or SAS, SPSS, MATLAB. Basic understanding of Cloud (AWS, Azure, etc.). Excellent verbal and written communication skills. Work or internship experience using data science tools in a corporate environment. Interest in, understanding of, or experience with Design Thinking and Agile Development Methodologies. Willingness to travel up to 100% of the time. Preferred Majors Computer Science, Data Science, Applied Mathematics, Statistics, Cognitive Science, Artificial Intelligence, Business Intelligence, Operations Research, Engineering Preferred Technical And Professional Expertise N/A About Business Unit IBM Services is a team of business, strategy and technology consultants that design, build, and run foundational systems and services that is the backbone of the world's economy. IBM Services partners with the world's leading companies in over 170 countries to build smarter businesses by reimagining and reinventing through technology, with its outcome-focused methodologies, industry-leading portfolio and world class research and operations expertise leading to results-driven innovation and enduring excellence. Your Life @ IBM Are you craving to learn more? Prepared to solve some of the world's most unique challenges? And ready to shape the future for millions of people? If so, then it's time to join us, express your individuality, unleash your curiosity and discover new possibilities. Every IBMer, and potential ones like yourself, has a voice, carves their own path, and uses their expertise to help co-create and add to our story. Together, we have the power to make meaningful change – to alter the fabric of our clients, of society and IBM itself, to create a truly positive impact and make the world work better for everyone. It's time to define your career. About IBM IBM’s greatest invention is the IBMer. We believe that through the application of intelligence, reason and science, we can improve business, society and the human condition, bringing the power of an open hybrid cloud and AI strategy to life for our clients and partners around the world. Restlessly reinventing since 1911, we are not only one of the largest corporate organizations in the world, we’re also one of the biggest technology and consulting employers, with many of the Fortune 50 companies relying on the IBM Cloud to run their business. At IBM, we pride ourselves on being an early adopter of artificial intelligence, quantum computing and blockchain. Now it’s time for you to join us on our journey to being a responsible technology innovator and a force for good in the world. Location Statement Benefits In addition to a competitive benefits program consisting of medical and life insurance, retirement plans, and time off, eligible employees may also have access to IBM offers a wide range of resources for eligible IBMers to thrive both inside and outside of work. 12 weeks of paid parental bonding leave. Family care options are also available to support eligible employees during COVID-19. World-class training and educational resources on our personalized, AI-driven learning platform. IBM's learning culture supports your restless attitude to grow your skills and build the depth and scale of knowledge needed to achieve your career goals. Well-being programs to support mental and physical health. Financial programs that empower you to plan, save, and manage your money (including expert financial counseling, 401(k), IBM stock discount, etc.). Select educational reimbursement opportunities. Diverse and inclusive employee resource groups where you can network and connect with IBMers across the globe. Giving and volunteer programs to benefit charitable organizations and local communities. Discounts on retail products, services, and experiences. We consider qualified applicants with criminal histories, consistent with applicable law. IBM will not be providing visa sponsorship for this position now or in the future. Therefore, in order to be considered for this position, you must have the ability to work without a need for current or future visa sponsorship. Being You @ IBM IBM is committed to creating a diverse environment and is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, pregnancy, disability, age, veteran status, or other characteristics. IBM is also committed to compliance with all fair employment practices regarding citizenship and immigration status.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-28T00:00:00.000Z"
    },
    "company": {
        "name": "IBM",
        "link": "https://www.linkedin.com/company/ibm"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Houston",
        "region": "TX",
        "postal_code": "77208",
        "street_address": null,
        "latitude": 29.760803,
        "longitude": -95.36951
    }
}