{
    "job": {
        "title": "Data &amp; Applied Scientist",
        "industry": "Computer Hardware,Computer Software,Information Technology and Services",
        "description": "Microsoft Speech team is looking for talented applied scientists. This is a great opportunity to join a strong team to work on the forefront of artificial intelligence! You will be able to work closely with world class scientists and engineering leaders to define the future. In this position, you will experience a wide range of technology spectrum and solve challenging problems that really matter. Responsibilities In this role, you will: Be part of world-class research teams to advance the state of art of speech enhancement Partner closely with strong engineering team to incorporate cutting-edge algorithms and deep learning models into the product. Qualifications Required Qualifications: Ph. D degree in Computer Science, or a related field, or equivalent alternative education, skills. Preferred Qualifications 3-5 years in Digital Signal Processing/Machine Learning/Speech Recognition is a strong plus. Demonstrates strong capabilities in areas like numerical optimization, or algorithm development and Innovate, design and build technologies related to audio/signal processing, speech recognition and machine learning Design and carry out scientific experiments for new ideas to improve technologies Develop system, infrastructure and tools to advance our audio and speech recognition capabilities Collaborate both within and outside team to effectively work on product/service features Formal training in scientific method and quantitative reasoning. Enthusiastic about solving hard technical challenges by applying scientific findings to practical problems. Solid programming and strong problem solving skills An efficient communicator via formulation at appropriate levels of detail. Comfortable with start-up style work environment: versatile, detail oriented, collaborative, can-do attitude with strong commitment Microsoft is an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to age, ancestry, color, family or medical care leave, gender identity or expression, genetic information, marital status, medical condition, national origin, physical or mental disability, political affiliation, protected veteran status, race, religion, sex (including pregnancy), sexual orientation, or any other characteristic protected by applicable laws, regulations and ordinances. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. If you need assistance and/or a reasonable accommodation due to a disability during the application or the recruiting process, please send a request via the Accommodation request form. Benefits/perks listed below may vary depending on the nature of your employment with Microsoft and the country where you work.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-24T04:21:54.000Z"
    },
    "company": {
        "name": "Microsoft",
        "link": "https://www.linkedin.com/company/microsoft"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Bellevue",
        "region": "WA",
        "postal_code": "98007",
        "street_address": null,
        "latitude": 47.6137,
        "longitude": -122.19093
    }
}