{
    "job": {
        "title": "Data Scientist",
        "industry": "Marketing and Advertising",
        "description": "GALE is a creative media consultancy that brings business insights to brand storytelling and activates it across every channel. With expertise in business strategy, media, CRM, addressable and integrated brand communications, performance marketing, and technology, GALE creates marketing systems and communications that grow businesses. GALE delivers strong outcomes for its partners in automotive, QSR, retail, gaming, entertainment, telecom and more. Founded in 2014, the agency currently has offices in New York, Detroit, Singapore, Toronto, Austin, Los Angeles, London, and Bengaluru. Some Brands We Work With: Chipotle, Seagate, T-Mobile, NBA, MGM, Allstate, Resorts World Genting, BMO, and Santander. If you’re driven by a passion to build something great, a desire to innovate, and a commitment to achieve excellence in your craft, GALE is a great place for you. Inclusion in Hiring GALE is an equal opportunity employer. All applicants will be considered for employment without attention to race, color, religion, sex, sexual orientation, gender identity, national origin, veteran or disability status. Please consider applying for this role even if you do not meet 100% of the suggested requirements, and/or if you have gaps in your resume. About the role We're currently seeking Data Scientists to join our rapidly growing Data Science and Analytics (DSA) team - ones that have a passion for working with real world data to derive actionable insights. Successful candidates for the role will work with clients and internal stakeholders to define, prototype, and produce custom solutions using state-of-the-art big data platforms, analytics, and machine learning. The ideal candidate will have a background in a quantitative field and have experience with large datasets, the Hadoop ecosystem, statistics/analysis, and client-facing activities. They will be enthusiastic, creative, results focused. You will have the opportunity to work across varying sets of data with a variety of clients. Who you are ●     High fluency with SQL on one or more of the following databases - Hive,PostgreSQL,Oracle, SQL Server, MySQL ●     Fluency with scripting (Python, Bash, etc.) ●     Experience with statistical programming languages/packages (R, SAS, Scipy/Numpy/Scikitlearn) ●     Familiar with Unix/Linux systems and command-line interfaces and editors ●     Familiar with the AWS ecosystem ●     Comfortable working with the Hadoop ecosystem (Spark, MapReduce, Hive, YARN) ●     Experience with supervised learning algorithms and their application to large data sets ●     Experience loading, cleansing, and analyzing very large datasets Nice to haves ●     Experience with unsupervised clustering algorithms, especially on large data sets ●     Some experience with interactive visualization of data in Shiney, D3 or Dash ●     Specific experience with the following programming languages: Scala, Apache Spark, Python, R ●     Some applied experience with ANN frameworks like: Tensorflow, Keras, Torch, Mxnet, etc. What you will be doing ●     Define, build, and present models to C-suite executives in industries ranging from automotive to startup ●     Ingest, manipulate and model large datasets using supervised and unsupervised machine learning techniques to help define the structure of the customer base ●     Produce prototypes, POCs, or APIs to showcase and make available models and their outcomes Inclusion in the Workplace We believe in inclusivity and do our best work when people with diverse perspectives, backgrounds and skills are brought together. Our Core Values are at the root of GALE’s collaborative environment and help to foster a strong community. Our Code of Conduct, Human Resources policies and executive investment in inclusion further support and protect GALE’s inclusive workplace. Our Hiring Process We want you to be just as discerning in making your next career move as we are finding great talent to join our team. Our interview process generally consists of the following stages to allow you to meet a range of people from various disciplines and domains. You will be assessed at each stage before being invited to move to the next. ·      Phone screen with a member of our Talent Acquisition Team ·      Interview with the Hiring Manager, who will generally be your manager. ·      Where relevant for the role, a technical aptitude test. (i.e. for domains in technology, data science, etc.,…) ·      Interview with a member of our team from a different Department than yours. ·      Interview with a member of our Leadership Team. Please discuss with our recruiters if you require any accommodations throughout the process to help enable a smooth interview (i.e. accessibility in terms of location, timing, method, etc.,...).",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-23T22:50:58.000Z"
    },
    "company": {
        "name": "GALE",
        "link": "https://www.linkedin.com/company/galepartners"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "New York City Metropolitan Area",
        "region": null,
        "postal_code": "10021",
        "street_address": null,
        "latitude": 40.748295,
        "longitude": -73.98556
    }
}