{
    "job": {
        "title": "Staff - Data Scientist",
        "industry": "",
        "description": "Position Title: Staff Data Scientist Position: Full Time, Exempt Supervises Staff: No Salary Range: $130,000 - $200,000 Please note this position is in Denver, CO. Cleerly will not sponsor a visa for this position. Job Description We’re Cleerly, a healthcare company based in Denver, Colorado and New York, New York that’s revolutionizing how heart disease is diagnosed, treated and tracked. We were founded 3 years ago by one of the leading cardiologists in the world and are a world-class team of engineers, designers, product managers, and data scientists backed by leading healthcare VCs. We have an immediate opening for a Staff-level Data Science leader to drive our machine learning strategy and development process. We’re searching for someone excited to work on novel technologies and develop the next generation of quantitative computer aided diagnosis systems. Are you an experienced data scientist with an excellent academic background?  Do you have a passion for image analysis and deep learning?  Have you shipped production models in a commercial setting? If the answer to these is yes, then we’d like to talk with you. What would I be doing? You’ll be working in a multi-disciplinary, cross-functional team to research, analyze, and build our ML algorithms and pipeline. You’ll work with other engineers to build a culture and approach focused on MLOps strategies. On any given day you could be: Researching new methods of measuring and analyzing large and highly complicated data sets Working with distinguished clinical researchers worldwide to validate new technologies Developing a new algorithm for image analysis Training and validating your image-based models for medical applications Building prototypes for experimentation Presenting findings and recommendations to groups of clinical experts and other stakeholders Designing the software interface for a model to deliver it into production Creating annotation solutions for 2D and 3D image labeling Staying abreast of current and novel developments in the field through reading, conferences, and other research opportunities Qualifications Ph.D. in an area of computational sciences and deep knowledge of the physics of image formation 2 or more years of commercial experience in deep learning Strong theoretical and practical background in image science, applied mathematics, machine learning, deep learning Significant experience with large-scale machine learning platforms such as PyTorch or TensorFlow Strong skills with your programming language of choice such as Python, Julia or R to access large amounts of data, execute multiple analysis steps, visualize intermediate and final results Demonstrated ability of prototype development Expertise in advanced data analytics, including structured & unstructured data, data mining, and ML techniques Ability to communicate complex concepts to both scientists and non-scientists A team-oriented individual that works collaboratively to achieve team goals Ability to exercise discretion and tact, and protect confidentiality where required Impress us more… Expertise in medical intelligence, medical imaging and data processing Experience in health care, education, or research fields Experience with development of DICOM- and end-user image-based software Published machine learning papers in top CS and medical journals Cleerly offers competitive benefits, including medical, dental, and life insurance; generous PTO, stock options, and 401K. OUR COMPANY IS AN EQUAL OPPORTUNITY EMPLOYER. We do not discriminate on the basis of race, color, national origin, ancestry, citizenship status, protected veteran status, religion, physical or mental disability, marital status, sex, sexual orientation, gender identity or expression, age, or any other basis protected by law, ordinance, or regulation. Job duties, activities and responsibilities are subject to change by our company.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-09T17:38:48.000Z"
    },
    "company": {
        "name": "Cleerly",
        "link": "https://www.linkedin.com/company/cleerlyhealth"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Denver",
        "region": "CO",
        "postal_code": "80247",
        "street_address": null,
        "latitude": 39.738453,
        "longitude": -104.984856
    }
}