{
    "job": {
        "title": "Software Engineer",
        "industry": "Information Services,Information Technology and Services,Health, Wellness and Fitness",
        "description": "At our firm, we put a focus on providing a great experience for all our employees, supporting in any way possible to allow for our teams to not only enjoy their work, but to excel at the same time. Our mission is focused around using advanced AI solutions to remodel not only how we treat disease, but also how we diagnose and prevent it all together. In your role as a full stack developer, you will assist in the development and support of a range of Healthtech products across the brand, with a focus on allowing you to develop your already existing skills and learn entirely new ones. The role will involve writing scalable, thoroughly tested software, working with a cross-functional team to deliver leading products that have great value to the users. As a front-end specialist, you will be expected to have extended knowledge of Javascript/Typescript and other modern frameworks, developing applications in React, and mobile applications in ReactNative. Whether you are an expert in these areas already or not, we have a focus on helping our software engineers develop these skills in their own ways, in a comfortable, friendly, and leading workplace. Benefits: Whether working in the office or from home, we are collaborative and fun, proven by our track record of being recognized as a great workplace. Consistent time off to relax. Flexible working hours. Annual allowance to support development. Great Insurance plans. 401(k) matching. A focus on employee growth and development. Requirements: A full stack Engineer with an array of knowledge of Javascript, ES6 and ES7 Some familiarity with React, and a willingness to develop this knowledge. An interest in gaining knowledge in GraphQL and Apollo Client. Bring more than just technical knowledge, caring about the company mission is key. Buchanan Tech, through rapid organic growth, is now a market leading tech recruitment firm and a top supplier to a number of clients including Series A funded, B series Funded, C series funded, Angel funded, Seed funded, Venture Capital backed, private equity backed, IPO’s, DJIA and FTSE listed companies. Buchanan Tech’s team of consultants come from a variety of backgrounds, but all subscribe to the company ethos of Understanding, Advising and Delivering for our clients & candidates. Buchanan Tech has a team of market leading consultants that specialise in the Healthtech sector. We provide consultancy and advice to software engineers and DevOps professionals across the US at all levels. Our Healthtech team works with the following levels: Web developer, Software engineer, Software developer, Front end developer, Network engineer, entry level software developer, java developer, entry level software engineer, IOS developer, Junior web developer, SQL developer, Junior developer, Entry level web developer, android developer, salesforce developer, .NET developer, Python developer, Game developer, Programmer and data engineers. JRTMP6.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-16T15:16:55.000Z"
    },
    "company": {
        "name": "Buchanan Staffing Group",
        "link": "https://uk.linkedin.com/company/buchanan-staffing-group"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Austin",
        "region": "TX",
        "postal_code": "78746",
        "street_address": null,
        "latitude": 30.264978,
        "longitude": -97.7466
    }
}