{
    "job": {
        "title": "Senior Software Engineer, Marketplace (Front End / JavaScript) - Remote",
        "industry": "Marketing and Advertising,Computer Software,Internet",
        "description": "Job Description: TrueCar envisions a world where car shopping is an uplifting experience. Our shopping experience helps buyers consider choices from every angle, builds confidence in their decisions, and enables every step of the process with tools and information that make car buying easy. Ultimately, TrueCar is helping people in the second largest purchase they will make in their lives. We’re removing the complexity out of buying a car, using technology and personalization, to create a one-of-a-kind experience that transforms car buying and ultimately people’s lives. Come join the team and help us accomplish our mission. TrueCar maintains a Dynamic Workplace, allowing employees to have their primary workstations at home, with office space in Santa Monica, CA and Austin, TX to be made available to individuals and teams to use as needed. Employees enjoy excellent benefits (health/vision/dental coverage, 401k with contribution matching, equity, etc.) as well as perks like monthly credits for at-home food delivery, internet/mobile phone service coverage, fitness expenses, and Caregiver support. About the team: We’re looking for talented Front End Engineers who are strong in JavaScript and are passionate about evolving technologies like React, Redux, GraphQL and Apollo. Along with coding, you will be responsible for working with product managers, backend engineers and designers. We love engineers who lead the charge, communicate with other team members, and deliver a quality product and user experience. About the role: In this role, you will be using front-end JavaScript Frameworks, such as React, to create universal/isomorphic, single-page apps for consumer and dealer facing websites You will also be contributing unit tests for the code you write using tools like Cypress, Mocha or Jest. Using JavaScript frameworks, you’ll develop reusable components that can be leveraged across all our web apps What you’ll need: Experience building web software or mobile applications - professional or open-source experience writing JavaScript, as well as with a JavaScript MVC framework in a Single Page Architecture (most notably, React and Redux but also including AngularJS, Backbone.js, Knockout or Ember.js). Familiarity with standard javascript async patterns (e.g. closures, callbacks, promises, error handling) Experience with modern version control system such as git or mercurial Solid grasp of software engineering fundamentals and their practical application Firm understanding of modern HTML/CSS Have delivered great technology quickly and understand how to ship in a fast-changing environment \"Self-starter\" attitude, the ability to make decisions independently, a willingness to take ownership of problems and a strong desire to learn and grow. Ability to facilitate meaningful discussion around complex issues and to convince others about technical tradeoffs as well as work with key stakeholders to effectively solve problems and drive decisions. Experience leading initiatives & meetings within a team as well as multi-person, multi-week projects. Ability to coach and help teammates prioritize. Nice to have: Familiarity with Babel or TypeScript and ES6/2015+ features Experience with Node.js Experience using Ruby on Rails Experience deploying apps to AWS Well versed in Agile processes such as Continuous Integration and Deployment BS/MS in computer science or equivalent work experience Automotive industry experience About TrueCar: TrueCar is a leading automotive digital marketplace that enables car buyers to connect to our nationwide network of Certified Dealers. We are building the industry's most personalized and efficient car buying experience as we seek to bring more of the purchasing process online. Consumers who visit our marketplace will find a suite of vehicle discovery tools, price ratings, and market context on new and used cars -- all with a clear view of what's a great deal. When they are ready, TrueCar will enable them to connect with a local Certified Dealer who shares in our belief that truth, transparency, and fairness are the foundation of a great car buying experience. As part of our marketplace, TrueCar powers car-buying programs for over 250 leading brands, including AARP, Sam’s Club, and American Express. Nearly half of all new-car buyers engage with TrueCar powered sites, where they buy smarter and drive happier. TrueCar is headquartered in Santa Monica, California, with offices in Austin, Texas. Location(s): Santa Monica, CA",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-09-12T05:23:04.000Z"
    },
    "company": {
        "name": "TrueCar, Inc.",
        "link": "https://www.linkedin.com/company/truecar-inc-"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Los Angeles",
        "region": "CA",
        "postal_code": "90101",
        "street_address": null,
        "latitude": 34.05224,
        "longitude": -118.24335
    }
}