{
    "job": {
        "title": "Solutions Architect",
        "industry": "Marketing and Advertising,Information Technology and Services,Financial Services",
        "description": "Refer A Friend Company Description McDonald’s is proud to be one of the most recognized brands in the world, with restaurants in over 100 countries that serve 70 million customers daily. As the global leader in the food service industry, our legacy of innovation and hard work continues to drive us. From drive thru updates to delivery to mobile order and pay, we are innovating quickly and growing. Joining McDonald's means thinking big and preparing for a career that can have influence around the world. At McDonald’s, we see every day as a chance to create positive impact. We lead through our values centered on inclusivity, service, integrity, community and family. From support of Ronald McDonald House Charities to our Youth Opportunity project and sustainability initiatives, our values keep us dedicated to using our scale for good: good for our customers, people, industry and planet. We also offer a broad range of outstanding benefits including a sabbatical program, tuition assistance and flexible work arrangements - check them out here! It's Set Up To Be a Global Hub That Cultivates Collaboration While most of us are working remote during COVID-19, we're excited to get back to our state-of-the-art headquarters in the booming West Loop of downtown Chicago. Take a class at Hamburger University Sample future items in our Test Kitchen Utilize the latest technology to connect with your team around the globe We are an equal opportunity employer committed to the diversity of our crew members, staff, operators, and suppliers. We promote an inclusive work environment that creates feel-good moments for everyone. We are interested in people who enhance our company culture: Does this role interest you? We encourage you to apply even if you don’t meet every single requirement! Job Description</strong Key Responsibilities Will Include As a Solutions Architect, you will use your knowledge and experience of HCM technologies, processes, and operations to optimize business results. Assess McDonald’s HCM technology landscape to ensure it meets current and future requirements Partner with various business and technology colleagues to define and maintain an HCM technology strategy and roadmap Foster an agile and analytics-driven work environment Identify, analyze and resolve system design weaknesses Collaborates with our technology teams, functions area and service providers for developing solutions or providing application support. The ideal candidate has the following experience Defined future state technology roadmaps that established a foundation for company success Considered variables that go beyond system selection and implementation, such as a user’s digital experience, business operating models, change management and stakeholder expectations Implemented and maintained HCM technologies that Delivered technology people want to use Enabled reliable and secure business processes Drove cost effectiveness / bottom-line results Effectively used modern practices to increase the speed of delivering software (e.g., Agile, DevOps, test automation, etc.) Proven ability to partner with business and technology stakeholders to drive measurable business outcomes Worked with large, global teams to deliver results. Teams would have consisted of employees and third-party contractors Knowledgeable in the following technologies SQL Oracle Database Linux Qualifications</strong Bachelor's Degree in the field of Computer Science, Information Systems, or Business Administration Minimum 10 years' leading sizeable IT planning and application development functions Minimum 5 years’ defining and deploying technology to improve HCM business services Demonstrated strong negotiating, influence, and leadership skills Experience in Automation/RPA, digital/virtual assistants and mobility Experience in Compensation practices Delivered projects and operations using agile delivery principles and teams Work Effectively in a matrix organization Additional Information</strong McDonald’s is committed to providing qualified individuals with disabilities reasonable accommodations to perform the essential functions of their jobs. Additionally, if you (or another applicant of whom you are aware) require assistance accessing or reading this job posting or otherwise seek assistance in the application process, please contact recruiting.supportteam@us.mcd.com McDonald’s provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to sex, sex stereotyping, pregnancy (including pregnancy, childbirth, and medical conditions related to pregnancy, childbirth, or breastfeeding), race, color, religion, ancestry or national origin, age, disability status, medical condition, marital status, sexual orientation, gender, gender identity, gender expression, transgender status, protected military or veteran status, citizenship status, genetic information, or any other characteristic protected by federal, state or local laws. This policy applies to all terms and conditions of employment, including recruiting, hiring, placement, promotion, termination, layoff, recall, transfer, leaves of absence, compensation and training. Nothing in this job posting or description should be construed as an offer or guarantee of employment.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-21T01:58:41.000Z"
    },
    "company": {
        "name": "McDonald's",
        "link": "https://www.linkedin.com/company/mcdonald%27s-corporation"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 120,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Chicago",
        "region": "IL",
        "postal_code": "60654",
        "street_address": null,
        "latitude": 41.88323,
        "longitude": -87.6324
    }
}