{
    "job": {
        "title": "Software Engineer",
        "industry": "",
        "description": "Job details Job Type Full-time Full Job Description The Role: As a core member of the system firmware team, you will be responsible for architecture, design, and develop PCIe solutions for Ampere's platform. In particular, lead (with the existing team) the design and development of the PCIe host controller driver and its related activities with the Trusted Firmware, UEFI and OS accordingly. Communicate with customers regarding all aspect of customer firmware concerns. In addition, handle cross function interaction with other teams. What the Team Wants You to Know: ARM firmware development work at Ampere is interesting, challenging, and will expand your professional breadth. Working in this area brings out the best engineering in people and produces products that have value in the market. The ARM server firmware/software is relatively new and you will have the opportunity to invent new software technology and influence the ARM server community. What You Will Do: Architect, design, and develop PCIe solutions for Ampere SoC's Interact with customer/3rd party vendors to address firmware requirement Lead, plan and implement all PCIe firmware development in trusted firmware, UEFI, and OS Interact and coordinate with various system firmware teams accordingly for firmware integration/issues Handle development of PCIe host driver in firmware and OS What You’ll Bring: 7+ years software development with C/C++ languages, shell script, perl and python 5+ years of experience with system design/development 5+ years of experience with PCIe host controller, bridge, and end point cards Experience with PCIe architecture Experience with PCIe capabilities such as configuration, ECAM, PCIe BAR, IO/memory region, ARI, ACS, ATS, PASID, etc. Experience with PCIe SERDES Experience with firmware boot loader (UEFI) and Linux kernel Experience with various NIC, storage (NVMe), and GPU cards Knowledge of Trusted Firmware (TF) implementation Self-managed individual with excellent problem-solving skills Good English communications skills, both verbal and written Education Bachelor’s degree or foreign degree equivalent in Electrical Engineering, Computer Science, Information Technology or a related technical field Perks in Santa Clara Office has panoramic views of Silicon Valley Garage parking Gym and café on campus Healthy snacks, espresso and drinks Standing /Ergo friendly desk set-up Ping-pong/game room Unlimited Flextime and 10+ paid holidays Perks in Portland Walking distance of breweries, landscaped parks, art galleries, restaurants and shops Garage parking On-site bike parking and repair station Gym On-site café, bar, and market Roof top terrace with Willamette River views Healthy snacks, espresso and drinks Standing /Ergo friendly desk set-up Game room Unlimited Flextime and 10+ paid holidays Perks in Raleigh Modern and open office setting Four miles of jogging and pedestrian trails Walking distance to various restaurants and shopping Healthy snacks, espresso, and drinks Adjustable sit-stand desks Unlimited Flextime and 10+ paid holidays Our Company Ampere is designing the future of hyperscale cloud and edge computing with the world’s first cloud native processor. Built for the cloud with a modern 64-bit Arm server-based architecture, Ampere gives customers the freedom to accelerate the delivery of all cloud computing applications. With industry-leading cloud performance, power efficiency and scalability, Ampere processors are tailored for the continued growth of cloud and edge computing. Our Story Like the scientist behind its name, Ampere employees are innovators. We understand the needs of cloud computing and different software requirements. We are inventing what comes next and looking at everything from the structure of memory and how efficient the system is, to considerations on speed, cost of electricity and ability to cool. Power, size, weight and cost are driving the technology requirements and the innovation to come. Our world class team of engineers, with depth and expertise in the cloud and semiconductor industries, is not only focused on the development of new semiconductor designs but also building out the first software ecosystem for Arm®-based server processors. Through the Ampere approach to the cloud and edge, we give our customers the freedom to challenge the status quo and accelerate next-generation data centers for the most memory-intensive applications. Given the challenge we have outlined, we are building a culture of entrepreneurs that ensure customers come first, proactively approaching industry challenges in the areas of security, power and performance, delivering results that matter most.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-23T04:09:41.000Z"
    },
    "company": {
        "name": "AMPERE COMPUTING EMPLOYER LLC",
        "link": "https://www.linkedin.com/company/ampere-computing-employer-llc"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 84,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "United States",
        "region": null,
        "postal_code": "99999",
        "street_address": null,
        "latitude": 39.50355,
        "longitude": -99.0183
    }
}