{
    "job": {
        "title": "Software Dev QA Engineer",
        "industry": "Information Technology and Services,Computer &amp; Network Security,Computer Software",
        "description": "Job Description Fortinet is developing a powerful platform that combines the security for Enterprise, Datacenter and carrier solutions that enables organizations to efficiently manage, scale and secure their networks. The Software Development QA Engineer will be part of this exciting development and will be working with a strong technical team that has experience delivering NGFW solutions. Participate in building a IPS platform for Enterprise/Data centers/Carriers that provides high throughput packet processing using latest networking technologies. Job Duties Execute functional/performance testing on products using a combination of manual and auto-testing techniques Focus on Fortigate firewall product test Create, maintain and execute test cases as well as scripting Reproducing and troubleshooting the bug with developer Collaborate closely with the development team to analyze, debug and resolve any issues Troubleshoot customer's issue Passionate, motivated and always willing to learn and explore new technologies Good team player Job Experience Required Solid knowledge of Networking Technology, especially Layer 2, 3 and 4, including VLAN, STP, LACP, VRF, RIP, OSPF, BGP, VRRF, HA redundancy, TCP, UDP and etc. Operations experience in Unix/Linux environment is essential Good Understanding of security technologies like firewall, IPS, Authentication, VPN and etc. Automation experience using Python Hands-on Experience in one or more of the firewall product Fortinet/Juniper/Sourcefire/Checkpoint/PaloAlto etc is a plus Demonstrated knowledge and trouble-shooting experience on most used techniques or networking protocols, Routing protocols. Experience in handling customer issues is a plus Experience in using Spirent or Ixia traffic generator is a plus Ability to work in collaborative environment and communicate well with other departments Ability to work on tasks under tight time constraints Hands on experience of Networking/firewall features, system level or equivalent experience on deploying and configuring Networking/firewall devices is a plus Have any networking certification like Fortinet NSE, CCNA, CCNP, CCIE, JNCIS, JNCIP, JNCIE etc is a plus. Educational Requirements Master’s Degree in Computer Science or related field #GD About Us Fortinet (NASDAQ: FTNT) secures the largest enterprise, service provider, and government organizations around the world. Fortinet empowers its customers with intelligent, seamless protection across the expanding attack surface and the power to take on ever-increasing performance requirements of the borderless network - today and into the future. Only the Fortinet Security Fabric architecture can deliver security features without compromise to address the most critical security challenges, whether in networked, application, cloud or mobile environments. Fortinet ranks number one in the most security appliances shipped worldwide and more than 450,000 customers trust Fortinet to protect their businesses. We are committed to providing reasonable accommodations for all qualified individuals with disabilities. If you require assistance or accommodation due to a disability, please contact us at accommadations@fortinet.com. Fortinet is an equal opportunity employer. We value diversity in our company, and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, or any other applicable legally protected characteristics in the location in which the candidate is applying.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-09-12T04:40:35.000Z"
    },
    "company": {
        "name": "Fortinet",
        "link": "https://www.linkedin.com/company/fortinet"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Sunnyvale",
        "region": "CA",
        "postal_code": "94089",
        "street_address": null,
        "latitude": 37.373676,
        "longitude": -122.036575
    }
}