{
    "job": {
        "title": "Software Engineer (ITEC)",
        "industry": "Information Technology and Services,Design,Hospital &amp; Health Care",
        "description": "Software Engineer Location: Aurora, CO. Required Clearance: Secret U.S. Citizenship Mandatory: Due to our US federal government contract, candidates for this position are required to be a US Citizen and will be subject to a background investigation. Job Description ITEC is looking for talented Software Engineers to join our team. Job Responsibilities Develop new functional capabilities within software applications to meet a wide range of customer requirements and operational needs. Develop software baseline changes using Agile and DevOps methods. Analyze, debug, and troubleshooting technical problems. Work as an effective team member on an Integrated Product Team effort to achieve program success. Contribute to the completion of program and project milestones. Required Skills Experienced with object-oriented analysis and design (OOAD). Experience with Agile development. Software and system-level debugging experience including the ability to identify problems in established code and make modifications as necessary. A minimum of 2-6 years of software experience using Java in a Linux environment. Since 1999, ITEC has maintained a strong and reputable presence in support of DoD and Intelligence community mission-critical programs. We are proud of our amazing Company culture. At ITEC, we take excellent care of our employees with competitive salaries, an employee care program and a great benefits package including Medical, Dental, Vision, Paid Time Off, and 401k.",
        "employment_type": "CONTRACTOR",
        "date_posted": "2021-09-08T03:10:37.000Z"
    },
    "company": {
        "name": "ettain group",
        "link": "https://www.linkedin.com/company/ettain-group"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Aurora",
        "region": "CO",
        "postal_code": "80018",
        "street_address": null,
        "latitude": 39.712933,
        "longitude": -104.81936
    }
}