{
    "job": {
        "title": "Senior Software Test Engineer",
        "industry": "Retail,Consumer Goods,Internet",
        "description": "Job Summary The Senior Software Developer in Test is responsible for ensuring that the software systems built at iHerb can be validated against expected behavior by developing and maintaining test automation programs. This role is responsible for understanding software engineering principles and developing test automation software. Job Expectations Analyze user stories to develop comprehensive test cases for functional, integration, and performance testing Monitor, maintain and continuously improve existing automated regression tests Write test automation programs that are easy to maintain and extend. Collaborate with Product and UX teams to define acceptance criteria for user stories Participates in special projects and performs other duties as assigned The duties and responsibilities described above may provide only a partial description of this position. This is not an exhaustive list of all aspects of the job. Other duties and responsibilities not outlined in this document may be added as necessary or desirable, with or without notice. Required Knowledge, Skills and Abilities Familiar with modern software architecture such as micro services, event-driven architectures, and containers Experience with test automation technology using Appium, selenium or similar Experience implementing test automation in BDD / POM framework. Experience with API automation using POSTMAN, RestAssured or Karate Performance testing experience using Jmeter, blaze meter or similar for web, mobile and backend applications. Experience with Testcase management tools like TestRails and CI/CD tools like Jenkins. Mobile testing experience using saucelabs, browserstack or similar. Programming experience in one or more of the following languages Python, Java,JavaScript,C#, Objective-C, and Swift Experience in backend, integration, and end to end test would be a plus Able to identify areas of ambiguity in testing Ability to understand loosely defined specifications and discovery of software behaviors via ad-hoc methods Strong ownership instincts and being able to mentor junior team members Excellent organization skills and ability to effectively communication with teams Equipment Knowledge Experience with Microsoft Office Suite (Word, Excel, PowerPoint) Experience with Google Business Suite (Gmail, Drive, Docs, Sheets, Forms) preferred Experience Requirements Generally requires a minimum of eight (8) plus years of experience in test automation and quality assurance Education Requirements A bachelor’s Degree in Computer Science or equivalent work experience Judgment/Reasoning Ability Able to identify, troubleshoot and resolve problems quickly using sound judgment, poise and diplomacy. Ability to use judgment and reasoning skills, and determine when to escalate issues, as required, in a timely manner. Physical Demands The physical demands described here are representative of those that must be met by a Team Member to successfully perform the essential functions of this job. While performing the duties of this job, the Team Member is regularly required to talk and hear. The Team Member is frequently required to sit, walk, climb stairs, use hands and fingers, bend, stoop and reach with hands and arms. Reaching above shoulder heights, below the waist or lifting as required to file documents or store materials throughout the work day. The Team Member may occasionally lift or move office products and supplies up to 25 pounds. Proper lifting techniques required. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. Work Environment The noise in the work environment is usually moderate. Other factors are Hectic, fast-paced with multi-level distractions Professional, yet casual work environment Office / Warehouse environment Ability to work extended hours as required About IHerb iHerb is a leading global e-commerce retailer with an emphasis on providing an exceptional selection of nutritional and wellness products for the past 25 years. With over 30,000 products shipped to over 180 countries, we provide the best overall value for natural products through an innovative and efficient supply chain process. Our teams have a strong sense of commitment and pride in their work, which has allowed us to grow, even during the recent pandemic. At iHerb, our purpose is to empower people to enhance their health, happiness, and well-being — that starts with valuing our team members by providing a positive work environment with competitive benefits. Our five shared values unite our team members across the globe and provide a stable foundation. These values speak to who we are, the culture we’re building, and how every single team member contributes to our larger company vision. iHerb's Shared Values Focus on the Customer Empower Our People Be Entrepreneurial & Pivot Quickly Embrace Diversity & Inclusion Strive for Simplicity IHerb Benefits At iHerb, we are dedicated to offering programs designed to help our employees and their families stay healthy, live well and plan for the financial future. Built on a strong foundation, our programs provide options and upgrades with flexibility, protection, and security in mind. Below is a snapshot of the benefits we offer our team members. For a more comprehensive listing, visit www.iHerbBenefits.com. Medical Care Starting in 2021, iHerb covers 100% of the associated cost for medical benefits Dental and Vision benefits Safe Harbor 401(k) + company match (100% of the first 6% of the employee’s contribution) Company-paid Term Life Insurance Short and Long Term Disability Flexible Spending Account (for qualifying expenses) Pet Insurance Voluntary Supplemental Benefits Education Reimbursement Programs Professional Development and Job Training Wellness Programs with opportunity to earn up to $300 per year We strive for innovation, targeted at delivering a customer-centric experience while transforming the online shopping experience. We change direction and define ourselves in the idea that individually we are incredible but united our growth is infinite and paramount to our success. iHerb strives to be the global industry leader! iHerb is an Equal Opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or veteran status. iHerb provides equal employment opportunities to all applicants for employment and prohibits discrimination and harassment.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-17T07:42:23.000Z"
    },
    "company": {
        "name": "iHerb, LLC",
        "link": "https://www.linkedin.com/company/iherb"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Irvine",
        "region": "CA",
        "postal_code": "92717",
        "street_address": null,
        "latitude": 33.68591,
        "longitude": -117.82472
    }
}