{
    "job": {
        "title": "Site Reliability Engineer",
        "industry": "Outsourcing/Offshoring",
        "description": "Microsoft Azure PaaS - US Citizen / Green Card Holders Only - As this is a Federal Project Roles/Responsibilities Design and deliver software to improve the reliability, scalability, latency, and efficiency of your services. Design and implement scalable monitoring and deployment solutions for large-scale distributed systems. Ability to work independently. Drive serviceability requirements upstream. Engage in service capacity planning and demand forecasting, software performance analysis and system tuning. Conduct periodic on call duties. Site Reliability Engineering: Stability through track and investigate problem incidents in your area of expertise by using standard and custom problem management tools and processes. BASIC QUALIFICATIONS: Four-year college degree in Information Technology, Information Security, related field or equivalent work experience Experience with SQL Server: Stored procedures, Server Replication, Transactional Replication Five years of experience in a large enter Is any remote work allowed? Yes, remote. **US Citizen / Green Card Holders Only**",
        "employment_type": "CONTRACTOR",
        "date_posted": "2021-08-10T20:28:42.000Z"
    },
    "company": {
        "name": "Sophus Info Solutions",
        "link": "https://www.linkedin.com/company/sophus-info-solutions"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Washington",
        "region": "United States",
        "postal_code": "98925",
        "street_address": null,
        "latitude": 47.411373,
        "longitude": -120.556366
    }
}