{
    "job": {
        "title": "Software Engineer (Remote)",
        "industry": "Information Technology and Services,Computer Software,Internet",
        "description": "About Us Fleetio is a modern software platform that helps thousands of organizations around the world manage a fleet. Transportation technology is a hot market and we’re leading the charge, with raving fans and new customers signing up every day. We recently raised a $21M Series B round and are on an exciting trajectory as a company. You can learn more about it here. About The Role We're looking for a Full Stack Software Engineer to join our growing engineering team and help us build amazing features for our customers. The ideal candidate is someone who has professional software development experience, takes high ownership, can work independently with minimal guidance, is highly driven and motivated to deliver value. This is a remote role and is open to candidates based in the United States, Canada, or Mexico . What you'll be doing You’ll collaborate with other Engineers, Product Managers, Designers, and the Customer Success team to implement features and help solve escalated support cases. About 80% of your time will be spent working on new features and 20% will be spent investigating and fixing bugs. What's in it for you Be a part of an incredible team of “A” players who go above and beyond to make Fleetio a successful company. You will build software used by people all around the world. So many different types of companies and organizations operate a fleet each day, and Fleetio is a good fit for most of them (it’s a huge market). Work remotely (within the United States, Canada, or Mexico), or at our Birmingham, AL HQ. Over 80% of our Engineering Team works remotely (including our CTO), and we have promoted a strong remote working culture since the beginning (2012). We place great emphasis on work/life balance. We have families and hobbies and know you do, too. Our team Our Engineering and Product teams are structured as autonomous squads that execute within one focal area toward a defined product vision. We're hardcore believers in easy-to-use software and our main goal as Product Engineers is to quickly and continuously deliver meaningful value to our customers. We've optimized our CI/CD tools and processes to get code into our production environments easily, resulting in an average of 40 deploys per week. Learn more about our Engineering Team and the interview process here. Requirements Experience with Ruby on Rails Experience with relational databases such as Postgres Experience with front-end web technologies HTML5, CSS3, JavaScript (ES6) Experience with unit testing frameworks such as Jest, RSpec Understanding of the balance between scrappiness and long-term code maintainability Compelled to make things look beautiful and work flawlessly Cherish productivity, delivering value and have a deep-rooted care for helping teams communicate and collaborate more effectively and efficiently Strong communication skills (particularly written) Be sure to mention \"coffee\" in your application so we know you read this Considered a plus Experience with ReactJS Experience with Tailwind or CSS-in-JS frameworks Experience with TypeScript You know a thing or two about the fleet management industry Benefits 100% coverage of employee health and dental insurance (50% family) 401(k) + match Company stock options Vision, STD & LTD Dependent Care FSA and Medical FSA Generous PTO, Company Holidays & Floating Holiday Maternity/Paternity leave Community service funds Mac laptop Professional development funds Health and wellness incentives Remote working friendly since 2012 Not quite what you were hoping for? Check out our other engineering roles here. For Non-U.S. based candidates, Fleetio offers a country-specific competitive benefits package. Fleetio provides equal employment opportunities to all employees and applicants and prohibits discrimination and harassment. We celebrate diversity and are committed to creating an inclusive environment for all. All employment is decided on the basis of qualifications, merit and business need. This application is not intended to and does not create a contract or offer of employment. Employment with Fleetio is at will. If you have a disability or a special need that requires an accommodation to fill out the online application, please let us know by calling (205) 718-7500 or emailing recruiting@fleetio.com .",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-13T16:26:28.000Z"
    },
    "company": {
        "name": "Fleetio",
        "link": "https://www.linkedin.com/company/fleetio"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Birmingham",
        "region": "AL",
        "postal_code": "35226",
        "street_address": null,
        "latitude": 33.522858,
        "longitude": -86.80771
    }
}