{
    "job": {
        "title": "Data Scientist",
        "industry": "Information Technology and Services,Computer Software,Internet",
        "description": "At HubSpot, we use data to power our decisions, systems and product solutions. We’re seeking an experienced data scientist to deliver that insight. Our ideal team member will have the mathematical and statistical expertise you’d expect, but a natural curiosity and creative mind that’s not so easy to find. You will join a team of data specialists, but will “slice and dice” data using your own methods, creating new visions for the future. Objectives of this Role Collaborate with product design and engineering to develop an understanding of needs Research and devise innovative statistical models for data analysis Enable smarter business processes—and implement analytics for meaningful insights Keep current with technical and industry developments Role Objectives/Responsibilities Work as the lead data strategist, building models to improve internal efficiency and customer experience Work closely with the engineering team to strategize and execute the development of data products Execute analytical experiments methodically to help solve various problems and make a true impact across various domains and industries Implement analytical models into production by collaborating with software developers and machine learning engineers. Devise and utilize algorithms and models to mine big data stores, perform data and error analysis to improve models, and clean and validate data for uniformity and accuracy Identify relevant data sources and sets to mine for client business needs, and collect large structured and unstructured datasets and variables Analyze data for trends and patterns, and Interpret data with a clear objective in mind Communicate analytic solutions to stakeholders and implement improvements as needed to operational systems Skills And Qualifications Degree in statistics, applied mathematics, or related discipline 5+ years experience in data science Proficiency with data mining, mathematics, and statistical analysis Advanced pattern recognition and predictive modeling experience Advanced use of SQL, R, Python Experience with machine learning models Comfort working in a dynamic, research-oriented group with several ongoing concurrent projects Preferred Qualifications Master’s degree in stats, applied math, or related discipline 2+ years of project management experience Professional certifications We know the confidence gap and imposter syndrome can get in the way of meeting spectacular candidates, so please don’t hesitate to apply — we’d love to hear from you. About HubSpot HubSpot (NYSE: HUBS) is a leading customer relationship management (CRM) platform that provides software and support to help businesses grow better. We build marketing, sales, service, and website management products that start free and scale to meet our customers’ needs at any stage of growth. We’re also building a company culture that empowers people to do their best work. If that sounds like something you’d like to be part of, we’d love to hear from you. You can find out more about our company culture in the HubSpot Culture Code, which has more than 5M views, and learn about our commitment to creating a diverse and inclusive workplace, too. Thanks to the work of every employee globally, HubSpot was named the #4 Best Place to Work on Glassdoor in 2021, and has been recognized for award-winning culture by Great Place to Work, Comparably, Fortune, Entrepreneur, Inc., and more. Headquartered in Cambridge, Massachusetts, HubSpot was founded in 2006. Today, thousands of employees work across the globe in HubSpot offices and remotely. Visit our careers website to learn more about culture and opportunities at HubSpot. By submitting your application, you agree that HubSpot may collect your personal data for recruiting, global organization planning, and related purposes. HubSpot's Privacy Notice explains what personal information we may process, where we may process your personal information, our purposes for processing your personal information, and the rights you can exercise over HubSpot’s use of your personal information.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-18T21:19:01.000Z"
    },
    "company": {
        "name": "HubSpot",
        "link": "https://www.linkedin.com/company/hubspot"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "United States",
        "region": null,
        "postal_code": "99999",
        "street_address": null,
        "latitude": 39.50355,
        "longitude": -99.0183
    }
}