{
    "job": {
        "title": "Site Reliability Engineer - Associate (Production support  PaaS)",
        "industry": "Financial Services",
        "description": "Job Description: Job Title: Site Reliability Engineer (SRE) Corporate Title: Associate Location: Cary, NC Overview Site Reliability Engineer (SRE) sits within Application Integration Platforms (AIP). The AIP mission is to build the commercial, technical, architectural, and operational frameworks that will allow Deutsche Bank to operate successfully and securely. PaaS is the strategic application-hosting platform of the Bank and hosts more than 50% of Bank's workloads. As a part of the team, you will be responsible for the delivery of on-premises and public-cloud based PaaS using third party vendor solutions that leverage Docker and Kubernetes. You will also provide on-demand access to technology services needed to build, host and manage bank applications using a variety of infrastructure solutions. What We Offer You: We offer competitive health and wellness benefits, empowering you to value life in and out of the office An environment that encourages networking and collaboration across functions and businesses Conveniently located nature trails, accessible year-round Hear from our people and look inside our office: DB@The Muse Your Key Responsibilities: Production support of PaaS infrastructure which includes incident, change, and problem management with a focus on maintaining the security and stability of the platform Collaborate with engineering, site reliability engineering (SRE) teams to host containerized workloads using the above technologies in the standardized, governed, and bank-approved manner Work closely with various vendors and internal teams, to ensure compliance with technology roadmap and security requirements on application, infrastructure, and operating system level Enhanced operational activities with trouble shooting and resolving issues requiring system functional knowledge and advanced knowledge of the underlying technologies being supported Your Skills and Experience: In-depth working experience with Linux containers, Ansible-like configuration/automation tools, and OpenShift technologies; experience with monitoring stack like Grafana and Prometheus will be handy in daily activities Exposure to middleware technologies like WebLogic, JBoss, and Tomcat is preferred Work experience in operations and infrastructure models with strong troubleshooting skills including basic networking knowledge; in-depth knowledge and experience with ITIL process is required to perform business as usual (BAU) activities Experience with Google Cloud Platform desired Good communication skills are required to collaborate with engineering and applications teams at various stages For external candidates: Please note, we are unable to consider external candidates who require sponsorship for work visas for this position. Please continue to review the Deutsche Bank Careers website for other opportunities. Our values define the working environment we strive to create - diverse, supportive and welcoming of different views. We embrace a culture reflecting a variety of perspectives, insights and backgrounds to drive innovation. We build talented and diverse teams to drive business results and encourage our people to develop to their full potential. Talk to us about flexible work arrangements and other initiatives we offer. We promote good working relationships and encourage high standards of conduct and work performance. We welcome applications from talented people from all cultures, countries, races, genders, sexual orientations, disabilities, beliefs and generations and are committed to providing a working environment free from harassment, discrimination and retaliation. Click here to find out more about our diversity and inclusion policy and initiatives. We are an Equal Opportunity Employer - Veterans/Disabled and other protected categories. Click these links to view the following notices: EEO is the Law poster and supplement; Employee Rights and Responsibilities under the Family and Medical Leave Act; Employee Polygraph Protection Act and Pay Transparency Nondiscrimination Provision.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-19T20:43:55.000Z"
    },
    "company": {
        "name": "Deutsche Bank",
        "link": "https://de.linkedin.com/company/deutsche-bank"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Cary",
        "region": "NC",
        "postal_code": "27511",
        "street_address": null,
        "latitude": 35.791473,
        "longitude": -78.78114
    }
}