{
    "job": {
        "title": "Data Strategy Scientist",
        "industry": "Automotive,Consumer Goods",
        "description": "Role Summary The Data Strategy Scientist role resides within the Decision Sciences & Analytics team and is a key player in providing operational support for the coordination, adoption, monitoring, and compliance of data governance standards and policies to support data science best practices. They will also develop and support methods to ensure the accuracy and integrity of data frameworks to enhance data access across the enterprise and shape future strategy for Decision Sciences & Analytics. The Decision Sciences & Analytics team has a clear vision – use data to make better business decisions that increase customer satisfaction and loyalty. Working cross-functionally across the organization the Data Strategy Scientist will support our mission by defining data standards, ensuring the quality of our data, monitoring compliance, and ensuring the proper use of our data that positively influences business decisions and direction for Decision Sciences & Analytics. The successful candidate will be a collaborator that is skilled in bringing insights from data to life. This is a new position, in a new team, with the unique opportunity to lay the foundation of how data and data driven decisions become a core element to VW Credit’s strategy. Role Responsibilities Utilize tools and methods to extract, link and manipulate large data sources – 20% Utilize tools and methods to ensure the accuracy and integrity of enterprise data – 15% Collaborate with various business and IT stakeholders to report data quality issues, make remediation recommendations, and provide communicate the status of enterprise data to data users/owners – 15% Collaborate with business teams on defining & documenting data across the enterprise – 15 % Develop and monitor compliance of Data Governance standards and policies – 15% Partner with IT and business teams to create and maintain master data. – 10% Participate in the routine reporting of data quality metrics to business users as well as upper management. – 5% Execute key data governances processes – intake/demand and prioritization process, issue management process, and monitoring process - 5% Primary Location United States-Illinois-Libertyville Other Locations United States-Virginia-Herndon Experience Required – 7-9 years of work experience 3+ years in utilizing methods and tools to extract and analyze data from large data sources 3+ years utilizing advanced data programming methods to ensure the accuracy and integrity of business data for data science and analytics projects 3+ years in developing, integrating and deploying Data Governance solutions 2+ years in developing solutions to monitor the utilization of data sources to ensure compliance with Data Governance standards (Supporting business users to utilize standardized data approaches) 2+ years supporting the developing data strategies to support business needs 2+ years in developing and monitoring compliance of Data Governance policies Education Required – Bachelor’s degree in Economics, Computer Science, Information Systems, or STEM field Desired – Bachelor’s degree in Economics, Computer Science, Information Systems, or STEM field Additional certifications in data sciences or analytics related fields General Skills Strong knowledge of business processes, information management, data flows, data relationships, and data quality standards to support decision sciences, analytics, and data governance efforts. Proficiency with multiple data environments (Oracle, Hadoop, MySQL, AWS S3/RedShift/RDS) Proficiency in multiple programming languages (such as Python, SQL, SAS, R, Java or Scala) Proficiency with Data Catalog/Metadata and Data Governance Solutions (Informatica Enterprise Data Catalog and Axon, Collibra, Alation) Strong understanding of the importance and benefits of good data quality, and the ability to champion results Experience defining requirements and managing master data, metadata, hierarchies, data classification, etc. Experience extracting, linking and manipulating large data sources using SQL, SAS or other related tools Demonstrated analytical, problem solving skills Initiative and ability to use technical knowledge to identify and address key issues, and determine resolution strategies aligned to business needs Ability to communicate effectively with team members, peers, and senior management Ability to think in a creative and innovative manner to create appropriate and efficient solutions Excellent interpersonal communication skills (both written and verbal); ability to communicate and present to a wide variety of audiences, both business and technical Ability to build relationships and partnerships, achieving results through influence, persuasion and the leveraging of these relationships Positive customer service orientation and responsiveness Specialized Skills Required – Experience extracting, linking and manipulating large data sources using Python, SQL, SAS or other related tools Experience with Big Data technologies such as Hadoop, Data Lakes, and AWS Prior experience with Data Catalog/Metadata and Data Governance solutions such as Informatica Enterprise Data Catalog and Axon, Collibra, or Alation Experience defining requirements and managing master data, metadata, hierarchies, data classification, etc. Strong understanding of data warehouse and data lake best practices Strong understanding of the importance and benefits of good data quality, and the ability to champion results to support better business decisions Experience working with and effectively collaborating with reporting, development, and business teams Comfortable working with tight deadlines; must be proactive and able to multi-task between multiple initiatives concurrently. Successful record of accomplishment of thriving in a fast paced, entrepreneurial and dynamic environment. Strong communication skills across all mediums and audience types (technical, business, executive, etc.) Desired – Experience in Master Data Management concepts and solutions Experience with Informatica Metadata Manager, Information Analyst, Enterprise Data Catalog, and Axon tools Experience with process mining approaches and tools, such as ProM Must be driven, operationally savvy, action-oriented who continually strives for improvement Strong critical thinking ability and problem resolution skills. Experience in Financial Services (automotive finance preferable) Work Flexibility Travel 10% of the time Onsite, remote work options dependent on team operating model and initiative Flexibility to work outside of core hours (Monday – Friday) to support business demand We are proud to be an EEO employer M/F/D/V. We maintain a drug-free workplace and perform pre-employment substance abuse testing.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-12T16:22:56.000Z"
    },
    "company": {
        "name": "Volkswagen of America, Inc",
        "link": "https://www.linkedin.com/company/volkswagen-of-america-inc"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 84,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Libertyville",
        "region": "IL",
        "postal_code": "60092",
        "street_address": null,
        "latitude": 42.282997,
        "longitude": -87.95334
    }
}