{
    "job": {
        "title": "Software Engineer I",
        "industry": "Information Technology and Services,Financial Services,Hospital &amp; Health Care",
        "description": "Functions as technical leader for multiple, complex applications and core utilities, utilizing demonstrated ability to deliver technical solutions to the problems and challenges inherent in related projects. As such, would be involved in all phases of project life cycle, assisting in the technical design, coding, implementation, maintenance, and support of assigned systems. Principal Duties and Responsibilities: Indicate key areas of responsibility, major job duties, special projects and key objectives for this position. These items should be evaluated throughout the year and included in the written annual evaluation. Work with vendors, application teams and other Systems Programming staff to develop core infrastructure technologies and frameworks, using best practices, that are highly scalable, stable, and well-performing Collaborates with other IS staff (Operations, Network Services, etc) to provide inter-disciplinary technical solutions. Works with project team of users and analysts to develop technical requests ensuring design will integrate with current systems. Assist staff in coding, testing, implementing, and maintaining systems. Writes and organizes internal documentation for new and existing applications. Maintains integrity of applications by routinely running data checks and analyzing errors and imbalances. Works to identify causes and prevent further occurrences. Mentors and supports others in Systems Programming in the design, implementation, use, and support of said applications and core utilities both individually and in team-based mechanisms such as code review and team design sessions. Develops project technical work plan and enforces adherence. Participates in team’s on call rotation to triage and resolve incoming issues as necessary. On call rotation requires 24x7 availability for one week and potentially similar availability during the backup on call week. Performs all other duties as assigned. Bachelor’s degree in Computer Science preferred, or relevant clinical I.T. industry experience. Five+ years in application infrastructure programming environment Skills/Abilities/Competencies: (Must be realistic, neither overstated nor understated, and related to the essential functions of the job.) Possess strong interpersonal skills to effectively communicate with cross functional teams including staff at all levels of the organization Ability to successfully negotiate and collaborate with others of different skill sets, backgrounds an levels within and external to the organization Strong problem solving and negotiation skills Ability to effectively conduct meetings, both formal and informal Requires minimal direction from leadership and possesses the ability to learn quickly Strong technical skills required, including the proven ability to design, implement, and maintain large, complex software libraries. Ability to translate business need into technical specification and set realistic goals for the completion of said needs. Stay current on emerging industry technologies and trends. Act as a technical leader for entire group. Excellent communication ability with other team members is absolutely required. Able to understand the political climate of the organization and act accordingly. Ability to work and be flexible within a complex work environment with competing priorities. Ability to assume a high level of responsibility. Experience with the management and administration of latest versions of SQL Server, SharePoint, Team Foundation Server is highly desirable Provide require technical support to end users who are having application issues. Reboot servers to apply monthly patches on a rotating basis. Experience with report writing tools. Primary Location MA-Wellesley-MGB NWH IS Work Locations MGB NWH IS Job Applications/Web Development Organization Mass General Brigham(PHS) Schedule Full-time Standard Hours 40 Shift Day Job Employee Status Regular Recruiting Department PHS Information Systems Job Posting Aug 23, 2021",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-24T01:18:22.000Z"
    },
    "company": {
        "name": "Mass General Brigham",
        "link": "https://www.linkedin.com/company/mass-general-brigham"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Wellesley",
        "region": "MA",
        "postal_code": "02181",
        "street_address": null,
        "latitude": 42.29693,
        "longitude": -71.291855
    }
}