{
    "job": {
        "title": "Software Engineer",
        "industry": "Biotechnology",
        "description": "We’re a cognitive science company on a mission to optimize the measurement of brain health to advance the development of new medicines and to enable earlier clinical insights in healthcare. That’s why we’re seeking a Software Engineer, responsible for developing platform components and product functionality for a portfolio of products which make up Cogstate’s solution offerings. The Software Engineer will be given substantial feature ownership and is expected to contribute product ideas as well as code. This position will work closely with R&D, Product Management, Test and Quality Assurance teams. *As of 4/1/21 this posting is not open to candidates based in CO. Key Responsibilities Understand and evaluate user stories, workflows and wireframes. Collaborate with product managers, expand upon desired functionality and provide technical approaches that accomplish the product needs. Identify functionality contained within our platform library as well as contribute to its capabilities. Develop feature functionality within the platform framework for product specific requirements, while still maintaining re-use and leveraging design patterns. Develop clean code, reusable components, and unit tests. Qualifications & Experience Bachelor’s Degree or equivalent experience. Knowledge of JavaScript, TypeScript, Angular, HTML5, and CSS3. Knowledge of C#, Entity Framework, REST Services with WebAPI Knowledge of Relational and NoSQL databases, such as SQL Server and MongoDB. Experience with version control systems (TFS, Git). Strong experience with web standards; browser capabilities, workarounds, best-practice development techniques. JavaScript unit testing, namespacing and design patterns. Write clean, testable, x-browser, modular, commented code. Experience with agile development methodologies. Skills & Expertise Ability to quickly understand and evaluate user stories, workflows and wireframes. Good communication skills – work collaboratively and development counterparts and others within the team. Exceptional problem-solving skills – creative out-of-the-box thinking, and comfort evaluating and deploying new technologies. Solid ability to work effectively under pressure and meet tight deadlines. Ability to adapt and learn new technologies. Company Perks Remote Work Practices: Cogstate is a virtual first company. Cogstate employees can work from anywhere where Cogstate is registered to do business within the United States, Australia, or the United Kingdom! Generous Paid Time-off: Cogstate employees receive 20 days of vacation leave, 10 days of personal leave and 10 paid public holidays, which can be tailored to dates of personal, cultural, or religious significance to you. 401(k) Matching: As you invest in yourself and your future, Cogstate invests in you too: we match up to 3% of your yearly salary in Cogstate’s 401k program Competitive Salary: We offer competitive base salaries plus additional earning opportunities based on the position. Health, Dental & Vision Coverage: We've invested in comprehensive health & dental insurance options with competitive company contributions to help when you need it most. We also offer free vision insurance for all full-time employees. Short-Term & Long-Term Disability Life Insurance: 100% employer sponsored Pre-Tax Benefits: Healthcare and Dependent Care Flexible Spending Accounts Learning & Development Opportunities: Cogstate offers a robust learning program from mentorships to scholarships to Coursera to improve knowledge or obtain certifications in applicable areas of interest. Why We Do What We Do Our mission at Cogstate is to optimize the measurement of brain health to advance the development of new medicines and to enable earlier clinical insights in healthcare. We are driven by the notion that through our work we impact the health of communities by delivering solutions that combine breakthrough science with advanced technologies. We are inspired by the dedication of researchers and the resilience of patients, and we are strengthened by our 20-year heritage supporting them. We are always working to simplify the complex with solutions that offer insights and hope for the future of healthcare, particularly dementia-related diseases and rare and pediatric disorders. Our Core Values Do the Right thing - We are honest and dependable. We keep our promises, act with integrity and foster trust through fairness, transparency, and open communication Think like a customer - We see our customers’ challenges as our own and strive to help them succeed. We listen, learn what makes them tick and adapt to creatively meet their needs. Take care of each other - We work together to tackle big challenges that can only be achieved through the collective and caring efforts of diverse individuals. We show appreciation, value differences, and celebrate wins. Lead with science - We are determined, curious thinkers who use knowledge and data to challenge the status quo and redefine what is possible. We are experts in our fields who are trusted by our customers. Own it - We are accountable to excellence and hold ourselves to high standards. We are problem solvers at heart and quick to both identify obstacles and bring solutions Work Hard - We show resilience in the face of hardship to do the messy work of innovating. We stick to difficult tasks with grit and determination. We iterate, experiment, and embrace failing forward. See the big picture - We are driven by an understanding that the work we do matters. Our personal connections to the mission may be different, but we know our “why” and it motivates us to do our best work. Commitment to Diversity & Inclusion Cogstate is committed to building and maintaining a fair, diverse and inclusive workplace where the personal worth of each employee is recognized, and all are respected and valued for their differences. Applicants with disabilities may be entitled to reasonable accommodation under the terms of the Americans with Disabilities Act and certain state or local laws. If you need assistance in applying please email PeopleandCulture@cogstate.com.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-15T15:37:41.000Z"
    },
    "company": {
        "name": "Cogstate",
        "link": "https://au.linkedin.com/company/cogstate"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "United States",
        "region": null,
        "postal_code": "99999",
        "street_address": null,
        "latitude": 39.50355,
        "longitude": -99.0183
    }
}