{
    "job": {
        "title": "Embedded Software Engineer",
        "industry": "",
        "description": "HIRING: Senior Embedded Software Engineer @ Franklin Lakes, NJ - DIRECT CLIENT - Long-Term Contract...!!! (Please reply ASAP) Job Title: Senior Embedded Software Engineer Location: Franklin Lakes, NJ Duration: Long-Term Contract Job Description: The Senior Embedded Software Engineer is a position contributing to the embedded software development for medical device product advancements. The individual would have responsibility for working cross-functionally to understand end-user needs and system requirements and mapping them to detailed embedded software and electrical design specifications and translating these into robust design elements. The responsibilities can include but are not limited to embedded electronics and software development, board design and updates & design for critical features and functions, implementation of features as part of a multi-disciplinary R&D team (systems, electrical, mechanical and application software) and integrating and verifying implemented features through unit and functional testing. Typically, the Senior Engineer will interface with other development teams for product integration and will interface both internally and externally to understand the clinical use cases, usability, and system requirements. Minimum Qualifications: ·       Bachelor’s Degree in Electrical Engineering, Computer Engineering, or software engineering. ·       A minimum of 3 years of post-educational professional experience, with focus on Embedded Software Development, Board design and development. ·       Experience developing embedded software in C/C++/Assembly and programming knowledge of Real-Time operating systems such as VxWorks, Micrium etc. is required ·       Working knowledge of digital and analog circuits, microprocessor hardware and software and development environments ·       Working knowledge of advanced mathematical Digital Signal Processing (DSP) concepts and implementation techniques, software instantiation of both linear & non-linear algorithmic processes associated with both the analog and digital highly desired ·       Read and understand of schematic designs and Electrical components reference manuals ·       Experience generating technical documentation and authoring internal/external publications Desired Qualifications: ·       Master’s Degree in Electrical Engineering, Computer Engineering, or software engineering. ·       5+ years of professional experience in the medical device industry ·       Experience programming ARM Cortex M4F or similar processors ·       Previous experience leading medical device embedded software design efforts. ·       Experience with schematic tools such as OrCAD, PSpice or DX Designer ·       Experience with board bring-up; effective use of hardware test equipment including logic analysers, digital storage oscilloscopes, etc. ·       Experience working with Wi-Fi, Blue Tooth, and other wireless technologies ·       Programming: application development and testing instrumentation in python, etc. ·       Experience developing low level device drivers for hardware peripheral interfaces and devices such as SPI, I2C, USB, LCD, ADC, DAC, RFIC ·       Working knowledge of applicable standards for medical devices: FDA QSR, ISO 13485, ISO 14971, IEC 62304. ·       Experience in a structured development environment with source control and bug tracking systems ·       Knowledgeable in hardware/software interfaces, programming of embedded processor utilizing a Real Time Operating System (RTOS), real-time and post processing data analytics, ·       Experience with software quality assurance to include unit and integration test development and execution, and code inspection and reviews. Competencies: ·       Excellent written & verbal communication skills ·       Self-directed with the ability to learn and adapt quickly to new technologies and trends ·       Team player, flexible and adaptable and capable of working on an agile environment Thanks & Regards Ravi Palaparthy Direct No: 201-905-1030 Email: ravi.p@infojiniconsulting.com",
        "employment_type": "CONTRACTOR",
        "date_posted": "2021-08-25T17:43:42.000Z"
    },
    "company": {
        "name": "Infojini Inc",
        "link": "https://www.linkedin.com/company/infojini-inc"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "New Jersey",
        "region": "United States",
        "postal_code": "08810",
        "street_address": null,
        "latitude": 40.139095,
        "longitude": -74.67851
    }
}