{
    "job": {
        "title": "Analytics Partner",
        "industry": "Marketing and Advertising,Computer Software,Internet",
        "description": "About Ancestry: When you join Ancestry, you join a human-centered company where every persons story is important. We believe that by discovering the struggles and triumphs of our past, we can foster deeper bonds and more meaningful connections among families and communities. Our talented team of scientists, engineers, genealogists, historians, and storytellers is dedicated to empowering customers around the world from all backgrounds on their journeys of personal discovery. With more than 27+ billion digitized global historical records, 100 million family trees, and 18 million people in our growing AncestryDNA database, Ancestry helps customers discover their family story and gain a new level of understanding about their lives. Passionate about dedicating your work to enriching peoples lives? You belong at Ancestry. Ancestry is looking for an Analytics Partner to join our People & Places team to help the organization make data-driven decisions that support our talent strategy. In this role, you will partner closely with internal HR partners and other functions to understand business objectives, gather data, develop and deliver accurate and actionable reports and dashboards connecting multiple systems across the organization. What You'll Do: Identify, analyze, and interpret trends or patterns with HR data sets and make recommendations for business and process improvement Develop reports and dashboards using various reporting and visualization tools to meet business needs Spearhead change from reactive to predictive analytics to create lasting business value Utilize tools such as Workday, Excel, Tableau, etc. to produce dashboards, reports (recurring & ad hoc), and presentations Handle complex requests, data visualizations, forecasting, sequencing, and trend analysis Partner closely with key stakeholders to identify leading and lagging indicators for key people success metrics and track those with meaningful metrics and methodologies Ensure data integrity and recommend solutions where problems arise Work in cross-functional teams, managing multiple priorities and stakeholders Work autonomously on projects that require significant judgment Analyze large data sets to identify issues or trends. Communicate data findings and action items to management Who You Are: 3-5 years of relevant analytics experience Knowledge of HR functions and practices strongly desired Expert level MS Excel skills, and other data visualization experience (Tableau, Power BI, Workday, Domo, etc.) Working knowledge of SQL, Python, R, VBA or other programming languages Excellent communication and organization skills A strong team player who is self-driven and uses logic/critical thinking skills to solve problems Ability to visualize data (e.g. tables, charts, etc.) in a manner that helps the end user quickly and accurately understand and execute on its results Intellectual curiosity and capability, as well as ability to conceptualize data into meaningful stories and conclusions that allow leaders to take action Working knowledge of an integrated HR tech stack, databases and spreadsheets (Workday, Crystal Reports, MS Office Suite) with the ability to learn new software and operating systems as they arise Ability to handle sensitive matters and maintain confidentiality Knowledge of global legal/compliance risks and requirements Additional Information: Ancestry is an Equal Opportunity Employer that makes employment decisions without regard to race, color, religious creed, national origin, ancestry, sex, pregnancy, sexual orientation, gender, gender identity, gender expression, age, mental or physical disability, medical condition, military or veteran status, citizenship, marital status, genetic information, or any other characteristic protected by applicable law. In addition, Ancestry will provide reasonable accommodations for qualified individuals with disabilities. All job offers are contingent on a background check screen that complies with applicable law. For San Francisco office candidates, pursuant to the San Francisco Fair Chance Ordinance, Ancestry will consider for employment qualified applicants with arrest and conviction records. Ancestry is not accepting unsolicited assistance from search firms for this employment opportunity. All resumes submitted by search firms to any employee at Ancestry via-email, the Internet or in any form and/or method without a valid written search agreement in place for this position will be deemed the sole property of Ancestry. No fee will be paid in the event the candidate is hired by Ancestry as a result of the referral or through other means.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-21T01:53:48.000Z"
    },
    "company": {
        "name": "Ancestry",
        "link": "https://www.linkedin.com/company/ancestry.com"
    },
    "education": {
        "required_credential": null
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "San Francisco",
        "region": "CA",
        "postal_code": "94121",
        "street_address": null,
        "latitude": 37.78008,
        "longitude": -122.42016
    }
}