{
    "job": {
        "title": "Software Engineer - Tock",
        "industry": "Marketing and Advertising,Computer Software,Internet",
        "description": "What We’re Looking For At least 2 years of experience Demonstrated fluency with one or more general purpose programming languages, including but not limited to: Java, JavaScript, C/C++ Experience in at least one of our areas of focus: Web application development Java application development Javascript/Typescript development Large software systems development Mobile application development (iOS or Android) A self-motivated individual who works well with little direction Enjoys being part of a team that works and learns together Has excellent written and verbal communication skills Loves making and building things as part of a growing team What You’ll Do The Software Engineer position is located in Chicago or can be 100% remote. You'll be helping us build the next generation restaurant booking system, based on the tried and true (and proven) system deployed at world-class restaurants such as Alinea, Next, The French Laundry, and more. We're looking for engineers who are generalists—you'll be working with a mix of front and back-end web development tools. Our team is pretty small and undergoing exponential growth, so there's a great opportunity for you to make a difference. All Tock employees are working remotely at this time. We are closely monitoring the status of COVID-19 as we continue our work to build a return-to-work plan that ensures a safe return to our offices and provides flexibility for our employees. Responsibilities Build next-generation web applications that are fast and responsive Be able to build a feature or enhancement, starting with engineering design taking it all the way to production with the support and mentorship of a senior engineer Contribute to core team culture and contribute code to efforts across a fast-growing company Support, maintain and upgrade code and participate in implementation of a complex system About Tock Tock is the only all-in-one system for reservations, takeout, delivery, and events. We are changing the way restaurants, wineries, and culinary event organizers run their business and how guests explore, discover, and book at these places all around the globe. About Squarespace Squarespace makes beautiful products to help people with creative ideas succeed. By blending elegant design and sophisticated engineering, we empower millions of people — from individuals and local artists to entrepreneurs shaping the world’s most iconic businesses — to share their stories with the world. Squarespace’s team of more than 1,200 is headquartered in downtown New York City, with offices in Dublin, Los Angeles and Portland. For more information, visit www.squarespace.com/about. Tock’s Explosive Growth Awarded Fast Company's \"Most Innovative Companies\" for 2021 Awarded Built In’s “2021 Best Places to Work” Awarded America’s Hottest Brands of 2020 by AdAge Won Chicago Tribune's \"Game Changer\" Award for industry innovation Reached a global customer base of 30 countries operating in 200+ cities Processed over $1 billion in prepaid reservations Named one of 2019's 50 Startups to Watch Featured in: New York Times, Bloomberg, GQ, Vice, Wired, Food & Wine, Eater, Skift Table, Chicago Tribune, Crain's Chicago Business, New York Post, and more What We Offer Competitive salary Full benefits (medical, dental, and vision insurance) 401k + employer match Flexible vacation & paid time off Paid parental leave Commuter benefit in the form of pretax (US) Not only do we embrace and celebrate the diversity of our customer base, but we also strive for the same in our employees. At Squarespace, we are committed to equal employment opportunity regardless of race, color, ethnicity, ancestry, religion, national origin, gender, sex, gender identity or expression, sexual orientation, age, citizenship, marital or parental status, disability, veteran status, or other class protected by applicable law. We are proud to be an equal opportunity workplace.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-09-03T00:00:00.000Z"
    },
    "company": {
        "name": "Squarespace",
        "link": "https://www.linkedin.com/company/squarespace"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Chicago",
        "region": "IL",
        "postal_code": "60654",
        "street_address": null,
        "latitude": 41.88323,
        "longitude": -87.6324
    }
}