{
    "job": {
        "title": "Software Engineer-Graduate",
        "industry": "Information Technology and Services,Computer Software,Telecommunications",
        "description": "Job ID: 113630 Required Travel : No Travel Managerial - No Location: USA- Plano (Amdocs Site) Who are we? At Amdocs, our purpose is to enrich lives and progress society. With our creativity and technology, we help make a better-connected world. Amdocs and its 25,000 employees serve the top tier players in the communications and media industry, enabling next-generation experiences in 85 countries. Our cloud-native, open and dynamic portfolio of digital solutions, platforms and services brings greater choice, faster time to market and flexibility, to better meet the evolving needs of our customers as they drive growth, transform and take their business to the cloud. Listed on the NASDAQ Global Select Market, Amdocs had revenue of $4.1 billion in fiscal 2019. For more information, visit Amdocs at www.amdocs.com We are Hiring New Grads Nationwide! Are you ready for the first step in your career? The Graduate Program Amdocs is dedicated to your success in your first professional role in a very dynamic industry. The Amdocs Graduate Learning program has been established to shorten your time to be productive in your group by building up the required skills and knowledge in the field. The Graduate Program starts your career with training in areas of SW Development, Amdocs and industry knowledge, meeting Amdocs leaders, Amdocs product training and personal mentorship. Roles available Mobile Development, Field Engineer, RF Engineer, Software Support Engineer, Software Developer, Software Engineer, Software Test Engineer, or Production Support Engineer, Project Officer What will your job look like in this role? You will get the chance to work on new technologies for automation, building dashboards and optimize environment build process. You will be exposed to the most current and advanced technologies, work with multi channels and a diverse area of expertise. Responsible for providing best-in-class technical support, install and maintain the software environment to a global customer base. You will provide engineering expertise to troubleshoot, modify and engineer software solutions and configurations. You will configure, install, and upgrade environments through the product life cycle (development, test, UAT, production) for both production and non-production environment on Prem and on Cloud. All you need is... BS or MS in Computer Science, Engineering, Information Technology. Must be a recent or upcoming college graduate Internship experience as Software Support/Infrastructure Engineer Unix/Linux scripting, Oracle/SQL scripting Java, CD/CI Technologies, Cloud Implementation knowledge, MicroService Technologies Strong technical, problem solving, and communication skills Why you will love this job Amdocs is dedicated to your success as a technology professional. This is an opportunity to be an instrumental member of an industry leader and work with our industry's most sophisticated technologies. You will be exposed to the latest training in the industry both internally and externally. You will have the opportunity to work in a growing organization, with ever-growing opportunities for personal growth. We are a dynamic, multi-cultural organization that constantly innovates and empowers our employees to grow. Our people our passionate, daring, and phenomenal teammates that stand by each other with a dedication to creating a diverse, inclusive workplace. We offer a wide range of stellar benefits including health, dental, vision, and life insurance as well as paid time off, sick time, parental leave, and 5h/month for volunteering! Amdocs is an equal opportunity employer. We welcome applicants from all backgrounds and are committed to fostering a diverse and inclusive workforce",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-30T00:00:00.000Z"
    },
    "company": {
        "name": "Amdocs",
        "link": "https://www.linkedin.com/company/amdocs"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Plano",
        "region": "TX",
        "postal_code": "75093",
        "street_address": null,
        "latitude": 33.019695,
        "longitude": -96.697586
    }
}