{
    "job": {
        "title": "Machine Learning Engineer, Applied ML",
        "industry": "Information Technology and Services,Computer Software,Financial Services",
        "description": "Join a leading fintech company that’s democratizing finance for all. Robinhood was founded on a simple idea: that our financial markets should be accessible to all. With customers at the heart of our decisions, Robinhood is lowering barriers, removing fees, and providing greater access to financial information. Together, we are building products and services that help create a financial system everyone can participate in. We Are Proud Of The World Class Products And Company Culture We Continue To Build And Have Been Recognized As Just as we focus on our customers, we also strive to create an inclusive environment where our employees can thrive and do impactful work. A Great Place to Work A CNBC Disruptor 50 in 2019 and 2020 A LinkedIn Top Startup in 2017, 2018, 2019 and 2020 Robinhood is backed by leading investors that include DST Global, Index Ventures, NEA, Ribbit Capital, Thrive Capital, and Sequoia. Check out life at Robinhood on The Muse! About The Role Insights from data power most decisions at Robinhood. The Core ML team works with a simple mission of making it easy to use machine learning at Robinhood. The team is executing the mission by building the core infrastructure (eg. training and serving platform, feature platform) and a number of model-as-a-service solutions (eg. embedding service, multi-arm bandit service). The team works closely with data scientists who are applying ML in various spaces such as risk and fraud, growth, customer understanding etc. to ensure that they are able to ship their solutions to create business value. As a machine learning engineer focused on applied ML , you will work closely with other teams to identify critical problems that can be solved using ML. You will co-develop a model, sometimes an ML system, with them and then, whenever possible, build and deploy the solution as a reusable and generalizable ML service. You will continue to build such services and onboard new applications to existing services over time. What You’ll Do Day To Day Dive into data to understand business problems that may benefit from ML Train novel machine learning models and take them to production Invest in feature engineering and model hyper-parameter tuning to improve predictive power and performance of the models After deployment, closely monitor the model and take recourse to model interpretability to understand how its impacts on users Work cross-functionally with data scientists, product managers, operations, and other engineering teams to build generalizable and reusable models Collaborate with our data infrastructure teams to build highly scalable services and systems Present ML success stories to internal and external audiences Survey the latest and greatest in various areas of ML and bring the benefits of those to the firm whenever possible About You 3+ years of experience as machine learning engineer or applied machine learning scientist Graduate degree in a quantitative field such as computer science, mathematics, statistics, engineering or natural sciences and some experience in software engineering in a production environment Solid understanding of machine learning and deep learning algorithms Experience of working with large, noisy and highly imbalanced datasets Experience of building and shipping ML models that are aligned with product roadmap Excellent programming skills, including proficiency in Python Passion for working and learning in a fast-growing company Excellent communication skills to tell a story through data. Experience of building relationships and influencing stakeholders across multiple discipline Bonus Points Industry experience of delivering business impact with ML models or systems Research and publication experience in any field of machine learning Proof of excellence in Kaggle or similar forums Technologies We Use Python Scikit-learn Tensorflow or Pytorch Kubernetes Kafka Feeling ready to give 100% to democratizing finance for all? We’d love to have you apply, even if you feel unsure about whether you meet every single requirement in this posting. At Robinhood, we’re looking for people invigorated by our mission, not just those who simply check off all the boxes.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-04T01:08:06.000Z"
    },
    "company": {
        "name": "Robinhood",
        "link": "https://www.linkedin.com/company/robinhood"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Menlo Park",
        "region": "CA",
        "postal_code": "94029",
        "street_address": null,
        "latitude": 37.45322,
        "longitude": -122.18322
    }
}