{
    "job": {
        "title": "Machine Learning Engineer",
        "industry": "Information Technology and Services",
        "description": "Let AIM Consulting guide you to success today! Our IT Placement Specialists are dedicated to placing qualified professionals, like you, in exciting opportunities with leading companies across the nation. We are currently seeking multiple Machine Learning Engineers for a 100% remote positions with a great company, please no third party candidates at this time ! You can email Madison Brown (Nichols) to apply directly at mnichols@aimconsulting.com . Responsibilities: Enhance and extend machine learning algorithms and models in AWS SageMaker Build end to end data pipeline for machine learning models Work with big data for machine learning applications and write optimized queries Work with a machine learning team to define and enforce data collection standards Perpetually work to identify and improve usability in all applications Help understand new KPIs to monitor and leverage to improve the performance of models Qualifications: Experience in AWS SageMaker Strong experience with Python, including NumPy Experience with AWS tools such as CodePipeline and CodeCommit Support estimation and rollout planning efforts Preferred: Bachelor's Degree in Quantitative Field (Data Science, Mathematics, Computer Science, Engineering, etc.) Certifications in AWS Experience with AWS Redshift and/or AWS Aurora Benefits: Comprehensive Medical Plan Prescription Program Dental Plan Vision Program Term Life Insurance Plan 401(k) Retirement Savings Plan Inclusivity: AIM Consulting is committed to building an inclusive and diverse workplace. AIM Consulting is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-10T20:38:23.000Z"
    },
    "company": {
        "name": "AIM Consulting Group",
        "link": "https://www.linkedin.com/company/aim-consulting-group"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "United States",
        "region": null,
        "postal_code": "99999",
        "street_address": null,
        "latitude": 39.50355,
        "longitude": -99.0183
    }
}