{
    "job": {
        "title": "Business Solution Lead",
        "industry": "Information Technology and Services,Insurance,Financial Services",
        "description": "As a member of the Global Center of Competence (CoC), the Business Solution Lead partners with business/functional leaders and working groups to provide strategic leadership and identify pragmatic and innovative automation and digitization solutions. He/She will leverage their process-driven, analytical and technical skills to create and maintain automation solutions. Their role includes coaching business and functional unit leaders across the organization to drive and lead process augmentation and automation initiatives across the enterprise. Key Responsibilities Engage in Business Solutioning and Stakeholder Management Partner with the Product Owner to define core product vision, goals, functionality and requirements Stand up the practice within the LoB/Function and partner closely with the Transformation Lead to create the framework and governance model Establish a shared vision by building consensus on priorities leading to product execution with the product owner Collaborate with highly creative user experience experts, visual designers and engineers to reach the best possible version of a feature or product to bring to market Create and maintain product roadmaps, with the product owner feature backlogs and product documentation Help define and refine working processes in order to maximize efficiency in constantly evolving environments Drive Lean Management thinking and start to transition using Agile Development Partner with BPR expert to identify automation opportunities, discuss automation approach and framework with designated business and functional product owners by outlining deliverables, timeline, roles/responsibilities to build BPA pipeline Design digital/ business automation solution in partnership with IT and Product Owners while ensuring alignment with the agreed process flow Collaborate with internal IT experts to design feasible IT solution, build user stories to support desired automation solution Secure approvals for BA resource requirements Establish and participate PI Planning, regular project update meetings Monitor pipeline, and inflight initiatives progress. Support business/functional Automation owner to build out communication to ensure proper engagement such as key milestones, in scope processes current and future state, timelines, technology dependencies, roles/responsibilities between business/functional owners, IT, Vendor and Global Automation team Act as an escalation to secure engagement and resolution Assists the line of business to escalate and resolve project blockers such as issues with business resources, IT and or SI Partner engagement Mentor and manage several team members Support Process Automation Implementation and Production Collaborate with transformation leads, and product owners to align on business objective, drive the automation business solution and planning, consult IT during the development phase, and monitor supervised production for assigned Workstream and/or initiatives. Supports the deployment of agile and machine learning capabilities in the LOBs in line with Chubb standards Engage the appropriate internal and external (staff augmentation) resources to use process automation best practices to deliver successful solutions. Assist the business to Integrate multiple projects across the line of business value chain. Assist in the deployment of program and project management standards for effective delivery meeting Time, Quality, Budget, LOB requirements. Guide and partner with change management resources (Change Manager & HR) to ensure effective communication and execution of the required organizational and role changes. Provide guidance on the post implementation support. Assist the LOB to Identify “in unit” roles and time requirements and work with business leaders to identify staff for the assignments Conduct lessons learnt post deployment on each initiative Engage in enhancing Digital / Process Automation framework and monitor adoption across the enterprise Participate as an active member of the Business Process Automation Excellence team, in developing a set of best practice guidelines and training content for use across all PA initiatives. Contribute to the continuous improvement of automation framework, technologies and knowledge by sharing information, building standards, developing intellectual property and capturing lessons learned. Provide direction and guidance to all program staff for assigned units and programs. Coach team members on areas of development to increase their knowledge and work performance. Preferred Qualifications Minimum of 4-6 years transformation experience, ideally within a global corporate footprint 4 – 6 years digital/business process engineering/business analysis experience in financial services Successful experience in major automation/digital transformations, with a heavy focus on both top and bottom line improvement Demonstrate deep understanding of the different ways of automation – including robotic process automation, intelligence scanning, virtual process management, artificial intelligence/cognitive Top tier strategy or execution consulting experience with Digital and Lean or Opex management experience preferred Experienced leader, known for building relationships, influencing and successful agreement with senior level executives; build credibility, and work effectively with global matrix groups fostering collaboration and teamwork Business Value Chain and Opportunity assessment techniques and experience Domain knowledge in one or more relevant industries Strong knowledge of digital, machine learning, robotics, chatbots, bpm and other newer automation centric technologies Digital agency, consulting or entrepreneurial experience Strong understanding of user experience, technical & business issues Emphasis on user-driven product design and data-driven product refinement Master’s degree or equivalent experience, advanced degree Preferred certification as a Green Belt Process Engineer or equivalent qualification Project Management certification and Agile experience Innovation mindset and savvy business and market acumen Sharp analytical and problem-solving skills Exhibit professionalism Up-to-date understanding of market trends and keen interest in following emerging technologies. EEO Statement At Chubb, we are committed to equal employment opportunity and compliance with all laws and regulations pertaining to it. Our policy is to provide employment, training, compensation, promotion, and other conditions or opportunities of employment, without regard to race, color, religious creed, sex, gender, gender identity, gender expression, sexual orientation, marital status, national origin, ancestry, mental and physical disability, medical condition, genetic information, military and veteran status, age, and pregnancy or any other characteristic protected by law. Performance and qualifications are the only basis upon which we hire, assign, promote, compensate, develop and retain employees. Chubb prohibits all unlawful discrimination, harassment and retaliation against any individual who reports discrimination or harassment. Work Locations Jersey City Other Locations USA-New York-New York Job Operations & Customer Service Travel No Job Posting Aug 23, 2021, 3:44:04 PM",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-24T01:16:32.000Z"
    },
    "company": {
        "name": "Chubb",
        "link": "https://ch.linkedin.com/company/chubb"
    },
    "education": {
        "required_credential": null
    },
    "experience": {
        "months_of_experience": 48,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Utica-Rome Area",
        "region": null,
        "postal_code": "13501",
        "street_address": null,
        "latitude": 43.09009,
        "longitude": -75.2616
    }
}