{
    "job": {
        "title": "Data Scientist - Machine Learning Engineer",
        "industry": "Information Technology and Services,Retail,Financial Services",
        "description": "Position Summary... What You'll Do... We are looking for a Machine Learning (ML) Engineer to help us create artificial intelligence products. He/she will collaborate with product manager, product solution architect, tech leads and multi-disciplinary engineers to define, develop and deploy an actual production system that uses AI/ML. Machine Learning Engineer Responsibilities Include Designing and developing MLOps for machine learning and deep learning systems for NLP applications. Develop machine learning applications according to requirements Implementing appropriate ML algorithms Running machine learning tests and experiments Train and retrain systems when necessary Perform statistical analysis and fine-tuning using test results Extend existing ML libraries and frameworks Study and transform data science prototypes Select appropriate datasets and data representation methods Research and implement appropriate ML algorithms and tools Keep abreast of developments in the field Requirements Proven experience as a Machine Learning Engineer or similar role Understanding of data structures, data modeling and software architecture Deep knowledge of math, probability, statistics and algorithms Ability to write robust code in Python, Java and R Familiarity with machine learning frameworks related to NLP. Excellent communication skills Ability to work in a team Outstanding analytical and problem-solving skills BSc in Computer Science, Mathematics or similar field; Master’s degree is a plus Preferred Qualification Experience in developing MLOps. Comfortable with fast-paced, fluid and ambiguous situations. Minimum Qualifications... Outlined below are the required minimum qualifications for this position. If none are listed, there are no minimum qualifications. Option 1: Bachelors degree in Statistics, Economics, Analytics, Mathematics, Computer Science, Information Technology or related field and 2 years' experience in an analytics or related field. Option 2: Masters degree in Statistics, Economics, Analytics, Mathematics, Computer Science, Information Technology or related field. Option 3: 4 years' experience in an analytics or related field. Preferred Qualifications... Outlined below are the optional preferred qualifications for this position. If none are listed, there are no preferred qualifications. Data science, machine learning, optimization models, Master’s degree in Machine Learning, Computer Science, Information Technology, Operations Research, Statistics, Applied Mathematics, Econometrics, Successful completion of one or more assessments in Python, Spark, Scala, or R, Using open source frameworks (for example, scikit learn, tensorflow, torch) Primary Location...603 MUNGER AVE STE 400, DALLAS, TX 75202, United States of America",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-09-24T08:03:43.000Z"
    },
    "company": {
        "name": "Walmart",
        "link": "https://www.linkedin.com/company/walmart"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 48,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Dallas",
        "region": "TX",
        "postal_code": "75342",
        "street_address": null,
        "latitude": 32.777977,
        "longitude": -96.79621
    }
}