{
    "job": {
        "title": "Software Engineer",
        "industry": "",
        "description": "Position Summary: JibJab is looking for a Full Stack Software Engineer to help build our future. They are relied upon to improve our existing products that millions of customers already love but also look to the future to explore new ways to make our customers laugh, feel loved, or just lol. This is a unique role that will help lead the effort to take many concepts and features to production with a small team of designers and engineers. Experience with: Ruby on Rails and/or Node & Express.js React.js, or similar frontend javascript framework Typescript & Javascript SQL, preferably Postgres Good programming principles, using SOLID and similar paradigms Debugging efficiently and effectively Effectively communicate and collaborate with engineering teammates, and product managers Ability to implement user story requirements and commit to story point estimates Diagnosing production issues, using logs and reports from customers Backend and Frontend Page Performance analysis, using modern approaches and tools Bonus: Serverless and Micro Service architecture knowledge Caching strategies, and working with different types of caches, such as Redis, and Cloudfront Working with queues, such as SQS Qualifications: Innovative thinker and a collaborative team player. 0-3 years of experience About the Company: JibJab is a leading digital greeting card and social expression company. We are one of the oldest start-ups, with our roots dating back to 1999 and have been deemed the “original dot com cockroach.” We live at the intersection of art and technology and have a mission of making billions of people happy. We live our core values , so if these resonate with you, we may be a good fit: Transparency: We are all on the same team and succeed by sharing what we know, both good and bad. Trust: We earn trust by delivering on our commitments. We assume people have the best intentions in both their actions and their decisions, and we advocate for their success by offering support. Joy: We deliver joy to our users and we derive joy from work. We aim to make billions of people happy. Intention: We know why we do something, what we hope to achieve and what we will learn from it. Inclusion: We build diverse teams, with a wide range of cultures, backgrounds and experiences. Diverse perspectives push our company forward and these differences lead to better, more informed decisions. Healthy Debate: We engage in respectful, enlightening debates and we listen to all opinions. When a decision is made, we fully commit and focus on the path forward. Quality: Quality is our competitive advantage. We prioritize quality over quantity. What we do, we do well.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-04T22:30:31.000Z"
    },
    "company": {
        "name": "JibJab",
        "link": "https://www.linkedin.com/company/jibjabllc"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Wisconsin",
        "region": "United States",
        "postal_code": "54943",
        "street_address": null,
        "latitude": 44.639957,
        "longitude": -89.73298
    }
}