{
    "job": {
        "title": "Data Scientist (Open to Remote)",
        "industry": "Information Technology and Services,Computer Software,Financial Services",
        "description": "Company Description About us, but we’ll be brief We are thrilled to share that FORTUNE has named Experian one of the 100 Best Companies to Work For. In addition, for the last five years we’ve been name in the top 100 “World’s Most Innovative Companies” by Forbes Magazine. Experian DataLabs is a R&D unit at Experian formed with the desire to work in collaboration with Experian’s business units to enhance relationships with clients and acquire strategic datasets. Experian® is a global leader in providing information, analytical tools and marketing services to organizations and consumers to help manage the risk and reward of commercial and financial decisions. Using our comprehensive understanding of individuals, markets and economies, we help organizations find, develop and manage customer relationships to make their businesses more profitable. Job Description What you’ll be doing The Key Job Functions Include You will be part of Experian North America R&D DataLabs concentrating on research and development of novel analytical solutions, new product prototyping, as well as new data asset evaluation and acquisition. This position requires extensive background and knowledge in deep learning and machine learning. Develop complex machine learning-based analytical solutions extracting insights from large amount of structured and unstructured data from diverse data sources Identify/develop appropriate machine learning/deep learning/natural language understanding/natural language processing techniques to uncover the value of the data Designing data structure and data storage schemes for efficient data manipulation and information retrieval Developing tools for data processing and information retrieval Analyzing, processing, evaluating and documenting large data sets Applying, developing and inventing algorithms to solve challenging business problems Validating score performance and conducting ROI and benefit analysis Documenting and presenting model process and model performance Qualifications What your background looks like Advanced degree in Machine Learning, Data Science, AI, Computer Science, Computer Engineering, Electrical Engineering, Physics, Statistics, Applied Math or other quantitative fields 0-6 years of working experience in data science, and/or predictive modeling Demonstrated ability to lead and execute projects from start to finish Ability to independently support existing products Proven track record in modifying and applying advanced algorithms to address practical problems Experience in deep learning (CNN, RNN, LSTM, attention models, etc.), machine learning (SVM, GLM, boosting, random forest, etc.), graph models, and/or, reinforcement learning. Experience with generative modeling techniques such as GAN Experience with open source tools for deep learning and machine learning technology such as pytorch, Keras, tensorflow, scikit-learn, pandas, etc. Proven ability to work independently on development of complex models with extremely large and complex data structures Proficient in more than one of Python, R, Java, C++, or C Experience in large data analysis using Spark (pySpark preferred) Robust knowledge and experience with statistical methods Plusses: Experience with Natural Language Processing, Natural Language Understanding, and the relevant open-source tools Experience in developing, modifying and experimenting advanced language models Experience in developing/applying/evaluating conversational AI technology Extensive knowledge of SQL Experience with Hadoop and NoSQL related technologies such as Map Reduce, Hive, HBase, mongoDB, Cassandra, etc. Experience with online, mobile marketing analytics Experience with GPU programming Solid knowledge of Bayesian statistical inference and related machine learning methods. Experience with Agile methods for software development Perks During this pandemic, all Experian employees are working remotely. Once it’s safe to do so, we’ll slowly return to our offices however we are in no rush to do this. The safety of our employees is of utmost importance. Four weeks of vacation to start, five sick days and two volunteer days (plus eleven paid holidays) Competitive pay and comprehensive benefits package, with a bonus target of 20% Flexible work schedule and relaxed dress code Additional Information All your information will be kept confidential according to EEO guidelines. Experian is proud to be an Equal Opportunity and Affirmative Action employer. Our goal is to create a thriving, inclusive and diverse team where people love their work and love working together. We believe that diversity, equity and inclusion is essential to our purpose of creating a better tomorrow. We value the uniqueness of every individual and want you to bring your whole, authentic self to work. For us, this is The Power of YOU and it ensures that we live what we believe.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-23T06:39:50.000Z"
    },
    "company": {
        "name": "Experian",
        "link": "https://www.linkedin.com/company/experian"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "San Diego",
        "region": "CA",
        "postal_code": "92161",
        "street_address": null,
        "latitude": 32.71576,
        "longitude": -117.16382
    }
}