{
    "job": {
        "title": "Software Engineer – Containers &amp; Cloud",
        "industry": "Computer &amp; Network Security",
        "description": "The Position We are looking for bright and talented software engineers with primary knowledge in containers and cloud to join one of our cross functional international teams in Boston. The Boston team will be a new innovation hub with strong focus on containerization and cloud SaaS, for our flagship product Appgate SDP. With Appgate SDP we provide Zero Trust Network Access (ZTNA) to our customers which has been recognized by Forrester as one of the few leaders in the new hype in cybersecurity. If you can bring passion, knowledge and innovation to the team, we’d love to hear from you! Today our international organization is rapidly expanding and employs over 500 people world-wide with close to 160 software engineers. We work creatively, agile, and always encourage to use the latest technology. In order to create an inspiring, innovative and knowledge gathering working environment, we give our software engineers maximal autonomy. Within Appgate you will be surrounded by the world’s best ethical hackers, machine learning experts and network security engineers. What You will do Contributing to the containerization of our flagship security products as part of a creative cross-functional international team Create new Zero Trust products for containerized workloads Create, manage and integrate software to automate and secure our public and private cloud offerings. Building automated frameworks for safe production deployments which can easily be maintained and operated by our SRE’s Always learn and bring new concepts and technology to your team What you will need Work experience with containerized workloads: Kubernetes, Docker Work experience in some of the following areas: Go, Python, Rest APIs, AWS, GCP, Azure, Terraform, other programming languages Good understanding of the Linux operating system Strong knowledge about automatic deployment of software Some basic knowledge about IP networking Cares about readable, performant, reliable, and secure code Able to work with other international software teams ·       3+ years of experience or show desire to take a steep learning curve Fluent in English Your Key interests Cybersecurity Containers Cloud environments such as AWS, GCP and Azure Continuous deployment and integration SAAS based software delivery The Company Appgate is a new large-scale international security software startup that brings together a set of highly innovative cloud and hybrid-ready security and analytics products and services with a big focus on Network Access, Anti-Fraud and offensive security services. The company is planning to go public in the second half of the year, and just got a new $100 Million funding for our ambitious expansion plans. Appgate SDP is a context-aware, identity-centric access control solution that surpasses outdated hardware-defined and perimeter-centric approaches to infrastructure security with a “software-defined perimeter” that increases resilience, simplifies management complexity and reduces costs. Currently deployed with well over 200 customers, including a few fortune 100 companies and governments. Appgate SDP is the fastest growing product within the Appgate portfolio. Does this sound like an interesting challenge for you? We hope to hear from you! Interviews are held regularly so the role can be filled before the application deadline. Privacy and PuL - When you apply you allow us to save your information strictly for recruitment purposes.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-10-05T17:31:35.000Z"
    },
    "company": {
        "name": "Appgate",
        "link": "https://www.linkedin.com/company/appgate-security"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Boston",
        "region": "MA",
        "postal_code": "02118",
        "street_address": null,
        "latitude": 42.358994,
        "longitude": -71.05863
    }
}