{
    "job": {
        "title": "Fall 2021 Machine Learning Framework Software Development Co-Op/Intern Engineer - (101766)",
        "industry": "Semiconductors",
        "description": "What You Do At AMD Changes Everything At AMD, we push the boundaries of what is possible. We believe in changing the world for the better by driving innovation in high-performance computing, graphics, and visualization technologies – building blocks for gaming, immersive platforms, and the data center. Developing great technology takes more than talent: it takes amazing people who understand collaboration, respect, and who will go the “extra mile” to achieve unthinkable results. It takes people who have the passion and desire to disrupt the status quo, push boundaries, deliver innovation, and change the world. If you have this type of passion, we invite you to take a look at the opportunities available to come join our team. What You Do At AMD Changes Everything At AMD, we push the boundaries of what is possible. We believe in changing the world for the better by driving innovation in high-performance computing, graphics, and visualization technologies – building blocks for gaming, Immersive platforms, and the data center. Developing great technology takes more than talent: it takes amazing people who understand collaboration, respect, and who will go the “extra mile” to achieve unthinkable results. It takes people who have the passion and desire to disrupt the status quo, push boundaries, deliver innovation, and change the world. If you have this type of passion, we invite you to take a look at the opportunities available to come join our team. Machine Learning Framework Software Development Intern The Role Software development intern on teams building and optimizing Machine Learning system software for AMD GPU compute platforms. Work as part of an AMD development team and open source community to analyze, develop, test and deploy improvements to make AMD the best platform for machine learning applications. The Person Good skills in Python and C++ development in a Linux environment. Ability to work as part of a team, while also being able to work independently, define goals and scope and lead your own development effort. Key Responsibilities Develop and optimize deep learning workloads on frameworks like TensorFlow, PyTorch, ONNX-RT etc. on AMD processors Work with open-source framework maintainers to understand their requirements – and have your code changes integrated upstream Work in a distributed computing setting to optimize for both scale-up (multi-GPU) and scale-out (multi-node) systems Optimize the entire deep learning pipeline Apply your knowledge of software engineering best practices Preferred Experience Ability to work independently, define project goals and scope, and lead your own development effort. Strong mathematical foundation in Tensors, Convolutions, Linear Algebra, Numerical Mathematics & Statistics Good Python and C/C++ programming and software design skills, including debugging, performance analysis, and test design. Knowledge of GPU computing (CUDA, HIP, OpenCL) and basic understanding of Deep Learning is a plus Academic Credentials Masters or equivalent experience in Computer Science, Computer Engineering, or related field. LOCATION: Santa Clara, CA AMD does not accept unsolicited resumes from headhunters, recruitment agencies or fee based recruitment services. AMD and its subsidiaries are equal opportunity employers and will consider all applicants without regard to race, marital status, sex, age, color, religion, national origin, veteran status, disability or any other characteristic protected by law. Requisition Number: 101766 Country: United States State: Texas City: Austin Job Function: Student/ Intern/ Temp AMD does not accept unsolicited resumes from headhunters, recruitment agencies or fee based recruitment services. AMD and its subsidiaries are equal opportunity employers. We consider candidates regardless of age, ancestry, color, marital status, medical condition, mental or physical disability, national origin, race, religion, political and/or third party affiliation, sex, pregnancy, sexual orientation, gender identity, military or veteran status. Please click here for more information.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-01T00:48:09.000Z"
    },
    "company": {
        "name": "AMD",
        "link": "https://www.linkedin.com/company/amd"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Austin",
        "region": "TX",
        "postal_code": "78746",
        "street_address": null,
        "latitude": 30.264978,
        "longitude": -97.7466
    }
}