{
    "job": {
        "title": "Software Engineer (Python) - Remote",
        "industry": "",
        "description": "Ordermark’s mission is to become a trusted partner to restaurants everywhere, offering products and services that help restaurants adapt to changing consumer trends and technology. We pride ourselves in building a team of world-class thinkers and innovators to revolutionize the restaurant industry, empowering our customers to tap into new markets. Ordermark helps restaurants and virtual kitchens aggregate mobile orders across all the major online ordering service providers into a single dashboard and printer. Powered by Ordermark's leading restaurant technology platform, Nextbite serves the fast-growing food on-demand revolution by empowering existing restaurants everywhere to serve more customers and earn more revenue. Nextbite, creates delivery-only restaurant concepts with high-quality, chef-inspired menus available through delivery apps. This combined offering helps restaurants increase efficiency and grow profits, creating successful food service across the country. By joining Ordermark you will have a front row seat to the rapidly changing restaurant landscape and the explosive online ordering industry. About the Role Seeking talented remote Software Engineers who will bring their passion for both building efficient systems and delighting customers. You’ll leverage your technical expertise with architectures, frameworks, performance, security, automated testing, and more to help build our product. Meanwhile you will collaborate with other members of the Engineering and Product teams. If you are a collaborative, adaptive, effective communicator that loves to learn you will thrive in our innovative culture. Our current tech stack: Languages/Frameworks: Python, Django/Fast API, Celery Storage: PostgreSQL, Redis, S3, DynamoDB DevOps: Terraform, CircleCI The impact you will have: Be a hands-on contributor to the engineering organization by helping to grow and deliver sophisticated solutions to problems of all sizes Continual learning to help build a better product through experimentation Play an integral role in the ongoing engineering of Ordermark’s SaaS technology solutions What you bring to the role: BA/BS degree in computer science, engineering, or equivalent experience 4-6+ years' of software development experience (including production usage of Python) ; 4-6+ years' experience using modern API frameworks Experience architecting and deploying services on AWS or other cloud computing platforms Familiar with using Docker and containerization technologies A desire to learn or existing knowledge of IaaC technologies (Terraform) Implementation of CI/CD pipelines (CircleCI, Github Actions) A proven track record of delivering quality software, ideally in either the consumer web or enterprise SaaS space You have designed and implemented large, scalable web applications and have an appreciation for clean, elegant and simple code What we offer: A team that has transitioned to remote work impressively, and remains highly collaborative and connected Excellent growth opportunity, and stock options for all full-time employees Medical, dental and vision (90% covered by Ordermark; 50% for dependents) - eligible immediately Unlimited PTO and paid company holidays 401k - eligible immediately $60/month reimbursement for online-ordered meals Bonusly - a team recognition platform with fun rewards We pride ourselves in having a team that promotes diversity, inclusion, leadership, mindfulness, high initiative, energy and passion.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-27T16:36:03.000Z"
    },
    "company": {
        "name": "Ordermark",
        "link": "https://www.linkedin.com/company/ordermark"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 48,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "United States",
        "region": null,
        "postal_code": "99999",
        "street_address": null,
        "latitude": 39.50355,
        "longitude": -99.0183
    }
}