{
    "job": {
        "title": "Software Engineer",
        "industry": "",
        "description": "Position: Software Engineer IV Location: Raleigh, North Carolina Duration: Full-time, Permanent Start: ASAP Pay: COMPETITIVE This position performs complex research, design, and software development assignments within a software functional area or product line, and provides direct input to project plans, schedules, and methodology in the development of cross-functional software products. This position performs software design — typically across multiple systems; mentors more-junior members of the team; and talks to users/customers and translates their requests into solutions. MUST HAVE QUALIFICATIONS: • 5+ years of Software Engineering experience • BS Engineering/Computer Science or equivalent experience required MUST HAVE TECHNICAL SKILLS: • Advanced knowledge of software development methodologies (e.g., Agile, Waterfall). • Strong proficiency with data manipulation language including optimization techniques. • Strong understanding of normalized/dimensional data modeling principles. • Strong knowledge of multiple data storage subsystems. • Expertise (emphasis in bold) in development languages including but not limited to: C#, Java/J2EE, JavaScript, JSP, C/C++, HTML, XML, SQL, Windows, UNIX, and .Net. • Strong research skills. • Strong knowledge in industry best practices in development. • Knowledge in using and developing applicable tool sets. • Ability to interface competently with other technical personnel or team members to finalize requirements. • Ability to work well with internal and external technology resources. • Knowledge of test-driven development. • Ability to write and review portions of detailed specifications for the development of complex system components. • Ability to complete complex bug fixes. • Good oral and written communications skills. MAIN RESPONSIBILITIES: • Interface with other technical personnel or team members to finalize requirements. • Write and review portions of detailed specifications for the development of complex system components. • Complete complex bug fixes. • Work closely with other development team members to understand complex product requirements and translate them into software designs. • Successfully implement development processes, coding best practices, and code reviews. • Operate in various development environments (Agile, Waterfall, etc.) while collaborating with key stakeholders. • Resolve complex technical issues as necessary. • Train entry-level software engineers as directed by department management, ensuring they are knowledgeable in critical aspects of their roles. • Keep abreast of new technology developments. • Design and work with complex data models. • Mentor less-senior software developers on development methodologies and optimization techniques. • All other duties as assigned",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-18T15:59:54.000Z"
    },
    "company": {
        "name": "Insight Global",
        "link": "https://www.linkedin.com/company/insight-global"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Raleigh",
        "region": "NC",
        "postal_code": "27699",
        "street_address": null,
        "latitude": 35.781303,
        "longitude": -78.64168
    }
}