{
    "job": {
        "title": "Engineering Laser Technician - $5,000 Sign On Bonus",
        "industry": "Semiconductors,Electrical/Electronic Manufacturing",
        "description": "Are you naturally curious? At MKS, our collective curiosity drives us to be an innovation leader in many industries. Our products drive advancements in a wide range of technical fields like cloud computing, the generation of clean drinking water, self-driving cars, and space exploration. We are a collaborative team that values fresh thinking and believes in mutual respect, constructive candor, diversity, and inclusion. Our customers value us as a partner and trust us to continually push the boundaries of possibility. We believe in creating technology that transforms and improves our world and are looking for new team members who share our vision. If this is appealing to you, we want to meet you. Spectra-Physics is the Lasers Business Unit of MKS Instruments. We have an excellent opportunity for someone like you to join our innovative product development engineering team as an Engineering Laser Technician . In this position, you will build prototypes and contribute to the optical design of free-space and fiber-based laser systems. You will work interactively within a project team and use your excellent interpersonal and communication skills to work effectively with cross-functional team members. We push the boundaries of technology to develop a wide range of nanosecond, picosecond, and femtosecond lasers that address the needs of Industrial, Scientific, and Life and Health markets. If you have a passion for working with cutting-edge laser systems, this is the role for you. What you will do is: ·       Build, align, characterize, and document performance of optical systems and prototype lasers ·       Design and set up laboratory experiments, process the data, and report results in a clear and concise manner ·       Conduct reliability evaluation and qualification of components, sub-assemblies, and products ·       Develop instructions to build optical and opto-mechanical subassemblies ·       Work under the guidance of project managers to procure, track, coordinate, and organize material for early development stage prototypes ·       Ensure that first articles of materials and components are adequately inspected and qualified ·       Track and ensure that material and component supplies are aligned with prototype build plans ·       Work in a multi-disciplinary team including Optical, Electrical, Mechanical, Software, and Manufacturing Engineers in evaluating and documenting opto-mechanical and electro-optical specifications  for new product development and in design transfer to Production What you will bring to the role and to our team are the following qualifications and skills: ·       AS/Technical degree plus 5+ years of experience in Lasers, Optics, or related field ·       Highly organized. Ability to work through and simplify complex processes ·       Hands-on experience with lasers including free-space laser beam alignment ·       Experience setting up optical experiments, analyzing the data, and clearly reporting the results ·       Experience with a variety of optical measurement instruments such as: beam parameter analyzers, power meters, autocorrelators, oscilloscopes, spectrum analyzers, and spectrometers ·       Experienced with standard Microsoft Office programs ·       Experience managing, filtering, and sorting large lists and data tables in Microsoft Excel ·       Ability to work as a part of a multi-disciplinary team and drive results across organizational boundaries. ·       Excellent communication and documentation skills If you have familiarity with any of the following, please let us know: ·       Hands-on experience with fiber optics, including fiber preparation and splicing, as well as components characterization ·       Experience in troubleshooting and failure analysis of optical modules and systems ·       Strong prototyping skills ·       Experience with pulsed fiber or solid-state laser testing in an industrial environment ·       Hands-on experience with harmonic generation and nonlinear crystals (SHG, THG, SFG) MKS Instruments, Inc. is an equal opportunity employer. We solicit and hire applicants regardless of race, color, national origin, sex, religion, age, disability, veteran status, or any other protected category. Our policy is to employ the most qualified applicants. We conduct background checks and drug screens, in accordance with company policies and federal and state guidelines. Globally, our policy is to recruit individuals from wide and diverse backgrounds. However, for positions requiring access to export-controlled goods and technical data that are subject to the International Traffic in Arms Regulations (ITAR) or Export Administration Regulations (EAR), MKS Instruments. Inc. may have to obtain an export license from the U.S. Government. As such, applicants for these positions, except “U.S. persons” (generally defined as U.S. citizens, noncitizen nationals (holder of a US Passport), lawful permanent residents (or, green card holders), individuals granted asylum, and individuals admitted as refugees), may be subject to an export license review process. Employment is contingent upon issuance of the license.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-20T00:27:01.000Z"
    },
    "company": {
        "name": "MKS Instruments",
        "link": "https://www.linkedin.com/company/mks-instruments"
    },
    "education": {
        "required_credential": "associate degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Milpitas",
        "region": "CA",
        "postal_code": "95035",
        "street_address": null,
        "latitude": 37.430763,
        "longitude": -121.897514
    }
}