{
    "job": {
        "title": "Junior Software Engineer",
        "industry": "",
        "description": "Software Developer (Junior to Intermediate Level) Isoprime Corporation is a small software development and consulting firm based in Naperville, Illinois.  We provide software technology consulting and packaged software products to serve the healthcare market – primarily hospital-based neonatal intensive care units. Job duties include software design, coding, testing, maintenance, and customer support. Being a small company, Isoprime offers the opportunity to experience all facets of software development and get extensive experience with a wide variety of tools. Our software products are built using Microsoft technology, including VB.Net and SQL Server, along with other supporting tools such as Crystal Reports. Job qualifications include classes, training, or experience with an object-oriented programming language such as VB.NET, C#, Java. Experience or extensive training in SQL is also required.  Experience or training in Crystal Reports, OLE DB (ADO), and MS Access would be useful. Background in healthcare applications is a plus. Excellent English-language skills are required, and you must have the permanent legal right to work in the US without sponsorship . We are a small company looking for a developer who will take ownership of their work, is eager to learn and grow, and can work well as part of a small team of developers. Responsibilities Design, Develop and Test new features for our customers Work with customers on implementing and configuring our software Answer support calls and emails to help customers troubleshoot problems Qualifications Experience or training in .NET (or another object-oriented language) Knowledge and understanding of SQL and Database Design Comfortable working with customers to troubleshoot problems Preferred BS in Computer Science or related degree VB .NET Experience Crystal Reports (or other reporting tools) experience Benefits Competitive Salary Participation in all aspects of software development from design to rollout Retirement Plan Company holidays and paid time off",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-05T14:33:19.000Z"
    },
    "company": {
        "name": "Isoprime",
        "link": "https://www.linkedin.com/company/isoprime"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Naperville",
        "region": "IL",
        "postal_code": "60563",
        "street_address": null,
        "latitude": 41.771496,
        "longitude": -88.148
    }
}