{
    "job": {
        "title": "Tesla Recharge \"Returnship\" Program - Software Engineer, Back End",
        "industry": "Automotive,Renewables &amp; Environment,Utilities",
        "description": "Role Tesla's Recharge Program is your pathway to returning to a full-time career after a career break of more than a year. During our 18-week program, you will refresh your existing skill sets and learn new technologies with supportive mentors by your side. We foster professional growth in a structured environment through a combination of training and hands-on projects. You will be empowered to take on new challenges that will allow you to reclaim both your skills and confidence in the workplace. Are you ready to Recharge you career? As a Software Engineer, you’ll take part in the design and development of software for the current and next generation of Tesla’s Enterprise Resource Planning systems, Digital Experience, Manufacturing and Service Software. Responsibilities Work with experienced engineers across many functional areas to deliver business value to internal and external stakeholders. Design and Develop scalable applications using tools like C#, .NET, Golang, MySQL and other open stack frameworks. Seek to understand all aspects, business and technical, of the applications on which you work so that you can be most effective. Contribute towards the timely completion of development tasks and small projects while applying company standards. Continually learn and apply relevant software development practices, patterns, tools and technologies. Increase efficiency, reduce waste wherever and whenever possible. Requirements Must be returning from a recent career gap of at least 1 year 2+ years of experience in web application development, including: Implementing Application Programming Interfaces (APIs), Object Oriented Programming and Design (OOP&D), Object Relational Mapping (ORM) Experience in backend development, using tools such as: C#, Java, Go, Ruby, Python etc. Relational databases, SQL, NoSQL Agile Development Distributed Source Control, using tools such as: Git BS/MS in Computer Science or equivalent degree",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-25T22:35:54.000Z"
    },
    "company": {
        "name": "Tesla",
        "link": "https://www.linkedin.com/company/tesla-motors"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Draper",
        "region": "UT",
        "postal_code": "84020",
        "street_address": null,
        "latitude": 40.52505,
        "longitude": -111.864204
    }
}