{
    "job": {
        "title": "100% REMOTE Site Reliability Engineer",
        "industry": "Staffing and Recruiting",
        "description": "A risk management software company is looking for a 100% remote Site Reliability Engineer and is offering up to $65/hour (contract-to-hire). This engineer is someone experienced with either Terraform, Cloudformation, or Ansible, and skilled with at least one scripting language (Powershell, Bash, Python, etc.). Someone who be comfortable joining a major Azure cloud migration project, and looking to expand their DevOps skill set (including hands-on Kubernetes/AKS builds) will fit in perfectly here! Required Skills & Experience 3+ years of experience Proficient with at least one major public cloud (Azure, AWS, or GCP) Infrastructure-as-Code (Terraform or Cloudformation) Configuration Management (Ansible preferred) Scripting (Bash, Powershell, Python, etc.) Linux or Windows server support/troubleshooting Desired Skills & Experience Understanding of containerization/orchestration (Docker, Kubernetes, etc.) Azure or AWS certifications Blue-Green deployment methodologies Monitoring (Grafana, Nagios, Prometheus) On-prem to Cloud Migrations What You Will Be Doing Tech Breakdown 70% on-premise 30% Azure Terraform AKS Daily Responsibilities 90% Hands On 10% Management Duties The Offer Competitive compensation: Up to $65/hour, (contract-to-hire) You Will Receive The Following Benefits Medical Insurance & Health Savings Account (HSA) 401(k) Paid Sick Time Leave Pre-tax Commuter Benefit Applicants must be currently authorized to work in the United States on a full-time basis now and in the future. Posted By: Gavin Malloy",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-13T08:41:52.000Z"
    },
    "company": {
        "name": "Motion Recruitment",
        "link": "https://www.linkedin.com/company/motion-recruitment-partners"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Chicago",
        "region": "IL",
        "postal_code": "60654",
        "street_address": null,
        "latitude": 41.88323,
        "longitude": -87.6324
    }
}