{
    "job": {
        "title": "Full Stack Software Engineer (C#.NET) - C#, .NET, Asp",
        "industry": "Computer Software",
        "description": "We are looking for qualified software development engineers with thorough understanding of algorithms, design patterns, multithreading, parallel processing etc., and experience in building micro-service based scalable cloud-based applications from scratch, and configuring existing systems using C# &.NET Core framework and related technologies. You will be collaborating with internal teams to create software design and architecture, write clean, scalable code with proper documentation. You will help build and use CI/CD pipelines and related DevOps tooling to assure continuous integration and zero-downtime deployments using Containerization and Orchestration concepts. You will be actively involved in improving the existing applications by revising, updating, refactoring, debugging, and deploying tested code, and serve as an expert. Top Reasons to Work with Us Competitive salary Extensive benefits Amazing company culture What You Will Be Doing Design and develop new scalable and sustainable cross-platform micro-service-based applications using cloud technologies and modify existing software system. Identify and evaluate new technologies for implementation the new system and to improve the current system. Participate in software design meetings and analyze business requirements to determine technical requirements, and estimation. Participate in agile planning/scoping activities with assigned Product coordinator. Develop reporting system with data driven application models, SQL Stored Procedures, develop routines or processing large amounts of data in SQL server and Microsoft Entity framework. Debug new and existing software systems, analyze code to find causes of errors and apply fixes/updates as needed Develop and implement CI/CD pipelines and related DevOps tooling to assure continuous integration. Plan, support and participate in zero-downtime deployments using containerization and orchestration techniques. Conduct technical deep dives on existing applications to support and create an asset inventory of current components to maintain reuse existing code Work with diverse Software Development and Engineering team in the development of new software, web applications and information solutions. Exercise and contribute to the best practices for software development What You Need for this Position 5+ years of demonstrated experience in full stack software development life cycle including requirements analysis, and data flow design Ability to prototype concepts, refine, test, and debug programs to meet needs Enterprise skills in ASP.NET/.Net core, MVC, and RESTful API development required Strong knowledge of IIS, Expert real-time data synchronization, and application caching. Working knowledge of HTML5, CSS, JavaScript, TypeScript. Experience creating responsive web applications and interfaces This role requires adapting to and making decisions in a highly proactive environment Must have expertise in programming under Windows/UNIX/Linux environment Solid hands on experience in MYSQL, Oracle, PostgreSQL would be plus Experience in real-time data processing, performance Tuning and Optimization Experience developing and managing Web Applications using .Net and flavors of Java Script (NodeJs, Containerized web applications) Excellent problem solving and multitasking skills, with a logical and pragmatic attitude Experience with Databases (MySql, PostgresSQL, MongoDB), Webservers (Apache) and UI/UX Design elements Good Understanding of cloud services models (PaaS, SaaS, IaaS) Solid understanding of DevOps and CI/CD concepts and experience with Azure DevOps or similar Agile tracking environments Certification or expertise based on experience, in designing, building, testing, and maintaining cloud applications and services on Microsoft Azure highly preferred So, if you are a Full Stack Software Engineer (C#.NET) with experience, please apply today! Email Your Resume In Word To Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also: Krista.Kornchuk@CyberCoders.com Please do NOT change the email subject line in any way. You must keep the JobID: linkedin : KK8-1640635 -- in the email subject line for your application to be considered.*** Krista Kornchuk - Recruiter - CyberCoders Applicants must be authorized to work in the U.S. CyberCoders, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-09T17:45:27.000Z"
    },
    "company": {
        "name": "CyberCoders",
        "link": "https://www.linkedin.com/company/cybercoders"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Elmhurst",
        "region": "IL",
        "postal_code": "60126",
        "street_address": null,
        "latitude": 41.902122,
        "longitude": -87.93995
    }
}