{
    "job": {
        "title": "Backend Software Development Senior/Lead/Principal Engineer",
        "industry": "Computer Software,Information Technology and Services,Internet",
        "description": "To get the best candidate experience, please consider applying for a maximum of 3 roles within 12 months to ensure you are not duplicating efforts. Job Category Products and Technology Job Details Note: By applying to the Software Backend Development posting, recruiters and hiring managers across the organization hiring Software Engineers will review your resume. Our goal is for you to apply once and have your resume reviewed by multiple hiring teams. Salesforce has immediate opportunities for talented software developers who want their lines of code to have significant and measurable positive impact for users, the company's bottom line, and the industry. You will be working with a group of world-class engineers to build the breakthrough features our customers will love, adopt, and use while keeping our trusted CRM platform stable and scalable. The software engineer role at Salesforce encompasses architecture, design, implementation, and testing to ensure we build products right and release them with high quality. We pride ourselves on writing high quality, maintainable code that strengthens the stability of the product and makes our lives easier. We embrace the hybrid model and celebrate the individual strengths of each team member while cultivating everyone on the team to grow into the best version of themselves. We believe that autonomous teams with the freedom to make decisions will empower the individuals, the product, the company, and the customers they serve to thrive. Your Impact Backend application development for Marketing/Commerce/Sales/Service/Einstein/MuleSoft/Platform/Industries Clouds Design, implement, and tune robust APIs and API framework related features that perform and scale in a multi-tenant environment. Experience handling large data sets in the cloud (e.g. GCP, AWS, Alibaba and/or Azure platforms) Integration with internal/external systems Test-driven development practices as well as CI/CD tools and its usage Required Skills BS with 2+ years of experience or MS with 2+ years of experience Broad knowledge of web standards relating to APIs such as REST, SOAP, XML, WSDL, HTTP, JSON, etc. Deep knowledge of object oriented programming and other scripting languages: Java, C++, C#, APEX, Ruby, Go, Scala, Python, Node.JS, JavaScript, Experience with Spring, gRPC, REST and the HTTP protocol Experience with Agile development methodology Salesforce information We are Salesforce Engineering Salesforce Ohana Culture Salesforce Engineering behind the cloud Open to Fully Remote, Flex (1-3 days/week in the office), or Office-Based (4-5 days/week in office) For Colorado-based roles: Minimum annual salary of $98,900. You may also be offered a bonus, restricted stock units, and benefits. More details about our company benefits can be found at the following link:  getsalesforcebenefits.com Accommodations If you require assistance due to a disability applying for open positions please submit a request via this Accommodations Request Form. Posting Statement At Salesforce we believe that the business of business is to improve the state of our world. Each of us has a responsibility to drive Equality in our communities and workplaces. We are committed to creating a workforce that reflects society through inclusive programs and initiatives such as equal pay, employee resource groups, inclusive benefits, and more. Learn more about Equality at Salesforce and explore our benefits. Salesforce.com and Salesforce.org are Equal Employment Opportunity and Affirmative Action Employers. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender perception or identity, national origin, age, marital status, protected veteran status, or disability status. Salesforce.com and Salesforce.org do not accept unsolicited headhunter and agency resumes. Salesforce.com and Salesforce.org will not pay any third-party agency or company that does not have a signed agreement with Salesforce.com or Salesforce.org . Salesforce welcomes all. Pursuant to the San Francisco Fair Chance Ordinance and the Los Angeles Fair Chance Initiative for Hiring, Salesforce will consider for employment qualified applicants with arrest and conviction records.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-17T23:23:48.000Z"
    },
    "company": {
        "name": "Salesforce",
        "link": "https://www.linkedin.com/company/salesforce"
    },
    "education": {
        "required_credential": null
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Rhode Island",
        "region": "United States",
        "postal_code": "02893",
        "street_address": null,
        "latitude": 41.628292,
        "longitude": -71.51881
    }
}