{
    "job": {
        "title": "Software Engineer (US)",
        "industry": "Information Technology and Services,Computer Software,Internet",
        "description": "Fortanix is a dynamic start-up solving some of the world’s most demanding data protection challenges for companies and governments around the world. Our disruptive technology maintains data privacy across its entire lifecycle -- at rest, in motion, and in use across any enterprise IT infrastructure -- public cloud, on-premise, hybrid cloud, and SaaS. With key strategic partners like Intel and Equinix, Fortanix customers like PayPal, Google & Addidas are reaping the benefits. Recognized by Gartner as a “Cool Vendor”, Fortanix is revolutionizing cyber security. Join the revolution! You will Contribute to a friendly and helpful company culture Design, implement, test, and maintain one or more of The backend of our cloud security platform, written in Rust, C Our Runtime Encryption® software for SGX, written in Rust and C Help deploy, monitor, and tune the performance of our software Participate in peer code review, which we believe results in a higher-quality product Follow security best practices (don’t worry, we’ll tell you what they are) Requirements You are someone who Exhibits uncompromising integrity Pays attention to detail Thinks critically about complex technical problems Can work independently, while also being an effective member of a team You have 2 to 5 years experience. Experience in Rust, C/C++, Java, Python, or G. Coursework and/or professional experience in computer architecture and operating systems A bachelor’s degree in Computer Science, Information Systems, or related field, or equivalent training or work experience Security experience is a plus, but is not required Benefits Benefits Free catered lunch every day Unlimited PTO (it’s between you and your work) Friendly culture that brings the best out of everybody Great working environment, we believe this in its truest form, \"Never Doubt that a small group of thoughtful committed technologists can change the world. Indeed, it is the only thing that ever has\" - Margaret Mead",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-25T03:41:11.000Z"
    },
    "company": {
        "name": "Fortanix",
        "link": "https://www.linkedin.com/company/fortanix"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Mountain View",
        "region": "CA",
        "postal_code": "94040",
        "street_address": null,
        "latitude": 37.39008,
        "longitude": -122.08139
    }
}