{
    "job": {
        "title": "Remote AWS Cloud Security Engineer - AWS, Palo Alto, Okta, ISO",
        "industry": "Entertainment",
        "description": "If you are a AWS Cloud Security Engineer with experience, please read on! We are creating a new form of live entertainment - part social gaming, part sports betting, part mind-blowing experience - all combined for debut in select cities around the world. We are seeking an experienced Cloud Security Engineer to join our team to build a mass multiplayer online games in mobile and web platforms. This position will focus on finding security weaknesses and crafting scalable and usable solutions. It will build security architecture, consult with other technology team members as they build and launch new products, proactively plan for the various security issues, and responds to incidents that occur. The Cloud Security Engineer will review security strategy to monitor and analyze our cloud infrastructure. What You Will Be Doing Reviews and upgrades security internal security policies and security controls. Implement software and network security best practices, including preparing all systems and software for cybercrimes and attacks and configures systems to best protect against fraudulent bugs and false positives. Identifies unaddressed areas of security weaknesses and drives cleverly engineered, scalable solutions. Maintains and manages central security policies for our cloud infrastructure. Builds a continuous monitoring solution to validate systems against company standards. Continuously scans and responds to policy violations. Consults with the technology team regarding the secure-by-default system architecture. Improves data security through use of encryption/key management, segregation, or other techniques. Works with other engineers to design more secure systems via design input and code review. Solves security risks with new, organic solutions. Architects and implements high level security measures. Manages and oversees continuous improvement of security standards Manages security operations, Security Monitoring, Incident Response procedures, Threat and Incident Management Participates in threat modeling, and architecture reviews. Ensures all security, governance, and compliance standards are met. Assists with gathering functional requirements and developing technical specifications. Supports outsourced development teams. Comprehend and determines solutions for various issues and continuously looks for new innovations to provide solutions. Proactively researches trends and reports findings to the Technology Department. Completes project deliverables ahead of schedule. Performs other duties as assigned. What You Need for this Position High school diploma or equivalent required. Must have at least three years of experience with Palo Alto Firewalls. CISSP or Security+ or equivalent certifications required. At least five years of ISO27001 Compliance experience required. At least one year of Terraform experience desired Strong understanding of web or mobile application security. At least five years of vulnerability management experience required. At least three years of Okta S.S.O. experience required. Experience working with GDPR and PCI requirements. Strong detail orientation, organization and time management skills, dependability and flexibility required. Risk management experience desired. Great communication skills, a positive attitude and a passion for software development and technology. Experience in the gaming industry desired. All candidates will be required to take both behavioral and cognitive assessments. So, if you are a AWS Cloud Security Engineer with experience, please apply today! Email Your Resume In Word To Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also: Nick.Valenti@CyberCoders.com Please do NOT change the email subject line in any way. You must keep the JobID: linkedin : NV1-1627882 -- in the email subject line for your application to be considered.*** Nick Valenti - Executive Recruiter - CyberCoders Applicants must be authorized to work in the U.S. CyberCoders, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-25T17:32:39.000Z"
    },
    "company": {
        "name": "CyberCoders",
        "link": "https://www.linkedin.com/company/cybercoders"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Carlsbad",
        "region": "CA",
        "postal_code": "92010",
        "street_address": null,
        "latitude": 33.16604,
        "longitude": -117.33793
    }
}