{
    "job": {
        "title": "Machine Learning Engineer",
        "industry": "Renewables &amp; Environment",
        "description": "Are you an experienced (5+ years) Machine Learning Engineer looking to join an innovative and dynamic team and the thought of enabling higher adoption of renewable energy and zero emission mobility globally gets you excited? Located in Salem, MA Titan Advanced Energy Solutions develops and tests industry-leading, ultrasound-based battery diagnostics systems for applications in electric vehicles, consumer electronics, stationary storage, and 2nd life market for re-purposing of used EV batteries. Titan’s innovative strides have been recognized with numerous awards and funding from top clean energy programs and institutions, including Greentown Labs, the Massachusetts Clean Energy Center (MassCEC) and the Department of Energy. Growing and poised to continue on their positive momentum, this is an exciting time to join the Titan team! The Machine Learning Engineer will work with our multi-disciplined, fast-pace team on a variety of interesting projects. We are looking for an independent thinker who is highly self-motivated, driven to achieve, goal and team-oriented, and passionate about clean technology. The ideal candidate will bring a passion for solving important problems with machine learning, deep learning approaches in ways that create data driven solutions leading to end products. Your bias to action combined with a learning mindset allows you to take calculated risks and unlock opportunities along the way. You will work with a diverse team on an array of cross-disciplinary projects centered around ultrasound time series signal data; you will be responsible for delivering ML-based solutions from problem framing, to prototyping, to production application. A successful candidate for this role will have solid computer science, mathematic fundamentals, experience developing machine learning based models, deploying and maintaining such models, experience with software development and continuous integration continuous deployment. Duties and Responsibilities: ·      Use machine learning techniques to develop scalable prediction models on time series data ·      Explore deep learning approaches to develop scalable prediction models on time series data ·      Develop production grade pipeline to deploy machine learning models ·      Support on-going maintenance, updates on models deployed ·      Design data infrastructure to gather, store and facilitate analysis of large quantity data ·      Drive engineering best practices across the data team, including code reviews, testing, reproducibility ·      Generate and maintain documentation as required ·      Other duties as assigned Required skills: ·      3+ years industry experience in machine learning, deep learning based modeling ·      BS, MS in Computer Science, Computer Engineering or equivalent degree ·      Expert proficiency with Python and related libraries ·      Ideally experience with deep learning frameworks such as PyTorch and Tensorflow ·      Git, GitHub Actions, GitLab CI/CD Pipelines ·      Experience with relational/non-relational databases such as CouchDB ·      Experience with Docker (docker-compose and swarm) and optionally Kubernetes ·      Excellent understanding of algorithms, data structures, coding standards ·      Self-motivated and pro-active, with multi-tasking and critical thinking capabilities Preferred skills : ·      Passion for clean energy, a systems-thinking perspective and a desire to take an active part   in shaping a new paradigm ·      Good knowledge of AWS Cloud Storage, Elastic Compute ·      Experience with Linux and shell scripting ·      Previous working experience with ultrasound signal data ·      Foundational knowledge on signal processing ·      Start-up experience a plus Personal Values : ·      Bias to action, self-motivated and entrepreneurial spirit ·      Attention to detail, effective time management, and pride in work ·      Dependable, trustworthy, empathetic & full of integrity ·      Strong collaborative communication skills; able to build consensus internally and externally Learn more at www.titanaes.com Titan welcomes applicants from every background – our diversity helps us thrive and serve our customers and each other. All employment decisions are based on qualifications, merit and business needs, without discrimination or bias. We are proud to be an equal opportunity employer. If you need assistance or accommodation due to a disability, please let us know.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-25T15:08:15.000Z"
    },
    "company": {
        "name": "Titan Advanced Energy Solutions (we are hiring!)",
        "link": "https://www.linkedin.com/company/titan-aes"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Salem",
        "region": "MA",
        "postal_code": "01970",
        "street_address": null,
        "latitude": 42.521404,
        "longitude": -70.89864
    }
}