{
    "job": {
        "title": "Software Test Engineer",
        "industry": "Information Technology and Services,Computer Software,Financial Services",
        "description": "What you will be doing as a Software Test Engineer: Will be working as a contributing scrum team member for a web application software development program. Working as part of a critical software development program that supports full lifecycle software development. Utilizing the agile software development methodology, the tester will be responsible for testing all phases of the agile lifecycle. Responsible for all quality and testing activities on the team to include writing test plans, creating test cases as necessary, demonstrating release capabilities to stakeholders, and providing a level of effort to manage. Responsible for reporting and tracking defects found during testing cycles and communicating test progress. Responsible for understanding and analyzing user stories, testing acceptance criteria, and ensuring the software implements functionality as specified by the stories. Must Haves Must possess an ACTIVE TS/SCI clearance with a Full Scope Polygraph; sponsorship is not available at this time. Understand various test methodologies. Experience in automated testing to include the design, development, and debugging of the test. Have good verbal and written communication skills. Ability to formulate and articulate an approach to solve problems. Ability to work independently; is a self-starter. Education: Minimum Bachelors' degree in Computer Science, Information Systems, Engineering, Business, related or discipline. Six years of relevant work experience may substitute for a degree. TekMasters' Impact Would you like to partner with a company that considers people its most valued asset? How about working for a company that views you as more than just a number, offering you: Industry best Medical options, including employer-paid options Dollar for Dollar 401k match with immediate investment Employer-paid disability and group life insurance Competitive salaries with weekly pay Continued appreciation and recognition throughout your service, not just when you retire. TekMasters' goal is to take care of you so that you can continue making an impact for the customer; we worry about your future so that you don't have to! We are a small, growth-oriented, federal contractor that delivers professional services supporting the Intelligence & Federal Community. We are a fast-paced group due to the diversity of the customers, projects, environments, and roles we support. 21-00545",
        "employment_type": "CONTRACTOR",
        "date_posted": "2021-07-14T06:59:36.000Z"
    },
    "company": {
        "name": "TekMasters",
        "link": "https://www.linkedin.com/company/tekmasters"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 72,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Dulles",
        "region": "VA",
        "postal_code": "20189",
        "street_address": null,
        "latitude": 38.91386,
        "longitude": -77.513885
    }
}