{
    "job": {
        "title": "Data Scientist",
        "industry": "Information Technology and Services,Computer Software,Internet",
        "description": "Description The Position Do you dream about creating a more sustainable future? At Uplight, we are motivating energy users and providers to accelerate the clean energy ecosystem. Working with over 90 of the world’s leading electric and gas utilities, Uplight provides an end-to-end customer energy experience. Uplight delivers personalized experiences that customers have now come to expect–improving satisfaction, increasing revenue, reducing the cost to serve, and contributing to carbon reduction goals. We are B Corp certified, enabling us to put our values into action by not only making decisions for the benefit of our shareholders, but also for our customers, environment, employees, and community. We are seeking a Senior Data Scientist to join our team and help us achieve our ambitious goals for our business and the planet. What You Get To Do As a member of the Measurement, Analysis, and Testing Hypotheses (MATH) team, you will be in the data trenches for multiple product lines across Uplight. MATH is the team that answers the question “How do we know our products are saving energy?” We work with stakeholders across the company to design experiments that allow us to attribute savings to our products, and we design and build the statistical models that allow for savings to be calculated. In addition, we work on taking insights generated from utility data and exposing it back to our customers in an easily digestible manner. We are a team currently largely located in Colorado. As an experienced data scientist, you will be a contributor and teacher on day one. Your role will be part builder, part mentor, part communicator, and part peer-reviewer. MATH is a highly collaborative team, and you will be hands on with your teammates answering questions, building models, and helping out however you can. At the same time, you will own your own code, review and refine your teammates’ code, guide the team’s development process, and be the technical leader shaping future development efforts on the team. This is the perfect role for a data scientist with data engineering experience, or a data engineer with data scientist interests. Skills and experience are necessary, but we hire on value alignment first, so if you feel you would be a good fit with us, still consider applying. What You Will Contribute Process, cleanse, and verify the integrity of data used for analysis and modeling Run, maintain, and develop statistical and propensity models Be the technical lead and shape how the team does all testing, deployment, and monitoring of algorithms and data pipelines in production environments Be willing to learn experimental design and statistical analyses Aggregate and disseminate results of analyses to internal and external stakeholders through data visualization, memos, and/or slide decks What You Bring To Uplight Knowledge of advanced statistical techniques and concepts (propensity modeling, regression, properties of distributions, statistical tests and proper usage, etc.) and experience with applications Experience dealing with large quantities of data across relational databases, cloud storage, and distributed compute systems Excellent written and verbal communication skills for presenting findings to technical and non-technical audiences Solid experience with common data science toolkits, such as scikit-learn, Spark ML, pandas, Scipy, etc. Experience with data pipelines and workflows Proficiency in Git or other version control systems A desire to work on business-driven technology problems Previous experience mentoring junior teammates A positive attitude General curiosity towards all things data and energy Bonus Points Experience with Looker or similar technologies Experience with Apache Airflow What Makes Working At Uplight Amazing In addition to all the standard medical and dental benefits, that kick in Day 1, we: Are proud to be over 500+ rebels with an important cause by helping to create a more sustainable planet. Are committed to the environment, our employees, and our communities. Are focused on career growth by following defined career ladders Take our work and mission seriously and….we love to laugh! We Also Provide 401k Match Medical, vision, and dental insurance Monthly wellness stipend Peer to peer recognition program Management by objectives bonus plan Innovative flexible time off Exceptionally collaborative and cool office spaces (once we reopen them) Salary Range: $95,000 to $107,000 In accordance with the Colorado Equal Pay for Equal Work Act, the approximate annual base compensation range is listed above. The actual offer, reflecting the total compensation package and benefits, will be determined by a number of factors including the applicant's experience, knowledge, skills, and abilities, as well as internal equity. Uplight provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-09-07T01:38:22.000Z"
    },
    "company": {
        "name": "Uplight",
        "link": "https://www.linkedin.com/company/uplightenergy"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Boston",
        "region": "MA",
        "postal_code": "02118",
        "street_address": null,
        "latitude": 42.358994,
        "longitude": -71.05863
    }
}