{
    "job": {
        "title": "Software Engineer - Originations",
        "industry": "Automotive,Consumer Goods",
        "description": "Role Summary The Software Engineer is a programmer , capable of designing, coding, testing and implementing applications systems. Our Software Engineer should be energetic, entrepreneurial mindset, innovating - thinking about the “art of the possible” to become the Fin Tech market leader. While partnering with our business colleagues, you are responsible for advancing the tech stack to elevate our service operations to the next level of Dealer and Customer satisfaction. Role Responsibilities Strategic Work – 20% of time Educate and inform yourself and team members about technology opportunities Participate in strategic roadmap discussions to help guide the technology strategy for Servicing Operations In partnership with the Solutions Architect, Domain Architect complete annual Application Rationalization activities Responsible for developing new service-based architecture Updates job knowledge by studying state-of-the-art development tools, programming techniques, and computing equipment; participating in educational opportunities; reading professional publications; maintaining personal networks; participating in professional organizations Operational Work – 80% of time Analyzing, programming and implementing modifications to existing systems following VCI standards and guidelines Program well designed testable and efficient code Produce non-functional specifications (e.g. secure, performance, management/monitoring, audit/logging, etc.) and data mining operational feasibility Provide time and cost estimates and be accountable for estimates provided Escalate anticipated risk to management promptly and properly Partner with Servicing Operations Solutions Architect on design options Identify opportunities to use new technologies in the business together with the different business divisions Participate in the creation of state-of-the-art ideas and developments into POCs, prototypes and pilots Troubleshoot problems with production systems. Ability to operate within both agile and waterfall SDLC Bring a passion to stay on top of tech trends, experiment with and learn new technologies, participate in internal & external technology communities, and mentor other members of the engineering community Work within and across teams (business partners, architects, peer engineers and IT Operations) to design, develop, document, test, implement, and support technical solutions across a full stack of development tools and technologies in the respective SDLC. Conduct application code reviews and suggest necessary changes as applicable. Report on status of systems and projects on a regular and timely basis. Ensure the timely resolution of issues. Escalate anticipated risk to management promptly and properly. Keep up to date on developments in technological systems and programming. Participate in development projects as a team member with staff from within the Information Technology department and from external departments or vendors Mentor and coach peer engineers Presentations of design, new technologies or product knowledge to various audiences Fully Remote Primary Location United States-Illinois-Libertyville Experience Required – 7 -10 years of experience in Software Development Education Required – B.S. in Computer Science or related discipline or equivalent job experience. Desired – Master's or PhD in Computer Science (or equivalent education) General Skills Analytical and conceptual thinking – using logic and reason, creative and strategic Communication skills – interpersonal, presentation and written Computer savvy – skilled in the use of software Integration – joining people, processes or systems Influencing and negotiation skills Problem solving Specialized Skills Required – Full Stack Experience With The Below Skillset Front-end technologies like HTML5, CSS3, SaaS, ES6, JavaScript App Development using opensource frameworks React, Bootstrap and jQuery. At least 5 years’ experience with Nodejs and Express to build Rest API’s. Experience implementing at least 2 projects with end to end server-side APIs using AWS stack S3, Cloud Front, CloudWatch, IAM, Serverless Lambda, API Gateway and CloudFormation (infra as code).(AWS certifications are plus) Linting frameworks (ES lint, TS lint) for coding standards and static code analysis tools like SonarQube, Code Climate or any demonstrable tool experience. TDD / BDD experience using Jest, Jasmine, Webpack and Cucumber. Must have CI/CD implementation experience using GitHub / Bitbucket / Jenkins or Concourse in any combination. Strong working knowledge with Json, Yaml and XML formatting and parsing. Database and cache - Knowledge of various RDBMS technology like MySQL, Oracle, SQL Server and Redis etc. and at least one NoSQL Technology (e.g. Cassandra, MongoDB, HBase, DynamoDB etc.) and experience writing queries Design capabilities for basic prototypes and UI /UX design. Server - Exposure to handling Windows servers. Linux is desirable. Container Technologies - Exposure to handling Docker containers and Kubernetes. Working with API (REST & SOAP) and Microservices API Management and Orchestration tools – BizTalk and Informatica is a plus. Experience with vendor integrations (hosted solutions) Experience implementing coding standards in partnership with Solutions Architect, Domain Architect and Enterprise Architecture Desired – Modern development practices – e.g. DevOps Data Mining / Machine Learning Map Reduce (Hadoop etc.) Mobile programming experience (iOS, Android) Embedded experience (QNX, Android etc.) Experience with Agile is desirable - (Pair Programming, TDD (Test Driven Development), XP (Extreme Programming), CICD (Continuous Integration Continuous Delivery) Work Flexibility Travel 10% of the time Onsite, remote work options dependent on team operating model and initiative Flexibility to work outside of core hours (Monday – Friday) to support business demand We are proud to be an EEO employer M/F/D/V. We maintain a drug-free workplace and perform pre-employment substance abuse testing.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-25T17:22:04.000Z"
    },
    "company": {
        "name": "Volkswagen of America, Inc",
        "link": "https://www.linkedin.com/company/volkswagen-of-america-inc"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 84,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Libertyville",
        "region": "IL",
        "postal_code": "60092",
        "street_address": null,
        "latitude": 42.282997,
        "longitude": -87.95334
    }
}