{
    "job": {
        "title": "Remote Senior PHP Web Developer - LAMP, Angular, MySQL, Apache",
        "industry": "Construction,Information Technology and Services,Financial Services",
        "description": "If you are a Remote Senior PHP Web Developer with experience, please read on! We are a well-established mortgage lender and marketing company working with the top lenders across the country! What You Will Be Doing Opportunities range from creating new features in an existing system, to helping create new services from scratch on the latest technologies. You will join a small and stable team of developers, make concrete and highly-visible contributions to the business, and develop expertise in optimizing web experiences on a high-traffic site. The ideal candidate is confident in using their judgement to fill in gaps and make suggestions, willing to take ideas from others and run with them, and interested in developing their skills as a web developer. What You Need for this Position 5+ years of experience with: PHP Angular Linux Apache MySQL Preferred Experience PHP Frameworks Node/Express Twilio Integrations Server/Database Maintenance / Devops What's In It for You Competitive Base Salary ($100k - $120k DOE) Vacation/PTO Medical Dental Vision 401k So, if you are a Remote Senior PHP Web Developer with experience, please apply today! Email Your Resume In Word To Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also: Dominik.Sobaszek@CyberCoders.com Please do NOT change the email subject line in any way. You must keep the JobID: linkedin : DS15-1645035 -- in the email subject line for your application to be considered.*** Dominik Sobaszek - Lead Recruiter - CyberCoders Applicants must be authorized to work in the U.S. CyberCoders, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-25T17:36:43.000Z"
    },
    "company": {
        "name": "CyberCoders",
        "link": "https://www.linkedin.com/company/cybercoders"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Philadelphia",
        "region": "PA",
        "postal_code": "08051",
        "street_address": null,
        "latitude": 39.95106,
        "longitude": -75.16562
    }
}