{
    "job": {
        "title": "Machine Learning Engineer",
        "industry": "Information Technology and Services,Computer Software,Internet",
        "description": "Hiretual is an AI-Powered Global Talent Platform for enterprises. It has been recognized as one of the best data management SaaS for talent acquisition in the market and trusted by 100+ Fortune 500 customers(Amazon, Nike, Paypal, Intel, etc.) As a machine learning engineer, you will join the core engineering team to develop the algorithm, framework, and product intelligence towards an AI and data-driven SaaS. You will be working with top AI researchers and infrastructure gurus to explore unlimited career space. Resonsibilities Develop highly scalable tools leveraging machine learning models to solve problems such as classification, clustering, topic modeling, natural language processing and recommendation Develop in-house machine learning tools and pipelines to support fast experimentation of machine learning models Collaborate with Data Engineers to prototype new algorithms and design experiments for evaluation to enhance the marketing efficiency Work with engineering teams to implement new models while considering functionality for recommendation output Take end to end ownership of Machine Learning systems - from data pipelines and training, to real-time prediction engines Contribute to a culture of continuous improvement, and data driven results Requirements You must have A Ph.D. or Master degree in computer science, math, physics, or related majors, with 2 years + full-time industry experience Developed and launched AI product It would be best if you were an expert at one of the following Knowledge discovery and information retrieval entity recognition, relation extraction, and knowledge learning from unstructured data Machine learning-powered recommendation systems and ranking algorithms content-based recommendation, collaborative filtering, etc. Natural Language Processing (NLP) deep learning and statistical learning Deep Graph Learning Benefits Unlimited growth/promotion space Competitive salary and options 401k plan with a 3% contribution Free daily lunch & dinner Comprehensive medical, dental, and life insurance with 100% coverage Generous PTO policy Commuter benefits Mac or PC - up to you Want to see how well you match up with this job? Try out our free job search chrome extension, JobSeer at https //go.jobseer.ai/jds",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-05T03:36:54.000Z"
    },
    "company": {
        "name": "Hiretual",
        "link": "https://www.linkedin.com/company/hiretual"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Mountain View",
        "region": "CA",
        "postal_code": "94040",
        "street_address": null,
        "latitude": 37.39008,
        "longitude": -122.08139
    }
}