{
    "job": {
        "title": "Data Scientist",
        "industry": "Computer Software",
        "description": "Job Responsibilities: Data science is in GAINSystems’ DNA. Our founder was an industrial engineering professor, and we remain a company of data-driven analysts and engineers. Although your daily tasks will vary, you will have the following responsibilities: Lead research and data science projects that convert models into operational value Work with our professional services team to identify viable, valuable data-driven projects Deliver fully functional, tested product prototypes Collaborate with product managers and engineers to define the product and technical roadmaps Contribute to extending our machine learning infrastructure You will have the opportunity, though not necessarily the responsibility, to independently identify research projects Candidate Requirements: Intellectual curiosity to explore questions answerable with data. Passion for experimentation. Commitment to delivering data-driven results. Strong statistical, computational, and mathematical foundations. Excellent communication (verbal and written) skills, and ability to collaborate with teammates with heterogeneous technical/quantitative backgrounds. Bachelor’s and graduate degrees in a quantitative field. Academic or industrial experience with data science and/or machine learning. Demonstrated experience with data-driven research. Fluent in SQL, and Python or R. NLP, reinforcement learning, and/or GAN experienced desired. Java and graph DB familiarity preferred, but not required. At GAINSystems, we recognize that diversity and inclusion make our teams stronger. We are committed to equal employment opportunity and welcome everyone regardless of race, color, ancestry, religion, national origin, age, sex, gender identity, sexual orientation, disability, marital status, domestic partner status, veteran status or medical condition. We encourage people from all backgrounds to apply. Powered by JazzHR hCPyowIzLO",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-10T08:21:03.000Z"
    },
    "company": {
        "name": "GAINSystems, Inc.",
        "link": "https://www.linkedin.com/company/gainsystems"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "United States",
        "region": null,
        "postal_code": "99999",
        "street_address": null,
        "latitude": 39.50355,
        "longitude": -99.0183
    }
}