{
    "job": {
        "title": "Software Engineer",
        "industry": "",
        "description": "The Company: Are you looking for an opportunity to develop your career in a fast-growing tech company? eFileCabinet is an industry-leading document management software company. We help businesses get back to work securely, efficiently, and effectively. Companies can manage all their documents with our top-rated cloud-based Rubex platform. Our robust product includes Smart Automation, Workflow, Templates, Share & Requests, Governance, and eSignature with KBA/OTP. With our top-rated customer service (check G2), eFileCabinet is a no-brainer for companies looking to get back to what matters. Who You Are: We are looking for product-focused, driven software engineers who have a passion for creating great SaaS applications. Do you have deep knowledge and experience in cloud technologies, problem-solving, critical thinking, and continuous learning/improvement? If you enjoy working as part of an Agile team of dedicated, passionate engineers to create amazing products, then you’re in luck; we are looking for you to join our team as a Software Engineer. What You’ll Be Doing: Producing and maintaining high-quality software applications, clean code, and documentation as part of an Agile team Maintaining existing applications, fixing bugs, enhancements and interacting with users to resolve problems Enhancing existing software applications by identifying areas of improvement, making recommendations, and designing and implementing new features Collaborating with other developers to design, optimize and peer review code Providing technical assistance in collaboration with stakeholders and existing customers. Improving system quality by identifying issues and common patterns, and developing standard operating procedures Investigating and using new technologies where relevant What You’ll Bring to the Table: 3-5 years of software design and development experience, with increasing responsibility Excellent team collaboration and communication skills Experience with cloud platforms, concepts and web technologies (AWS/Azure) Experience with/understanding of various architectural styles (SOA, microservices, etc.) Experience designing and implementing software following best practices, primarily with C# .NET (Framework and Core), and React, Angular or other modern JS front-end framework Experience with various storage and caching technologies, scaling and optimization (SQL, PostgreSQL, NoSQL, etc.) Strong analytical and reasoning skills with an ability to visualize processes and outcomes Proficiency in troubleshooting software issues and debugging a large codebase Driven and detail-oriented with a passion for learning What We Offer: Four Day Work Week Fully Remote Position Flexible Work Schedule Straightforward and clear uncapped compensation Maternity and Paternity Leave Opportunities to grow your career Top-notch work-life balance and company culture Come experience the stability of a 20-year-old company with the vision and energy of a startup. Apply today! eFileCabinet is an EEO; M/F/D/V; we offer PTO; Medical, Dental, Vision, 401k (with Match), Life insurance and many perks. The salary for this position is dependent on experience.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-03T03:28:59.000Z"
    },
    "company": {
        "name": "eFileCabinet",
        "link": "https://www.linkedin.com/company/efilecabinet"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Lehi",
        "region": "UT",
        "postal_code": "84043",
        "street_address": null,
        "latitude": 40.387875,
        "longitude": -111.84917
    }
}