{
    "job": {
        "title": "Software Engineer-MTS-Force.com-Web Services-OOP/OOD-Jenkins/Maven-Com. Design Patterns-CIO Org #: 21-06309",
        "industry": "Information Technology and Services,Accounting,Financial Services",
        "description": "Job Description Please note that Salesforce requires a *** per hour minimum wage for all contractors. Required Skills 4&plus; years experience with ***munity Cloud/Lightning 4&plus; years experience with Lightning Components (Aura) or Lightning Web Components (LWC) 4&plus; years Salesforce coding including APEX and SOQL 4&plus; years front-end technologies include JavaScript, CSS, HTML, etc. 4&plus; experience working with CI/CD pipelines and deployments, Git, Bamboo, Jenkins, AWS General Requirements Bachelor's Degree or equivalent Preferred 4&plus; years relevant experience Two SFDC certifications Experience with Salesforce Sales, Marketing, and Service clouds Good understanding of a functional area primary technology and platform Demonstrated ability to execute on features of medium to high complexity within his/her functional area. Partners with a more senior engineer to deliver complex features. Written code that others can understand, support, maintain, and expand. Demonstrated consistent, successful delivery over time. Considered a good problem solver who can identify root cause within functional domain and collaborate to identify root cause across system boundaries quickly Aware of interdependencies between his/her functional areas and other functional area, both upstream and downstream. Solid understanding of a major technology employed in IT development: Java, Force.com, Front-End technologies/CMS (Object Oriented JavaScript, CSS), PL/SQL, SOA, Ruby etc., solid understanding of remainder Aware of and understands trends, technical developments in the broader industry and how those can be applied at SFDC. Basic understanding of the architecture of the major functional platform(s) within the group or BU Recognition of when to configure vs. build Work needs direction and oversight from a more senior member of the team Partners with a more senior engineer to deliver very complex or foundational features. Able to use and extend existing code framework to implement new functionality. Maintains at least one applicable technology certification Industry Standard ETL Tool (Informatica, Ab Initio, etc)Sql , PL/SQL, DatabaseShell ScriptingLinux/Solaris basic commands -Understanding of Data models Solid understanding of a business area and multiple processes within that area. Able to actively participate in functional process discussions (level 3-4) Understanding of immediate upstream / downstream impacts from functional decisions Understanding of underlying data schema, data definitions and relationship to process Demonstrated understanding of both industry and SFDC-specific policies & practices. Applies them to his/her work effectively. Track record of delivering on features of medium complexity over a period of time Track record of meeting sprint commitments Minimal code rollbacks or post production bugs. A highly experienced professional with a full understanding of area of specialization; Has wide-ranging experiences, uses professional concepts and company objectives to resolve complex issues in creative and effective ways. All software engineers must be well versed in Agile Methodology & have ADM Training. Works on complex issues where analysis of situations or data requires an in-depth evaluation of variable factors. Exercises judgment in selecting methods, techniques and evaluation criteria for obtaining results. Internal and external contacts often pertain to company plans and objectives.",
        "employment_type": "CONTRACTOR",
        "date_posted": "2021-09-08T03:04:21.000Z"
    },
    "company": {
        "name": "HireTalent - Diversity Staffing &amp; Recruiting Firm",
        "link": "https://www.linkedin.com/company/hiretalent_"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Seattle",
        "region": "WA",
        "postal_code": "98133",
        "street_address": null,
        "latitude": 47.60323,
        "longitude": -122.33028
    }
}