{
    "job": {
        "title": "Data Scientist",
        "industry": "Information Technology and Services,Computer Software,Financial Services",
        "description": "Job Description Infosys is seeking a Data Scientist with machine learning and Python experience in Richardson, TX. You will work on productionizing machine learning models and guide development teams for implementing end to end machine learning use case. You will define end to end architecture of Data Science and machine learning project along with being the technology architect. You will provide technology consulting for defining right Data Science and ML use cases and provide high level architecture. Required Data Scientist Qualifications Candidate must be located within commuting distance of Richardson, TX or be willing to relocate to one of these areas – once COVID-19 has diminished . This position may require travel. Bachelor’s degree or foreign equivalent required from an accredited institution. Will also consider three years of progressive experience in the specialty in lieu of every year of education. 5 years of experience with Information Technology 5 years of experience with Data Science and Python or R Experience with data gathering, data quality, system architecture, coding best practices Will consider H1B applicants Preferred Data Scientist Qualifications: 5 years NLP analysis skills, software engineering or systems analysis experience preferred 4 years of experience with more than one programming language; Python, R, Scala, Java, SQL Strong fundamentals in machine learning Deep Learning experience with CNNs, RNN, LSTMs and the latest research trends Experience with Lean / Agile development methodologies Prior experience in Azure chatbot, DialogFlow, Alexa, RASA, or Amazon Lex Shipped one or more machine learning based products Big Data Experience strongly preferred in HDFS, Hive, Spark, Scala Experience with perception (e.g. computer vision), time series data (e.g. text analysis) Data visualization tools such as Tableau, Query languages such as SQL, Hive Good applied statistics skills, such as distributions, statistical testing, regression, etc. Experience and desire to work in a Global delivery environment About Us Infosys is a global leader in next-generation digital services and consulting. We enable clients in 46 countries to navigate their digital transformation With over three decades of experience in managing the systems and workings of global enterprises, we expertly steer our clients through their digital journey. We do it by enabling the enterprise with an AI-powered core that helps prioritize the execution of change. We also empower the business with agile digital at scale to deliver unprecedented levels of performance and customer delight. Our always-on learning agenda drives their continuous improvement through building and transferring digital skills, expertise, and ideas from our innovation ecosystem. To learn more about Infosys and see our ideas in action please visit us at www.Infosys.com EOE/Minority/Female/Veteran/Disabled/Sexual Orientation/Gender Identity/National Origin Country USA State / Region / Province Texas Work Location Richardson, TX Interest Group Infosys Limited Domain Artificial Intelligence Skillset Technology|Artificial Intelligence|Artificial Intelligence - ALL, Technology|Data Science|Machine Learning, Technology|Machine Learning|Python Company ITL USA",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-09T20:21:58.000Z"
    },
    "company": {
        "name": "Infosys",
        "link": "https://in.linkedin.com/company/infosys"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Richardson",
        "region": "TX",
        "postal_code": "75080",
        "street_address": null,
        "latitude": 32.960762,
        "longitude": -96.73352
    }
}