{
    "job": {
        "title": "Full stack software engineer",
        "industry": "",
        "description": "Hello connections Hope you are doing great. Here is the new requirements please have a look and revert me back if you are interested. Position: Full-Stack Software Engineer Client: College Board Mode: Contract 12/23/2021 (possible extension) Any Visa Acceptable 100 % Remote Team: This team provides application development for the customer services teams. They are in the midst of combining several systems into one serverless product. Must have strong coding in our stack and API experience. Profiles: That they would like solid technician with full skills, especially node.js to serverless AWS and prioritize lambda/sns/sqs/javascript Job Description:- The Software Engineer will be responsible for building software products and data pipelines, using an array of diverse technologies, including Node.js, React, and AWS products. This position will work on a small team solving high-priority challenges at Client. Responsibilities:- ·       Design and Implement serverless software solutions supporting data focused systems ·       Play supporting role in understanding business needs in context, from user perspective ·       Support user-driven design of data models, APIs and interfaces ·       Support and maintains apps in production on the AWS cloud ·       Follow best practices around version control, testing, and automated build processes Requirements for the role:- ·       BA or BS required (major in an analytical field desired) ·       Minimum of 4-6 years work-related experience ·       Minimum of 7-10 years work-related experience ·       Highly proficient with Node.js ·       Experienced with AWS or other Cloud Services (CloudFormation, Lambda, SNS/SQS, S3, CloudWatch, and DynamoDB are especially desired) ·       Proficient in developing effective UIs using React.js ·       Ability and enthusiasm to learn new technologies as required good communicator with practical decision-making skills; a believer in good comments and documentation ·       Experience in hands-on development of software applications for the Web in a professional environment Preferred skills for the role:- ·       Strong analytical thinking and structured problem-solving ability ·       Experience using libraries and frameworks where it makes sense, while still understanding how each line in your codebase works ·       Ability to handle multiple projects and assignments simultaneously and effectively in a cross-functional team environment ·       Ethos of continuous improvement and interest in learning new things ·       Strong ability to understand and internalize the big-picture and broader implications of design and development decisions ·       Excellent interpersonal and collaboration skill with the ability to work with a diverse set of colleagues, across functions and from different organizations ·       Self-starter, ability to set priorities, work independently and attain goals Thanks & Regards Abhishek Sharma Talent Aquisition Recruiter Las Vegas, NV-89142 Email:- abhishek@magnious.com #Phone:- (516)-208-2011",
        "employment_type": "CONTRACTOR",
        "date_posted": "2021-08-05T15:55:05.000Z"
    },
    "company": {
        "name": "Magnious Solutions Inc",
        "link": "https://www.linkedin.com/company/magnious-solutions-inc"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 84,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Las Vegas",
        "region": "NV",
        "postal_code": "89159",
        "street_address": null,
        "latitude": 36.16909,
        "longitude": -115.14058
    }
}