{
    "job": {
        "title": "Sr. Wireless Software Engineer",
        "industry": "Electrical/Electronic Manufacturing,Computer Software,Automotive",
        "description": "Description Indefinite U.S. work authorized required for employment. Future sponsorship for work authorization unavailable at this time Purpose Of Position The candidate will exhibit in-depth experience for software design and coding in wireless framework (RIL/Telephony (Android), Ofono (Linux)). The candidate will be engaged in entire software design phase including requirement review, software design review, writing detail design specification, coding, analysis of customer defects, and intensive design level unit testing. The candidate will attend vehicle quality events, field testing, on-site customer support as well. The candidate must have good communication and project management skills as he will have to manage certification for all Americas (North and South America) including 3 rd party certification companies management such as BTI, Umlaut, etc. Educational/Experience Requirements A minimum 3 years of hands-on Java/J2EE, Java script, C, C++ programming experience. Minimum of 3 years of software development experience in Android or Linux OS environments. Must have software design and coding experience at all areas from the following domains. – Radio Interface Layer (RIL)/Telephony, Ofono. Must be familiar with wireless monitoring tools such as QXDM, and wireless equipment such as R&S’s CMW-500 and Anritsu MD-8475A including analysis of QXDM logs. Must have good project management and communication skills. Strong hands-on skills on Software debugging. Should be familiar with software version control tools. BS degree in Computer Science, Computer Engineering, or Electronics/Electrical Engineering Preferred Qualifications: Experience in developing automotive multimedia/infotainment software highly desired Experience in wireless modem or device certification for wireless carriers (Verizon, AT&T, Bell etc) Experience with Android, iOS, Linux platform based SW development Experience with GIT, JIRA, Eclipse IDE Project management and presentation skills. MS degree in Computer Science, Computer Engineering, or Electronics/Electrical Engineering Job Responsibilities Creation of software requirement, design documents. Creation of system test plans based on specifications and standards Define test cases and conduct designer level and product level testing. Manage small projects and technical resources, including planning, estimating and follow through Works with the customer to further define requirements and to resolve issues Communicate effectively with customers to improve overall system performance Responsible for communication with customer on design definition Responsible for project management and project review with customer Engage in all stage of software design and implementation activities for RIL/Telephony(Android) and Ofono(Linux). Device certification activities for all North and South America Participate in design review and code inspection meeting Participate in vehicle quality events.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-25T17:44:52.000Z"
    },
    "company": {
        "name": "Hyundai Mobis North America",
        "link": "https://www.linkedin.com/company/mobis-north-america"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Plymouth",
        "region": "MI",
        "postal_code": "48170",
        "street_address": null,
        "latitude": 42.370724,
        "longitude": -83.46905
    }
}