{
    "job": {
        "title": "Sr. Data Scientist",
        "industry": "Financial Services",
        "description": "S&P Global Market Intelligence The Role: Lead Data Scientist Grade (relevant for internal applicants only): 11 The Impact The Data Scientist is a member of S&P Global Market Intelligence's Data Science team who partners with machine learning engineers and business partners to design and build AI-centric applications that transform S&P Global Market Intelligence's products and operations. Our data scientists apply the breadth of modern techniques in machine learning and natural language processing to build systems that power worldwide markets. Working at S&P Global — where data is the primary raw material, the core strategic asset, and the finished product — presents a rare opportunity for data scientists to multiply their impact across every level of the business, from operations to technology, product, sales, and all other areas of the business. Compensation/Benefits Information (US Applicants Only) S&P Global states that the anticipated base salary range for this position is $55,900 to $155,900. Base salary ranges may vary by geographic location. In addition to base compensation, this role is eligible for an annual incentive bonus/a sales commission plan. This role is not eligible for additional compensation such as an annual incentive bonus or sales commission plan. This role is eligible to receive additional S&P Global benefits. For more information on the benefits we provide to our employees, visit https://www.spgbenefitessentials.com/newhires . Responsibilities Partner with machine learning engineers to identify, scope, prototype, develop, deploy, and operate AI-powered applications in production settings Work with stakeholders to design and implement robust machine learning systems that solve business problems Stay abreast of emerging AI technologies to drive S&P Global's vision for its products and operations Evangelize data science concepts and wins to audiences inside and outside of S&P Approach problem-solving with a machine-learning-first mindset Basic Qualifications University degree in engineering or a related field Experience seeking out problems and identifying and proposing creative, data-driven solutions Strong programming skills with an understanding of what it takes to write and share high-quality code Good conceptual knowledge of probability, statistics, and computer science Strong SQL skills Fluency in Python Experience with machine learning frameworks such as Scikit-Learn, PyTorch, and TensorFlow Strong oral and written communication skills Entrepreneurial spirit Preferred Qualifications Graduate degree in a technical field Experience designing, developing, and operating machine learning systems in production settings A passion for designing and building software to help solve problems Proficiency in an advanced data science topic, such as: Computer vision Natural language processing Probabilistic programming Publicly demonstrated data science competency, such as: Conference talks Open-source contributions Published research Knowledge of the finance and investment industry Perks Flexible work schedules 4 weeks' paid vacation annually Supportive community of data scientists and machine learning engineers Access to industry-leading financial data sets Practicalities The MI Data Science team is based in Charlottesville, VA and New York, NY, but we welcome applicants in many U.S. office locations, as well as those who are home-based. Our application process includes completing and presenting a take-home data science challenge — if this sounds like a fun opportunity, you're in the right place. S&P Global Market Intelligence At S&P Global Market Intelligence, we know that not all information is important—some of it is vital. Accurate, deep and insightful. We integrate financial and industry data, research and news into tools that help track performance, generate alpha, identify investment ideas, understand competitive and industry dynamics, perform valuation and assess credit risk. Investment professionals, government agencies, corporations and universities globally can gain the intelligence essential to making business and financial decisions with conviction. S&P Global Market Intelligence is a division of S&P Global (NYSE: SPGI), which provides essential intelligence for individuals, companies and governments to make decisions with confidence. For more information, visit www.spglobal.com/marketintelligence. EOE Statement S&P Global is an equal opportunity employer committed to making all employment decisions without regard to race/ethnicity, sex, pregnancy, gender identity or expression, color, creed, religion, national origin, age, disability, marital status (including domestic partnerships and civil unions), sexual orientation, military veteran status, unemployment status, or any other basis prohibited by federal, state or local law. Only electronic job submissions will be considered for employment. If you need an accommodation during the application process due to a disability, please send an email to: EEO.Compliance@spglobal.com and your request will be forwarded to the appropriate person. The EEO is the Law Poster http://www.dol.gov/ofccp/regs/compliance/posters/pdf/eeopost.pdf describes discrimination protections under federal law. # 20 - Professional (EEO-2 Job Categories-United States of America), IFTECH202.1 - Middle Professional Tier I (EEO Job Group), SWP Priority – Ratings - (Strategic Workforce Planning) Job ID: 263143 Posted On: 2021-07-09 Location: Charlottesville, Virginia, United States",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-01T06:31:15.000Z"
    },
    "company": {
        "name": "S&amp;P Global Market Intelligence",
        "link": "https://www.linkedin.com/company/s&amp;p-global-market-intelligence"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "New York",
        "region": "NY",
        "postal_code": "10132",
        "street_address": null,
        "latitude": 40.713047,
        "longitude": -74.00723
    }
}