{
    "job": {
        "title": "Software Developer (ABAP)",
        "industry": "Construction,Automotive,Transportation/Trucking/Railroad",
        "description": "Location: 2727 N Central Ave, Phoenix, Arizona 85004 United States of America U-Haul Get your career moving with the world’s largest do-it-yourself moving and self-storage company. Family Traditions U-Haul is family. In many cases, that’s not just figurative talk. Generations of the same families often choose to build careers here, realizing that a personal investment in U-Haul means providing for each other. U-Haul was founded in 1945 by the Shoen family in Ridgefield, Washington. After a year of innovations, the company relocated its headquarters to Phoenix, Arizona. U-Haul helps families move from locations in all 50 states and 13 Canadian Provinces and Territories. Today, U-Haul has grown into more than trucks and trailers, we offer a variety of services such as U-box, Self-storage and moving help. When a family entrusts U-Haul and its services with their loved ones and possessions amid the stress and adventure of a move, we embrace that awesome responsibility. A caring culture means catering to our millions of annual customers. But it also means supporting our thousands of dedicated Team Members. Become Part Of a Team If you are an experienced ABAP Programmer, U-Haul has a unique opportunity for you! We are looking for a SAP ABAP Developer who is interested in elevating your skills, turning ideas into solutions and thrive in a collaborative environment. You’ll be part of our Core Enterprise System Group and your team is responsible for support of the Financial and Project Modules. As you work closely with your team you can expect a challenging, fast paced environment, rewarding position with compensation and benefits to match. Daily Tasks Include Provide production support for SAP sub-processes/sub-modules supporting corporate clients, including routine systems operation support; diagnose and fix system problems; monitor and maintain batch processes; maintain production and test environments Respond to end-user problems, Help Desk problem tickets Provide applications development and enhancement functions, including analysis, design, coding, testing, and object transports using SAP’s ABAP Development Workbench. Work with SAP functional analysts and Operations business analysts to formalize specifications for custom development. Design and implement technical solutions for conversions, interfaces, enhancements, reports, forms and workflows using call transactions, user exits, bolt-on, standard data transfer, dialog programming, SAP Script, etc. Develop custom solutions using customized transactions and the enhancement framework including user exits to provide additional functionality not available within standard SAP. Document and perform unit, string, integration, and regression testing in support of new implementations and releases. Review and Test System Upgrades Keep manager or team lead informed of significant cross-team, cross-functional issues and/or significant technical challenges as appropriate. Proactively work to solve these issues while including the key functional and/or business stakeholders Provide assistance to out off-site team as needed. Requirements: Solid understanding of ERP applications Ability to analyze the data and data structures 5 or more years of experience or the equivalent combination of education and experience specific to ABAP programing. Experience in SAP ECC 6.0 Experience in BI or BW a pulse Experience in Solution Manager a pulse. Experience with Sarbanes-Oxley compliance, ITIL methodologies and Change Management Methodologies Advanced skills with data analysis and problem solving Advanced skills and knowledge of technical documentation Strong analytical abilities, communication and interpersonal skills Strong time management skills, ability to multi-task and work in a team environment Excellent verbal and written communication skills with a strong focus on customer facing interaction, customer service, and presentation Self-starter with leadership qualities who can work independently and in teams on tasks and projects with limited supervision Ability to provide quality business solutions within compressed time-lines and delivery dates Previous experience with at least 1 (one) full life-cycle implementation experience. Desire to learn new modules/sub-modules and non-ECC related SAP technology. Perks Of Joining The U-Haul Fleet Get your career moving with a company who empowers team members to the healthiest version of themselves! We provide robust wellness benefits, events, and resources to help team members becomes the happiest and healthiest they can be. Here are just some of the programs U-Haul has available: Full Medical coverage New indoor fitness gym Onsite medical clinic for you and your family Career stability Opportunities for advancement Valuable on-the-job training Prescription plans Dental & Vision Plans Business and travel insurance YouMatter Employee Assistance Program Paid holidays, vacation, and sick days Employee Stock Ownership Plan (ESOP) 401(k) Savings Plan Life insurance Critical Illness/Group Accident 24-hour physician available for kids Subsidized gym/ membership MetLaw Legal program MetLife auto and home insurance Discounts on cell phone plans, hotels, and more LifeLock identity Theft Tuition reimbursement program Free online courses for personal and professional development at U-Haul University Savvy consumer wellness programs- from health care tips to financial wellness U-Haul federal credit union AMERCO and its family of companies, including U-Haul, have strived to create a culture of health and wellness. As of February 1, 2020, and consistent with applicable state law, no AMERCO or U-Haul company will hire individuals in states where it may lawfully decline to hire individuals who use nicotine products. By continuing with this application, you are indicating that, if hired, you consent to nicotine screening in the future. This policy will not apply to team members hired before February 1, 2020. U-Haul is an equal opportunity employer. All applicants for employment will be considered without regard to race, color, religion, sex, national origin, physical or mental disability, veteran status, or any other basis protected by applicable federal, provincial, state or local law. Individual accommodations are available on requests for applicants taking part in all aspects of the selection process. Information obtained during this process will only be shared on a need to know basis.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-09-02T05:30:07.000Z"
    },
    "company": {
        "name": "U-Haul International, Inc",
        "link": "https://www.linkedin.com/company/u-haul-international-inc-"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Phoenix",
        "region": "AZ",
        "postal_code": "85009",
        "street_address": null,
        "latitude": 33.448204,
        "longitude": -112.072586
    }
}