{
    "job": {
        "title": "Founding Software Engineer",
        "industry": "",
        "description": "We are looking for a well-rounded engineer to join us in building our low-code platform from the ground up. You’ll solve hard problems and help shape the future of our company. We’re founded by two former Google engineers and graduated from YC’s W21 batch. We recently featured at Google I/O and have an incredible list of supporters and advisors. What You Will Work On Spec, design, and build functionality in FlutterFlow. Help us decide what to build next. You will partner with our founders and team to identify and prioritize new features. Write code that writes code! We work in an interesting and challenging space that few people get to work on. Talk to customers to understand their needs. Be the right hand to our CTO. Help solve complex problems and mentor more junior team members. Who you are 4+ years of proffesional experience as a Software Engineer. You write high-quality code that is readable and reliable. You have a start-up mentality. You understand shipping a feature early and learning from the result is more important than perfecting it. Self-starter who likes to take initiative. You are more interested in getting to the right answer than being right. You are driven and derive a sense of purpose from building something that matters. You are always willing to roll up your sleeves and pitch in when the team needs help. Bonus Points 1+ years of experience with Flutter and Dart Experience with Firebase Experience with mobile app development Benefits Live anywhere in the US Generous salary and equity package Flexible Vacation / Sick Leave Flexible work hours About Us We are building a low-code platform to dramatically improve how mobile applications are built. What used to take months of development time, can now be built within hours and days. We’re founded by two former Google engineers and graduated from YC’s W21 batch. We recently featured at Google I/O and have an incredible list of supporters and advisors.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-20T22:33:11.000Z"
    },
    "company": {
        "name": "FlutterFlow",
        "link": "https://www.linkedin.com/company/flutterflow"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 48,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "New York",
        "region": "United States",
        "postal_code": "13856",
        "street_address": null,
        "latitude": 42.93923,
        "longitude": -75.62005
    }
}