{
    "job": {
        "title": "Software Engineer, Backend",
        "industry": "Health, Wellness and Fitness",
        "description": "About Calm We have a simple mission at Calm: To make the world a happier and healthier place. The heart of Calm is digital but the brand is expanding offline into a variety of products and services that bring more peace, clarity and perspective into people’s busy lives. Calm is passionate about helping people take care of their minds and we believe that Calm can become one of the most valuable and meaningful brands in the world. Improving Concentration and Awareness Reducing Anxiety Improving Memory and Creativity Higher EQ Increasing Happiness Getting Better Sleep Calm is the #1 consumer brand for digital health, with over 100 million downloads (100K new per day). We weren named Apple’s App of the Year and the world’s first mental health unicorn. Inc. 5000 cited Calm as the 19th Fastest Growing Private Company in America and we were voted the ‘World’s Happiest App’ by the Center for Humane Technology. Check out the Calm Careers Page to learn more about the mission, our values, and hear personal stories from our employees. Calm was co-founded by Alex Tew (Million Dollar Homepage) and Michael Acton Smith (Mind Candy, Moshi Monsters, Firebox). Mission: Calm’s Engineering team contributes directly to the company mission to make the world a happier and healthier place. As a backend engineer working on the B2B product area, you will be delivering experiences that provide more values to Calm’s fast-growing B2B user base and help bring mental wellness to more organizations. About the Role: You will work up and down the stack across a wide number of technologies and third party tools, mainly using tools like Typescript, Nodejs and Postgres. You would collaborate with partners across the company, from Marketing and Content to Data, Product and Design and have plenty of opportunities to learn and grow alongside our B2B business’ growth. Outcomes: Serve as a reliable, go-to resource on the team for backend projects, writing maintainable code that can be quickly updated when needed, has a low volume of bugs, and is readable and easily understood by other engineers on the team. Be self-directed with an ownership mindset, completing work efficiently, with minimal intervention from others on the team. Help uncover scope early in order to establish engineering time estimates that guide prioritization decisions. Ensure our most frequently exercised user flows are performant and error free Implement designs with tradeoff of between short and long-term flexibility and capabilities Deploy code to production, maintain visibility on the status of Pull Requests and client builds as they get deployed, and identify root causes and resolution actions for critical bugs. Stay up to date on the latest technologies in web development, incorporating those changes which can accelerate our development speed and improve quality Keep a pulse on user feedback that comes in via customer support, prioritizing bug fixes that have the greatest impact on our customers and advocating for application improvements that solve common user pain points Work with product and design to create technical design and engineering plan for new features Work with product and data team to identify and tracking KPI for new features Work with web engineers to A|B test new features and UX changes on Calm’s web application, optimizing for the best outcomes for our users and the business Competencies: Solid proficiency with Nodejs or comparable (e.g. any backend language, esp: Python, Go Ruby) Solid proficiency with Postgresql or comparable (e.g. MySQL, MongoDB) Experience working with REST APIs Solid understanding of responsive web development Ability to understand business requirements and translate them into technical requirements Growth mindset: receives feedback easily and incorporates it quickly Proactive executor: thoughtful in approach and decisive in decisions Pragmatic: balance scrappiness and rigor Great technical communicator Strong attention to detail Strong product and architectural instincts Enthusiasm and passion for quality Takes responsibility for making sure issues are resolved and shipped quickly Nice-to-Haves: Experience building large scale web application Experience with TypeScript Familiarity with code versioning tools (e.g. git) Familiarity with deployment CI tools (e.g. Jenkins) Experience working with cloud hosting platform (eg. AWS) Experience working with container technologies (e.g. Docker, Kubernetes) Experience working with data team to measure impact of product features Able to deliver high quality code reviews that reduce defects and support the development of peers Experience working with third party libraries and tools (eg. Okta) Experience and interest towards full stack ownership Benefits Competitive salary and equity “Take the time you need” approach to time off Coverage for medical, dental, & vision insurance plans 401K Home office stipend Supportive wellbeing benefits including our EAP support, and monthly wellbeing reimbursement Commuter benefits Life insurance and disability benefits Remote-first environment that allows you to work flexibly from many locations Opportunity to work with a product focused on making the world happier and healthier We believe that mental health is health, and every person should be considered in the discussion. That’s why we’re proud to be an equal opportunity workplace, committed to equal employment opportunity regardless of race, color, religion, national origin, age, sex, marital status, ancestry, physical or mental disability, genetic information, veteran status, gender identity or expression, sexual orientation, or any other characteristic protected by applicable federal, state or local law. Calm is deeply committed to diversity, equity and inclusion, both in our hiring practices and in our experiences as a Calm employee. We strive to create a mindful and respectful environment where everyone can bring their authentic self to work, and experience a culture that is free of harassment, racism, and discrimination. Calm is also committed to providing reasonable accommodations for qualified individuals with disabilities and disabled veterans in our job application procedures. Please inform Calm’s Recruiting team if you need any assistance completing any forms or to otherwise participate in the application process.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-09-03T18:53:49.000Z"
    },
    "company": {
        "name": "Calm",
        "link": "https://www.linkedin.com/company/calm-com"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "United States",
        "region": null,
        "postal_code": "99999",
        "street_address": null,
        "latitude": 39.50355,
        "longitude": -99.0183
    }
}