{
    "job": {
        "title": "AWS Site Reliability Engineer",
        "industry": "Information Technology and Services",
        "description": "AWS SRE Engineer Location North Houston DISYS at a Glance: Incorporated in 1994 Certified Minority Business Enterprise (MBE) More than 3500 employees ISO 27001, ISO 9001 and ITIL Quality Assurance Programs Hybrid on-site, nearshore and offshore service models Global Delivery Centers Across the World AWS Site Reliability Engineer (Individual Contributor; experienced) Job Description We count on our site AWS reliability engineers (SREs) to empower our users with a rich feature set, high availability, and stellar performance level to pursue their missions. As we expand our customer deployments, we are currently seeking an experienced SRE to deliver insights from massive scale data in real time. Specifically, we are searching for someone who brings fresh ideas, demonstrates a unique and informed viewpoint, and enjoys collaborating with a cross-functional team to develop real-world solutions and positive user experiences at every interaction. Duties ·       Responsible for the cloud-native production environments by monitoring availability and taking a holistic view of system health ·       Build plumbing software to manage cloud platform infrastructure and applications and to improve reliability, quality, and time-to-market of our suite of software solutions ·       Measure and optimize system performance, with an eye toward pushing our capabilities forward, getting ahead of customer needs, and innovating to continually improve ·       Provide operational support and engineering for multiple large distributed development teams ·       Plan projects and being involved in project management decisions Daily and Monthly Responsibilities ·       Gather and analyze metrics from both operating systems, cloud platform components, and applications to assist in performance tuning and fault finding ·       Partner with development teams to improve services through rigorous testing and release procedures ·       Identify, prioritize, and develop reusable patterns for test automations and smoke tests ·       Participate in production operation readiness reviews, run-book reviews, and identify automation opportunities Digital Intelligence Systems, LLC (DISYS) is an Equal Opportunity Employer that recruits and hires qualified candidates without regard to race, religion, sex, sexual orientation, gender identity, age, national origin, ancestry, citizenship, disability, or veteran status.",
        "employment_type": "CONTRACTOR",
        "date_posted": "2021-08-10T16:41:35.000Z"
    },
    "company": {
        "name": "DISYS",
        "link": "https://www.linkedin.com/company/disys"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Houston",
        "region": "TX",
        "postal_code": "77208",
        "street_address": null,
        "latitude": 29.760803,
        "longitude": -95.36951
    }
}