{
    "job": {
        "title": "Software Engineer (December 2021 Grads)",
        "industry": "Information Technology and Services,Computer Software,Hospital &amp; Health Care",
        "description": "Responsibilities Participate fully in software development life cycle including requirement analysis, planning, software design, development, testing and deployment. Design, build and produce software solutions with support and guidance Build knowledge base of relevant clinical and financial workflows and leverage in day-to-day work. Run software tests, review results and perform root cause analyses to identify problems. Participate and provide input in project code reviews. Identify, implement and support technical solutions to deliver business requirements Seek out new tools to analyze and solve problems. Required Qualifications Bachelor’s degree or equivalent work experience Knowledge of relevant programming languages including lexical, concrete and abstract syntax. Knowledge of relational databases, data modeling and SQL scripting Knowledge of cloud-based SaaS architectures The aptitude to independently learn new technologies The ability to complete assigned work on time or ahead of schedule with exceptional quality Preferred Technical internship with a software company or healthcare organization Netsmart is proud to be an equal opportunity workplace and is an affirmative action employer, providing equal employment and advancement opportunities to all individuals. We celebrate diversity and are committed to creating an inclusive environment for all associates. All employment decisions at Netsmart, including but not limited to recruiting, hiring, promotion and transfer, are based on performance, qualifications, abilities, education and experience. Netsmart does not discriminate in employment opportunities or practices based on race, color, religion, sex (including pregnancy), sexual orientation, gender identity or expression, national origin, age, physical or mental disability, past or present military service, or any other status protected by the laws or regulations in the locations where we operate. All applicants for employment must be legally authorized to work in the United States. Netsmart does not provide work visa sponsorship for this position.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-09-03T19:38:03.000Z"
    },
    "company": {
        "name": "Netsmart",
        "link": "https://www.linkedin.com/company/netsmart"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Overland Park",
        "region": "KS",
        "postal_code": "66214",
        "street_address": null,
        "latitude": 38.97482,
        "longitude": -94.6836
    }
}