{
    "job": {
        "title": "Software Engineer",
        "industry": "Information Technology and Services,Computer Software,Financial Services",
        "description": "Do you want to work for an Emmy® Award-winning company? At Audible Magic we are building the most revolutionary media recognition technology and rights management solutions for the global music, movie and television industry. Our customers and partners include some of the largest and most recognized brands in the industry. We win awards because we keep driving to provide better solutions for our customers, solutions that meet the needs of the ever-changing music and entertainment industry. At Audible Magic we believe our customers are paramount, and our reputation and integrity are the foundation of our business. Responsibilities Manage entire sections of our platform by taking projects from idea to implementation Collaborate closely with our design teams on implementing new features and workflows Build highly reliable and scalable cloud-based applications Clearly communicate status and open issues to team leads and managers Ability to learn on the job and implement new technologies Advocate and evangelist of the micro services architecture and REST API vision Develop and maintain the external developer portal containing reference implementations, swagger-based testing interfaces and articles Drive the containerizing effort of the API artifacts Requirements Superior communication chops, both verbal and written, including excellent technical writing and interpersonal skills 3+ years of relevant software engineering experience. AGILE or iterative development experience Ability to write unit tests (TDD practices) for back-end and front-end services Work effectively under stress, independently, and within a team A devil for the details, able to work well under deadlines in a changing environment and perform multiple tasks effectively and concurrently Preferred Experience 3+ years of Object-Oriented Programming (.NET or java) 2+ years of Database experience (SQL and NoSQL databases) 1+ years of NodeJS experience Basic experience building RESTful web services Basic experience working with Message Queue Systems Basic experience working with XML and JSON formats Added Bonus Experience with AWS or similar cloud computing environments Experience building and managing automated build/test/deployment Experience working with Docker Experience working with Oracle Databases Microservice architectures knowledge Robust knowledge of API software design patterns Education Must have a bachelor’s degree (masters’ preferred) in Computer Science, Applied Mathematics, Engineering, or any other technology related field. An equivalent of this educational requirement in working experience is also acceptable.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-14T02:37:27.000Z"
    },
    "company": {
        "name": "Audible Magic",
        "link": "https://www.linkedin.com/company/audible-magic"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Seattle",
        "region": "WA",
        "postal_code": "98133",
        "street_address": null,
        "latitude": 47.60323,
        "longitude": -122.33028
    }
}