{
    "job": {
        "title": "Sr Staff Software Engineer",
        "industry": "Marketing and Advertising,Information Technology and Services,Computer Software",
        "description": "Company Description ServiceNow is making the world of work, work better for people. Our cloud‑based platform and solutions deliver digital workflows that create great experiences and unlock productivity for employees and the enterprise. We're growing fast, innovating faster, and making an impact on our customers' and employees' lives in significant and important ways. With over 6,900 customers, we serve approximately 80% of the Fortune 500, and we're on the 2020 list of FORTUNE World's Most Admired Companies.® We’re looking for people who are ready to jump right in and help us build on our incredible momentum, our diverse, engaged workforce, and our purpose to make the world of work, work better. Learn more on Life at Now blog and hear from our employees about their experiences working at ServiceNow. Job Description As a Senior Staff Software Engineer, focused on cloud infrastructure automation, you will have the opportunity to work on ServiceNow Platform and Tools, build solutions using workflows, orchestration and developer tools in Private and Public Multi Cloud infrastructure. What you get to do in this role: You will design and develop automations to support the deployment and management of ServiceNow Platform/Products in our own infrastructure as well as Public Clouds Build high-quality, clean, scalable and reusable code by enforcing best practices around software engineering architecture and processes (Code Reviews, Unit testing, etc.) Play a key role in the design and implementation of new products and features while also enhancing the existing product suite Work closely with the product owners to understand detailed requirements and own your code from design, implementation, test automation and delivery of high-quality product to our users. Design and implement software that is simple, intuitive and easy to use that will allow customers to extend and customize the functionality to meet their specific business needs In addition to tools and automation, you will interact with other members of the infrastructure organization and the ServiceNow development teams. Qualifications To be successful in this role you have: At least 14 years of proven software development experience (Java, JavaScript, RESTful API, HTML, XML are must haves) Very strong technical skills with a proven record of strong architecture & design experience. Solid foundation in distributed systems with proven experience designing and architecting Systems Excellent technical design, problem-solving, debugging skills and an aptitude for learning new technologies Detailed knowledge of web-based database application development using MySQL or other relational databases Experience with Cloud Application Development Platforms/ AWS/ Azure/ Google Cloud will be a big plus. Excellent analytical, strategic planning, written and oral communication skills Ability to handle multiple competing priorities in a fast-paced environment. Self-starter, good team player, attention to detail and ability to work well with others Bachelors or MS degree in Computer Science/Engineering or equivalent preferred Additional Information ServiceNow is an Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, creed, religion, sex, sexual orientation, national origin or nationality, ancestry, age, disability, gender identity or expression, marital status, veteran status or any other category protected by law. If you are an individual with a disability and require a reasonable accommodation to complete any part of the application process, or are limited in the ability or unable to access or use this online application process and need an alternative method for applying, you may contact us at +1 (408) 501-8550, or talent.acquisition@servicenow.com for assistance. For positions requiring access to technical data subject to export control regulations, including Export Administration Regulations (EAR), ServiceNow may have to obtain export licensing approval from the U.S. Government for certain individuals. All employment is contingent upon ServiceNow obtaining any export license or other approval that may be required by the U.S. Government.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-17T23:40:34.000Z"
    },
    "company": {
        "name": "ServiceNow",
        "link": "https://www.linkedin.com/company/servicenow"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 168,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Kirkland",
        "region": "WA",
        "postal_code": "98034",
        "street_address": null,
        "latitude": 47.675507,
        "longitude": -122.20336
    }
}