{
    "job": {
        "title": "Software Developer",
        "industry": "Construction,Food &amp; Beverages,Transportation/Trucking/Railroad",
        "description": "Position Summary The Programmer/Analyst will be responsible for web application development in VB.Net or C# and experience writing queries in a relational database. This position will assist a small team of developers in coding and modifying custom business applications and reports. Position Responsibilities May Include, But Not Limited To Design, develop and implement business applications using current technologies. Develop design documents such as technical specifications, functional requirements, object modules, system test plans, technical and user documentation. Ensure successful completion of projects. Provide support to maintain existing Intranet, Extranet and Internet sites and applications Document process flows. Participate in team code reviews. Develop small to medium scale applications with low complexity. Other projects or duties as assigned. Qualifications Associate’s degree in Information Systems, Management Information System, Computer Science with at least 6 months of work experience or course work in software development. Exposure to JavaScript and HTML Exposure to development language such as .NET or Java Exposure to database design Exposure to multi-tier development, process flows, use cases, UML Strong debugging skills Understanding of Object Orientated Principles Exposure to SDLC (Software Development Life Cycle) principles Ability to set and meet deadlines on projects The ability to communicate effectively through written and verbal communication, including strong presentation skills and the ability to communicate technical ‘speak’ to a non-technical audience Desire to pursue career in Application Development Ability to self-teach new IT technologies This position must pass a post-offer background and drug test.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-20T00:06:23.000Z"
    },
    "company": {
        "name": "Performance Foodservice",
        "link": "https://www.linkedin.com/company/performance-foodservice"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 6,
        "seniority_level": "junior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "La Crosse",
        "region": "WI",
        "postal_code": "54602",
        "street_address": null,
        "latitude": 43.808765,
        "longitude": -91.25186
    }
}