{
    "job": {
        "title": "Data Scientist",
        "industry": "Staffing and Recruiting",
        "description": "Job Title Data Science Delivery Behavior Profile (Analyst I, II, III) Location Atlanta, GA Summary Mather Economics seeks new graduates to early-stage career individuals who have strong technical skills with the ability to write efficient and maintainable code. Candidates should have experience in data cleaning, manipulation and management through coursework, fellowships, independent research and/or internships. Individuals should be detail-oriented, organized and have a good understanding of econometric modeling and coding. Primary Responsibilities Handle data operational tasks, such as running, modifying and automating recurring processes using SQL and Python Apply econometric modeling coefficients to client datasets using STATA Pull and manipulate data for client requested reporting Write queries to pull output for A/B testing results to be used in client reporting Maintain data quality assurance on a regular basis for data feeds from clients and to clients Problem-solve data or process issues Create and updating health reporting to check for data quality assurance, anomalies and process success Communicate with consulting team on operational tasks and timelines Communicate with team on key performance insights (KPI) on health reporting and quality acceptance thresholds Adjust recurring processes and data to account for any errors outside of quality acceptance thresholds Basic Qualifications Candidates should have a four-year degree from an accredited college or university. Typically, we like to see individuals who have degrees in economics, computer science, or mathematics. Degrees should be accompanied with an internship or work experience that relates to the degree and position. Their technical skills should include Stata, SQL, and Python Other Details During the interview process we are looking for people who can successfully complete a series of technical assessments. They should have well thought out answers and be able to explain how they arrived to each one. It should be evident that they critically self-reviewed their work for errors, typos and inconsistencies. They should have attempted to answer questions they were unsure about by utilizing the resources around them, like Google. This position requires the individual to be an independent problem solver with critical thinking and reasoning skills who can consistently think outside of the box. Individuals should be friendly and easy to talk to with an overall positive attitude. We are looking for candidates with hard technical skills who are also effective communicators. Candidates should show real interest in the position and industry, meaning we want to see people who enjoy being in the weeds with data and writing efficient and maintainable code. In terms of culture, we are seeking individuals who stress they want a fast-paced, team focused atmosphere, have a desire to continually learn and improve technical skills, and show desire to grow into future positions with the company. They must “want” to come to Mather Economics because data manipulation and management sounds interesting to them. After they are hired, we want to see them interact during training, engaged throughout the process, and show general aptitude in understanding the initial requirements. They should take what they learned and apply it immediately, ask questions as needed, and learn from the mistakes they make. As they continue to develop, they should have a strong grasp on stress testing their output, preparing data for effective analysis, independently identifying problems, and creating solutions, and being a part of the team. Enjoys being in the weeds with data Hard-skill oriented Enjoys problem solving Curious and continually eager to learn technical skills and methods Inquisitive and innovative Ability to think outside of the box Ability to write efficient and maintainable code Detail-oriented Team player Effective communicator Critical thinker and reasoning Ability to critically self-review work and stress test output Statistical and quantitative thinking Ability to independently identify problems and create solutions Self-motivated Industry knowledge Ability to prepare data for effective analysis A good understanding of econometric modeling Time management skills Understands how items fit in with the bigger picture How To Apply Please submit your resume below for this opportunity and to view other positions available, visit our careers page at https://jobs.crelate.com/portal/allyon/ Allyon, Inc. is an equal employment opportunities (EEO) employer and terms of employment are without regard to race, color, religion, sex, national origin, age, disability or genetics. Allyon, Inc. complies with applicable state and local laws governing nondiscrimination in employment. This policy applies to all terms and conditions of employment.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-12T20:59:19.000Z"
    },
    "company": {
        "name": "Allyon, Inc.",
        "link": "https://www.linkedin.com/company/allyon-inc"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Atlanta",
        "region": "GA",
        "postal_code": "30355",
        "street_address": null,
        "latitude": 33.748547,
        "longitude": -84.3915
    }
}