{
    "job": {
        "title": "Software Development Engineer - Java",
        "industry": "Information Technology and Services,Internet,Telecommunications",
        "description": "Comcast brings together the best in media and technology. We drive innovation to create the worlds best entertainment and online experiences. As a Fortune 50 leader, we set the pace in a variety of innovative and fascinating businesses and create career opportunities across a wide range of locations and disciplines. We are at the forefront of change and move at an amazing pace, thanks to our remarkable people, who bring cutting-edge products and services to life for millions of customers every day. If you share in our passion for teamwork, our vision to revolutionize industries and our goal to lead the future in media and technology, we want you to fast-forward your career at Comcast. Job Summary Responsible for planning and designing new software and web applications. Edits new and existing applications. Implements, testing and debugging defined software components. Documents all development activity. Works with moderate guidance in own area of knowledge. Job Description The Technology, Product, Experience (TPX) organization works at the intersection of media and technology and our innovative teams are continually developing and delivering products and next-generation technologies that transform the customer experience. The Next Generation Access Network (NGAN) organization is a highly agile, fast paced, and dedicated group at the forefront of change focused on innovating, building, and operating the best in class, most reliable access network for our customers. About The Team This team is an inclusive group of engineers who value collaboration, creative problem-solving, and continued learning. Our team is responsible for a suite of applications used by 20,000+ Comcast Field Technicians. As a software developer, you will work on projects at various stages of the product life cycle, including requirements gathering, design, development, deployment, quality assurance, and operational support. Core Responsibilities Collaborate with project stakeholders to identify product and technical requirements and integration needs Participate in designing new software features and projects Work independently and with others to implement software for assigned projects Collaborate with Quality Assurance team to ensure applications meet specifications and technical requirements Assist in production software releases Engage in pair programming, code reviews, and user story acceptance Document software and processes Keep current with technological developments within the industry You Will Gain Experience In Java, Spring, JDBC, SQL, Maven AWS environments Web-based programming languages (e.g., Angular) Troubleshooting, software lifecycle and quality assurance practices Skills And Experience We're Looking For Collaborative approach, professional work ethic, and positive attitude Willingness to learn new technologies and flexibility regarding changes in technical direction Proficient in Java and SQL Familiar with web application programming About Our Perks & Benefits We are determined to create an environment where our employees feel valued, understand our business goals, and are motivated. Here's a look at just some of the perks and benefits we make available to our US-based employees: Medical & Dental 401(k) Savings Plan Generous paid time off Life Milestones - from adoption assistance, childcare resources, pet insurance, and more, Comcast supports you at all life stages. Courtesy Services - We offer all of our full-time employees in serviceable areas free digital TV and internet. Discount tickets for Universal Resorts, including theme park tickets and onsite hotel rooms. Learn more at http://jobs.comcast.com/life-at-comcast/benefits We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, perform essential job functions, and receive other benefits and privileges of employment. Please contact us to request an accommodation. Disclaimer This information has been designed to indicate the general nature and level of work performed by employees in this role. It is not designed to contain or be interpreted as a comprehensive inventory of all duties, responsibilities and qualifications. Comcast is an EOE/Veterans/Disabled/LGBT employer. This position is ineligible for visa sponsorship . To be considered for this role, you must be legally authorized to work in the United States and not require sponsorship for employment now or in the future. Education Bachelor's Degree Relevant Work Experience 2-5 Years Base pay is one part of the Total Rewards that Comcast provides to compensate and recognize employees for their work. Most sales positions are eligible for a Commission under the terms of an applicable plan, while most non-sales positions are eligible for a Bonus. Additionally, Comcast provides best-in-class Benefits. We believe that benefits should connect you to the support you need when it matters most, and should help you care for those who matter most. That’s why we provide an array of options, expert guidance and always-on tools, that are personalized to meet the needs of your reality – to help support you physically, financially and emotionally through the big milestones and in your everyday life. Please visit the compensation and benefits summary on our careers site for more details.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-10-18T06:09:10.000Z"
    },
    "company": {
        "name": "Comcast",
        "link": "https://www.linkedin.com/company/comcast"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Reston",
        "region": "VA",
        "postal_code": "22096",
        "street_address": null,
        "latitude": 38.960186,
        "longitude": -77.3545
    }
}