{
    "job": {
        "title": "Staff Site Reliability Engineer",
        "industry": "Hospital &amp; Health Care,Medical Devices,Pharmaceuticals",
        "description": "Job Description Summary The Site Reliability Engineer will be responsible for performance and availability of Compute and Network infrastructure consumed by all business segments. The Site Reliability teams are composed of highly talented individuals obsessively focused with availability through operational excellence. The ideal individual is relentlessly technical, passionate for automating everything and totally committed to delivering amazing customer experiences.GE Healthcare is a leading global medical technology and digital solutions innovator. Our mission is to improve lives in the moments that matter. Unlock your ambition, turn ideas into world-changing realities, and join an organization where every voice makes a difference, and every difference builds a healthier world. Job Description Responsibilities Establish performance baseline, capacity thresholds, correlate events, and define monitoring/alerting criteria Develop automated solutions to address potential problems before they result in a service interruption Provide impact assessment and mitigation plan for changes going into the production environment Investigate root cause of severe and systemic outages, identify corrective actions and apply across the enterprise Develop availability measures that align with consumer experience to accurately assess the usability of crucial services Build capacity models to baseline transactional load compared to resource performance and leverage data to predict overall system capacity while automating load placement to avoid outages Identify thresholds for all critical links in the data path to quickly isolate where imbalances may result in potential outages Analyze failure points in services to model risk level and resolution steps if failure occurs. Assist in driving architecture enhancements into system to mitigate potential failure points. Programmatically monitor for and remediate configuration drift of critical devices Develop response plans to potential failure points and evaluate effectiveness during planned tests Perform comprehensive operational health checks of the entire services to identify areas of concern and track activities to drive improvements at all levels of the architecture Provide technical coaching and direction to more junior teammates Qualifications Bachelor's Degree in Computer Science or “STEM” Majors (Science, Technology, Engineering and Math) with minimum of 6 years of experience Strong organizational and project management skills Strong analytical and problem resolution skills Excellent knowledge of common operating systems (Unix/Linux, Windows)Strong oral and written communication skills Demonstrated experience scripting or developing software and services for the cloud Ruby, Python, Go, Java, Node.js, .NET, etc. Extensive knowledge of network protocols (TCP/IP, SNMP, FTP, syslog, TFTP, etc. Experience managing version control systems such as Git Experience deploying and managing infrastructure on public clouds such as AWS or Azure Experience deploying end-to-end cloud solutions utilizing a variety of PaaS/IaaS technologies & supporting middleware/data tier technology stacks such as message queues, web/worker roles, database engines, enterprise search and accompanying monitoring solutions Infrastructure compliance auditing and management, and overseeing disaster recovery planning & execution strategy as well as contingency plans Experience using an automated configuration management system (Terraform, Chef, Puppet, Ansible, Salt, etc.) Excellent knowledge of Network Management (SNMP, MIB) Experience with configuring, customizing, and extending monitoring tools (Datadog, Sensu, Grafana, Splunk, etc.) Excellent knowledge of TCP/IP networking, and inter-networking technologies (routing/switching, proxy, firewall, load balancing etc.) Knowledge and experience using Analytics Software Packages like Matlab, SAS, JMPro etc. Passion for eliminating repetitive manual processes using automation Desired Skills Programming experience with open source scripting and data analysis packages like Python, R is a plus. Our total rewards are designed to unlock your ambition by giving you the boost and flexibility you need to turn your ideas into world-changing realities. Our salary and benefits are everything you’d expect from an organization with global strength and scale, and you’ll be surrounded by career opportunities in a culture that fosters care, collaboration and support. Additional Information GE offers a great work environment, professional development, challenging careers, and competitive compensation. GE is an    Equal Opportunity Employer    .  Employment decisions are made without regard to race, color, religion, national or ethnic origin, sex, sexual orientation, gender identity or expression, age, disability, protected veteran status or other characteristics protected by law. GE will only employ those who are legally authorized to work in the United States for this opening. Any offer of employment is conditioned upon the successful completion of a drug screen (as applicable). Relocation Assistance Provided: No",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-09-02T22:30:49.000Z"
    },
    "company": {
        "name": "GE Healthcare",
        "link": "https://www.linkedin.com/company/gehealthcare"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 72,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Texas",
        "region": "United States",
        "postal_code": "76522",
        "street_address": null,
        "latitude": 31.463793,
        "longitude": -99.333275
    }
}