{
    "job": {
        "title": "Software Engineer",
        "industry": "",
        "description": "Software Engineer Mid Level or Senior Engineer Remote, USA/Canada, Full-Time How can you apply your technical expertise to help clients transform data into new business value? 4 Mile Analytics is a full-service consultancy with expertise in strategy, data analytics, data engineering, data visualization, software development, UX design, and project/product management. We believe in the power of data to form compelling narratives that drive innovation. Our guiding principle is to help our clients move up the chain of analytic maturity. Our developers have contributed code to projects that have transformed the world’s largest companies. We focus on pragmatic solutions to our clients’ most complex data problems. Every day presents fresh opportunities to develop your technical, leadership, and business skills. We pride ourselves on an inclusive, values driven culture that achieves a healthy work life balance. We value in our teammates: Curious minds who are inclined to ask, “Why?” Strong problem-solvers who are comfortable in unfamiliar situations, and can view challenges through multiple perspectives Driven to develop technical skills for oneself and team-mates Ability to connect with clients and colleagues of different backgrounds and communication styles, through empathy and clear verbal, visual, and written communication Equates professional achievement with happy end-users You’ll work on the following: A wide variety of engineering projects including data visualization, web services, data engineering, web-portals, SDKs, and integrations — in numerous languages, frameworks, and clouds Apply continuous delivery practices to deliver high-quality software and value as early as possible. Work in collaborative teams to build new customer experiences Participate in the entire cycle of software consulting and delivery from ideation to deployment What we’re looking for: 2-5 (for mid level) and 5+ (for senior)  years of experience in Front End UI development using Angular, React or another modern Javascript framework 2-5 (for mid level) and 5+ (for senior) years of experience with 2 or more back-end development languages such as Java, NodeJS, Python or Ruby Ability to lead the delivery of major features and moderately complex projects Ability to mentor and guide junior developers Familiarity with at least one cloud environment (AWS, GCP, Azure) Experience with database fundamentals Ability to write high-quality, well-tested code and comfort with Object-Oriented or functional programming patterns Past experience quickly learning new languages and frameworks Familiarity with Agile methods, such as Scrum and/or Kanban Desire to influence others, advocate for technical excellence, while remaining flexible Ability to work with a high degree of autonomy and self-direction What We Offer: 4 Mile offers full-time employees the following compensation package Competitive salary Unlimited PTO 3% company contributions to a 401K Excellent health-care benefits for you and your family members Internet or coworking subsidies and equipment to help you make a good workspace Snack allowance Permanently remote Company retreats",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-29T16:31:38.000Z"
    },
    "company": {
        "name": "4 Mile Analytics",
        "link": "https://www.linkedin.com/company/4mile"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "California",
        "region": "United States",
        "postal_code": "93266",
        "street_address": null,
        "latitude": 37.254673,
        "longitude": -119.61728
    }
}