{
    "job": {
        "title": "Machine Learning Engineer (Remote/Anywhere)",
        "industry": "Information Technology and Services,Computer Software,Telecommunications",
        "description": "Collabora is always looking for passionate and talented software developers to join our geographically-distributed engineering team. We are growing so read on and discover what you could be involved with. Key Responsibilities Discussing technology with clients and represent Collabora at conferences and trade shows to demonstrate and promote our leadership in the open source arena Analysing client problems and designing solutions leveraging open source technologies and Collabora's technical expertise Defining and scoping client projects in collaboration with the delivery team Working with a team of engineers based globally to implement and contribute both to client and open source projects Contributing publicly to open source projects to ensure Collabora's continuing technical leadership Gaining working knowledge of customers’ products, applications, technical and business strengths and target markets Understanding client needs and reconciling time constraints, available technologies and resources, and open source best practices Requirements Technical Skills: Knowledge in machine learning (ML) techniques (supervised, unsupervised) and proficiency in high- and low-level programming languages (C/C++/Python) is a must-have Strong/Extensive foundation in Math, e.g. linear algebra, bayesian statistics, multivariate calculus Proven track record of experience in open-source software development/methodologies is essential as well as a good standing in any relevant open source community Academic and Research Publications in the Machine Learning domain is a big plus Demonstrable contributions to components in open source projects Commercial Skills Understanding client needs and reconciling time constraints, available technologies and resources, and open source best practices Ability to work in a global context with clients and engineers spanning continents Knowledge of customers’ organization, management, product, target market, applications and decision making internal process Personal Skills Self learning skill to get sufficient knowledge of Collabora's services, business model, project delivery life cycle and other related technical domains Self-motivated and reliable, with a demonstrable passion for learning and collaboration Very good English language skills (both verbal and written) Ability to work and communicate in an online, globally- distributed environment Collabora is a software consultancy specializing in bringing companies and the Open Source community together. We combine years of Open Source software leadership with an understanding of the challenges that businesses, non-profits, and governments face. Collabora brings deep technical expertise in system integration & architecture, graphics, multimedia, web engines and communications to a number of market verticals, including mobile, IVI / automotive, set top box / smart TV, and a range of other specialized embedded applications. Collabora has the unique business model of enabling enterprises to leverage Open Source software in their solutions. Having worked with notable industry leading companies in the automotive, aerospace and handset mobile verticals amonst many others, Collabora has established a broad customer portfolio.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-06T05:01:55.000Z"
    },
    "company": {
        "name": "Collabora",
        "link": "https://uk.linkedin.com/company/collabora"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "United States",
        "region": null,
        "postal_code": "99999",
        "street_address": null,
        "latitude": 39.50355,
        "longitude": -99.0183
    }
}