{
    "job": {
        "title": "Senior Software Engineer : Backend",
        "industry": "Information Technology and Services,Computer Software,Internet",
        "description": "100% Remote - Hiring in Canada and Latin America Only At Urbint, our mission is to make communities more resilient. We do this by pairing external data with artificial intelligence to identify areas of high risk and prevent catastrophic loss for utilities and infrastructure operators across the country. We are a team of close-knit engineers, entrepreneurs, and data geeks who obsess over problem-solving, new technologies, and making a positive impact in our communities. We build software which assists utilities and infrastructure operators in working safely and efficiently. These software solutions combine user-friendly interfaces with large amounts of external data and machine learning models to drive the best possible decisions, while maintaining high security and data privacy standards. Our Application Team partners closely with product managers, user interface designers, and our other engineering teams to develop performant, easy to use full stack web applications which drive the workflows and decisions of our customers. We encourage people from underrepresented groups to apply. Our Tech Stack Python, Django TypeScript, React, Ionic PostgreSQL, Redis, Kafka Kubernetes, GCP, Terraform Who You Are Significant backend experience designing, building and maintaining enterprise web applications and/or APIs. Experience working closely with product and account support personnel to help prioritize the best solutions to the largest problems. Experience designing and architecting systems to meet high standards of reliability and ease of use Attention to detail in work and ability to identify ambiguities in specifications. Able to effectively communicate ideas and concepts within your team, across teams, and throughout the organization, even with non-technical audiences, in both written and verbal forms. Eagerness to work in a cross functional team to help build end-to-end features. Nice to Have Familiarity with modern DevSecOps techniques: CI/CD, TDD, Infrastructure as code (IaC), etc. High proficiency with relational databases and ability to profile and optimize queries. Production experience with Django Rest Framework, FastAPI, or other API frameworks Benefits Mission Driven - Some companies use AI to serve better digital ads and trade stocks, we seek to make our communities safer and more resilient Top Compensation - Competitive compensation package We are 100% Distributed - work from anywhere Your health matters to us, so we offer 100% employer-paid premium option Distributed work monthly stipend Office Space Stipend for co-working space expenses Wellness reimbursement Educational Allowance Weekly lunch stipend We're an equal opportunity employer. All applicants will be considered for employment without attention to race, color, religion, sex, sexual orientation, gender identity, national origin, veteran or disability status.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-17T23:36:26.000Z"
    },
    "company": {
        "name": "Urbint",
        "link": "https://www.linkedin.com/company/urbint"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "New York",
        "region": "NY",
        "postal_code": "10132",
        "street_address": null,
        "latitude": 40.713047,
        "longitude": -74.00723
    }
}