{
    "job": {
        "title": "Site Reliability Engineer (SRE)",
        "industry": "Law Enforcement,Computer Networking,Information Technology and Services",
        "description": "HOW TO APPLY To apply for this position, please click the “Easy Apply” button. Applications submitted without a resume will not be accepted. JOB DESCRIPTION The FBI’s Applications and Data Division is looking for dedicated technologists to help us face some of the nation’s toughest challenges. As a Site Reliability Engineer, your focus will be on ensuring maximum availability, reliability, security and performance for digital experiences by discovering and solving problems before they threaten mission-critical applications. You will apply your combined engineering and software development experience and skills to drive best practices, patterns and architectures to maximize the availability, reliability and stability of platforms, processing and delivery of systems. If helping the FBI stay ahead of threats by delivering on the potential of software and data sounds like the right fit for you, join our mission. SALARY LEVEL Salary is commensurate to experience and location. KEY REQUIREMENTS Must be a U.S. citizen. Must be able to obtain a Top Secret Clearance. Meet the FBI’s Employment Eligibility requirements. Must be in compliance with the FBI Employment Drug Policy. Must never have been convicted of a felony. EDUCATION AND EXPERIENTIAL REQUIREMENTS Education All candidates must have a bachelor’s degree or higher from a U.S.-accredited college or university. All degrees must be verified by submitting college transcripts. Specialized Experience Experience reporting and communicating high-value metrics to leadership. Understanding of how site reliability influences users. Strong knowledge of data-center infrastructure and cloud platforms in working directly with the infrastructure and application teams. Experience configuring and managing Software Defined Networks (SDNs). Familiarity with Apache Web Server, Apache Tomcat, Eclipse Jetty, Java, content delivery network tools or similar software. Experience with log management systems such as Splunk. Experience with automated configuration management tools, including software such as Puppet, Ansible or Chef. Working knowledge of automation and orchestration to enable continuous integration and continuous deployment of applications and infrastructure. Experience with networking and networking protocols, including the use of routers, switches, firewalls and load balancers, as well as TCP/IP, the OSI Model and network analysis tools. Experience in troubleshooting infrastructure problems and working with a team to resolve large-scale production issues. Experience instrumenting and monitoring systems to gain visibility and understanding of how systems are performing. Experience with agile methodologies, performance engineering and automation tools.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-19T16:35:08.000Z"
    },
    "company": {
        "name": "Federal Bureau of Investigation (FBI)",
        "link": "https://www.linkedin.com/company/fbi"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Huntsville-Decatur-Albertville Area",
        "region": null,
        "postal_code": "35809",
        "street_address": null,
        "latitude": 34.708153,
        "longitude": -86.59986
    }
}