{
    "job": {
        "title": "NLP Machine Learning Engineer",
        "industry": "Consumer Electronics",
        "description": "Job Description: Conducting research in the area of Language and Conversation AI, advancing the state of the art. Efficiently implementing algorithms, defining data sets and benchmarks and running experiments on real data. Constantly reviewing relevant literature to identify emerging methods or technologies and current best practices. Following the market, products and understanding customer needs, to find innovative solutions to real customer problems. Developing algorithms as software components and supporting their integration into actual products. Roles and Responsibilities: PhD/M.Tech/B.Tech in computer science or related fields / 3-6 years of work experience in fields of Natural Language Processing and Deep Learning. Deep and broad understanding of foundations up to state-of-the-art machine learning and deep learning techniques, including hands-on experience with deep learning frameworks. Experience in designing deep learning architectures, as well as implementing in a real-world setting. Familiarity with NLP concepts and related tasks, such as language modeling, neural retrieval & generation, text classification & NER, machine translation, summarization. Familiarity with AWS stack and cloud deployment. Hands on experience in writing code in Python. Innovative thinking, creativity, and self-learning preferred",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-24T11:09:46.000Z"
    },
    "company": {
        "name": "Samsung Electronics",
        "link": "https://kr.linkedin.com/company/samsung-electronics"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "IN",
        "locality": "Noida",
        "region": null,
        "postal_code": "201306",
        "street_address": null,
        "latitude": 28.58467,
        "longitude": 77.352005
    }
}