{
    "job": {
        "title": "Engineering Manager, Site Reliability Engineer (Consumer)",
        "industry": "Internet",
        "description": "Company Description Twitter is what’s happening and what people are talking about right now. For us, life's not about a job, it's about purpose. We feel real change starts with conversation. Here, your voice matters. Come as you are and together we'll do what's right (not what's easy) to serve the public conversation. Job Description Who We Are Twitter offers engineers the outstanding opportunity to personally make a noticeable difference at a company that makes a difference in the world. Our Site Reliability Engineering teams embed within our consumer product engineering teams. SREs supporting these teams will specialize in and are passionate about scaling our infrastructure, improving developer efficiency, automation, and tooling that power impactful features on Twitter, like the Timelines, Notifications, Search, Trends, and so much more! Our team is seeking an enthusiastic Engineering Manager in the Site Reliability Engineer organization to lead a team of SREs. What You’ll Do We believe passion and personality matter; as such, we need leaders that can lead diverse, thoughtful, and driven engineers while balancing day to day people management with moving the business forward both technically and culturally. As an Engineering Manager, you will manage a team of engineers who are working to keep Twitter reliable and scalable. Your responsibilities include, but are not limited to Mentor, grow, and empower your team by giving them the skills, confidence and motivation to make decisions independently that lead to their personal and professional success, and enable them to become technical leaders. Help the individuals on your team to build and implement personal development plans that align with Twitter’s goals and objectives, and understand how their work fits into the bigger picture. Scale the team up by sourcing and hiring dedicated SREs Manage engineers spread out across various time zones and regions Partner with other Engineering Managers across Twitter to achieve reliability outcomes for their services. Participate and drive deep technical design discussions within your team, and across partner teams. Who You Are You possess strong leadership skills and the ability to motivate teams. You will bring a strong perspective and developed partnership style that inspires change, and motivates engineers to develop simple solutions to sophisticated operational or reliability challenges. You have experience formulating a team's technical strategy and roadmap, and you've collaborated and partnered effectively with several other teams. You have experience building services and systems, have successfully taken projects from inception to production, and are confident diving in to provide leadership for major projects when needed. You are capable of leading a discussion with upper management, and are able to tailor the level of technical detail to suit your audience. Qualifications B.S. in computer science or similar field or equivalent experience You have 3+ years of handling services in a large scale distributed environment You have 2+ years experience successfully managing a team of 4 or more engineers on large-scale projects that included technical deep-dives and production troubleshooting in the areas of distributed systems, debugging, performance Demonstrable knowledge of TCP/IP and HTTP Practical knowledge of shell scripting and at least one higher-level language (e.g. Python, Golang, Java or Scala)",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-10-15T14:26:26.000Z"
    },
    "company": {
        "name": "Twitter",
        "link": "https://www.linkedin.com/company/twitter"
    },
    "education": {
        "required_credential": null
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Seattle",
        "region": "WA",
        "postal_code": "98133",
        "street_address": null,
        "latitude": 47.60323,
        "longitude": -122.33028
    }
}