{
    "job": {
        "title": "Software Engineer",
        "industry": "Computer Software",
        "description": "Nuix creates innovative software that empowers organizations to simply and quickly find the truth from any data in a digital world. We are a passionate and talented team, delighting our customers with software that transforms data into actionable intelligence. At Nuix, we hire the best people from around the world and empower them to do what they do best. We pride ourselves on our ongoing innovation, dedicated customer service, and cutting-edge solutions that make a real difference to our customers and the world in which we live. We collaborate to provide innovative solutions for more than 1,800 customers in over 72 countries. Our customers include many of the world’s top financial institutions, corporations, and government departments, all major global regulatory agencies, leading security and law enforcement agencies, and all tier-one advisory firms and litigation support vendors. As a result of our continued growth, we are seeking an outstanding Software Engineer. This position is responsible for implementing critical software modules for Nuix with a high degree of independence and requires excellent knowledge JavaScript, C#, SQL and related technologies. Key responsibilities include: Deliver scalable and performant solutions as part of an Agile team Collaborate across teams to achieve seamless integrations between multiple projects Develop software from approved designs and/or requirements adhering to all relevant standards and making efficient use of Nuix’s software development environment Design, develop, and perform unit, system, and integration tests of software components Participate in planning, backlog grooming, and technical design discussions Fully document any software you develop and ensure code quality is in line with the relevant coding standards Key Requirements: 2-4 years experience in a similar role Strong software development skills in a primarily object-oriented technology (C#, Java) Familiarity with relational, NoSQL, and graph databases Ability and desire to test code is required Demonstrate ability to solve complex problems on a daily basis Passion for and understanding of good development practices such as test-driven development, and agile methodologies Ability to collaborate and communicate effectively across multiple time-zones Strong organizational, prioritization, and time management skills Excellent verbal and written communication skills Ability to demonstrate excitement about and connection to the Nuix mission and values Ability to thrive in a fast-paced, agile environment with a sense of urgency and attention to detail Willingness to learn & develop professionally Nuix is on an incredible journey of transformation, aligning our strengths with our ambitions to pursue greater opportunities. To find out more about who we are and what we are doing, please visit our web page. https://www.nuix.com/ As we expand our global team and extend our skills and expertise, we are unified as one Nuix team guided by our shared values. Nuix Vision Finding Truth in a Digital World. Nuix Mission Statement Nuix creates innovative software that empowers organizations to simply and quickly find the truth from any data in a digital world. We are a passionate and talented team, delighting our customers with software that transforms data into actionable intelligence. Nuix Values Customers – Focus, Deliver, Delight Innovation – Unleash Collective Genius Teamwork – Stronger together People – Respect, Encourage, Reward Integrity – Authentic and Accountable Passion – Committed to the Mission We believe in these principles and seek to weave them into the fabric of our daily work at Nuix. In doing so, we co-create a dynamic and purposeful company culture that we can be proud of and want to belong to. **Nuix is an Equal Opportunity Employer**",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-10T01:46:26.000Z"
    },
    "company": {
        "name": "Nuix",
        "link": "https://au.linkedin.com/company/nuix"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Pittsburgh",
        "region": "PA",
        "postal_code": "15235",
        "street_address": null,
        "latitude": 40.44217,
        "longitude": -79.99496
    }
}