{
    "job": {
        "title": "Machine Learning Engineer",
        "industry": "",
        "description": "Machine Learning Engineer Soothsayer Analytics is seeking Machine Learning Engineer who has an interest in solving challenging ML/ AI problems in Insurance. Our AI team works on a variety of exciting analytics (ML, AI) projects. Number of positions : 4 Immediate need, need someone to start within 1-2 weeks max. Required Education: PhD in computer science, Physics, Statistics, Applied Mathematics, or other quantitative/ Computational discipline or Master's with over 5 years of real-time relevant real-time Industry experience as an AI/ML/ Deep Learning is a MUST. Required experience: At least 5 years industry experience as a Data Scientist is required. Job Description: Participate in requirements gathering, technical specification, design, and development of complex operationalizing machine learning projects. Ability to translate business requirements into plausible technical solutions for the articulation to other development team members. Contribute to the architecture design, development of data or machine learning pipelines, and integration into enterprise systems Responsible for Build and configure multi-tenant machine learning environments on-prem, cloud, or hybrid Responsible for Build, test and optimize AI/ML models Interact with teams of engineers from multiple disciplines Identifying and defining the scope Defining technical approach, data and algorithms needed Responsible for building out the data product from POC to product Communicate modeling results and its business impact to scientific and business stakeholders Collaborate with other engineers, data scientists, and business analysts. Machine Learning Engineer/ Data Scientist Advanced level Experience in Python and ML Experience with building Machine Learning models and pipelines using tools like Python and Spark in AWS SageMaker. Experience building a variety of deep learning methods (autoencoders, embeddings etc.) using Pytorch, Tensorflow. Experience building time series models Proficient in data processing using pandas and pySpark. Ad hoc analysis to describe and understand data sets. Familiarity with MLOps Knowledge of SQL for accessing and processing data Experience with at least one CI/CD tool , e.g. Jenkins, Github actions, or cloud equivalents Experience in hyperparameter tuning, model selection and metrics. The candidate should demonstrate the ability to be well organized and perform error analysis to investigate model performance. Experience building visualizations using python. Hands on experience in a range of ML and AI techniques (e.g. supervised and unsupervised machine learning techniques, deep learning) Deep understanding of data manipulation/wrangling techniques Required Skills/ Skills Matrix: Data Analysis and Modeling using Python/Spark – 5 years = Must Distributed data processing using pyspark - 3 years = Must Deep Learning on structured data - 3 years = Must Computer Vision/NLP - 12 months = Good to have MLOps - 6 months = Must Time Series Analysis and Modeling – 1 year = Must Domain experience in solving ML problems in one or more of Insurance - 3 years = Must AWS SageMaker – 1 year - Must",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-27T15:32:25.000Z"
    },
    "company": {
        "name": "Soothsayer Analytics",
        "link": "https://www.linkedin.com/company/soothsayer-analytics"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Livonia",
        "region": "MI",
        "postal_code": "48154",
        "street_address": null,
        "latitude": 42.395065,
        "longitude": -83.3695
    }
}