{
    "job": {
        "title": "Sr. Staff Site Reliability Engineer",
        "industry": "Information Technology and Services,Computer &amp; Network Security,Security and Investigations",
        "description": "Description Job ID (22-491) OPEN TO REMOTE Come Join Our Passionate Team! At Barracuda, we make the world a safer place. We believe every business deserves access to cloud-enabled, enterprise-grade security solutions that are easy to buy, deploy, and use. We protect email, networks, data and applications with innovative solutions that grow and adapt with our customers’ journey. More than 220,000 organizations worldwide trust Barracuda to protect them — in ways they may not even know they are at risk — so they can focus on taking their business to the next level. We know a diverse workforce adds to our collective value and strength as an organization. Barracuda Networks is proud to be an Equal Opportunity Employer, committed to equal employment opportunity and equitable compensation regardless of race, gender, religion, sex, sexual orientation, national origin, or disability. Envision yourself at Barracuda As a Senior Staff Site Reliability Engineer you will be responsible for managing our production services and will work with Engineering and Operations teams to ensure reliability, scalability, and performance on the AWS public cloud. You will have significant opportunities to make a difference in how we run on the cloud, with direct impact to ourselves, engineering, and our customers. Tech Stack: Elasticsearch, AWS, EKS, Kubernetes, EC2, Fargate, Github Actions, Argo CD, Chef, Postgresql, Ubuntu, plus more What You’ll Be Working On Identifying and implementing improvements that reduce costs, reduce toil, and reduce risk. Ensure service reliability and uptime Participate in rotating on-call Troubleshooting issues across the AWS stack: Network, application, automation, software Collaborating with internal groups to identify, develop, and deploy manageable, scalable and robust services Representing Cloud Engineering in design reviews and operational readiness exercises for new and existing services What You Bring To The Role 5+ years experience in managing systems in AWS Bachelor’s degree or equivalent work experience Knowledge of DevOps principles and application to software delivery in cloud architecture 3+ years of Strong experience with a Kubernetes ecosystem in production Experience with modernizing past tech stacks is a plus Elasticsearch experience is a huge plus What You’ll Get From Us A team where you can voice your opinion, make an impact, and where you and your experience are valued. Internal mobility – there are opportunities for cross training and the ability to attain your next career step within Barracuda. High-quality health benefits Retirement Plan with employer match Career-growth opportunities Flexible Time Off and Paid Time Off benefits Volunteer opportunities",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-10-05T01:42:41.000Z"
    },
    "company": {
        "name": "Barracuda",
        "link": "https://www.linkedin.com/company/barracuda-networks"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Alpharetta",
        "region": "GA",
        "postal_code": "30022",
        "street_address": null,
        "latitude": 34.075615,
        "longitude": -84.29455
    }
}