{
    "job": {
        "title": "Software Engineer (Entry Level)",
        "industry": "Construction,Information Technology and Services,Computer Software",
        "description": "Description: Who we are: The Advanced Technology Laboratories (ATL) is a Lockheed Martin applied research and development center. Aligned with the Corporation’s Chief Technology Officer, we work to advance scientific discovery and technology transition in human systems, robotics and autonomy, spectrum systems, data analytics and more! What We Do Spectrum Systems Lab (SSL) Engineers are hardworking problem solvers with an ability to learn and think creatively! We combine diverse skillsets and backgrounds to deliver groundbreaking technology to our customers, community, and company. We support research and technology development for projects funded externally and internally helping advance the state-of-the-art for Defense and prepare our customers and Lockheed Martin for the future of tomorrow. What You’ll Do Are you a skilled engineering generalist? As an engineer at SSL your day-to-day responsibilities vary based on the needs of our programs. We pride ourselves in the flexibility we give to our engineers to pursue research that is of interest to them, and give opportunities for engineers to grow and learn about what others in the lab are doing. Based on our current needs, your skills and the skills you wish to acquire, you could be tasked with any of the following: The design, code and test of software for Digital and RF/analog advanced state-of-the-art receivers, transmitters, antennas, and jam and anti-jam systems. Architecting and implementing data engineering pipelines in support of automated analysis of machine learning, sensor processing, and target tracking research prototypes over large data sets. Utilize DevSecOps fundamentals to analyze, debug, and integrate RF processing and target tracking software. Lead and/or support research projects to innovate and provide new/novel solutions for novel problems. Participate in large-scale field tests where our systems are tested on the ground, at sea, and in the air on commercial or Military assets. Assist in the acquisition of new business by coming up with modern day solutions to customer problems. To promote the sharing of ideas, Lockheed Martin cultivates an inclusive work environment that inspires differences and big-picture thinking. Here Are Some Of The Benefits You Can Enjoy Our employees play an active role in strengthening the quality of life where we live and work by volunteering more than 850,000 hours annually. Medical/Dental Sick and bereavement leave 401k Paid time off Work/life balance Career development Mentorship opportunities Rewards & recognition Lockheed Martin is an Equal Opportunity/Affirmative Action Employer. You will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected veteran status, or disability status. We will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us to request accommodation. Basic Qualifications B.S. in Computer Science, Computer Engineering, Electrical Engineering or related field 0-2 years of experience in software and/or embedded design, development and testing. Good team working and collaboration skills. Ability to obtain a security clearance to at least the Secret level. Desired Skills Experience and/or interest in any of the following is a plus, but not required. Software/Algorithms Software development (C, C++ and/or Python preferred) Designing and implementing CI/CD pipelines Modern wireless communication techniques and protocols Web development (React.js preferred) Familiarity with machine learning algorithms and pipelines Embedded/Hardware Experience with RF Test Equipment FPGA's and digital design (Xilinx preferred) Linux kernel/driver development Embedded C and/or C++ development Software-Designed Radios (USRP SDRs, Analog Devices Radios like the AD9361, AD9371, Directly-Sampled transceivers cut as the Xilinx RFSoC and/or Analog Devices MxFE) RF circuit design Research Knack for developing first-of-a-kind solutions to new problems Leading research into state-of-the-art technologies General Awareness of customer mission areas: Electronic Warfare (EW), RF signal intercept, RF geolocation technologies, Electronic Support Measures (ESM), Signal Intelligences (SIGINT) Radar signal processing Digital signal processing for software and/or FPGA fabric System Administration Experience (Ubuntu and/or RedHat preferred) Project management Job.Qualifications BASIC QUALIFICATIONS: Lockheed Martin is an Equal Opportunity/Affirmative Action Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, pregnancy, sexual orientation, gender identity, national origin, age, protected veteran status, or disability status. Join us at Lockheed Martin, where your mission is ours. Our customers tackle the hardest missions. Those that demand extraordinary amounts of courage, resilience and precision. They’re dangerous. Critical. Sometimes they even provide an opportunity to change the world and save lives. Those are the missions we care about. As a leading technology innovation company, Lockheed Martin’s vast team works with partners around the world to bring proven performance to our customers’ toughest challenges. Lockheed Martin has employees based in many states throughout the U.S., and Internationally, with business locations in many nations and territories. Experience Level 4 yr and up College",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-31T03:49:08.000Z"
    },
    "company": {
        "name": "Lockheed Martin",
        "link": "https://www.linkedin.com/company/lockheed-martin"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Cherry Hill",
        "region": "NJ",
        "postal_code": "08003",
        "street_address": null,
        "latitude": 39.909725,
        "longitude": -74.9871
    }
}