{
    "job": {
        "title": "Software Engineer (Backend) - North America",
        "industry": "Computer Software,Internet,Computer Games",
        "description": "About Us Gravity Sketch is a VC backed London-based startup transforming the future of digital creation. Our vision is to revolutionise 3D design and the way products are brought to life. We are developing the first 3D digital design platform focused on creative designers. We aim to positively disrupt the current design and engineering workflows, placing the user at the center of the creation process in hopes of accelerating the full development process. The platform is used by thousands of designers across the globe in industries such as transportation, industrial design, media and entertainment, and apparel. Life At Gravity Sketch We’re a small team of 33. We move quickly, take pride and ownership in our work, and aim to leave a real impact on the industry. Our culture is one of innovation, collaboration, and creativity. We’re looking for ambitious, passionate, and empathetic people who want to join us on our journey. As a fast-growing start-up we’re process-light and with a heavy focus on innovating. If you’re resourceful by nature and a great team player, you’ll fit right in. At Gravity Sketch, you’ll drive your own projects and career development. We’ll support you in your individual growth goals, so you’ll have access to unparalleled learning if you’re up for the challenge! We work hard, and we play hard too whether we’re finding new ways for the whole team to listen to our company Spotify while remote, or playing Jackbox with colleagues there’s something for everyone from Beat Saber, to pub quizzes, to board game nights, to Zoom workouts, to collaborative fun sketching sessions in GS. We’re always open to trying new things if you want to share your hobby with the team! What You'll Be Doing This role will involve designing and developing large scale distributed systems to support real-time multi-user interactions in an Immersive Product (yes, even more complex than an MMO), with 3D collaboration. As a Backend Engineer in an immersive technology company, you will need to understand our products and have empathy with our users. You must have a passion and motivation to improve, propose, design, and develop scalable backend systems to support low latency interactions across multi-platform applications such as desktop, mobile devices, design tablets, AR, VR and so on. You’ll work on PoC, MVP, and production development, and properly address and balance the quality (scalability, reliability, extensibility, flexibility etc) of the systems you are going to deliver within set timeframes. The role would suit someone with a solid engineering foundation, and strong motivation to learn new skills and knowledge in cutting edge technologies. Ideally you’re always willing to try, propose, redesign, and refactor alternative solutions to be more efficient, while reducing errors, and minimising human interactions for easier maintenance. Requirements What we look for Compatible to work within Pacific timezone (this is a fully remote role) Bachelor’s degree in fields related to Computer Science, Physics, Mathematics, or Engineering Development experience in at least one of the languages C#, C++, Java, Golang, Rust Understand and adopt rigorous industry-standard coding and design pattern best practices, including SOLID Experience with distributed system(s) Strong understanding of distributed database(s) Keen interest in continuously learning new and emerging technologies Willing to get hands on with devops Bonus points if you have Experience in large scale projects and working as part of a team Experience with a large scale distributed system Experience using Redis, Apache Cassandra, DynamoDB, ElasticSearch, Docker, Kubernetes Understand concurrency, high-multi threading and low latency interactions Understand and know how to build a scalable system Experience deploying to AWS or Google cloud React, Javascript, HTML, or other frontend development experience Benefits Medical, dental & vision insurance 25 days paid holiday Employee stock options £1,000 personal budget per year for professional development Enhanced parental leave policy (maternity and paternity) Top spec IT equipment Regular team socials, team lunches Chance to work at a fast growing startup disrupting the Createch industry Real work ownership - you drive your own initiatives Great work culture and environment - we work hard but also know how to have fun We are committed to equality of opportunity for all employees. Applications from individuals are encouraged regardless of age, gender, sexual orientation, background, and nationality.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-10T04:05:38.000Z"
    },
    "company": {
        "name": "Gravity Sketch",
        "link": "https://uk.linkedin.com/company/gravitysketch"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Seattle",
        "region": "WA",
        "postal_code": "98133",
        "street_address": null,
        "latitude": 47.60323,
        "longitude": -122.33028
    }
}