{
    "job": {
        "title": "Clinical Laboratory Scientist",
        "industry": "Biotechnology",
        "description": "Clinical Lab Scientist This is an excellent opportunity for a California Clinical Lab Scientist to join a great full-service reference laboratory experiencing tremendous growth! Top Reasons to Work with Us Competitive Pay and full benefits including medical, dental, vision, 401K and more We provide excellent training for newly licensed and experienced candidates Join a dynamic company with excellent opportunities for growth! Fun and friendly environment with employee perks Great location, quick access to freeway What You Will Be Doing Responsible for the performance, quality assessment and reporting of assigned analytical test procedures Works on problems of diverse scope where analysis of data requires evaluation of identifiable factors Work on cutting-edge testing Exercises judgment within generally defined practices and policies in selecting methods and techniques for obtaining solutions What You Need for this Position Licensed CA Clinical Lab Scientist or Limited Micro License Experience in microbiology or molecular testing is a plus PCR So, if you are a California Licensed Clinical Lab Scientist, we would love to review your resume! Email Your Resume In Word To Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also: Anna.Thomas@CyberCoders.com Please do NOT change the email subject line in any way. You must keep the JobID: linkedin : AT-1639717 -- in the email subject line for your application to be considered.*** Anna Thomas - Principal Recruiter - CyberCoders Applicants must be authorized to work in the U.S. CyberCoders, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-25T17:36:50.000Z"
    },
    "company": {
        "name": "CyberCoders",
        "link": "https://www.linkedin.com/company/cybercoders"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Irvine",
        "region": "CA",
        "postal_code": "92717",
        "street_address": null,
        "latitude": 33.68591,
        "longitude": -117.82472
    }
}