{
    "job": {
        "title": "Machine Learning Engineer &amp; Junior Data Scientist",
        "industry": "Information Technology and Services",
        "description": "Position 1 Machine Learning Engineer Responsibilities Consulting with managers to determine and refine machine learning objectives. Designing machine learning systems and self-running artificial intelligence (AI) software to automate predictive models. Transforming data science prototypes and applying appropriate Client algorithms and tools. Monitoring and ensuring that algorithms generate accurate user recommendations. Turning structured and unstructured data into useful information by utilizing various data science approaches Solving complex problems with multi-layered data sets, as well as optimizing existing machine learning libraries and frameworks. Developing Client algorithms to analyze huge volumes of historical data to make predictions. Running tests, performing statistical analysis, and interpreting test results. Documenting machine learning processes. Keeping abreast of developments in machine learning. Requirements: Bachelor's degree in computer science, data science, mathematics, or a related field. Master s degree in computational linguistics, data analytics, or similar will be advantageous. At least two years' experience as a machine learning engineer At least two years experience as a full-stack engineer Advanced proficiency with Python, Java, and R code writing Extensive knowledge of Client frameworks, libraries, data structures, data modeling, and software architecture. In-depth knowledge of mathematics, statistics, and algorithms. Superb analytical and problem-solving abilities. Great communication and collaboration skills. Excellent time management and organizational abilities. Position 2: Junior Data Scientist Your Skills Should Include Degree in a scientific or quantitative field, or proven proficiency in these areas Strong understanding of statistics and how it can be used with the scientific method and Bayesian statistics Strong technical ability in a data-focused programming language, such as R or Python Ability to solve unique or complex problems and explain your findings in a concise, actionable manner Ability to form useful machine learning models that have a measurable impact towards a target goal Ability to learn new skills and information sets quickly Selecting features, building, and optimizing classifiers using machine learning techniques Data mining using state-of-the-art methods Extending company s data with third party sources of information when needed Enhancing data collection procedures to include information that is relevant for building analytic systems Processing, cleansing, and verifying the integrity of data used for analysis Doing ad-hoc analysis and presenting results in a clear manner Creating automated anomaly detection systems and constant tracking of its performance Responsibilities: Explore large data sets and identify trends on both short- and long-time scales; identify what types of models best apply towards a particular objective Implement predictive models that improve prediction accuracy Implement models that automate decision making at scale that optimize for target KPI Build data science models that tie directly into other existing models Great communication skills Experience with data visualization tools, such as DOMO, Tableau, D3.js, GGplot, etc. Proficiency in using query languages such as SQL. Good applied statistics skills, such as distributions, statistical testing, regression, etc. Good scripting and programming skills Data-oriented personality",
        "employment_type": "CONTRACTOR",
        "date_posted": "2021-06-16T04:00:41.000Z"
    },
    "company": {
        "name": "LGZ New Media",
        "link": "https://uk.linkedin.com/company/lgz-new-media"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Dallas",
        "region": "TX",
        "postal_code": "75342",
        "street_address": null,
        "latitude": 32.777977,
        "longitude": -96.79621
    }
}