{
    "job": {
        "title": "Senior Software Engineer- Apple TV Services",
        "industry": "Consumer Electronics",
        "description": "Summary The Apple TV Services Teams What happens when the world’s most innovative engineers collaborate with the world’s most creative storytellers? TV gets reinvented. Meet the reinventors: The Apple TV Services teams created and manage the Apple TV app as well as tvOS, which redefined and refined the way people watch their favorite shows, movies, and so much more — including everything they love from the major subscription services. Today, these teams also manage one of the most exciting new realms at Apple: They bring viewers the critically acclaimed and award-winning Apple Originals in Apple TV+. And they’ve engineered it so Apple TV+ can be enjoyed not only on Apple devices, but also directly on many new televisions and third-party streaming devices. To deliver Apple-level quality on a global scale, these engineers employ talent and tools to smoothly ingest and process a wide array of media assets. They work cross-functionally to handle video flow from content ingestion, playback, transcoding, and virtually everything else it takes to make the experience as seamless as possible. Join them to see what else is possible. Areas of work include macOS/iOS Engineering, Full-Stack Engineering, Front-End Engineering, Back-End Engineering, Quality Engineering, Machine Learning Engineering, Data Science, Data Engineering, Site Reliability Engineering, Commerce Engineering, and Engineering Project Management. We successfully launched Apple TV+. Now we are growing! The AP Videos team is looking for a motivated developer who also possesses excellent interpersonal skills. The candidate should have experience developing frameworks for large scale systems, and should be a good standout colleague. Key Qualifications Ideal candidate will have exposure to some of the following: - Built backend services for consumer products - Designed or worked with complex domain models - Created beautiful APIs - Built highly scalable micro-services - Fluent in Java and have opinions about Java Stream, asynchronous programming, dependency injection - Take pride in your unit tests - Worked with message driven programming using Kafka or other messaging technologies - Insights into caching technologies - Knowledge of key/value or column stores Description On the Apple Video Frameworks team, you will -  Design, build, and maintain the core frameworks used by Apple Video's engineering teams -  Debug production issues across services and levels of the stack -  Build a phenomenal customer experience for people using your infrastructure Education & Experience BS CS/CE/EE or equivalent experience Role Number: 200243596",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-09T20:01:49.000Z"
    },
    "company": {
        "name": "Apple",
        "link": "https://www.linkedin.com/company/apple"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "San Diego",
        "region": "CA",
        "postal_code": "92161",
        "street_address": null,
        "latitude": 32.71576,
        "longitude": -117.16382
    }
}