{
    "job": {
        "title": "Data Scientist / Machine Learning Engineer for AVConference",
        "industry": "Consumer Electronics",
        "description": "Summary Our team is responsible for implementing software services for realtime video conferencing and media distribution systems. Our custom AV pipeline is used for marquee features such as FaceTime, Group FaceTime, SideCar, AirPlay4K and HomeKit IP Camera. Apple's Interactive Media Group (IMG) is looking for a proactive and hardworking data scientist to help deliver the best real-time video user experience. Key Qualifications • Expertise in statistical data analysis, data visualization and AB testing • Excellent understanding of machine learning algorithms including regression, clustering, classification and dimensionality reduction. • Experience in retrieving and processing large amounts of data from structured and unstructured databases • Proficiency in Python using data science libraries and machine learning frameworks • You demonstrate strong communication skills and the ability to explain and understand complex technical concepts • You are a highly motivated, self-directed and fast learner • You have excellent judgment and integrity with the ability to make timely and sound decisions Description As a data scientist you will contribute to evaluating and improving the performance of Apple’s realtime media solutions. The ability to build advanced data visualizations, perform comprehensive analysis and deliver solid conclusions is essential for this position. Our team builds automated pipelines and cloud services to support data and machine learning processing. You will collaborate with a team of software engineers and cross-functional leaders to bring analytics rigor and drive key decisions. Education & Experience B.S/M.S/PhD in EE/CE/CS or relevant quantitative field with a strong focus in data science and machine learning Additional Requirements Software development experience in C or Objective-C is preferred but not required Role Number: 200146783",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-17T15:18:05.000Z"
    },
    "company": {
        "name": "Apple",
        "link": "https://www.linkedin.com/company/apple"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Cupertino",
        "region": "CA",
        "postal_code": "95014",
        "street_address": null,
        "latitude": 37.319313,
        "longitude": -122.02927
    }
}