{
    "job": {
        "title": "Electrical Test Engineer",
        "industry": "Information Technology and Services,Computer Software,Computer Networking",
        "description": "Requirements Under general supervision, designs, develops and tests electrical and/or electronics hardware and/or firmware for downhole tools and surface systems. This may include analog and digital circuitry, power transmission and distribution, signal and communication systems, mechatronic systems. Diagnoses instruments and electrical and/or electronic systems problems. Services, troubleshoots, repairs and/or replaces and maintains instrument and electrical and/or electronics component levels in surface and downhole equipment. May perform analytical troubleshooting, repair and maintenance of electrical and/or electronic systems. May be required to develop, test and debug firmware for Microprocessor/ Microcontroller/ DSP system and software for test system automation. Evaluates, selects and applies standard engineering techniques, procedures and criteria, using judgement in making minor adaptations and modifications. May develop specifications, conduct process study, research investigations, and report preparation. Provide technical guidance to designers/drafters and less experience engineers as required. May provide technical leadership in developing solutions and/or devising new approaches to problems encountered Incorporates reliability analysis during the design and test process. Complies with HSE and Service Quality requirements. Job tasks, correctly performed, impact indirectly on cost containment, efficiency, profitability, or operations. Skills typically acquired through the completion of an undergraduate degree in Electrical Engineering, Electronics Engineering or similar discipline, and 4 years of related experience Design knowledge / Product development is very important New Product Development environment with knowledge of testing procedure Hardware Testing experience is most important Validate smaller circuitry Knowledge of following tools is good to have PCB- Altium ( should understand `` Software Test Automation- Labview Firmware knowledge You can apply via: http://jobd.info/?id=DSrCKf Recruiter Details Praveen Rao (302) 214-0551 praveen_us@falconsmartit.com Find all current job openings at our Career Page https://www.falconsmartit.com/FalconCareer.html Follow us on LinkedIn for Job Opportunities https://www.linkedin.com/company/falconsmartit/",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-20T22:42:26.000Z"
    },
    "company": {
        "name": "Falcon Smart IT (FalconSmartIT)",
        "link": "https://uk.linkedin.com/company/falconsmartit"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 48,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Dover",
        "region": "DE",
        "postal_code": "19901",
        "street_address": null,
        "latitude": 39.15883,
        "longitude": -75.52114
    }
}