{
    "job": {
        "title": "Quantitative Developer / Researcher - Quantitative Crypto Trading Firm",
        "industry": "Financial Services,Internet,Computer Software",
        "description": "Quantitative Developer / Researcher - Quantitative Crypto Trading Firm Location: Remote. It would be nice (not required) if you are located in either the San Francisco Bay Area or New York (since other team members are in those places). This position is with a DeFi-specific hedge fund that is focused on several strategies; the first of which is a stablecoin yield strategy. The company will pay competitive salary (up to $200k or more) plus discretionary bonuses which can be lucrative. Job Responsibilities: - Reporting to the CEO of the hedge fund. - About 60% development and 40% research. - The company does not require much more than 40 hours/week, but it's not a 9-5 job. Whenever you are not sleeping, the company would like you to be available to work on short notice. - Creating internal tooling to measure performance. For example, calculating the rate of return, what market makers are making or losing by providing liquidity, etc. - Developing core algorithms and models that lead directly to trading decisions. - Working closely with smart contract engineers to develop proprietary market analysis tools. - Supporting research and statistical analyses of decentralized finance applications including Automated market makers, Decentralized derivatives, and Impermanent loss analysis tools. - Source, evaluate and productionize alternative datasets leading new alpha generation strategies. Qualifications: - Professional experience as a Quant. - A Master's degree in Financial Engineering. - Experience trading cryptocurrency. Basic knowledge of blockchain and DeFi. - Proficiency with programming in Python. - Strong skills in mathematics and statistics. - Statistical modeling skills for time-series and cross-sectional data. - Ability to grasp new concepts quickly, such as new crypto financial systems and where to find the exploits in those systems. - Ability to understand things at a high level and translate them into granular details. Nice to have: - Experience with decentralized finance tools. - Proficiency with C++. About Skyrocket Ventures Skyrocket Ventures is a recruiting firm for hundreds of high growth technology companies that range from industry leaders to top-tier startups. This opportunity is with one of our client companies for a full-time permanent hire. Please only apply if you are authorized to work in the U.S. Please note that even if this job is not a perfect match, we encourage you to apply as long as it is in the ballpark. Companies are often flexible in hiring candidates who do not perfectly fit their written job description, as long as the most important qualifications are there and the candidate is good in general. Most of the jobs we are recruiting for are not posted online, so if you would like to know of all the opportunities we have that match your interests and qualifications, then please get in touch with us. After you apply to this job posting, we’ll consider you for this job as well as any other potential matches with our client companies. If we have any potential matches, we’ll share your resume with those companies and contact you about any interview opportunities we can get you. Thank you, and we wish you a great job search!",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-10-18T05:54:22.000Z"
    },
    "company": {
        "name": "Skyrocket Ventures",
        "link": "https://www.linkedin.com/company/skyrocket-ventures"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "San Francisco Bay Area",
        "region": null,
        "postal_code": "94112",
        "street_address": null,
        "latitude": 37.39271,
        "longitude": -122.042
    }
}