{
    "job": {
        "title": "Data Scientist",
        "industry": "Staffing and Recruiting",
        "description": "Title: Data Scientist Duration: 6 Months - Right to hire Location: Irving, TX 75039 , Tampa, FL 33637 Data Scientist to work on post model developmental Analytics on economic forecasting models . Criteria: 1. More of a Data Scientist 2. Masters in the quantitative field from top schools 3. SAS/R and Python (working experience in Python); SAS is preferable over R. 4.    C++ and R are not a “must-have” but an advantage In need of Business Systems Analysts who can gather and interpret business requirements, create functional specifications and designs, and perform validation and document results as needed for economic forecasting and other models The job requires the below. o Master’s degree in quantitative fields –econometrics/economics/other quantitative fields . o Knowledge of banking systems is very important and work experience with Banking Industry a Plus . o Ability to work in a fast-paced environment. o Quick learner and self-starter and willing to learn and adopt new techniques or subject matter. o Strong Analytical, communication, and writing skills. o Act as a liaison between Business and Technical groups. o Extensive experience in Data Mapping exercise which could be straight through or derived and to perform validation of what was mapped is accurate to source. o Ability to understand and deep dive into the current applications to scope out business requirements for the group. o Experience in developing Time Series Models/Value at Risk Models/other econometric models and defending analysis results with business and regulatory stakeholders and has worked as a programmer in the past. o Technical background and working knowledge of Unix, Java, SQL/SAS, SVN, Python, R, MATLAB, Autosys is a plus but this is not a programmer position. o Prior experience working with Model Risk Management SR -11 requirements or ability to quickly ramp up is a plus. o Experience with Hadoop and Big Data Analytics tools (such as Hue, Hive, Anaconda Enterprise Notebook, Jupyter Notebook) is a plus. Responsibilities: o Gather business requirements and translate into functional specs for programmers. o Might require deep dive and analysis into current applications to propose designs for the project. o Work with technical teams to come up with estimates for the effort to complete. o Research appropriate data fields in banking/credit systems, learn about various business processes, document business and regulatory rules. o Developing test scenarios and performing internal validation prior to turning over to separate QC team. o Document model approach, assumptions, results and automating/validation report creation. o Document sourcing information.",
        "employment_type": "CONTRACTOR",
        "date_posted": "2021-08-22T19:09:57.000Z"
    },
    "company": {
        "name": "Mindlance",
        "link": "https://www.linkedin.com/company/mindlance"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Irving",
        "region": "TX",
        "postal_code": "75063",
        "street_address": null,
        "latitude": 32.813877,
        "longitude": -96.949936
    }
}