{
    "job": {
        "title": "Site Reliability Engineer",
        "industry": "Information Technology and Services,Computer Software,Internet",
        "description": "Who We Are Hi, we’re SambaSafety and we offer the industry’s most comprehensive driver monitoring software. Our technology helps everyone from large corporations to small companies ensure only the safest individuals are driving on behalf of their business. These companies trust SambaSafety to keep their employees safe on the roads, helping protect their brand, greater community and bottom line. Simply put, we save lives and are on a mission to reduce crashes on American roadways 20 percent by 2025. We’ve built an inclusive, supportive, and exceptional culture where every employee is empowered in their role. Don’t take our word for it; we’ve been recognized as a Top Workplace by The Denver Post and Built In Colorado. And our employees rate SambaSafety top-notch, with a rock solid 4.7-star rating on Glassdoor. What You’ll Do Investigate and contribute to solving various issues in production environments Drive infrastructure as code adoption Deployment of software releases Proactively analyze and contribute improvements to support deployment processes Provide collaboration as a conduit between various technical and non-technical teams Work with the development teams to improve system quality Build effective monitoring, alerts, and metrics for production services Provide configuration management for production applications Participate in an on-call rotation What You’ll Need Ability to listen to team feedback and prioritize efforts within the shift or escalate to managers for suggestions. Excellent collaboration skills. Ability to think strategically and act tactically. Works with a sense of urgency in high pressure environment and demonstrates the ability to effectively respond to issues during emergency situations. Demonstrates the ability to adapt quickly to changing priorities, circumstances and direction. Professional experience with cloud environments (AWS certification preferred) Strong knowledge and experience working in Linux/Unix environment Experience with centralized logging solutions (Splunk, Elk, etc.) Knowledge of active monitoring (Datadog, Dynatrace, etc.) Understanding of security best practices Experience with CI/CD tools (Jenkins, CircleCI, etc.) Experience with a modern programming language (python, Java etc.) Experience with SQL and NoSQL databases Understanding of git Knowledge of networking principles such as firewalls, load balancing, routing and switching Knowledge of horizontal and vertical scaling best practices Benefits And Perks Unlimited Paid Time Off and Paid Volunteer Days 401k match and generous Healthcare Benefits including a fully employer paid family medical plan Wellness &Tuition Reimbursement Zoom Happy Hours Flexible Work From Home schedule & a Monthly Internet stipend Lots of Samba swag Samba Virtual Events including our famous Samba Sprint Our team of talented and committed safety professionals is exceptional. At SambaSafety we strive to foster an inclusive culture that supports, encourages and celebrates a wide array of diversity. We are committed to create a space where all employees can show up as their authentic selves every day, and we work to advance employee equality, diversity and inclusion. SambaSafety provides equal employment opportunities to all employees and applicants for employment without regard to race, color, religion, sex, national origin, age, disability, gender identity, and expression or genetics. Come join us to find out for yourself what all the excitement is about!",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-20T10:07:35.000Z"
    },
    "company": {
        "name": "SambaSafety",
        "link": "https://www.linkedin.com/company/sambasafety"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Denver",
        "region": "CO",
        "postal_code": "80247",
        "street_address": null,
        "latitude": 39.738453,
        "longitude": -104.984856
    }
}