{
    "job": {
        "title": "Computer Vision / Machine Learning Senior Engineer",
        "industry": "Consumer Electronics",
        "description": "Summary The ACVML R&D team at ARKit is looking for an Excellent CVML Engineer to work on Real Time Visual Place recognition systems. Our team provides an environment with a good balance between pragmatism and technical expertise applied to real problems. The main goal of this position is to support relocalization for inside-outside SLAM systems on multiple platforms with different HW specs. This is an exciting role where the candidate will have the opportunity to interact with interdisciplinary teams and top researchers to achieve the best quality and performance. Key Qualifications -  Excellent CV foundations. Able to resolve problems involving Multiple View Geometry -  Excellent ML foundations for vision based patter Recognition and visual perception problems -  Proven expertise on Visual Place Recognition for localization systems is a plus -  Proven expertise in developing Real Time systems -  Knowledge of DL Frameworks such Caffe, PyTorch or TensorFlow -  Experience with C / C++ / Python / -  Solid knowledge of Public Apple frameworks such CoreML, Metal is a plus Description Computer Vision, Vision for Robotics / AR. Or at least 3 years of validated expertise on similar roles / projects Education & Experience PhD or MsC in Computer Science or similar Role Number: 200242961",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-26T14:41:54.000Z"
    },
    "company": {
        "name": "Apple",
        "link": "https://www.linkedin.com/company/apple"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Cupertino",
        "region": "CA",
        "postal_code": "95014",
        "street_address": null,
        "latitude": 37.319313,
        "longitude": -122.02927
    }
}