{
    "job": {
        "title": "Sr. Data Protection Security Engineer",
        "industry": "Computer Software",
        "description": "About the Team Workday is looking for an experienced Security Engineer who has an ability to independently research and tackle technical issues and handle events. The main responsibility of the role will be to lead an enterprise Data Loss Prevention (DLP) solution - CASB, Email and Endpoint - with integrated tools and applications across an array of corporate environments. About the role Manage the enterprise Data Loss Prevention (DLP) tools environment, including but not limited to configuring policies, anomaly detection and patching. Monitor the use of DLP tools and ensure a consistent process of improvement is in place. Create and maintain platform specific documentation. Maintain DLP audit and compliance dashboards supporting continuous process improvement Diagnose and analyze technical information from multiple sources. Work with internal stakeholders, and business partners, to support the DLP technology (troubleshooting, upgrades, etc.) Collaborate with the business to identify sensitive, high value data (e.g. customer data, sensitive data, IP & source code) and ensure appropriate controls are in place to protect it. Define, implement and support process and technology improvements related to preventing unauthorized disclosure, modification, removal or destruction of information. Develop new rules and processes to enhance detection capabilities mitigating the risk of the insider threat and data loss. Analyze and aggregate data loss prevention data to support the enhancement/tuning of existing policies and determine additional controls. Investigate host, network and log-based security events. Analyze global data loss prevention data to provide metric reporting. Communicate security, data protection, data loss prevention related concepts to a broad range of technical and non-technical staff at multi-organizational levels. About you Bachelor's degree, or higher, in computer science or a related discipline. Minimum 5 years’ experience working in a Security Operations, or related, role. Data Loss Prevention and/or Cloud Access Security Broker (CASB) implementation and/or management experience desirable. Experience deploying data protection solutions in the cloud, and on-premise. Proven background in security engineering, data protection, data lifecycle management, data loss prevention, or experience supporting these security-related solutions. Proven experience with creating regular expressions, encoding and encryption. Experience with RESTful APIs and automation. Experience identifying threats (IoCs and TTPs), vulnerabilities, and exploitations. Knowledge of cryptographic implementations at media, file, and application levels. Coding/Scripting experience (e.g. Python) Strong problem solving with demonstrated proactive correction capabilities Comprehensive understanding of industry leading Data Loss Prevention technologies Self-starter with an ability to navigate and collaborate effectively within a geographically complex and dispersed global corporation Ability to work independently, manage work to ensure quality, on-time delivery. Experience in data analysis anomaly detection (e.g. UEBA) preferred Experience and/or certification in cyber forensics desirable. CISSP, CISA, CEH, OSCP, GIAC, GSEC or other industry recognized security certification(s) preferred, but not essential. Additional Job Description At Workday, we believe every potential recruit brings value to the table. Believe you are missing some of the skills and are hesitant to apply? We do not believe in the ‘perfect’ candidate and are happy to teach. So however you identify and whatever background you bring with you, apply and see what we are all about!",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-30T23:53:48.000Z"
    },
    "company": {
        "name": "Workday",
        "link": "https://www.linkedin.com/company/workday"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "McLean",
        "region": "VA",
        "postal_code": "22101",
        "street_address": null,
        "latitude": 38.93759,
        "longitude": -77.18378
    }
}