{
    "job": {
        "title": "Staff Backend Software Engineer",
        "industry": "Information Technology and Services,Financial Services,Hospital &amp; Health Care",
        "description": "Role: Java Back End Developer Location: 100% Remote Duration: 6 Months Summary We are building a new and high-visibility self-service API experience that will bring innovations to new and existing customers. Are you excited to shape a new era for client and be at the forefront of technology hitting developers' hands? We're looking for people to help us forge a new direction for our products & technology. This is a technical contributor and developer role which requires knowledge of web architecture, backend systems development, API design and billing systems. You will build new functionality, increase scale, and deliver quality work against technical and schedule challenges in an agile environment while following strong software design and process principles to meet our customer demands. You will be working with talented engineers on cutting-edge technologies while continually growing your skills as an engineer. We are looking for someone who can work well in a startup within an organization and can bring flexibility, speed, and quality to our team. You should have a solid background in the fundamentals of software development as well as a deep understanding of best practices in various languages and technologies. Additionally, you should be passionate about and take great personal pride in building cool interfaces for other developers to use. If you are an expert at designing, developing, and deploying web services, and like to be challenged, this is the perfect opportunity for you. Key requirements B.Sc. or equivalent in Computer Science, Software Engineering or comparable field. 3+ years' professional experience designing, developing & deploying commercial, scalable, and secure web services. Proficiency in Java language Proficiency in web development framework Spring / SpringBoot. Proficiency in writing SQL queries and working with large relational databases. Understanding of CI/CD and web applications deployment considerations. Experience with coding complex billing and financial systems. Experience with REST API design & development. Experience with refactoring and scaling existing systems. High level written and verbal communication in both general and technology-specific applications. Thank you, Ashish Yadav Global HQ Address - 7250 Dallas Pkwy, Suite 825 Plano, Texas 75024 Office: (201) 340-8700 x 513 | Cell: (408) 933-3377 | Fax: (201) 221-8131 | Email: ashish.yadav@net2source.com Web: www.net2source.com | Social: Facebook | Twitter | LinkedIn",
        "employment_type": "CONTRACTOR",
        "date_posted": "2021-08-20T22:39:02.000Z"
    },
    "company": {
        "name": "Net2Source Inc.",
        "link": "https://www.linkedin.com/company/net2sourceinc"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "San Francisco",
        "region": "CA",
        "postal_code": "94103",
        "street_address": null,
        "latitude": 37.77314,
        "longitude": -122.41323
    }
}