{
    "job": {
        "title": "Data Scientist",
        "industry": "",
        "description": "Data Scientist tl;dr: An innovative seed-stage startup in the DevSecOps space is looking for a Data Scientist to join our team and help design and build NLP and anomaly detection models and algorithms using bleeding edge technology. Our tech-stack and R&D culture As this is a greenfield application, we do not have all the details ironed out, you will help us do that. However, we’ll probably be using some of these: ● Databricks / Apache Spark / Presto / Hive / Athena for data wrangling ● PyTorch / TensorFlow / Keras / Scikit-learn for ML/DL ● AWS as a cloud provider ● Python and Jupyter notebooks well, for everything We will be putting a high emphasis on: ●      Honing your skills ●      Non-blocking automatic MLOps CI/CD pipeline ●      Letting data scientists research and not distract them with endless unneeded meetings ●      Involvement and impact on the decision making process and roadmap of a new product ●      Open-source use and contribution One of the challenges of data scientists is getting data, you’ll have all the data you need, and then some. What do we expect you to bring to the table? We believe that for every highly functioning relationship, there must be a good synergy between the partners and that it must be a win-win situation for all. Our key requirements are: ●      Enjoy your work and working with your team and be proud of it ●      Assume best intentions – we know we will! ●      Drive to build something amazing ●      Be excited about data and coding ●      Have strong opinions, but hold them loosely What will you be doing? As a seed-stage team member, you will be working on a greenfield application and ML models. You will be an integral part of the design and architecture decision process, working directly with the other team members and leadership (we have a very flat structure). In this role you will have a huge impact on the success of the company. Minimum Qualifications - At least 4 years of experience as a Data Scientist / Researcher / ML Engineer - Hands-on experience building ML/DL models - Master's degree or equivalent in a STEM field Preferred Qualifications - MLOps and data engineering experience - Familiarity with the DevOps ecosysetm - Experience with NLP, anomaliy detetion - PhD in a STEM field",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-16T18:09:35.000Z"
    },
    "company": {
        "name": "Stealth Startup",
        "link": "https://www.linkedin.com/company/stealth-startup-51"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 48,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Atlanta Metropolitan Area",
        "region": null,
        "postal_code": "30317",
        "street_address": null,
        "latitude": 33.74975,
        "longitude": -84.38857
    }
}