{
    "job": {
        "title": "Senior Software Engineer (C#)",
        "industry": "Capital Markets,Financial Services",
        "description": "Doran Jones is looking for a Senior Software Engineer with a passion for solving business problems with technology and creating high-quality software, and that is eager to learn about the intersection of finance and technology. Responsibilities Work closely with portfolio management, trading, compliance, and technology teams to deliver cutting-edge innovative software solutions Collaborate in a fast-paced team environment to understand, engineer, and deliver on business requirements Strike a balance along the dimensions of feasibility, stability, scalability, and time-to-market while delivering solutions Qualifications: 8+ years of professional software development experience Deep expertise in an object-oriented programming language such C# Knowledge of SQL and experience writing production queries against one or more SQL DBMS Experience with CSS, AWS, MSSQL, NoSQL, is a plus Experience with gRPC is a plus Experience programming in python is a plus Familiarity with FX, Futures, Bonds/Repos, Options and Swaps Experience working with any OMS/EMS platform Excellent verbal and written communication skills Experience working in an Agile environment Experience with basic DevOps techniques, including CI/CD and infrastructure-as-code, is a plus Degree in Computer Science or closely related field Doran Jones Inc. (DJI) is the leading financial services Data Engineering and Application Development firm, specializing in Capital Markets, Risk, and Regulatory Compliance. We are US-based, helping our clients fill gaps in capacity and expertise, reduce risk, and accelerate change. Our leaders average over 25 years of experience in Financial Services and Technology. DJI is repeatedly engaged by the largest and most complex clients for our Agile transformation expertise and practical understanding of the critical relationship between data, architecture, and application development. DJI has a mission to place more people from non-traditional backgrounds into sustainable technology careers. Through partnerships with non-profit technology programs in underserved communities and Veteran organizations, candidates transition from tech training programs into real IT careers at DJI. Our unique recruitment policy allows us to create exceptional teams, bringing a broad spectrum of experience to our company and creating anything but a traditional consulting firm. DJI is a wholly-owned subsidiary of McLaren Strategic Ventures, a private equity firm, that invests in start-ups and scale-ups. They provide a full range of highly trusted domain consulting, advisory services, and innovative technologies globally. Doran Jones is able to offer a broad range of technology, deeper AI and machine learning tools, data intelligence, alternative resourcing capabilities, and capital access to invest and digitize at scale. Our clients benefit from this unique portfolio allowing them to accelerate the pace of their own digital transformations through innovative products and services designed around industry-wide issues. Visit www.doranjones.com to learn more!",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-10-05T17:44:51.000Z"
    },
    "company": {
        "name": "Doran Jones Inc.",
        "link": "https://www.linkedin.com/company/doranjonesinc"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 96,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "New York",
        "region": "NY",
        "postal_code": "10022",
        "street_address": null,
        "latitude": 40.758892,
        "longitude": -73.96851
    }
}