{
    "job": {
        "title": "Data Engineer ",
        "industry": "",
        "description": "Hi, Hope you are doing well, Our client is hiring for Data Engineer candidate for Seattle, WA or Burbank/Glendale/Anaheim, CA (Remote Start) location . Please review the below job description and share your updated resume, if you are available and interested in a long term contract role. Position:       Data Engineer Location:      Seattle, WA or Burbank/Glendale/Anaheim CA (Remote Start) Duration:      05+ months of contract to Hire Job Description: Minimum Qualifications • Expertise with SQL, data analysis, and reporting. • Strong ability to organize, analyze, and disseminate information. • Experience driving and completing projects through technical leadership in a complex, matrixed organization. • Experience translating business needs into technical system requirements. • Proactively identify and solve data issues with attention to detail. • Experience working with multiple disparate, complex, large datasets. • Eagerness to adapt and learn. • Cloud data technologies Preferred Qualifications • Experience writing software in Python. • Experience with PYSPARK, Pandas or equivalent data platform. • Proven experience in keeping up with emerging technologies. • Knowledge and familiarity with data visualization and presentation tools and strategies. • Understanding of data sovereignty and data localization and how they impact implementation for data processing, aggregation, analysis and presentation. • Azure • Databricks Thanks, Ankit Bhardwaj Lead Recruiter apolis Direct (310) 929 2354 Cell (847) 469-3602 www.apolisrises.com linkedin.com/in/ankit-bhardwaj-463b7454",
        "employment_type": "CONTRACTOR",
        "date_posted": "2021-07-02T15:14:42.000Z"
    },
    "company": {
        "name": "Apolis",
        "link": "https://www.linkedin.com/company/apolisrises"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 72,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Seattle",
        "region": "WA",
        "postal_code": "98133",
        "street_address": null,
        "latitude": 47.60323,
        "longitude": -122.33028
    }
}