{
    "job": {
        "title": "Senior Software Engineer (Remote Eligible)",
        "industry": "Health, Wellness and Fitness",
        "description": "Description: Relatient is a leading provider of integrated messaging solutions for practices, hospitals and health care systems. We take a patient-centered approach to engagement, utilizing the power of real-time clinical data to deliver timely messages between patients and their care providers. Ranked as Klas Category Leader in Patient Outreach, named one of Deloitte's 2018 & 2019 Technology Fast 500 and a 2019 Red Herring Top 100 winner, Relatient is changing the way healthcare providers engage with their patients. We are looking for a talented Senior Software Engineer to join our dynamic team in building platform solutions that integrate with Enterprise Health Care systems. We expect an engineer who will work hard, keep up in a fast-paced start up environment, and have fun! If you are looking to be challenged daily, make a huge impact and help define the future of patient engagement, we would love to have you join our team! The Ideal Candidate Is a problem solver Possess excellent design and coding skills and a zeal for building applications using open source frameworks for cloud native technologies. Is responsible for all aspects of SDLC of existing and new components Is comfortable building UIs using modern frameworks (Angular 4+ with Typescript, React, Vue.js), CSS/SCSS and HTML, backend microservices with Node.js or PHP, and relational and NoSQL databases (MySQL, PostgreSQL, DynamoDB, MongoDB) with full ownership of shipping user-facing enterprise products Is focused on the customer and the details that make their experience exceptional Encourages innovation, implementation of cutting-edge technologies, outside-of-the-box thinking, teamwork, and self-organization Collaborates with and across Agile teams to design, develop, test, implement, and support technical solutions in a full-stack development tools and technologies Possess a strong sense of engineering quality and takes pride in the code they're responsible for while defining best practices as our teams abide by a You Build It, You Own It attitude Responsibilities Build resilient, secure, and scalable UI/UX, APIs, and Microservices using latest technologies Perform engineering activities for performance tuning and deep monitoring of applications and services Work with business partners, architects, and other groups to identify technical and functional needs of the system, determine the priority of work, and ensure integrated end-to-end design and delivery Leverage DevOps practices for Continuous Integration and Continuous Deployment Occasional travel up to 10% is required . Requirements: Bachelor's Degree or relevant work experience 5+ years of experience in a software engineering role 3+ years of experience with HTML/CSS 3+ years of experience developing RESTful APIs 3+ years of experience using Angular 2+ 3+ years of experience with relational databases (MySQL, PostgreSQL, etc.) 2+ years of experience working in an Agile development environment 2+ years of experience in Application Development using Node.js, JavaScript or TypeScript Previous experience with testing frameworks and Quality Assurance technologies: ATDD, Selenium, Webdriver.io, Jasmine, Karma, Mocha, Chai, Sinon, PHPUnit, Postman Previous experience with GitLab, Nexus, and Dockerhub Previous experience in one of the following Cloud technologies: AWS, Docker, Terraform Previous experience with container orchestration frameworks: Kubernetes, Docker Swarm, or Amazon ECS/EKS is a plus Previous experience with PHP or porting PHP to Node.js is a plus About Relatient Founded in 2014, our offices are located in historic Franklin and Cookeville, TN and include a casual, dynamic work environment with a spirit of innovation and growth. Our team consists of smart, driven, and creative people who are motivated to impact the way in which healthcare providers engage with their patients. Our platform takes a patient-centered approach to engagement, utilizing the power of real-time clinical data to deliver timely messages between patients and their care providers. Our platform effortlessly automates appointment reminders, patient billing and payment collection, satisfaction surveys, self-check-in, non-medical transportation and on demand messaging. What We Offer Base salary plus incentives Medical, dental, and vision insurance Employer HSA match contribution Employer paid Life Insurance 100% employer paid long-term disability insurance 401k10Generous PTO policy which includes 3 weeks paid time off plus all 10 paid holidays Perks such as an annual employee awards banquet, holiday parties, monthly lunches, bottomless snacks and coffee Casual culture with approachable leadership Great office environments located in historic Franklin, TN and beautiful Cookeville, TN. Learn more about our company at www.relatient.net Relatient is an equal employment opportunity employer.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-10-18T06:04:27.000Z"
    },
    "company": {
        "name": "Relatient",
        "link": "https://www.linkedin.com/company/relatient"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Franklin",
        "region": "TN",
        "postal_code": "37064",
        "street_address": null,
        "latitude": 35.923653,
        "longitude": -86.86783
    }
}