{
    "job": {
        "title": "Software Engineer ",
        "industry": "Computer Software,Design",
        "description": "Software Engineer As a Software Engineer, you’ll help develop the next generation platform that will support all our products. You’ll share your skills, innovation, and experience with a team of talented engineers, guiding the way on software design and best practices and helping to solve some of our most challenging technical problems. You’ll find yourself able to stretch and grow in almost any direction you choose, while building a data analytics experience that will delight users and directly impact the bottom line. Along the way, you’ll be working with friendly people who are as passionate about software as you are. If the following sounds like you, we want to talk: You’re a great programmer, highly skilled in frontend and backend development using technologies like React and NodeJS You know TypeScript or another strongly typed language You’re passionate about clean code. You understand that the code you write today will need to be read by developers in the future. You can roll up your sleeves supporting the development of deployment pipelines using tools like Kubernetes, Docker & Gitlab CI/CD You are a coach and mentor to other developers, a thought leader in code reviews and software design. You’re passionate about building great experiences that delight customers and are self-motivated to get it done. You believe in automated testing – if it doesn’t have tests, it isn’t done. You believe in taking ownership of what you build – if it breaks, you fix it. You’re a great collaborator, and a lifelong learner. Required Skills: 3+ years of experience as a professional software engineer Automated testing experience using React Testing Library, Jest or similar Experience developing RESTful APIs Demonstrated ability to translate business requirements into technical solutions. Excellent written and verbal communication as well as listening skills. Excellent problem-solving skills. Demonstrated ability to write clean code and higher-level software design patterns Ability to learn quickly and work independently with minimal direction and guidance. Ability to quickly identify and acquire information necessary for solving problems. Valued Skills: Cloud container experience with Docker and Kubernetes Comfort working in a distributed, collaborative, agile environment Experience working with deployment technologies such as Gitlab CI, ArgoCD, AWS or similar Benefits: 100% company-paid medical, dental and vision Health plans that cover your family and pets Company matched 401k Employee Stock Purchase Plan (ESPP) Paid time off: 3 weeks-vacation, 6 sick days, 11 holidays, 3 floating holidays, 2 wellbeing days and 20 hours of volunteer time. 100% paid parental leave 100% paid fertility care, fertility preservation, in vitro fertilization, surrogacy, adoption and more. Tuition Reimbursement Wellness programs with up to $300 fitness reimbursement annually",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-10-17T22:50:24.000Z"
    },
    "company": {
        "name": "Interactive Resources - iR",
        "link": "https://www.linkedin.com/company/interactive-resources---ir"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Salt Lake City",
        "region": "UT",
        "postal_code": "84101",
        "street_address": null,
        "latitude": 40.758476,
        "longitude": -111.888145
    }
}