{
    "job": {
        "title": "Software Applications Engineer",
        "industry": "Electrical/Electronic Manufacturing,Information Technology and Services,Computer Software",
        "description": "Company Overview KLA is a global leader in diversified electronics for the semiconductor manufacturing ecosystem. Virtually every electronic device in the world is produced using our technologies. No laptop, smartphone, wearable device, voice-controlled gadget, flexible screen, VR device or smart car would have made it into your hands without us. KLA invents systems and solutions for the manufacturing of wafers and reticles, integrated circuits, packaging, printed circuit boards and flat panel displays. The innovative ideas and devices that are advancing humanity all begin with inspiration, research and development. KLA focuses more than average on innovation and in 2019 we invested 15% of sales back into R&D. Our expert teams of physicists, engineers, data scientists and problem-solvers work together with the world’s leading technology providers to accelerate the delivery of tomorrow’s electronic devices. Life here is exciting and our teams thrive on tackling really hard problems. There is never a dull moment with us. Group/Division Enabling the movement toward advanced chip design, KLA's Measurement, Analytics and Control group (MACH) is looking for the best and brightest research scientists, software engineers, application development engineers and senior product technology process engineers to join our team. The MACH team's mission is to collaborate with our customers to innovate technologies and solutions that detect and control highly complex process variations—at their source—rather than compensate for them at later stages of the manufacturing process. With over 40 years of semiconductor process control experience, chipmakers around the globe rely on KLA to ensure that their fabs ramp next-generation devices to volume production quickly and cost-effectively. Our MACH team develops leading-edge solutions for patterning process analytics and control technologies, thereby providing customers with critical insight at the feature level, field level and cross-wafer analysis. Our teams also develop advanced modeling simulation, data analytics and process control modeling technologies. As a member of the MACH team, you’ll be joining the most sophisticated and successful process-control company in the semiconductor industry--working across functions to solve the most complex technical problems in the digital age. Installation/upgrade/technical support of Klarity ACE product Project management for beta and product adoption at customer site Support HQ and local Business Unit to achieve their business goals Minimum Qualifications Responsibilities Provide highly visible customer support through the performance of on-site installation/upgrades, as well as overseeing any necessary diagnoses, troubleshooting, service, and integration of customer in-house software or MES. Instruct customers in the operation and maintenance of the system. Serve as company liaison with customer on administrative and technical matters for assigned projects. Interpret customers’ needs and clarifies if the responsibility for problem resolution falls to sales personnel, product marketing, or engineering to improve the qualities and features. Maintain a dedication to high quality and high customer satisfaction. Requires good communication skills with internal/external customers, computer operation & diagnostics understanding. Need to have process orientation and have a broad software system understanding. Position requires domestic and international travel to support customers worldwide Write custom translators that takes data in one format and puts into a several standard formats Qualifications Major in Computer Science/Management Information System or related Oracle administration and PL/SQL Linux administration Programing ability in one or more of the following languages C#/C/C++/Python Experience installing and maintaining an enterprise application Good software documentation skills are required. Good problem solving skills are required. Domain knowledge of semiconductor manufacturing Experience in Semiconductor space Experience with Klarity Defect or Klarity ACE is a plus Programing experience and Unix/Linux shell scripting Understanding of UNIX/Linux Understanding of relational databases Understanding of software development and architecture is desirable 30% Domestic or up to 20% International travel required We offer a competitive, family friendly total rewards package. We design our programs to reflect our commitment to an inclusive environment, while ensuring we provide benefits that meet the diverse needs of our employees. KLA is proud to be an Equal Opportunity Employer. We do not discriminate on the basis of race, religion, color, national origin, sex, gender identity, gender expression, sexual orientation, age, marital status, veteran status, disability status or any other status protected by applicable law. We will ensure that qualified individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, to perform essential job functions, and to receive other benefits and privileges of employment. Please contact us at talent.acquisition@kla.com to request accommodation.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-27T05:12:37.000Z"
    },
    "company": {
        "name": "KLA",
        "link": "https://www.linkedin.com/company/klacorp"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Portland",
        "region": "ME",
        "postal_code": "04104",
        "street_address": null,
        "latitude": 43.659218,
        "longitude": -70.256516
    }
}