{
    "job": {
        "title": "Sr. Software Engineer-Product Development",
        "industry": "Financial Services",
        "description": "If you are a Sr. Software Engineer-Product Development with experience, please read on! We are an exciting company in the FinTech space, providing innovative sales and regulatory automation solutions to financial and insurance industries. Our product suite offers our customers accurate tools to automate and accelerate the sales process for agents, advisors, and their customers. We are restructuring the way insurance, retirement, and investment products are marketed, sold, bought, delivered, and managed. Our mission is to make the complex simple and be the leading industry partner our customers can count on. What You Will Be Doing You will be in charge of designing, writing, unit testing, and commenting code. You will be ensure that any and all submitted modules compile, are 100% bug-free, and are in adherence to the highest quality. Your role will be integral during the build/release processes, including; but not limited to code integration coordination, check-in, build and all installation processes. What You Need for this Position ASP.NET MVC REACT .NET 5 Microservices .net core 3.1 What's In It for You Fully covered Health Benefits 401k PTO Flexible Work Schedule Dynamic Culture So, if you are a St. Software Engineer-Product Development with experience, please apply today! Email Your Resume In Word To Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also: Justine.Jolley@CyberCoders.com Please do NOT change the email subject line in any way. You must keep the JobID: linkedin : JJ9-1637995 -- in the email subject line for your application to be considered.*** Justine Jolley - Executive Recruiter - CyberCoders Applicants must be authorized to work in the U.S. CyberCoders, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-25T17:33:00.000Z"
    },
    "company": {
        "name": "CyberCoders",
        "link": "https://www.linkedin.com/company/cybercoders"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Colorado Springs",
        "region": "CO",
        "postal_code": "80908",
        "street_address": null,
        "latitude": 38.835224,
        "longitude": -104.8198
    }
}