{
    "job": {
        "title": "Software Engineer, Android",
        "industry": "Marketing and Advertising,Computer Software,Internet",
        "description": "HOMER has a newly created opportunity for an Engineer III, Android to join our growing team! This role can be remote based in select US locations (AL, CA, CT, FL, GA, ID, MA, MD, MI, MO, NC, NE, NY, OR, PA, TN, TX, WA, WY) . HOMER, a BEGiN brand, is the proven early learning program that provides the best educational start possible. We offer personalized, fun, and proven learning products for kids ages 2-8 to help build confidence, mastery, and a love of learning. We are deeply committed to our members and to their children, and we are building a creative and strategic team to develop a portfolio of early learning products that support learning everywhere. Reporting to an Engineering Manager , the Engineer III, Android will expand our technology stack to include native Android applications. This role will be responsible for creating reliable, scalable, and high-performance mobile apps for Android based systems, contributing to software architecture and driving best practices that enable a quality product. You will: Make direct technical contributions (writing, debugging, reviewing and deploying code). Own a small feature from technical design through completion, including implementation, testing, rollout, addressing bugs, and communicating status throughout the process. Contribute to technical design of applications and participate in larger system design efforts. Build automated tests and help maintain existing testsuites. You Have: Demonstrable expertise designing and building native Android applications and shared frameworks (SDKs). Proficiency in Kotlin or Java and knowledge of the Android SDK and Android ecosystem. Experience consuming data from web services. Experience shipping one or more Android apps, ideally currently available in the Google Play Store. Sound Computer Science fundamentals (Bachelor's degree in CS or related field preferred). Strong interpersonal and communication skills. At least 2-3 years of relevant work experience. We like people who: Collaborate effectively with stakeholders and other distributed team members (product managers, UI/UX designers, engineers, animators, illustrators, data scientists and others) to define and refine requirements and then execute on them. Are interested in innovations within the mobile industry. Are passionate about and thrive in a culture of learning and teaching. You love challenging yourself to constantly improve, and sharing your knowledge to empower others. Care about solving big, systemic problems. You look beyond the surface to understand root causes so that you can build a complete and long-term solution for the whole ecosystem. Want to be part of an organization with a transparent and agile environment where you can communicate freely and openly. What you'll get: HOMER offers competitive compensation including equity and full benefits. Smart, passionate, and engaged co-workers. Excellent top-tier Medical/Dental/Vision benefits. The chance to have a big impact, quickly. Help bring a love of reading and learning to children globally! HOMER is a proud equal opportunity employer. All qualified applicants will be considered without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. At HOMER, we are committed to building a diverse team of talented people who are passionate about creating educational content kids love. We believe in fostering a culture where productivity can flourish, one that is empathetic, respectful, and inclusive. At HOMER, we know that diversity, equity, and inclusion aren't just an idea, a one-time initiative, or phrases to throw into a job post: they're a daily practice and an ongoing conversation. We survey our team about inclusivity, run trainings on DEI topics, and have a committee to ensure we are all continuing to learn and grow.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-30T05:10:44.000Z"
    },
    "company": {
        "name": "HOMER",
        "link": "https://www.linkedin.com/company/homerlearning-inc-"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "New York",
        "region": "NY",
        "postal_code": "10132",
        "street_address": null,
        "latitude": 40.713047,
        "longitude": -74.00723
    }
}