{
    "job": {
        "title": "Site Reliability Engineer",
        "industry": "Computer Software,Information Technology and Services,Marketing and Advertising",
        "description": "Company Description Epsilon is the leader in outcome-based marketing. We enable marketing that’s built on proof, not promises. Through Epsilon PeopleCloud, the marketing platform for personalizing consumer journeys with performance transparency, Epsilon helps marketers anticipate, activate and prove measurable business outcomes. Powered by CORE ID®, the most accurate and stable identity management platform representing 200+ million people, Epsilon’s award-winning data and technology is rooted in privacy by design and underpinned by powerful AI. With more than 50 years of experience in personalization and performance working with the world’s top brands, agencies and publishers, Epsilon is a trusted partner leading CRM, digital media, loyalty and email programs. Positioned at the core of Publicis Groupe, Epsilon is a global company with over 8,000 employees in over 40 offices around the world. For more information, visit epsilon.com. Follow us on Twitter at @EpsilonMktg. Job Description As a Site Reliability Engineer, you’d proactively monitor and improve end-to-end system performance, identifying deficiencies and potential failures throughout our infrastructure. You will build deep, end-to-end knowledge of the complexity of our platform and continuously create improvements and automation to enhance durability, performance, and maintainability of the platform. You are central to the automation of everything at Epsilon. Responsibilities Using Full Stack methodologies, develop and maintain scalable alerting, ticketing, and logging tools for debugging and monitoring Proactively monitor events, investigate issues, analyze solutions, and drive problems through to resolution using a wide variety of Ops tools and monitoring platforms to gain knowledge, understanding, and enable persistent monitoring of system availability, performance, and capacity Maintain our monitoring systems and develop new metrics/monitoring dashboards as additional coverage events become necessary Provide support to maintain a high availability environment Qualifications Bachelor’s degree in Computer Science or related field Experience with Python, JavaScript, React, Java Good understanding of Linux, Bash and shell scripting Knowledge of and experience with network stack, protocols, network management and monitoring tools Experience with automation tools Puppet, Chef, Docker, Jenkins and/or Ansible Knowledge of Docker for container orchestration Experience with SQL Ability to work collaboratively in a fast-paced environment Experience working with Agile methodologies, preferably SCRUM. Excited by Big Data technologies and interested in integrating statistics and analytics to make our systems perform even better Additional Information Great People, Deserve Great Benefits We know that we have some of the brightest and most talented associates in the world, and we believe in rewarding them accordingly. If you work here, expect competitive pay, comprehensive health coverage, and endless opportunities to advance your career. Epsilon is an Equal Opportunity Employer. Epsilon’s policy is not to discriminate against any applicant or employee based on actual or perceived race, age, sex or gender (including pregnancy), marital status, national origin, ancestry, citizenship status, mental or physical disability, religion, creed, color, sexual orientation, gender identity or expression (including transgender status), veteran status, genetic information, or any other characteristic protected by applicable federal, state or local law. Epsilon also prohibits harassment of applicants and employees based on any of these protected categories. Epsilon will provide accommodations to applicants needing accommodations to complete the application process.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-18T18:19:25.000Z"
    },
    "company": {
        "name": "Epsilon",
        "link": "https://www.linkedin.com/company/epsilon"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Chicago",
        "region": "IL",
        "postal_code": "60654",
        "street_address": null,
        "latitude": 41.88323,
        "longitude": -87.6324
    }
}