{
    "job": {
        "title": "Software Development Engineer",
        "industry": "Computer Software,Information Technology and Services,Internet",
        "description": "Description We believe that Amazon Music on Alexa the best voice-enabled music experience in the world. Its Day 1 in the world of voice-enabled devices and we're looking for great engineers to help us make it even better. As a member of the Amazon Music on Alexa Team, you will be responsible for leading the effort to invent and improve the ways that customers can ask for what they want to hear in Amazon Music Unlimited, Prime Music or Ad-supported Free Tier. Our team works at the intersections of big data, music personalization, machine learning, and building highly-available run-time services. The ideal candidate is interested in being part of an agile team, passionate about innovating for customers, and has a demonstrable track record of success in delivering new features and products. A commitment to team work, hustle, and strong communication skills (to both business and technical partners) are absolute requirements. We will be building reliable, scalable, and high performance products that require sound CS fundamentals of Computer Science and practical engineering experience. You should be a person that pays close attention to details and is driven to deliver solutions that delight customers. We develop software in Java, Python, Ruby, Spark, and various AWS technologies. Basic Qualifications 2+ years of non-internship professional software development experience Programming experience with at least one modern language such as Java, C++, or C# including object-oriented design 1+ years of experience contributing to the architecture and design (architecture, design patterns, reliability and scaling) of new and current systems. Bachelor's degree in Computer Science or related field Software design experience Experience in at least one modern programming language 1+ years of industry experience as a software development engineer Preferred Qualifications Problem solving skills and passion for big data technologies and tools. Eager to learn and learn fast, enjoy a fast paced environment Self-directed, demonstrate leadership potential and a team player Driven to provide the best customer experience via technology Proven ability to work effectively in a cross-functional team Experience with scalable distributed systems and service oriented architectures Excellent written and oral communication skills Ability to drive innovation Amazon is committed to a diverse and inclusive workplace. Amazon is an equal opportunity employer and does not discriminate on the basis of race, national origin, gender, gender identity, sexual orientation, protected veteran status, disability, age, or other legally protected status. For individuals with disabilities who would like to request an accommodation, please visit https://www.amazon.jobs/en/disability/us. Company - Amazon.com Services LLC Job ID: A1605052",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-14T17:03:30.000Z"
    },
    "company": {
        "name": "Amazon",
        "link": "https://www.linkedin.com/company/amazon"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Seattle",
        "region": "WA",
        "postal_code": "98133",
        "street_address": null,
        "latitude": 47.60323,
        "longitude": -122.33028
    }
}