{
    "job": {
        "title": "Embedded Software Engineer",
        "industry": "Consumer Electronics",
        "description": "Principal Duties and Responsibilities As an embedded software engineer, you will write software enabling our next-generation of cloud-connected, IoT wireless audio ecosystem of products. You will work closely with other functional teams to support our currently deployed products, help bring new products to market, and work on our next generation platforms. The ideal candidate has strong C++ experience in an embedded Linux environment and thrives working in a fast-paced, extremely collaborative agile team. Responsibilities include: •             Contribute to an enthusiastic and talented team of Software Engineers to bring new products and compelling experiences to the market •             Take a leadership role in supporting, improving, and enhancing a very large and complex software ecosystem •             Work closely with other engineering disciplines to resolve difficult technical issues with deployed software and with software in development •             Build platforms by architecting reusable building blocks enabling faster and more efficient product creation •             Take part in full stack software development which includes embedded, mobile apps, cloud, and everything in between •             Work with QA on developing testing processes, frameworks, and automation strategies •             Focus on innovating new and better ways to create solutions that add value and amaze the end user, with a penchant for simple elegant design in every aspect from data structures to code to systems architecture •             Stay up to date on relevant technologies, plug into user groups, understand trends and opportunities to ensure we are using the best techniques and tools Qualifications: •             B.S. in Computer Science or equivalent; advanced degree a plus •             Excellent object oriented design (OOD) and object oriented programming (OOP) using C++ •             7+ years experience using C++ with at least one embedded operating system (Linux-preferred) •             Experience with Bluetooth, WiFi or other similar wireless protocols •             Excellent interpersonal, communication, collaboration, and presentation skills •             Strong sense of ownership, passionate, fast learner, detail-oriented, analytical mindset, perfection seeker •             Strong experience with one scripting language like Python, Perl or Shell Highly Desirable: •             Embedded firmware programming in C •             Writing/modifying device drivers and boot loaders on embedded systems •             Experience working with common peripherals such as USB, I2C, I2S or SPI",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-10-05T17:19:33.000Z"
    },
    "company": {
        "name": "Bose Corporation",
        "link": "https://www.linkedin.com/company/bose-corporation"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 84,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Framingham",
        "region": "MA",
        "postal_code": "01703",
        "street_address": null,
        "latitude": 42.28156,
        "longitude": -71.41882
    }
}