{
    "job": {
        "title": "Lead Azure/Python Engineer (Remote)",
        "industry": "Information Technology and Services,Computer Software,Financial Services",
        "description": "100% Remote Full Time Direct Hire Job Title: Lead Software Engineer Salary: $150k - $160k Job Location: 100% Remote Requirements: 8+ years of software development with a good background using Azure and ideally Python + Leadership experience is highly desired We are a 200 person extremely well funded software company in the agricultural solutions space. We are focused on unlocking the global genetic potential of plants to enhance the sustainability of food, feed, fiber and fuel production. We and our partners harness natural and novel genetic variation through breeding, trait development, etc. to develop products that accelerate crop improvement. We have been ranked in the Inc. 5000 as one of the fastest growing companies for the past several years. We are currently in a major growth phase and hiring a Lead software engineer to help us scale. This position will have split responsibilities between Leadership and hands-on work. We are seeking someone with a heavy Azure background and ideally Python experience. Top Reasons to Work with Us Work Remote Competitive salary ($150k - $160k) 401k match Stable / Fast Growing / Exciting company Full Benefits (health, dental, vision, etc.) What You Need for this Position 8+ years of software engineering experience Heavy Azure experience (Azure DevOps, Azure Functions, Azure API Gateway) Python Leadership experience is highly desired JavaScript/Angular is a plus Cloud Native products BS in CS (or related) is preferred but not required So, if you are a Lead Azure/Python Engineer with experience, please apply today! Email Your Resume In Word To Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also: Danny.Herries@Optello.com Please do NOT change the email subject line in any way. You must keep the JobID: linkedin : DH1-1634370 -- in the email subject line for your application to be considered.*** Danny Herries - Lead Recruiter - Optello Applicants must be authorized to work in the U.S. Optello is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire. Optello will consider for Employment in the City of Los Angeles qualified Applicants with Criminal Histories in a manner consistent with the requirements of the Los Angeles Fair Chance Initiative for Hiring (Ban the Box) Ordinance.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-31T07:09:47.000Z"
    },
    "company": {
        "name": "Optello",
        "link": "https://www.linkedin.com/company/optello-us"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 96,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Austin",
        "region": "TX",
        "postal_code": "78746",
        "street_address": null,
        "latitude": 30.264978,
        "longitude": -97.7466
    }
}