{
    "job": {
        "title": "Site Reliability Engineer",
        "industry": "Information Technology and Services,Computer Software,Staffing and Recruiting",
        "description": "Essential Duties And Responsibilities Deploy and maintain infrastructure in both AWS and DataCenter. Generate documentation and clear communication on projects from development to delivery. Be responsible for AWS, DataCenter, Windows and Linux systems up time and performance. Manage and maintain: Kubernetes, Docker, Chef, JFrog Artifactory. Work closely with software engineers and tech leadership to drive projects. Build and run production environments in AWS using Infrastructure as code methods. Orchestrate environment development using Kubernetes, Terraform and/or Cloud Formation. Build & Deploy CI pipeline automation to a combination of Kubernetes/Docker and VM based systems in both VMWare and AWS. Work closely with System Architects, Engineers, Product Managers and System Administrators to meet their environment setup and service automation needs. System monitoring & analytics. Required Experience Bachelor’s degree Experience in system build configuration automation 3+ years of experience in Linux. 2+ years of experience building and maintaining a SaaS platform 2+ years working experience with AWS: VPC, EC2, RDS, Cloudformation. Preferred Experience using Terraform Must be passionate about automation. Experience with task management and tracking. Professional experience in software engineering and development. Scripting skills in one of Ruby/Bash/Python. Build and release automation tools: Jenkins, GIT, Docker. Production system integration, log collection and analysis, build and performance monitoring/tuning. Design and implement availability, security and performance monitoring.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-26T05:52:02.000Z"
    },
    "company": {
        "name": "Sayva Solutions",
        "link": "https://www.linkedin.com/company/sayva-solutions"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "San Diego",
        "region": "CA",
        "postal_code": "92161",
        "street_address": null,
        "latitude": 32.71576,
        "longitude": -117.16382
    }
}