{
    "job": {
        "title": "Machine Learning Engineer",
        "industry": "Computer Software",
        "description": "Based on decades of parallel computing research at MIT, Neural Magic has developed deep learning model sparsification tools and a CPU inference engine. Our solution helps data scientists and ML engineers sparsify and quantize deep learning models to minimize footprint and run on CPUs at GPU speeds. Please look through our GitHub repos to get a feel of what we are about, and if still interested, apply to join our team. We are seeking a machine learning engineer excited to work with state-of-the-art models and cutting-edge research, as well as with parallel and concurrent algorithms. This person will work closely with our technical team, bringing deep learning product requirements to our engineers and putting machine learning research into practice within our software. If you are a machine learning engineer who wants to contribute to solving challenging technical problems at the forefront of machine learning, this is the role for you. Founded by an award-winning team of professors and students out of MIT, Neural Magic is a venture-backed company headquartered in Davis Square, Somerville, MA. What you’ll do Contribute to designing, building, evaluating, shipping, and refining Neural Magic’s machine learning product including libraries, demos, and notebooks Prototype and iterate on state of the art research against proprietary, in-house software Work closely with customers to understand specific needs, implementation details, and successful deployment using Neural Magic’s engine Collaborate with a cross functional team about market requirements, best practices and how machine learning is deployed in the wild Be a trusted advisor and partner, providing deep analysis of deep learning approaches, helping to define and conduct pilot tests What you’ll need: Master’s or PhD degree in computer science or math, or equivalent experience. Prefer a focus on machine learning. Solid knowledge of machine learning and deep learning fundamentals, in particular MLPs and CNNs Experience with taking deep learning models from conception to production: writing, training, testing, and deploying machine learning models Proficient with Python and one or more deep learning frameworks such as Pytorch, Tensorflow, Caffe, MXNet, Keras, etc Experience working with large data pipelines for analyzing and training Self-directed individual who learns quickly and is comfortable operating in a blank slate environment Excellent communication skills, ability to tailor technical information for different audiences Strong sense of project ownership and personal responsibility",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-04T01:26:32.000Z"
    },
    "company": {
        "name": "Neural Magic",
        "link": "https://www.linkedin.com/company/neural-magic"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Somerville",
        "region": "MA",
        "postal_code": "02143",
        "street_address": null,
        "latitude": 42.389122,
        "longitude": -71.097145
    }
}