{
    "job": {
        "title": "Staff Software Engineer (Servicenow service portal)",
        "industry": "Information Technology and Services",
        "description": "Role: Staff Software Engineer (Servicenow service portal) Location: Santa Clara/Remote Duration: Long term W2 Candidate This position is not open for C2C Must have non-negotiable 3+ years experience with Servicenow service portal. 8 years for software development experience (Front end) What you'll do in this role: Build high-quality, clean, scalable and reusable code by enforcing best practices around software engineering architecture and processes (Code Reviews, Unit testing, etc.) Work with the product owners to understand detailed requirements and own your code from design, implementation, test automation and delivery of high-quality products to our users. Design software that is simple to use to allow customers to extend and customize the functionality to meet their specific needs Contribute to the design and implementation of new products and features while also enhancing the existing product suite Be a mentor for colleagues and help promote knowledge-sharing What you will need for this role to be successful: 4+ years of experience in ServiceNow’s service portal custom applications development 8 years of experience in the development of custom applications using Java, JavaScript, jQuery, AngularJS, and ReactJS. (Both client and service side scripting) Has technical knowledge building REST/SOAP-based APIs. Deep knowledge of AJAX, JSON, HTML, XML, CSS, REST, HighCharts and associated frameworks Understanding of dependency injection and unit-testing principles Understanding of functional programming paradigm Experience with relational databases and SQL Deep understanding of design patterns Strong verbal and written communication skills.",
        "employment_type": "CONTRACTOR",
        "date_posted": "2021-07-15T22:00:30.000Z"
    },
    "company": {
        "name": "Apptad Inc.",
        "link": "https://www.linkedin.com/company/apptad"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 96,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "United States",
        "region": null,
        "postal_code": "99999",
        "street_address": null,
        "latitude": 39.50355,
        "longitude": -99.0183
    }
}