{
    "job": {
        "title": "Sr Software QA Engineer - Emerging Interface",
        "industry": "Marketing and Advertising,Information Technology and Services,Computer Software",
        "description": "Company Description ServiceNow is making the world of work, work better for people. Our cloud‑based platform and solutions deliver digital workflows that create great experiences and unlock productivity for employees and the enterprise. We're growing fast, innovating faster, and making an impact on our customers' and employees' lives in significant and important ways. With over 6,900 customers, we serve approximately 80% of the Fortune 500, and we're on the 2020 list of FORTUNE World's Most Admired Companies.® We’re looking for people who are ready to jump right in and help us build on our incredible momentum, our diverse, engaged workforce, and our purpose to make the world of work, work better. Learn more on Life at Now blog and hear from our employees about their experiences working at ServiceNow. Job Description What you get to do in this role: Maintain existing automation test frameworks Collect and report quality metrics from test execution Work with developers to design specific testing strategies for features being developed and automate them Create comprehensive test plans; execute and automate them Support engineering organizations in troubleshooting or addressing issues with applications and dev/test environments Qualifications To be successful in this role you have: 4+ years of experience with quality assurance and Java programming with Selenium, JUnit and TestNG Fluency with scripting in JavaScript. Experience with Eclipse, Jenkin, Maven, and Git Understanding of testing techniques (e.g. performance, unit, integration, automated), their strengths and weakness, and ability to use them to best effect Ability to use tools (such as IDE, debugger, build tools, source control, ServiceNow instances, profilers, system administration/Unix tools) to assist with daily tasks Experience driving cross-team technical discussions with an understanding of SDLC concepts JB0015470 Additional Information ServiceNow is an Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, creed, religion, sex, sexual orientation, national origin or nationality, ancestry, age, disability, gender identity or expression, marital status, veteran status or any other category protected by law. If you are an individual with a disability and require a reasonable accommodation to complete any part of the application process, or are limited in the ability or unable to access or use this online application process and need an alternative method for applying, you may contact us at +1 (408) 501-8550, or talent.acquisition@servicenow.com for assistance. For positions requiring access to technical data subject to export control regulations, including Export Administration Regulations (EAR), ServiceNow may have to obtain export licensing approval from the U.S. Government for certain individuals. All employment is contingent upon ServiceNow obtaining any export license or other approval that may be required by the U.S. Government.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-17T23:39:18.000Z"
    },
    "company": {
        "name": "ServiceNow",
        "link": "https://www.linkedin.com/company/servicenow"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 48,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "San Diego",
        "region": "CA",
        "postal_code": "92161",
        "street_address": null,
        "latitude": 32.71576,
        "longitude": -117.16382
    }
}