{
    "job": {
        "title": "Software Engineer",
        "industry": "Financial Services",
        "description": "In a world of disruption and increasingly complex business challenges, our professionals bring truth into focus with the Kroll Lens. Our sharp analytical skills, paired with the latest technology, allow us to give our clients clarity—not just answers—in all areas of business. We value the diverse backgrounds and perspectives that enable us to think globally. As part of One team, One Kroll, you’ll contribute to a supportive and collaborative work environment that empowers you to excel. Kroll is the premier global valuation and corporate finance advisor with expertise in complex valuation, disputes and investigations, M&A, restructuring, and compliance and regulatory consulting. Our professionals balance analytical skills, deep market insight and independence to help our clients make sound decisions. At Kroll, your work will help deliver clarity to our clients’ most complex governance, risk and transparency challenges. Apply now to join One team, One Kroll. RESPONSIBILITIES: Develop high quality software in an enterprise environment Work in an agile team environment Develop a custom highly interactive Web Application Develop custom restful APIs and services Utilize SQL Server to develop a custom database Write and review documentation (technical, process, project requirements, etc.) Execute unit tests for all code developed and deployed Provide support for custom applications currently in production REQUIREMENTS: Excellent analytical and troubleshooting skills Knowledge of Language: JavaScript, C#, Python Front End Framework: Angular, React or View Database: SQL, MySQL, Mongo DB Process: Agile, Scrum, SDLC (Software Development Lifecycle) Demonstrated outstanding written & verbal communication skills, time management and documentation skills Detail oriented work efforts Preferred Qualifications Experience Developing websites / applications Performing testing, maintenance, and enhancements on web applications Learning and applying new technical skills Attitude Desire to learn Take ownership of work Welcome feedback In order to be considered for a position at Kroll, you must formally apply via careers.kroll.com Kroll is committed to creating an inclusive work environment. We are proud to be an equal opportunity employer and will consider all qualified applicants regardless of gender, gender identity, race, religion, color, nationality, ethnic origin, sexual orientation, marital status, veteran status, age or disability.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-09-07T21:30:42.000Z"
    },
    "company": {
        "name": "Kroll",
        "link": "https://www.linkedin.com/company/kroll"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Nashville",
        "region": "TN",
        "postal_code": "37221",
        "street_address": null,
        "latitude": 36.166344,
        "longitude": -86.77907
    }
}