{
    "job": {
        "title": "Data Analyst",
        "industry": "",
        "description": "About Mobinity Global: Mobinity Global is transforming the way recruiting is done in the digital age. We work with a number of top tier companies, tech startups, freelance companies, Industry professionals and subject matter experts for projects, internships, jobs and freelance work. If you meet the below eligibility criteria , please apply and our recruitment team will contact you through LinkedIn to get you started. We plan to build a strong connection with all of our applicants so that we can facilitate both our employment partners and potential employers now as well as in the future. Eligibility Criteria: Your year of graduation is 2020 or later. (Masters Candidates can also apply) You have a bachelor's degree in business/ economics/ finance/ Computer Science / Statistics major from a USA university. You have an aspiration to work for companies such as Dell, Citadel, Qualtrics, PNC, Venture for America, RippleMatch, SAP, Robinhood etc. Description: Apply your knowledge of data analysis to real-world modelling, analysis, and report with our experienced analyst team. Data Analyst Duties and Responsibilities: Using advanced computerized models to extract the data needed Removing corrupted data Performing initial analysis to assess the quality of the data Performing further analysis to determine the meaning of the data Performing final analysis to provide additional data screening Preparing reports based on analysis and presenting them to management Requirements: A high level of mathematical ability Programming languages, such as SQL, Oracle and Python The ability to analyze, model and interpret data Problem-solving skills A methodical and logical approach The ability to plan work and meet deadlines Accuracy and attention to detail Interpersonal skills Teamworking skills Written and verbal communication skills Benefits: Shadowing, mentoring, and training opportunities. Hands-on application of finance principles in a fast-paced work environment Opportunity to attend weekly meetings and occasional networking events Compensation available Apply NOW and we'll get you started to explore your best matches!",
        "employment_type": "INTERN",
        "date_posted": "2021-10-18T06:05:38.000Z"
    },
    "company": {
        "name": "Mobinity Global",
        "link": "https://www.linkedin.com/company/mobinity-global"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Phoenix",
        "region": "AZ",
        "postal_code": "85009",
        "street_address": null,
        "latitude": 33.448204,
        "longitude": -112.072586
    }
}