{
    "job": {
        "title": "Data Scientist",
        "industry": "Food &amp; Beverages",
        "description": "Position Summary: FreshDirect is looking for an experienced analyst / data scientist to join our Analytics team. This person must be a motivated, independent contributor to the team, focusing on data-driven insights to pursue increased profitability. They will work towards evolving the way we manage data, automate reporting, and provide business recommendations all towards providing data insights to support decisions that allow the company to prosper. Specifically, this candidate will be working directly with the director of analytics responsible for order forecasting and capacity oversight. The ideal candidate will come with a toolkit comprised of modeling methods, statistical analysis techniques, and forecasting experience. Essential Functions: Develop and maintain accurate demand projections based on customer behavior trend, marketing campaigns and initiatives, and operational capacity. Provide ongoing business observations, insights, and recommendations leveraging all company data. Push the company towards strategies to drive profitability using predictive analytics, mathematical modeling, and simulation. Partner with department leads and senior management to optimize business efforts and operational resources to achieve maximum profitability, as well as support company initiatives to grow the business. Provide clear communications of the latest trends, insights, and data-driven recommendations. Collaborate with the team to synergize efforts and continuously innovate in order to provide the best possible analytical products. Candidate should demonstrate initiative, possess an intellectual curiosity, and is interested in continuously developing skills and techniques. Minimum Qualifications: 3-5 years of analytical and/or business optimization experience with a focus in logistics and/or ecommerce. Bachelor’s degree or higher, majoring in any math-focused field (operations research, economics, physics, etc.) Exceptional problem-solver. Willing to learn new skills/techniques to do so quickly and accurately. Very strong verbal and written communication skills, with the ability to turn technically complex ideas into a narrative. Ability to work in a dynamic, cross-functional environment, with a strong attention to detail. Tech-savvy and able to work, communicate, and convey ideas both in-person and virtually. Not afraid to speak up, provide input, offer proposals/initiatives, and lead. Excellent time-management, organized, and task-focused. Knowledge, Skills, Abilities, Passions: Strong data management skills (organize, manipulate, etc.) to derive insights quickly and accurately (typically using excel, SQL, SAS, R, Python, etc.) Understands and/or ability to learn new programming languages, scripting, and coding as needed to solve difficult problems. Public speaking and presenting skills as well as the expertise in presenting tools (powerpoint, Power BI, graphs/charts, etc.) that conveys concepts, trends, insights, recommendations, etc. Passion for learning as well as teaching others, specifically in the data and analytics space. Who is FreshDirect: FreshDirect is the northeast's leading online fresh food grocer, delivering directly to customers throughout seven states, including the New York City, Philadelphia, and District of Columbia metropolitan areas. FreshDirect is committed to sourcing the freshest and best-tasting meat, fish, produce, and specialty items through direct relationships with suppliers, growers, and farmers. Launched in 2002, FreshDirect is a privately held company headquartered in Bronx, NY. From the beginning, FreshDirect has set out to provide something different. We are a community partner with a mission to deliver the highest quality and service that customers can find. This is an environment in which associates can innovate, grow and have successful careers—most of our leaders have come up through our ranks. And thanks to our team’s extraordinary efforts, we are a leading innovator in the e-commerce and grocery industries. Why choose FreshDirect? We're a company that thrives on teamwork. Our evolution is driven by our passionate employees and investment in perfecting the technology that lets us deliver the highest-quality food. Our state-of-the-art facility creates an environment for innovation. We support our employees with on-the-job training for plant employees and drivers, team-building activities, workplace recognition opportunities, and by encouraging direct relationships with our suppliers in the field. Great people deserve great perks. We offer comprehensive benefits, plus many workplace extras, including: ·      A flexible and generous paid time off plan ·      20% off at freshdirect.com and significant markdowns at our employee market ·      24-hour access to the FreshDirect shuttle between our Bronx headquarters and the subway ·      Regular events and barbecues for employees Click to explore careers and life @ FreshDirect Learn more @FreshDirect on Twitter, Instagram, Facebook, YouTube! Disclaimer: The above statements are intended to describe the general nature and level of work being performed by the Team member(s) assigned to this position. They are not intended to be an exhaustive list of all responsibilities, duties, and skills required of individuals in this position. Position Descriptions may be subject to change as the needs of the organization change. As an EQUAL EMPLOYMENT OPPORTUNITY EMPLOYER, FreshDirect does not discriminate against applicants or employees because of their race, color, citizenship status, national origin, ancestry, sex, gender, sexual orientation, age religion, creed, marital status, veteran status, domestic violence victim status, familial status, or on any other basis prohibited by law. Furthermore, FreshDirect will not discriminate against any applicant or employee because they are disabled, a disabled veteran, or a veteran of the Vietnam era, provided they are qualified and meets the requirements established by FreshDirect for the job.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-10-04T20:10:24.000Z"
    },
    "company": {
        "name": "FreshDirect",
        "link": "https://www.linkedin.com/company/freshdirect"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Bronx",
        "region": "NY",
        "postal_code": "10462",
        "street_address": null,
        "latitude": 40.826153,
        "longitude": -73.920265
    }
}