{
    "job": {
        "title": "Software Engineer(Machine Learning / Data Scientist)",
        "industry": "Management Consulting",
        "description": "Through our dedicated associates, Conduent delivers mission-critical services and solutions on behalf of Fortune 100 companies and over 500 governments – creating exceptional outcomes for our clients and the millions of people who count on them. You have an opportunity to personally thrive, make a difference and be part of a culture where individuality is noticed and valued every day. Job Summary: Software Engineer-Machine Learning / Data Scientist Purpose Responsible for those functions, activities, and skills required for analysis, design, coding, integration, test & maintenance of software modules, subsystems or systems which control other electrical, mechanical, electronic or network systems. General Scope Builds knowledge of the organization, processes and customer Requires knowledge and experience in own discipline; still acquiring higher level knowledge and skills Receives a moderate level of guidance and direction Moderate decision making authority guided by policies, procedures, and business operations protocol Primary Responsibilities May perform one or more of the following: Plans, designs, develops and tests software systems or applications for software enhancements and new products. Analyzes, programs, and modifies software enhancements and/or new products used in local, networked, or Internet-related computer programs. Using current programming languages and technologies, writes code, completes programming, and performs testing and debugging of applications. Plans and directs studies of potential electronic data processing applications. Develops and installs programs to support general business applications running on PCs. Designs web pages, including graphics, animation, and functionality; develops infrastructure and applications related to pages. May make hardware or software purchasing recommendations regarding web development. All other duties as assigned. Candidate Education BA/BS in a field that emphasizes data analysis and visualization (e.g., computer science, social sciences, physical sciences, math, engineering, or statistics), or equivalent work experience Candidate Minimum Qualification Familiarity with basic concepts of programming Java, Spring, Python Willingness to learn new technologies needed for the project Minimum shows a systematic, analytical approach to problem solving. Minimum technical knowledge and understanding of major technology areas, platforms, development processes and system lifecycles Preferred Qualification 0 to 2 years of experience working with Java, Spring, Python Familiar with at least one of the popular development language. Exposure to website development, micro services, machine learning Good communication skills and team player & contributor Understanding of the conventional image and video processing approaches Working knowledge of relational databases Minimum has a broad and moderately deep knowledge coupled with working knowledge of the activities of those businesses and other organizations that use software systems. Conduent is an Equal Opportunity Employer and considers applicants for all positions without regard to race, color, creed, religion, ancestry, national origin, age, gender identity, gender expression, sex/gender, marital status, sexual orientation, physical or mental disability, medical condition, use of a guide dog or service animal, military/veteran status, citizenship status, basis of genetic information, or any other group protected by law. People with disabilities who need a reasonable accommodation to apply for or compete for employment with Conduent may request such accommodation(s) by clicking on the following link, completing the accommodation request form, and submitting the request by using the \"Submit\" button at the bottom of the form. For those using Google Chrome or Mozilla Firefox please download the form first: click here to access or download the form. You may also click here to access Conduent's ADAAA Accommodation Policy.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-02T02:18:04.000Z"
    },
    "company": {
        "name": "Conduent",
        "link": "https://www.linkedin.com/company/conduent"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Lebanon",
        "region": "KS",
        "postal_code": "66952",
        "street_address": null,
        "latitude": 39.809875,
        "longitude": -98.55673
    }
}