{
    "job": {
        "title": "Senior Research Engineer, Molecular Design Interface",
        "industry": "Research,Biotechnology,Pharmaceuticals",
        "description": "At Roivant, we are passionate about discovering and developing new drugs to impact patients' lives. Since its inception in 2014, Roivant has launched over 20 portfolio companies (Vants), overseen 5 successful IPOs, established a $3B partnership with a global pharma, built a pipeline of over 40 assets across various modalities and therapeutic areas, and delivered 8 successful phase 3 readouts. Roivant is currently building new capabilities in drug discovery and expanding its existing development engine to become the world's leading tech-enabled pharmaceutical company Roivant's drug discovery capabilities are driven by our computational discovery platform, which combines preeminent physics-based tools with deep expertise in machine learning to generate unprecedented analytical power that can tackle previously intractable discovery challenges. The tight integration of this computational platform with our experimental capabilities enables the rapid design and optimization of new drugs to address a wide range of targets for diseases with high unmet need. We believe that the future of drug discovery lies in integrating predictive sciences, biology and medicinal chemistry to accelerate the path to new medicines. This role is an opportunity to be an architect of this paradigm shift and generate transformative benefit for patients Position Summary Roivant Discovery is looking for a highly motivated Scientific Programmer to develop our next-generation molecular design interface. The candidate should be an expert in molecular visualization, structure manipulation, and developing graphical user interfaces for a multi-disciplinary organization. As a member of the software engineer team, the candidate will develop a state-of-the-art molecular design environment to ensure the best outcome of the Roivant computational platform to improve the drug discovery process. Our computational platform leverages molecular dynamics, free energy calculations, quantum chemistry, and machine learning methods. Key Responsibilities Develop a state-of-the-art molecular design environment Collect and understand requirement from drug discovery projects and key stakeholders Utilize and expand the capabilities of open-source molecular visualization programs such as VMD and Chimera Champion the implementation and adoption of the integrated design environment among colleagues Develop modules for existing and to-be developed drug discovery workflows Assist colleagues in integrating scripts for deployment in drug discovery projects Collaborate with third-party programs developers Requirements Highly motivated to develop computational methods and software for discovering better medicines Experience developing Graphical User Interfaces (GUIs) for scientific applications. Excellent communication skills and strong team player Outstanding development skills (Python, Tcl/Tk, and C/C++ preferred) Demonstrated track record of conveying complex data in an intuitive graphical form Experience developing plugins for molecular visualization programs such as VMD, Pymol, and Chimera Experience with scientific computing systems and schedulers Experience with version control (such as Git) and test-and-release (such as Jenkins) frameworks Additional Preferred Qualifications Experience working with a diverse team on an ambitious project Experience with parallel programming, especially data-parallel, using MPI, OpenMP, OpenACC, CUDA Experience working with containers Ability to manage HPC clusters (CPU and GPU based) Experience in using/deploying workflow managers in distributed computing facilities Experience in molecular dynamics simulations, Monte Carlo simulations, or other computational physics simulations Experience in cheminformatics, bioinformatics, and data science Passionate about developing software to advance drug discovery Roivant Sciences provides equal employment opportunities to all employees and applicants for employment and prohibits discrimination and harassment of any type without regard to race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-01T07:33:08.000Z"
    },
    "company": {
        "name": "Roivant Sciences",
        "link": "https://www.linkedin.com/company/roivant-sciences-inc-"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Boston",
        "region": "MA",
        "postal_code": "02118",
        "street_address": null,
        "latitude": 42.358994,
        "longitude": -71.05863
    }
}