{
    "job": {
        "title": "Software Engineer",
        "industry": "Information Technology and Services,Computer Software,Telecommunications",
        "description": "Parker and Lynch is current seeking a Software Engineer in the Kansas City area to work within the Management Information Systems department and be responsible for carrying out software development projects that aid the goals of the company. This role cooperates within a team providing strong, scalable solutions across every department of a fast-growing and agile company. Responsibilities Develop and design customer-facing and internal applications Design internal APIs and develop custom web services Collaborate with Business Analysts as well as other departments to obtain requirements for projects, execute test plans and supply required functionality. Maintain and migrate legacy software and applications Integrate with third party systems Analyze root causes, debug code, and troubleshoot issues Qualifications BS in Computer Science or a related field Adept in at least one general purpose programming language: Ruby, Python, PHP, Perl, C#, or C++ Experience using version control systems like Git and/or Subversion Knowledgeable with Linux and command-line interfaces like Bash and/or KornShell Experience using SQL Skills Strong troubleshooting and debugging skills Excellent verbal, written and interpersonal communication skills Highly detail oriented Team player What helps you stand out: Experience with: CSS3 / HTML5 Web Services (SOAP/REST) JavaScript (React/ES6/ES7/jQuery) AJAX OWASP Twelve-Factor Applications What's in it for you? Competitive compensation package 401(k) company match and being 100% vested on your first day Great medical benefits Flexible schedule Locally owned with a fun and friendly atmosphere Recognized as one of the Best Places to Work in 2020 by Glassdoor Employment Type Full-time Equal opportunity employer If you have a strong desire to impact the success of a local organization please apply today!",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-19T14:08:31.000Z"
    },
    "company": {
        "name": "Parker and Lynch",
        "link": "https://www.linkedin.com/company/parker-and-lynch"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Lenexa",
        "region": "KS",
        "postal_code": "66227",
        "street_address": null,
        "latitude": 38.956512,
        "longitude": -94.73757
    }
}