{
    "job": {
        "title": "Software Security Staff Engineer",
        "industry": "Semiconductors",
        "description": "Samsung Semiconductor Inc. Overview Samsung Semiconductor Inc. (SSI) is advancing the world’s technology. As a leader in Memory, System, LSI and LCD technologies, our US teams contribute to breakthroughs in 5G, SOC, memory and display. With our global perspective and diversity of thought, we proudly serve our customers around the world. We are looking for team members who share our commitment to learning and growth and excel when collaborating within and across teams. SSI is headquartered in the heart of Silicon Valley and is a wholly-owned U.S. subsidiary of Samsung Electronics Co., Ltd. - the #1 employer in the world (Forbes, Oct 2020) and top patent-holder in the U.S. Want to advance the world’s technology with us? JOB TITLE/REQ ID/LOCATION: Job Title: Software Security Staff Engineer Req ID : 40191 Location : San Jose Inside This Business Group The Memory Solutions Lab (MSL) mission is to develop innovative open system architectures and solutions that transform the performance of semiconductor memory in SSDs, mobile devices and data centers. Overview & Impact Samsung Semiconductor, Inc. is a world leader in Memory, System LSI and LCD technologies. Samsung founded a new advanced research and development lab, MSL (Memory Solution Lab), at San Jose CA in 2012. The vision of MSL is to be the engine of technology inspiration and renovation for Samsung semiconductor. Especially, MSL is tackling a variety of challenging issues in data center, storage, new memory, server, and software infrastructure for cloud and enterprise storage systems. MSL is operated like a start-up under Samsung umbrella. We are looking for a most passionate R&D software security staff engineer who can share our visions and have a journey together. Specifically, we are looking for a software and firmware security engineer of Datacenter Technology Group who can lead software security system and infrastructure architecture development that leverages Samsung intelligent storage technologies including near data processing technologies, new SSD architecture, new SSD interface, and so on. The software security staff engineer will lead development that covers a broad spectrum of software security including isolated running environment and is building technologies and ecosystems surrounding SSD, network, software, and services. The ideal candidate must have a strong understanding of software security, isolated running environment, storage system and SSD. Experience in software security framework architecture development and optimization of systems and software is required. Job Responsibilities Lead/develop software security system framework that leverages innovative Samsung technology including memory and SSD Propose changes to memory and storage systems to support technologies that improve security and performance. Identify and develop specific opportunities for storage products such as SSD in near data processing Assess the validity and rigor of new product concepts establishing software security frameworks for ongoing evaluation as appropriate Build cross-functional relationships with engineering and product planning team to shape long-term product roadmap Interact with partners and customers to define and refine product concepts Hold your own in technical discussion, be a subject matter expert, and have strategic influence Work with emerging and established datacenter storage software stacks to optimize and innovate for new memory and storage technologies Create new and useful IP, publish at conferences, and generate whitepapers and specification documents. Qualifications & Required Skills MS or PhD in scientific field, ideally in Computer Architecture, Computer Science or Electrical Engineering. 15+ years’ experience in software development, security system and framework architecture design and development, and performance optimization Good understanding of computer architecture Good understanding Linux system Good understanding of ARM cores Direct experience building and deploying Linux kernel components. Track record of innovation and creativity in problem solving Skills & Abilities Proven software security architecture design and framework development experiences Research and development experience building and analyzing software security Strong background in C/C++ programming Must be highly motivated with excellent verbal and written communication skills. Comfortable working in a multinational environment and understands how to leverage cultural diversity Additionally, we look for the following universal qualities in all candidates: Resourceful Achiever: self-motivated and proactive, you flex to try new approaches and creatively solve problems Avid Learner: you thrive with challenges, seek continuous growth and improvement, and seek data to prove your hypotheses Devoted Professional: you are diligent and deliberate in your work, leveraging your expertise to deliver results without ego Thoughtful Collaborator: you build relationships across teams, offering help and welcoming ideas from others to drive work forward in an inclusive manner Samsung Semiconductor Inc (SSI), an equal opportunity employer, is a world leader in Memory, System LSI, and LCD technologies. Headquartered in San Jose, California, SSI is a wholly-owned U.S. subsidiary of Samsung Electronics Co., Ltd.- one of the largest semiconductor manufacturer in the world and the industry's volume and technology leader in DRAM, NAND Flash, SSDs, mobile DRAM and graphics memory. It is one of the largest providers of system logic, imaging and LED lighting solutions, as well as providing advanced process design and manufacturing for fabless companies. Samsung Semiconductor, Inc. also has a research and innovation center with numerous labs providing product design and research in: logic, memory, image sensors, displays and mobile technologies. In addition, the company supports Samsung Display Company, the largest producer of LCD and OLED displays. SSI is an Equal Opportunity Employer. It is SSI’s policy to comply with all applicable national, state and local laws pertaining to nondiscrimination and equal opportunity, and hiring decisions are made accordingly. Learn more about Samsung Semiconductor here. A day in the life Samsung Video Samsung Semiconductor Career Page",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-20T05:49:21.000Z"
    },
    "company": {
        "name": "Samsung Electronics America",
        "link": "https://www.linkedin.com/company/samsung-electronics-america"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 180,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "San Jose",
        "region": "CA",
        "postal_code": "95148",
        "street_address": null,
        "latitude": 37.334793,
        "longitude": -121.888145
    }
}