{
    "job": {
        "title": "Data Scientist",
        "industry": "Investment Management",
        "description": "About Pagaya Pagaya is a financial technology company reshaping the asset management space using machine learning and big data analytics to manage institutional money. With a focus on fixed income and alternative credit, Pagaya offers a variety of discretionary funds to institutional investors including pension funds, insurance companies and banks. Pagaya’s unique technology platform — Pagaya Pulse — runs on a suite of artificial intelligence technologies and state-of-the-art algorithms to deliver a consistently high and scalable performance edge. The company was founded in 2016 by seasoned finance and technology professionals with offices in New York and Tel Aviv. The team manages over $5 billion in assets on behalf of institutional investors around the world. Our Team Our team comprises over 300 professionals in New York and Tel Aviv with expertise in artificial intelligence, data-rich alternative assets and asset management. You will be surrounded by some of the most talented, supportive, smart, and kind leaders and teams -- people you can be proud to work with! Who We Are Continuous learning. It’s okay to not know something yet, but have the desire to grow and improve. Win for all. We put our mission over ourselves to make sure all participants in the system win. Debate and commit. Share openly, question respectfully, and once a decision is made, commit to it fully. The Pagaya way. Use first principles thinking to support our needs, but is unique to Pagaya. The Role We're looking for a Data Scientist to join our Research team. This is a great opportunity to solve hard problems, grasp algorithms quickly, and build a career in big data. In this role, you will work closely with our team of Quantitative Researchers and fellow Data Scientists to translate data into actionable insights in order to help bolster the research pipeline. You will work closely with our Global Research department joining one of our fastest growing business units. Key Responsibilities Provide day-to-day support of quantitative data-related projects Prepare and monitor quantitative data collection Conduct data analysis including advanced statistical techniques such significance testing, mean, standard deviation, regression, clustering, etc. Ensure data and reporting quality Visualize data insights using charts, graphs and tables and develop reports in PowerPoint or Tableau Work in a short life-cycle research and development environment Generate and test working hypotheses in new markets Qualifications Master’s degree in Data Science, Computer Science, Statistics, Applied Mathematics, or a closely related field is encouraged Good applied statistics skills, such as distributions, statistical testing, regression, etc. Prior scripting and programming experience, preferably in Python Independent and fast learner that can work alone and in teams Ability to learn and explore new fields of expertise Knowledge in some of the following can be an advantage: machine learning, predictive modeling, optimization, risk and finance Benefits Generous paid time off policy Medical, Dental, Vision Insurance When onsite: Unlimited snacks and beverages Covid-compliant environment A diverse and inclusive culture",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-20T14:48:30.000Z"
    },
    "company": {
        "name": "Pagaya",
        "link": "https://www.linkedin.com/company/pagaya"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Boston",
        "region": "MA",
        "postal_code": "02118",
        "street_address": null,
        "latitude": 42.358994,
        "longitude": -71.05863
    }
}