{
    "job": {
        "title": "Machine Learning Engineer",
        "industry": "Electrical/Electronic Manufacturing,Computer Software,Automotive",
        "description": "ISEE is seeking a full-time Machine Learning Engineer to join our team. The ideal candidate has several years of work experience. Role Responsibilities Include Working on the intersection of sensing and perception algorithms. Prototyping and deploying robust computer vision algorithms on ISEE’s vehicle fleet in areas of: Sensor calibration, localization and mapping, fusion, tracking and pattern recognition. Benchmarking and maintaining developed modules. Work independently to deliver high-quality code in a timely fashion. Collaborate with team for testing, evaluation and review of code. Required Qualifications Degree in Computer Science, Electrical Engineering, Robotics or related field. Experience in deploying deep learning models at scale on real-world data in at least one of these deep learning frameworks: PyTorch, Tensorflow, Caffe. Hands-on experience with developing, training and deploying deep learning models in multimodal (sensors space and temporal) real world data. Strong Python and/or C++ skills. Passionate about self-driving vehicles and real-world robotic solutions. Strong presentation and communication skills. Preferred Publication record in top-tier computer vision or machine learning conferences. 3+ yrs industrial experience in deploying Computer Vision/Deep learning algorithms in real-world scenarios. Robotics/autonomous experience is a plus.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-25T11:34:21.000Z"
    },
    "company": {
        "name": "ISEE AI",
        "link": "https://www.linkedin.com/company/isee-ai"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Cambridge",
        "region": "MA",
        "postal_code": "02239",
        "street_address": null,
        "latitude": 42.36525,
        "longitude": -71.10502
    }
}