{
    "job": {
        "title": "Machine Learning Engineer / $45 per hour DOE",
        "industry": "Staffing and Recruiting",
        "description": "We have a client who is looking to bring on a Machine Learning Engineer to join their team. This company focuses on people and how they navigate their everyday lives from things like major purchases like buying a house, life changing events like going to college or starting a new business. They focus on making sure that the data their clients/consumers have before, during and after making these big decisions is delivered effectively and set them up for success. Upon Joining The Team You Would Be Working in close collaboration with data science and engineering teams Analyzing structured and unstructured data sources to determine the key business questions and hypotheses that can be explored with the data sets Evaluating approaches and algorithms based on available data and research objectives Developing experimental ML Models to solve complex data mining problems Required Skills & Experience 3+ years of experience Degree in Computer Science or related Python Snowflake SQL AWS Sagemaker Desired Skills & Experience Independent Thinking Must have an understanding of US Retail and Online Markets What You Will Be Doing Tech Breakdown 90% Machine Learning 10% Engineering Daily Responsibilities 100% Hands On The Offer Competitive Salary: Up to $45/hour DOE 7 month contract-to-hire You Will Receive The Following Benefits Medical Insurance & Health Savings Account (HSA) 401(k) Paid Sick Time Leave Pre-tax Commuter Benefit Applicants must be currently authorized to work in the United States on a full-time basis now and in the future. Posted By: Treasure Kimp",
        "employment_type": "CONTRACTOR",
        "date_posted": "2021-08-26T07:53:54.000Z"
    },
    "company": {
        "name": "Motion Recruitment",
        "link": "https://www.linkedin.com/company/motion-recruitment-partners"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Los Angeles",
        "region": "CA",
        "postal_code": "90101",
        "street_address": null,
        "latitude": 34.05224,
        "longitude": -118.24335
    }
}