{
    "job": {
        "title": "Marketing Data Consultant, Senior - Healthcare",
        "industry": "",
        "description": "Do you enjoy using your analytical skills to be the one-and-only Data Scientist on the Marketing Team? Do you enjoy collaborating and building relationships with key partners to help support the organization’s data goals for health plan products that are highly compliance and government regulated? As a Marketing & Communications Consultant, Senior you will manage the data and analytical marketing projects for the WellFirst Health Plan - provided by SSM Health Plan in MO and IL along with providing additional support for initiatives with Dean Health Plan and Prevea360 Health Plan in WI for the Medicare & ACA Health Insurance Plans. What You’ll Do: Primary Focus Areas Use analytics methods to extract value from business data Work with statistical models to support segmentation and personalization Share results with both technical and non-technical audiences Hands-on experience using large datasets to draw business insights Data Work: analysis, proofing, appending, sftp pickup/delivery Excel work (macros, splitting, formulas, vlookups) Targeting, segmentation, and personalization of data Data Visualization: Charts, Visio, Presentations, Etc. IDN (Integrated Delivery Network) Marketing Projects: Coordinate data with hospitals and clinics, clinic/hospitals visits (refill brochure inventory) and occasionally onsite events at Care locations Surveys + Analysis/Reporting Market Research; Marketing/Advertising Strategic Analysis; Market/Geographic Strategic Analysis Spread best practices of analytics to stakeholders and across the marketing team Manage marketing projects: copywriting and project management in Workfront Candidates give best consideration will have the following: Understanding of how analytics and data impact marketing and advertising Strong analytical skills Highly proficient in Microsoft Excel Self-starter Excellent written and verbal communication skills This position is based in the WellFirst Health St. Louis , MO office with 1-2 days a week an option for remote work. Read more at https://ssmh.wd5.myworkdayjobs.com/ssmhealth/job/MO-SSM-Health-Westview-Building/Marketing---Communications-Consultant--Senior--St-Louis-_R34097",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-10-05T17:29:42.000Z"
    },
    "company": {
        "name": "WellFirst Health",
        "link": "https://www.linkedin.com/company/wellfirst-health"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "St Louis",
        "region": "MO",
        "postal_code": "63121",
        "street_address": null,
        "latitude": 38.635357,
        "longitude": -90.20099
    }
}