{
    "job": {
        "title": "Software Engineer",
        "industry": "Information Services,Information Technology and Services,Computer Software",
        "description": "Everyone wants a career with impact. Here, you’ll be helping some of the world’s most renowned and ambitious companies build winning cloud platforms. Responsibilities: Work with customers to define, design, and develop complex, multi-tier distributed software applications on cloud platforms ( AWS / GCP) Passionate about mentoring team members and bringing in new technologies within the larger team. Work hands-on with cloud native services to demonstrate and prototype outcomes in customer/partner environments. Work in a supportive environment with many growth opportunities. Technical Requirements: 3+ years of experience with Java and Spring Boot framework. Experience building, architecting, designing and implementing highly distributed global cloud-based systems on either AWS or GCP Experience building or integrating with Continuous Integration/Delivery process. Experience implementing platform components such as RESTful APIs, Message Queues Systems, Observability Services, State Management Systems, Caching etc. Hands-on micro services architecture experience using Spring boot, Docker and Kubernetes Expertise with the AWS or GCP cloud native services Self-starter and strong, quick problem solving skills. Ability to communicate with clients on a business level and translate their needs into a technical solution. Bonus if you have experience with both AWS and GCP Bonus if you have experience with Google Kubernetes Engine Bonus if you are familiar with provisioning and automating infrastructure with infrastructure as code tool such as Terraform or Cloud Formation. Bonus if you have experience using Anthos, BigQuery, BigTable, TensorFlow. Benefits Include: Competitive compensation. Generous benefits. Flexible vacation and PTO policies (we have a minimum vacation policy in fact!)",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-17T16:58:56.000Z"
    },
    "company": {
        "name": "Experienced Recruiting Partners, LLC.",
        "link": "https://www.linkedin.com/company/experienced-recruiting-partners-llc-"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "United States",
        "region": null,
        "postal_code": "99999",
        "street_address": null,
        "latitude": 39.50355,
        "longitude": -99.0183
    }
}