{
    "job": {
        "title": "Software Engineer - Quality Assurance / Test",
        "industry": "Electrical/Electronic Manufacturing,Information Technology and Services,Computer Software",
        "description": "Description Open Systems International, Inc. (OSI) www.osii.com is a fast-paced, growing, high technology company, headquartered in Medina, Minnesota. As a world leader in the Operations Technology (OT) field, OSI develops and supplies state-of-the-art energy management, optimization and control software solutions to energy utility companies worldwide. In This Position You Will Have The Following Responsibilities In this position you will focus on system verification of software produced by our Development group using manual and automated testing. All of this is done using the latest technologies in a fast-paced, collaborative environment at our forward-looking company. Specific on-the-job training will be provided. Use manual and automated test procedures to identify high-impact problems. Assist in the creation and execution of resolution plans. Author, execute and maintain test procedures, automated test scripts and code. Design, develop, implement and improve various test methodologies, plans and test automation. Review defect descriptions, requirements, and designs to incorporate into test plans. Maintain customer test environments to replicate real-world test scenarios. Requirements Minimum Bachelor's degree in Computer Science, Software Engineering or related technical field. Proficient with Linux, Windows, UNIX environments. System Administration experience (small system or personal networks is okay). Understanding of manual and automated testing best practices. High level scripting skills (Python, Perl, Shell scripting). Understanding of Configuration Management. Proficient in a source control system (CVS, Subversion, Git, etc.). Innate desires to automate, monitor and continually improve everything in sight. Preferred Master's degree in Computer Science, Software Engineering or related technical field. Experience with different database technologies (SQL, Cassandra, MongoDB). Knowledge of tool building and automation. Capability to maintain Windows/Linux/UNIX Servers. Experience in server virtualization, especially VMWare and VSphere. General networking skills (Layer 2 & 3 switches, TCP/IP, SNMP, etc.). Benefits OSI offers a comprehensive benefit package including health, dental, life and disability insurance, 401(k) matching, bonuses, profit sharing and a generous amount of paid time off and paid holidays. Additional perks include casual dress code, flexible work hours, free beverages, employee events, onsite fitness center, exciting travel opportunities, employee referral bonus programs, and monthly birthday and anniversary celebrations. Check out our Life at OSI Facebook page to see more. As an employee of OSI you will have access to cutting edge technologies in a fun, professional, positive and dynamic work environment. We have excellent opportunities for growth and development. Discover your future. Discover OSI.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-06-23T12:52:13.000Z"
    },
    "company": {
        "name": "Open Systems International",
        "link": "https://www.linkedin.com/company/open-systems-international"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Medina",
        "region": "MN",
        "postal_code": "55340",
        "street_address": null,
        "latitude": 45.01901,
        "longitude": -93.58608
    }
}