{
    "job": {
        "title": "Software Engineer, Frontend",
        "industry": "Furniture",
        "description": "At Feather, our mission is to transform people's relationship with material goods to create a healthier and happier planet. We are redefining furniture rental for city living and helping people feel at home no matter where they live or how long they plan on staying. By giving people smarter options, Feather is able to keep more furniture in homes and out of landfills. About This Job We are looking for a talented Frontend Software Engineer to join our team. We have positions open on several different teams, covering all aspects of our business; everything from a heavy frontend, consumer focus to a heavy backend, operations focus, and several points in between. This position is for those who are experienced in the frontend and can help advocate, architect and design scalable client solutions, make major changes to our entire user experience and get their hands dirty with data/state management on a granular level. What You’ll Do Focus on user experience and create UIs that are scalable, intuitive and add value for users of all kinds. Work in a distributed architecture consisting of APIs and message/event consuming microservices. Begin to take ownership of larger initiatives, collaborating with other engineers to deliver project epics Requirements 3+ years of experience building commercial software with a modern programming language An eagerness to join a fast-paced, growing, and evolving environment. Excellent analytical and problem-solving skills. Strong experience creating rich user applications with modern frontend frameworks, such as React, Angular or Vue, and modern state management tools, such as Redux Strong experience working with RESTful APIs, as well as noSQL data models and GraphQL. Technology Stack You don't need to have experience with all of these. We’re looking for talented and smart engineers who are willing to ramp up on these technologies. Frontend React, Redux, Saga, Typescript, GraphQL, Storybook, Emotion Backend Express, NestJS, RESTful APIs, GraphQL Benefits Competitive compensation Health, vision, dental, and life insurance 401(k), commuter benefits, and HSA/FSA Flexible vacation and paid time off A monthly stipend to support remote work A 50% discount on your own Feather subscription The latest hardware to get the job done",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-30T03:39:54.000Z"
    },
    "company": {
        "name": "Feather",
        "link": "https://www.linkedin.com/company/feather1"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "New York",
        "region": "United States",
        "postal_code": "13856",
        "street_address": null,
        "latitude": 42.93923,
        "longitude": -75.62005
    }
}