{
    "job": {
        "title": "Site Reliability Engineer",
        "industry": "Computer Software,Research,Biotechnology",
        "description": "With over 35 nationalities and a range of backgrounds represented in our Benevolent team, we aim to build an inclusive environment where our people can bring their authentic selves to work, be respected for who they are and the exceptional work they do. We welcome and actively encourage applications from all sections of society and are committed to offering equal employment opportunities regardless of sex, race, religion or belief, ethnic or national origin, marital, domestic or civil partnership status, sexual orientation, gender identity, parental status, disability, age, citizenship, or any other basis. We see our diversity as an asset as we tackle challenging problems that bridge the gap between drug discovery and technology. The Role As a Site Reliability Engineer, you will be working alongside our autonomous cross-functional squads. You will advocate high-quality engineering and best-practice in production software as well as providing the infrastructure to both build rapid prototypes and launch production-quality services. You must be a strong communicator who can explain what is required to build and deliver top quality software products. You will be keen to work with the rest of the team and develop collaboratively. You will promote test-driven development and other Agile best practices for ensuring the software is resilient enough for our scientists to rely upon. You will be a core team member building and maintaining the underlying infrastructure that supports our AI-driven technology. You will also be adding your input into diverse areas such as authentication, network topology, sharded databases, scalable web services and interfaces to external data sources and APIs. Primary Responsibilities Implementing software solutions for cloud infrastructure in accordance with specifications and best engineering practices. Working towards improving long-term infrastructure availability and reliability. Monitoring and handling incident response of the infrastructure, platforms and core engineering services. Constructing pipelines to automate infrastructure and software deployments. Troubleshooting infrastructure, network and software issues. Staying up to date with recent technology trends and tools. Automating repetitive manual processes and procedures. Participating in on-call rotation to support Benevolent employees in their day-to-day activities. We are looking for someone with 2+ years of SRE/DevOps experience in a commercial setting. Ability to code and fluency in at least one programming language (Python/Java/Go/C++ preferred). Hands-on experience with Kubernetes. Good understanding and experience in administering cloud technologies(we work with AWS, but experience with other cloud providers is also a benefit!). Good understanding of infrastructure-as-code and tools such as Ansible, Terraform, Helm. Comfortable working with Unix-based operating systems. Experience with cloud networking, cloud operations, automation and orchestration. Experience with monitoring and alerting solutions (for example InfluxDB/Grafana/Prometheus). Understanding of quality of service measurement tools (SLIs, SLOs, SLAs). Understanding of database technologies(for example, relational, NoSQL, Graph) and their basic use cases. Basic understanding of network protocols such as TCP, HTTP/S and Load Balancing and the contexts in which they are used(for example, understanding the differences between AWS Application Load Balancer against AWS Network Load Balancer). About Us BenevolentAI unites AI with human expertise to discover new and more effective medicines. Our unique computational R&D platform spans every step of the drug discovery process, powering an in-house pipeline of over 25 drug programmes. We advance our mission to reinvent drug discovery by harnessing the power of a diverse team, rich with different backgrounds, experiences, opinions and personalities. In our offices in London and New York and research facility in Cambridge (UK), we work in highly collaborative, multidisciplinary teams, harnessing skills across biology, chemistry, engineering, AI, machine learning, informatics, precision medicine and drug discovery. We share a passion for being part of a mission that matters, and we are always looking for curious and collaborative people who share our values and want to be part of our journey. If that sounds like a fit for you, hit the ‘apply’ button and join us. Want to do a little more research before you apply? Head over to our Glassdoor page to learn about our benefits, culture and to find out what our team think about life at Benevolent. You can also find out more about us on LinkedIn and Twitter.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-28T15:38:21.000Z"
    },
    "company": {
        "name": "BenevolentAI",
        "link": "https://uk.linkedin.com/company/benevolentai"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "New York",
        "region": "United States",
        "postal_code": "13856",
        "street_address": null,
        "latitude": 42.93923,
        "longitude": -75.62005
    }
}