{
    "job": {
        "title": "Lead Software Engineer",
        "industry": "Nonprofit Organization Management,Insurance,Financial Services",
        "description": "Description Position at ProAg Grow with Confidence, Grow with Us ProAg has an exciting opportunity for a Lead Software Engineer to join our team. Are you looking for an opportunity to apply the advantages of technology and dedicate importance to ensure our software packages are the easiest and most efficient in the industry? Bring your passion for innovation to an Agile environment to help serve quality software products to our farmers, agents, and re-insurers. When viewed from 30,000 ft the development lead role serves the feature teams so that they can work at a higher level. It does so by providing estimates to business stakeholders and support to feature teams. Reporting to the Software Development Director, your mission will be to enable feature teams to be more productive and efficient. This position will be in ProAg’s Maple Grove, MN office. In This Exciting Opportunity You Will Lead kickoff and overview meetings with teams and assigns features to development teams. Identify detailed features with acceptance criteria, develop estimates per feature, identify discrepancies, identify, and document risks and assumptions and complete a prototype if needed. When working with feature teams, focus on improving the quality of interactions between the teams. Take a collaborative approach when working with a platform team on short-lived occasions. Be responsible for troubleshooting issues in non-production environments and with other teams to resolve any issues. Play release manager and engineer roles during releases. What You’ll Bring Significant relevant and progressive professional experience At least a bachelor’s degree in Computer Science, or a related field, or the equivalent education and/or experience. Experience in Analysis, Design and Development skills. Experience with and proven ability of the following: process modeling, data modeling, systems development methodologies, performance tuning, and application monitoring. Excellent written and verbal communications skills with an emphasis on confidentiality, tact, and diplomacy. What We Believe In Ensures Accountability. Take personal responsibility and ownership of successes and challenges. Communicates Effectively. Actively seek out and communicate with key stakeholders in all situations. Resourcefulness. Determine how to meet customer and employee needs and finds the resources to get it done. Customer Focus. Every interaction is a customer and is handled with empathy and seriousness. Instill Trust. Make intentions clear and meet shared challenges together, showing respect for the relationship and the team. Who We Are While our nation weathers economic storms, ProAg, a member of the Tokio Marine HCC group of companies, is positioned as a financially strong and well-capitalized insurer. We’re known for our quick response and fast, accurate claims settlement. We understand how important this is because many of us are farmers and ranchers ourselves. With more than 90 years of service to our agents & insureds, we stand committed to continuing the principles that ProAg was founded on: Integrity, Loyalty and Customer Service. The Tokio Marine HCC Group of Companies offers a competitive salary and employee benefit package. We are a successful, dynamic organization experiencing rapid growth and are seeking energetic and confident individuals to join our team of professionals. The Tokio Marine HCC Group of Companies is an equal-opportunity employer. Please visit www.tokiomarinehcc.com for more information about our companies.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-20T22:45:57.000Z"
    },
    "company": {
        "name": "ProAg",
        "link": "https://www.linkedin.com/company/proag"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Maple Grove",
        "region": "MN",
        "postal_code": "55340",
        "street_address": null,
        "latitude": 45.09812,
        "longitude": -93.444534
    }
}