{
    "job": {
        "title": "Machine Learning Engineer/Python",
        "industry": "Staffing and Recruiting",
        "description": "Job Description A financial company that originally began in the NYC area has expanded their operations to the West Coast, specifically Irvine, CA. They’re looking for a Mid-level Machine Learning Engineer. The company itself helps to provide personalized financial services and options to small businesses. They have created a unique technology platform that is also offered to clients along with their notable customer service. The candidate must have at least 2 years of experience in Machine Learning/Data Engineering. You will be an integral part of the team while working closely with the Director of Analytics as well as other members of the team. This candidate must be local to the Orange County area and unfortunately cannot provide sponsorship at this time. Required Skills & Experience Bachelors degree in Statistics/Analytics/Computer Science or related field A minimum of 2 years of experience Local to OC/LA area Most experience writing production/deployment code using R/Python Develop deep learning models Desired Skills & Experience Experience in classification, detection, segmentation More than 2+ years of experience What You Will Be Doing Tech Breakdown 50% Coding 50% Modeling Daily Responsibilities 70% Hands On 30% Team Collaboration The Offer Competitive Salary: Up to $150K/year, DOE You Will Receive The Following Benefits Medical Insurance & Health Savings Account (HSA) 401(k) Paid Sick Time Leave Pre-tax Commuter Benefit Applicants must be currently authorized to work in the United States on a full-time basis now and in the future Posted By: Niki Strutzel",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-03T08:22:57.000Z"
    },
    "company": {
        "name": "Motion Recruitment",
        "link": "https://www.linkedin.com/company/motion-recruitment-partners"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Irvine",
        "region": "CA",
        "postal_code": "92717",
        "street_address": null,
        "latitude": 33.68591,
        "longitude": -117.82472
    }
}