{
    "job": {
        "title": "Machine Learning Engineer",
        "industry": "Information Technology and Services,Automotive",
        "description": "Modis is looking for Machine Learning Engineers. Our opportunities are either long-term engagements, contract to hire or permanent placement roles. If you're looking for work in an enterprise level environment with a Fortune 100 company - make sure to apply today! RESPONSIBILITIES: Plan, Configure, Deploy and Operate a cloud solution Deliver Proof of Concepts for new Solutions on Cloud Works well under pressure, independent and meets deadline REQUIRED SKILLS: Hands on/working Knowledge of Google Cloud Platform(GCP) Experience Hosting applications on GCP using Compute Engine, App Engine, Kubernetes Engine, Cloud Storage, Big Query etc.. Good understanding of cloud design considerations and limitations and impact of pricing Knowledge of Networking principles and protocols including not limited to Load Balancing, firewall rules Proficient in scripting languages including Python, yaml. Knowledge of Application Monitoring using GCP(Google stackdriver) Prior experience working with: container technology, docker files, doscker images, Github, CI/CD concepts Experience with infrastructure configuration management tools such as Terraform, Puppet and Chef. PREFERRED SKILLS / EXPERIENCE: Machine Learning experience GCP Stack Kubeflow NLP Platform vision Migration to GCP Understanding or desire to learn end to end Machine Learning technology stack (Tools such as Domino Data Labs, Kubeflow, Kubernetes, SeldonCore, GCP, Jupyter Notebook, Hive, etc). Ability to work cross functionally 1-2+ years of experience developing GCP ML app’s ADDITIONAL INFORMATION: Modis offers Visa sponsorship and Green Card services Please feel free to contact Leticia Oliveira for further assistance at leticia.oliveira@modis.com Equal Opportunity Employer/Veterans/Disabled To read our Candidate Privacy Information Statement, which explains how we will use your information, please visit https://www.modis.com/en-us/candidate-privacy/ The Company will consider qualified applicants with arrest and conviction records.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-03T14:06:36.000Z"
    },
    "company": {
        "name": "Modis",
        "link": "https://ch.linkedin.com/company/modis"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 12,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Detroit Metropolitan Area",
        "region": null,
        "postal_code": "48215",
        "street_address": null,
        "latitude": 42.339054,
        "longitude": -83.04875
    }
}