{
    "job": {
        "title": "Data Entry/Analyst",
        "industry": "Automotive,Marketing and Advertising",
        "description": "Must Haves: 1-3 years data analysis experience Manipulating data lists, analyzing and re-analyzing data, pulling data from other sources, etc. Microsoft Office applications (MS Word, Excel) – must know basic data manipulation Pivot Tables and Vlookups are a nice to have Ability to work under pressure and move fast Strong attention to detail Team mentality, lots of juggling, team work Pluses: Proficient with building GMC and/or Fusion Pro work flows Experience with working with a postal software – First Logic Day to day: Work with internal clients (3 assigned account reps) that give requirements and job instructions Budget coordination, proofs, sign offs, data analysis in a 24-hr window Receive day to day direction from Individual Auto Account Executive Ability to comprehend written and/or verbal job instructions Works with postal software (i.e. First Logic) to perform USPS data hygiene (i.e. CASS, merge, purge, etc.) Ability to work in various data management software environments Manipulates data based on client requirements Provides proofs to internal client Prepares jobs for production floor Assists internal client with information pertaining to their jobs Provides various data counts Proficient with building GMC and/or Fusion Pro work flows Strong attention to detail & accuracy",
        "employment_type": "CONTRACTOR",
        "date_posted": "2021-07-09T17:44:18.000Z"
    },
    "company": {
        "name": "Insight Global",
        "link": "https://www.linkedin.com/company/insight-global"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 12,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "West Chicago",
        "region": "IL",
        "postal_code": "60185",
        "street_address": null,
        "latitude": 41.884655,
        "longitude": -88.2049
    }
}