{
    "job": {
        "title": "Software Engineer",
        "industry": "Information Technology and Services",
        "description": "A 6 month REMOTE Software Engineer job in Texas is currently available through Modis Engineering, formally Adecco group. This for an excellent, global renowned client. The pay rate is $62/HR. Daily Responsibilities On a daily basis , creating SailPoint Identity IQ components to support IAM Migration. In addition, unit testing, fixing bugs, and UAT testing Key Skills - Sailpoint, Java. Description: Deploy Identity Governance solution to meet customer requirements using Sailpoint Follow approved life cycle methodologies, create documentation for design and testing Proficient in Java Programming Interact/coordinate with customers as required Resolve technical issues through debugging, research, and investigation. Maintenance of security applications and service Supporting the application and the customers (here the customers are other domain teams – not the end user) Adhering to all standard SDLC and SPLC processes in developing the solutions and services Effective communication with partner teams & customer Assume best intentions Required: 4-8 years of industry experience in design, development, customization, configuration, deployment of any Identity Management and Governance products Minimum of 3 years’ experience in Sailpoint Hands on experience with Java based technologies, Microservices, Containerization, CI/CD (Continuous Integration/Continuous Delivery) Thorough domain knowledge on the below areas of IAG User Lifecycle Management, Provisioning and Reconciliation Auditing, Reporting and user activity Monitoring Access Certification Java/J2EE and strong SQL knowledge Knowledge of Web Services (REST/SOAP) Java/J2EE Sailpoint SQL / REST. Top 3 skills: Sailpoint Identity IQ Git Hub Merging / Rebasing, Java Experience in developing and testing If you are interested in this job, then please click APPLY NOW. For other opportunities available at Modis Engineering www.modis.com. If you have questions about the position, please contact Pragya Jain at 408-962-4980 or pragya.jain@modis.com.  Equal Opportunity Employer Minorities/Women/Veterans/Disabled",
        "employment_type": "CONTRACTOR",
        "date_posted": "2021-08-18T16:42:42.000Z"
    },
    "company": {
        "name": "Modis",
        "link": "https://ch.linkedin.com/company/modis"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 48,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Austin",
        "region": "Texas Metropolitan Area",
        "postal_code": "78723",
        "street_address": null,
        "latitude": 30.276316,
        "longitude": -97.70931
    }
}