{
    "job": {
        "title": "Senior GNC Engineer - Launch Vehicle and Spacecraft - GNC",
        "industry": "Defense &amp; Space",
        "description": "If you are a Senior GNC Engineer - Launch Vehicle and Spacecraft with experience, please read on! What You Will Be Doing Develop the algorithms that run within the flight software to control rockets and orbital spacecraft Write simulations, running on high-powered PC to simulate the physics of the rocket, flying it virtually into orbit and port that into hardware in the loop test bed, including real flight hardware. What You Need for this Position GNC GNC Engineer guidance Navigation and Control Simulation Flight Software 6-DOF C++ Python Simulink So, if you are a Senior GNC Engineer - Launch Vehicle and Spacecraft with experience, please apply today! Email Your Resume In Word To Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also: Richard.Marion@CyberCoders.com Please do NOT change the email subject line in any way. You must keep the JobID: linkedin : RM2-1633351 -- in the email subject line for your application to be considered.*** Richard Marion - Recruiting Manager - CyberCoders Applicants must be authorized to work in the U.S. CyberCoders, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-31T07:11:56.000Z"
    },
    "company": {
        "name": "CyberCoders",
        "link": "https://www.linkedin.com/company/cybercoders"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Oakland",
        "region": "CA",
        "postal_code": "94612",
        "street_address": null,
        "latitude": 37.80483,
        "longitude": -122.27248
    }
}