{
    "job": {
        "title": "Machine Learning Engineer",
        "industry": "Information Technology and Services,Transportation/Trucking/Railroad",
        "description": "RESOLVIT Bringing Solutions That Make Business Better Join Resolvit as a Machine Learning Operations Engineer and be part of a creative, forward-thinking team. Our success at deploying skilled, highly knowledgeable experts has landed us on the Inc. 5000 list of America’s fastest-growing companies four times – and we’re just getting started. As the Machine Learning Operations Engineer , you will implement, monitor, and maintain a suite of machine learning tools. You will bring your deep expertise in MLOps to analyze and recommend enterprise-wide solutions for operationalizing AI/ML analytics. You will also develop end-to-end Data, Dev, and MLOps pipelines based on in-depth understanding of AI lifecycle and business problems to ensure solutions are delivered efficiently, predictably, and sustainably. What You’ll Need to be Successful: At least 8 years of technical experience in a technology business At least 3 years of experience as a machine learning engineer Bachelor’s degree in engineering, physics, chemistry, mathematics, or computer science or relevant and significant industry experience Experience with AI/ML, video analytic edge computing, Kubernetes, and Docker solutions Proficiency in C/C++, Python, GO, or similar languages Proficiency with Computer Vision tools such as Open CV and Deep Learning Frameworks (Keras, TensorFlow, PyTorch) Experience deploying scalable AI solutions that solve industry problems Experience with structured and unstructured data Data engineering background Experience with data science models at scale Experience with MLOps tools (MLFlow) Benefits: At Resolvit, you’ll be given the support you need to grow in your consulting career. In addition to opportunities for advancement, we offer: Medical, dental, and vision insurance Life insurance coverage Long-term and short-term disability coverage 401(k) retirement plan with matching Professional support from our Client & Employee Optimization Specialist About Resolvit: Resolvit is an international technology consulting firm with industry-leading customers in the financial services, high tech, manufacturing, retail, life sciences, and government sectors. Through its partnerships, Resolvit delivers highly impactful, innovative solutions across five core areas: Infrastructure Modernization, Application Development Services, Enterprise Data Management & Analytics, Knowledge & Content Management, and Strategic Staffing.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-17T14:32:02.000Z"
    },
    "company": {
        "name": "Resolvit",
        "link": "https://www.linkedin.com/company/resolvit"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 96,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "United States",
        "region": null,
        "postal_code": "99999",
        "street_address": null,
        "latitude": 39.50355,
        "longitude": -99.0183
    }
}