{
    "job": {
        "title": "Software Engineer, Backend",
        "industry": "Marketing and Advertising,Computer Software,Internet",
        "description": "What's so interesting about this role? Our team is growing because our user base is growing (30% in the last year!) which means we need you! We're looking for a Backend Engineer who is passionate about building, testing, deploying and working closely with the Product team to deliver new features. You will have the opportunity to solve challenging problems, work with the latest systems, collaborate with a kind and capable team and contribute meaningfully. What's the job? Be a part of the engineering team where we implement new features and work closely with the product and design teams Build for the future by designing maintainable and well-tested systems to serve a global audience of millions of concurrent users (we're big!) Understand and improve Grindr's Backend Services and Third Party Integrations Troubleshoot unexpected issues across various systems because being the most popular is hard… and fun :) What We'll Love About You: 2-4 years of experience as a Software Engineer working on Backend Systems (Service APIs, Data Processing, Messaging Services) Passionate about testing software and systems Understanding of concurrency concepts and trade-offs You love figuring things out and understand how they work end-to-end We'll Really Swoon if You have any of: Experience developing Production systems using Java 8+, SQL, Kubernetes, Kotlin Experience developing or working with Continuous Integration and Continuous Delivery tools Experience designing large-scale Web or API systems for data consistency Experience with Cloud Services (any cloud!) Experience with Redis, RabbitMQ or Elasticsearch Experience with Big Data processing pipelines and tools What You'll Love About Us Global impact. Grindr is the world leading LGTBQ+ social networking service. Your role will impact the lives of millions of LGTBQ+ people around the world. High Growth. Like the company itself, this role offers significant room for growth and development Remote First: We have offices in LA, NYC, SF, Chicago, Toronto and Taipei, though the company is set-up not just as remote-friendly, but remote-first. More than 30% of our employees work outside the cities where we have offices. Today, we are set-up to hire easily in the US, Canada and Taiwan. If you live outside one of these countries, just let us know so we can make sure we can support you. Comp: Industry competitive compensation, including equity for all employees Benefits: Unlimited vacation policy Family insurance: We provide great insurance coverage for health, dental and vision for you and your family. Retirement Savings: Generous 401(k) plan Other Perks: home-office stipend, many company-sponsored events About Grindr Since launching in 2009, Grindr has grown into the world's largest social networking app for gay, bi, trans, and queer people. We have millions of daily users who use our location-based technology in almost every country in every corner of the planet. Today, Grindr proudly represents a modern LGBTQ+ lifestyle that expands into new platforms. From social issues to original content, we continue to blaze innovative paths with a meaningful impact for our community. At Grindr, we create a safe space where you can discover, navigate, and get zero feet away from the queer world around you. As of June 2020, Grindr has new owners with a track record of multiple successful Bay Area start-ups. The new leadership is demonstrating a renewed commitment to creating an experience for users that is safe, fun, and productive, as well as a positive & uplifting company culture in which everyone can be their best selves. At the heart of Grindr's mission in this new chapter is a shared set of core values including transparency, accountability, experimentation (failing fast), and strong allegiance to the LGBTQ+ community. Grindr is an equal opportunity employer. To learn more about how we handle the personal data of applicants, visit our Employee and Candidate Privacy Policy.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-18T17:19:12.000Z"
    },
    "company": {
        "name": "Grindr",
        "link": "https://www.linkedin.com/company/grindr"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Atlanta",
        "region": "GA",
        "postal_code": "30355",
        "street_address": null,
        "latitude": 33.748547,
        "longitude": -84.3915
    }
}