{
    "job": {
        "title": "Embedded Software Engineer - C Programming, Hardware, Systems",
        "industry": "Computer Hardware",
        "description": "If you are an Embedded Software Engineer with C programming experience, please read on! With locations around the world, we're a technology powerhouse on a mission to develop the next generation of cutting-edge, networking products and services for our customers! Due to explosive growth and increased demand for our products/services, we're looking to expand our embedded engineering team with talented programmers with C programming skills for embedded systems (hardware/firmware). Top Reasons to Work with Us Recognized industry leader! Competitive base salary and benefits! Opportunity for professional growth! What You Will Be Doing Responsible for developing, updating, and enhancing subsystems and portions of switch software using C and Python Analyze designs to determine programming, coding, and integration needs based on product, solution, or architecture knowledge Writing and executing test plans, protocols, and documentation Responsible for software systems design status updates, problem resolution, and project progress What You Need for this Position 3+ years of C Programming experience Embedded software development experience Design/architecture of software systems for embedded hardware/firmware Testing and debugging skills Bachelor's degree in Computer Science, Information Systems, or equivalent Pluses Networking technologies and product experience GIT version control Strong understanding of product life cycles Python What's In It for You Benefits For your hard work and dedication, you will be rewarded with a competitive base salary, RSUs and benefits including but not limited to Medical (HDHP + HSA, PPO, HMO, EPO, ACO options) Dental Vision Life AD&D 401(k) + Match Flexible Spending Account (FSA) Short Term and Long Term Disability So, if you are an Embedded Software Engineer with C Programming experience, please apply today! Email Your Resume In Word To Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also: Pat.Befort@CyberCoders.com Please do NOT change the email subject line in any way. You must keep the JobID: linkedin : PB2-1635326 -- in the email subject line for your application to be considered.*** Pat Befort - Recruiting Manager - CyberCoders Applicants must be authorized to work in the U.S. CyberCoders, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-31T07:01:33.000Z"
    },
    "company": {
        "name": "CyberCoders",
        "link": "https://www.linkedin.com/company/cybercoders"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Santa Clara",
        "region": "CA",
        "postal_code": "95050",
        "street_address": null,
        "latitude": 37.352394,
        "longitude": -121.95308
    }
}