{
    "job": {
        "title": "Software Engineer Intern",
        "industry": "",
        "description": "About Mobinity Global: Mobinity Global is a recruitment consultancy firm that helps companies such as Dell, Citadel, Qualtrics, PNC, Venture for America, RippleMatch, SAP, Robinhood, etc recruit faster and with more convenience. We are transforming the way recruiting is done in the digital age. We work with a number of top-tier companies, tech startups, freelance companies, Industry professionals, and subject matter experts for projects, internships, jobs, and freelance work. If you meet the below eligibility criteria , please apply and our recruitment team will connect with you to understand your strengths and strategize your career ahead. We plan to build a strong connection with all of our applicants so that we can facilitate both our employment partners now as well as in the future. Eligibility Criteria: Your year of graduation is 2020 or later. (Masters Candidates can also apply) You have a bachelor's degree in Computer Science, Data Science, Electrical Engineering or related analytical field of study from a USA university. You have an aspiration to work for companies such as Dell, Citadel, Qualtrics, PNC, Venture for America, RippleMatch, SAP, Robinhood etc. Your Key Accountabilities May Include The main responsibilities of the role will be: Independently complete basic coding tasks and provide careful code reviews. Participate in design sessions with particular focus on asking questions and understanding why the team makes the design decisions that they do. Working on Python, C++, etc. programming on time series analysis including plotting, calculations, and summarizing. Data management, database queries, and other desktop applications. Prepare and conduct effective presentations, participation in client meetings and interaction with clients and subcontractors. Work on multiple, unique assignments simultaneously in a fast-paced environment. Exercise judgment on details of work and in making preliminary selections and adaptations of engineering alternatives. Requirements: Highly motivated with a desire to learn. Proficient in Microsoft Excel. Be a great teammate — contribute quality work, help out, be flexible, and adapt easily to changing product needs based on customers and the market. Benefits: Shadowing, mentoring, and training opportunities. Fast-paced work environment. Opportunity to attend weekly meetings and occasional networking events. Compensation available. Apply NOW and we'll connect with you to explore your best matches!",
        "employment_type": "INTERN",
        "date_posted": "2021-10-18T00:31:00.000Z"
    },
    "company": {
        "name": "Mobinity Global",
        "link": "https://www.linkedin.com/company/mobinity-global"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Los Angeles Metropolitan Area",
        "region": null,
        "postal_code": "90021",
        "street_address": null,
        "latitude": 34.073666,
        "longitude": -118.23985
    }
}