{
    "job": {
        "title": " Encroachment/Right of Way Inspector ",
        "industry": "Utilities",
        "description": "We are currently seeking an Encroachment/ROW Inspector to join our team. The ideal candidate would be familiar with Utility Vegetation Management, enjoys a mix of work from home and fieldwork, is a self-starter, and values the freedom of working independently. If you enjoy a fast-paced environment and the challenges of a rewarding profession, consider a career with ECI. This role typically requires 75% work from home and 25% fieldwork but is subject to change based on work requirements on any given day. During these uncertain times, you can take pride in knowing you are an essential employee . Our team members work independently and follow all CDC recommended guidelines and company safety protocols relevant to COVID-19. Some of the most important characteristics of ECI Encroachment/ROW Inspector is that you are open-minded and able to engage in safe, constructive interactions with the public. You are accountable for advancing a culture of safety and excellence while providing quality and value to our customers and clients. WHAT WE OFFER: Industry competitive pay. Company vehicle with a fuel card to take to and from home & work. Medical/Health/Dental/Vision/Life Insurance, effective Day 1 for full-time team members. 401K eligibility. Paid Holidays, Vacation, and Sick Leave. Weekly paychecks and direct deposit. Participation in Employee Referral Program (must meet eligibility requirements). Boot and clothing program (company-funded). Ongoing training and assistance with obtaining industry certifications. WHAT YOU WILL DO: Resolve encroachment issues by building trust with landowners and internal stakeholders. Manage one or more concurrent projects spread across different geographical locations. Read and interpret transmission construction engineering plans. Negotiate landowner encroachment agreements. Maintain detailed records. Execute memorandum of understanding (MoU) with landowners. Communicate daily with the utility client, contractors, landowners, and the general public. Perform duties in a manner that will promote and maintain good public relations and work safety practices. Assume other duties and responsibilities as assigned. WHAT YOU NEED TO HAVE: Ability to understand and interpret engineering plans. Strong negotiation skills are a must. Must be able to work alone, outdoors in various weather conditions and terrain. Must have exceptional interpersonal and communication skills, strong problem solving and multi-tasking abilities, and demonstrated attention to detail. Must be able to adapt to change. Must have basic computer skills. WHAT WOULD BE AMAZING TO HAVE: A degree in Forestry, Engineering, or related field is a plus. Prior utility or utility vegetation management (UVM) or related fieldwork experience is a plus. Previous project management experience is desired. ISA Arborist Certification preferred Bi-Lingual (Spanish) is a plus. Physical Fieldwork can require extended periods of time driving to the worksite and accessing encroachments and/or property owner residences. Company Overview Environmental Consultants (ECI) is a leading provider of vegetation and asset management consulting services to the utility industry. Successful professionals at ECI have come from a variety of backgrounds, including: forestry, arboriculture, natural resource management, biology, landscape maintenance, horticulture, nursery management, environmental sciences, geology, agriculture, parks & recreation management, urban forestry, geography, and more. ECI offers exciting career opportunities with an excellent compensation package and ongoing growth potential. Applicants must pass a pre-employment drug test and a criminal background check. All candidates must possess a valid driver's license and have a good driving record. ECI is an Equal Opportunity and Affirmative Action Employer. EOE/AA : Minority/Female/ Vets/ Disabled.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-25T17:28:09.000Z"
    },
    "company": {
        "name": "Environmental Consultants (ECI)",
        "link": "https://www.linkedin.com/company/environmental-consultants-inc"
    },
    "education": {
        "required_credential": null
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Asheville",
        "region": "NC",
        "postal_code": "28805",
        "street_address": null,
        "latitude": 35.595913,
        "longitude": -82.55004
    }
}