{
    "job": {
        "title": "Associate Data Scientist",
        "industry": "Information Technology and Services,Retail,Financial Services",
        "description": "About Gap Inc. Our brands bridge the gaps we see in the world. Old Navy democratizes style to ensure everyone has access to quality fashion at every price point. Athleta unleashes the potential of every woman, regardless of body size, age or ethnicity. Banana Republic believes in sustainable luxury for all. And Gap inspires the world to bring individuality to modern, responsibly made essentials. This simple idea—that we all deserve to belong, and on our own terms—is core to who we are as a company and how we make decisions. Our team is made up of thousands of people across the globe who take risks, think big, and do good for our customers, communities, and the planet. Ready to  learn fast, create with audacity and lead boldly? Join our team. About The Role The Product Analytics Team at Gap Inc. is a research team that applies techniques from operations research and machine learning to drive business benefits for Gap Inc. and its brands. The team’s focus is creating analytical capabilities to support product operations at Gap Inc. Areas of expertise include demand forecasting, inventory replenishment, inventory and supply chain optimization, pricing, product testing, product attributes, flexible inventory and supply chain initiatives What you'll do Build, validate, and maintain Operations Research (OR) and/or AI( Machine Learning (ML) /Deep learning), models Work with large quantities of data in scripting languages Synthesize findings, prepare presentations and assist in presenting findings to all levels of management Provide framework/methodology for measurement and feedback mechanism for models Collaborate within the team and outside the team to solve a complex problem Who you are Bachelor’s/Advanced degree in Operations Research, Statistics, Math, Computer Science, Industrial Engineering or related field preferred Proven experience in areas of optimization, statistics, machine learning, and inventory theory Ability to develop and apply analytic solutions to solve business problems Skills to collaborate with cross-functional teams and influence product and analytics roadmap Hands-on experience with data analysis, statistical, optimization and simulation packages (SQL, Python, SAS, Tensorflow, Hive, etc) Notice to applicants in San Francisco: Gap Inc. and its related brands will consider for employment, qualified applicants with criminal histories in a manner consistent with the San Francisco Fair Chance Ordinance. The Fair Chance Ordinance is provided here: English Spanish Chinese Tagalog Benefits at Gap Inc. Merchandise discount for our brands: 50% off regular-priced merchandise at Old Navy, Gap, Banana Republic and Athleta, and 30% off at Outlet for all employees. One of the most competitive Paid Time Off plans in the industry.* Employees can take up to five “on the clock” hours each month to volunteer at a charity of their choice.* Extensive 401(k) plan with company matching for contributions up to four percent of an employee’s base pay.* Employee stock purchase plan.* Medical, dental, vision and life insurance.* See more of the benefits we offer. For eligible employees Gap Inc. is an equal-opportunity employer and is committed to providing a workplace free from harassment and discrimination. We are committed to recruiting, hiring, training and promoting qualified people of all backgrounds, and make all employment decisions without regard to any protected status. We have received numerous awards for our long-held commitment to equality and will continue to foster a diverse and inclusive environment of belonging. This year, we’ve been named as one of the Best Places to Work by the Humans Rights Campaign for the fourteenth consecutive year and have been included in the 2019 Bloomberg Gender-Equality Index for the second year in a row.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-05T04:33:25.000Z"
    },
    "company": {
        "name": "Gap Inc.",
        "link": "https://www.linkedin.com/company/gap-inc-"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "San Francisco",
        "region": "CA",
        "postal_code": "94121",
        "street_address": null,
        "latitude": 37.78008,
        "longitude": -122.42016
    }
}