{
    "job": {
        "title": "Senior Java Software Engineer",
        "industry": "Information Technology and Services",
        "description": "Title - Senior Java Software Engineer Type - Fulltime Location - San Jose, California, United States Requirements: Four or more years of programming experience in Java, Scala and or/ Python. Two or more years of experience in AWS or other Cloud platforms like Azure/GCP Two or more years of experience in Kafka or other messaging technologies such as Google Pub/Sub, RabbitMQ Three or more years of experience in one or more databases: noSQL databases like MongoDB, Cassandra or relational databases like DynamoDB/Aurora Experience with development frameworks, monitoring tools, command-line applications (Spring Boot, git, ssh, grafana/prometheus/datadog) and other aspects of developing in large, distributed software teams Experience in one or more unit and e2e testing frameworks like JUnit, JMeter, Locust, BlazeMeter Exposure to Big Data pipelines and technologies. Responsibilities: Work across technology boundaries (networking, compute, security, storage, analytics) to develop cloud native microservices to meet the strategic needs of the company Develop a scalable system using Cloud development paradigms and constructs of distributed deployment Ability to create quality code with good development and test practices that produce least amount of issues in the field Work closely with Product Management and the CTO group to define the product architecture and leads its development Assist with pre-sales customer discussions to understand the Enterprise deployment models and their requirements.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-17T07:28:24.000Z"
    },
    "company": {
        "name": "Avesta Computer Services",
        "link": "https://www.linkedin.com/company/avesta-computer-services"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 48,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "San Jose",
        "region": "CA",
        "postal_code": "95148",
        "street_address": null,
        "latitude": 37.334793,
        "longitude": -121.888145
    }
}