{
    "job": {
        "title": "Machine Learning Engineer",
        "industry": "Internet,Automotive,Consumer Services",
        "description": "This position is a great opportunity for an entrepreneurially-minded person who enjoys making a difference in a start-up environment. Looking for a Machine Learning Engineer to both create and extend existing models. Responsibilities Build, extend, deploy, maintain, and troubleshoot machine learning solutions to help drive business metrics. Collaborate with analytics and data teams to optimize machine learning model performance and data pipelines. Ensure our relevancy in the field of machine learning by staying up to date on the latest ML techniques and become the subject matter expert within the company. Develop solutions to complex problems without considerable technical direction. Qualifications and Experience 2-4 years of experience as a machine learning engineer or data scientist Experience with developing software in object-oriented programming languages, including Python, Scala, Java, or C++ Experience with machine learning tools, including Tensorflow, Pytorch, or Scikit Learn Proven and demonstrated experience with data preparation, building, scaling, and optimizing machine learning solutions Self-driven, organized, reliable and determined team player Thinks analytically and solves complex problems within a team structure Flexible and able to adapt to new processes and requirements in a dynamic environment Strong, clear and concise written and verbal communication skills Advocates for innovation and drives change through persuasion and consensus Translates issues/problems into solutions with tangible changes that improve the team or the organization ***Unfortunately, this position does not offer work sponsorship at this time*** Keywords: machine learning, ML, engineering, data science, programming, models, modeling, python, tools, data, building, deploying, scaling, troubleshooting, maintaining, strategy",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-05T17:46:27.000Z"
    },
    "company": {
        "name": "Burtch Works",
        "link": "https://www.linkedin.com/company/burtch-works"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "United States",
        "region": null,
        "postal_code": "99999",
        "street_address": null,
        "latitude": 39.50355,
        "longitude": -99.0183
    }
}