{
    "job": {
        "title": "Software Engineer - Backend Services",
        "industry": "Information Technology and Services,Computer Software,Internet",
        "description": "What You’ll Do As a Software Engineer in the Firmware department, you will be contributing to the development of Leia Inc’s core technology consisting of display systems, camera systems, and APIs for developers. Your responsibilities will include (but are not limited to): Contributions to all phases of software engineering lifecycle. Requirements gathering, project planning, system testing, system prototyping, and troubleshooting of existing system Participate in scrum/agile activities (eg. stand ups, sprint planning) Documents requirements, system architecture, test plan and test cases. Participate in the research, recommendation and architecture discussion. Projects you might work on: 4V Camera App using Camera2 API ToF camera Android integration Sensor Fusion Head Tracking This is a position based at Leia Inc’s headquarters in Menlo Park. What You’ll Have Experience with Android application development Experience with camera2 API and third party API Experience with OpenGL graphic programming Strong communication and team player Minimum BS degree in EE, CE, CS or equivalent experience Nice to Haves C++ development Experienced with multi-core/multi-CPU environments Building API interfaces for external app integration Light up Life At Leia we are working at the forefront of display technology — making screens come to life in richer, deeper, and more beautiful ways. We apply our proprietary nanotechnology to give any display the ability to produce Lightfield, immersive “holographic” content — no glasses, no tracking, no fuss. Come join a team that’s ready to redefine the digital experiences of tomorrow! What We Offer In order to assemble top talent to help realize this mission Leia offers our employees: Competitive Compensation Package Medical, Dental, and Vision Plan Retirement Savings Plan 401(k) Catered lunch and dinner daily (Dependent on Location) Stocked kitchen with healthy (and unhealthy) snacks and beverages Onsite workout facility (Dependent on Location) Leia Inc. is an Equal Opportunity Employer. Candidates are evaluated without regard to age, race, color, religion, sex, disability, national origin, sexual orientation, veteran status, or any other characteristic protected by federal or state law.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-30T05:20:52.000Z"
    },
    "company": {
        "name": "Leia Inc.",
        "link": "https://www.linkedin.com/company/leia-inc-"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Los Angeles",
        "region": "CA",
        "postal_code": "90101",
        "street_address": null,
        "latitude": 34.05224,
        "longitude": -118.24335
    }
}