{
    "job": {
        "title": "Machine Learning Engineer",
        "industry": "Computer Software,Consumer Services,Information Technology and Services",
        "description": "About the job We are a hyper-growth eCommerce start-up with a mission to bring a smile to people's faces by connecting them to products that bring nourishment, love, memories, connection, nostalgia, and comfort. We've recently closed our Series C funding for $110M and are looking to scale our AI & Data practice. We are looking for a top Machine Learning Engineer to join our team in New York. You will be joining a small team of experienced ML engineers and have the opportunity to learn and have a significant impact on mission critical projects. The team is building deep learning models for RecSystems, Personalization, and Search functionality. Core Responsibilities Collaborate with cross-functional teams of data scientists, data engineers, software engineers, and machine learning engineers. Research and implement best-in-class ML approaches to e-commerce problems. Develop a deep subject matter expertise of how our marketplace functions across the entire user journey Own and iterate upon our various recommendation , personalization, and search engines. Oversee end-to-end model lifecycle development Deploy ML models into production Drive meaningful ROI and impact upon our full funnel acquisition and retention Basic Qualifications B.S. in a quantitative field i.e. Computer Science, Engineering, Physics, Mathematics, etc. 1-5 years of experience building production level Machine Learning models Excellent programming and debugging skills in Python Experience with deep learning frameworks & libraries i.e. PyTorch, Tensorflow, etc. Strong ML background in at least one of the following areas: NLP, Search, recommendation, personalization, ranking/relevance, etc. Nice to Have: Advanced Degree in a quantitative field (M.S. / Ph.D) Direct E-Commerce Experience",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-17T15:10:54.000Z"
    },
    "company": {
        "name": "Alldus",
        "link": "https://ie.linkedin.com/company/alldus"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 12,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "New York City Metropolitan Area",
        "region": null,
        "postal_code": "10021",
        "street_address": null,
        "latitude": 40.748295,
        "longitude": -73.98556
    }
}