{
    "job": {
        "title": "DevOps Engineer",
        "industry": "Information Technology and Services,Computer Software,Financial Services",
        "description": "Years of Experience 7 years Education Requirements Bachelor’s Degree Position Description CI/CD Engineer is responsible for the set-up, maintenance, and ongoing development of continuous build/integration infrastructure. Requirements Responsibilities Create and maintain fully automated CI build processes for multiple environments Write build and deployment scripts Support CI/CD tools integration/ operations/ change management, and maintenance Support full automation of CI/Testing Develop policies, standards, guidelines, governance and related guidance for both CI/CD operations and for work of developers On-board/ train and support developers from source control, through build automation, merge resolution, CI, test automation, deployment based on tools usage and policies, standards Enable DevOps by moving code from Dev/Test to Staging and Production. Troubleshoot issues along the CI/CD pipeline Good understanding of Quality Control and Test Automation in Agile-based Continuous Integration environments Required Skills 3-5 years of experience building DevSecOps pipelines for implementing CI/CD for cloud applications. Possess deep expertise in scripting languages like Bash, Python and Groovy and are very skilled in troubleshooting deployment issues on AWS. Have minimum 3 years of experience managing resources on AWS. Possess deep expertise in many tools from the DevSecOps tool chain. Working knowledge of fundamental Linux systems administration. Working knowledge of fundamental Windows Systems administration. Certifications AWS Solutions Architect (Associate) or Developer (Associate) Must be able to obtain a public trust security clearance Preferred Skills Previous experience with VA and working on VA legacy systems for Education Service Soft Skills Organizational Skills Can plan and prioritize work. Follows tasks to their logical conclusion and makes sure that everything has been done to the right standard. Good attention to detail. Team Work Able to enthuse and maintain project interest. Comfortable working both individually and as part of a team. Prepared to challenge ideas within a group in a constructive way. Communications Ability to communicate clearly and efficiently to team members and clients, verbally and in writing. Able to present ideas in a variety of ways depending upon audience and context. Excellent active listening skills. Quantitative Management Ability to determine process measures and track to determine process effectiveness and efficiency. Results oriented Able to drive things forward regardless of personal interest in the task. Benefits SES provides a competitive salary and the following benefits Medical Dental Vision AD&D STD LTD Company paid Life Insurance 401k with employer contribution Paid Time Off",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-06T15:59:48.000Z"
    },
    "company": {
        "name": "SES Corporation",
        "link": "https://www.linkedin.com/company/ses-corporation"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Chantilly",
        "region": "VA",
        "postal_code": "22022",
        "street_address": null,
        "latitude": 38.888687,
        "longitude": -77.417496
    }
}