{
    "job": {
        "title": "Research or Sr. Research Scientist, Bioprocess",
        "industry": "Biotechnology",
        "description": "Your challenges Develop and execute experiments to validate, support and promote current products and new product development in bioprocess. Present and analyze data in a clear, concise format and write drafts of application notes. Provide training to Eppendorf employees and customers. Work closely with others in the Bioprocess Business Unit to provide technical input. Produce research reports, protocols, and application notes for internal and external publications. Evaluate new technologies or products for potential integration into bioprocess product portfolio. Evaluate novel and competitive cell culture and fermentation techniques and equipment findings. Your expertise Ph.D. degree in Biology, Biochemistry, Bioprocess, Bioengineering or other related life science advanced degrees required. 2-6 years of experiences in mammalian cell culture and bacteria fermentation. 2-6 years of hands-on experiences working with bioreactors/fermentors in R&D, PD, Applications lab or Bio pharmaceutical settings required. Software programming experiences in Visual Basic required. Bioprocess engineering, bioreactor design and scale-up experiences desired Your benefits at Eppendorf Competitive total rewards package including health, financial, and education benefits Innovative and Collaborative company culture Work in state of the art laboratory Contribute to the improvement of the human living condition Please note that we can only consider applications that are submitted online via our application management tool.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-09-02T05:58:53.000Z"
    },
    "company": {
        "name": "Eppendorf Group",
        "link": "https://de.linkedin.com/company/eppendorf"
    },
    "education": {
        "required_credential": null
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Enfield",
        "region": "CT",
        "postal_code": "06083",
        "street_address": null,
        "latitude": 41.9765,
        "longitude": -72.59199
    }
}