{
    "job": {
        "title": "Senior Data Scientist - Clinical, Medical and Regulatory",
        "industry": "Pharmaceuticals",
        "description": "About The Department The Clinical, Medical and Regulatory (CMR) department at Novo Nordisk is one of the most diverse and collaborative groups within the organization. From health-care-provider interactions and developing and implementing regulatory strategies with the Food & Drug Administration (FDA) to providing medical education and collecting data to support efficacy and new product development, CMR is involved. The one thing that keeps us all marching to the same beat is our patient-centered focus. At Novo Nordisk, you will help patients around the world. As their needs evolve, so does our challenge to find better and more innovative ways to improve their quality of life. We’re changing lives for a living. Are you ready to make a difference? The Position The Senior Data Scientist will help drive the Novo Nordisk Inc (NNI) Scientific Analytics vision to explore and develop new solutions that may hold the potential to add value to patients and Novo Nordisk in the future within therapeutic areas covered by Novo Nordisk corporate and commercial strategies. The Senior Data Scientist will build machine learning-based tools and processes, identify and deliver dynamic and reliable analytics products and services by leveraging internal and external data to enable faster decision making across Novo Nordisk; contributing to the growth, competitiveness, and innovation of the company. Acts as an internal analytics consultant to understand the needs of stakeholders, build strategic relationships, and develop/implement innovative solutions that address the needs of the business. The Senior Data Scientist will work with similar roles in Novo Nordisks Big Data Analytics COE, Health Economics & Outcomes Research (HEOR) Analytics, and HR People Research and Analytics to help foster and grow a community of predictive and prescriptive analytics. Relationships This position reports the head of Scientific Analytics. Internal relationships include other departments in CMR, including HEOR, Clinical Trial Management, Global Drug Discovery, Global Research Technologies, Global Medical Affairs, Regulatory and Safety, & International Operations, as well as with other data science units globally. Mentors Analytics/Data Science interns and junior departmental staff and oversees projects with external vendors. Extended internal relationships include other Data Science departments across NNI, e.g. Commercial Insights & Analytics, and HR Analytics. External relationships include external collaboration partners, as relevant. Essential Functions Collaborate with business stakeholders to define business problems and to design solutions using advanced analytics. Strategically analyses technology landscape to develop and deliver novel analytics solutions and services (NLP, AWS, data acquisition & preparation, ML tools). Regularly and adeptly uses best in class technology tools for maximum business impact Explores and introduces new data driven approaches to generate business insights to address unanswered business problems Expertly understands and incorporates analytics best practices and keeps on top of emerging tools and practices. Leads the development of new and creative analytics solutions that will become part of our core deliverables. Ability to quickly understand new concepts and implement novel designs to advanced data science problems Participates in large and complex analytics projects; understands stakeholder needs; demonstrates thorough understanding of data and directs data preparation activities. Rapidly designs, prototypes, and implements automated data workflows. Understands all aspects of project management (i.e. project charters & timelines, projects workshops, meeting facilitation, requirements gathering, communications, etc.) Provides rigorous assessment of the accuracy, validity, and reliability of machine learning models. Validates, interprets and presents data findings to key stakeholders. Translates machine learning models into production ready tools for end users and drives intelligent analytics solutions. Strong understanding of the strengths and limitations of data sources & tools, emerging technologies, and analytics trends. Understands predicative modelling, machine learning algorithms and advanced statistics Works closely with key stakeholders to understand current issues, anticipate future needs, and determine potential solutions Communicates to ensure efficient knowledge sharing and collaboration across CMR Presents complex interdisciplinary issues at internal/external meetings. Presents work to multiple departments with both strategic and tactical recommendations that are business focused Leads the development of new standards and/or practices. Applies analytical capability and insight to tasks to build support for new standards and/or practices across departments Collaborates with other Scientific Analytics team members to ensure overall integration of products and services. Leads and drives information analysis projects. Contributor and occasionally project leader on cross-functional and cross-departmental projects. Creates and uses project plan to drive complex projects Physical Requirements 0-10% overnight travel required. Qualifications Bachelor's degree with minimum of 7 years’ relevant experience. Advanced degree preferred Advanced degree may be substituted for experience as appropriate Advanced degree in Information Science (MIS), Informatics, Mathematics, Engineering, Statistics (MS) or related field (MS) strongly preferred Excellent organizational, communication, and presentation skills Excellent organizational, communication, and presentation skills Advanced skills in Natural Language Processing, data mining, predictive models, machine learning models, information visualization concepts and tools Experience with cloud analytics platforms & tools (i.e., AWS platform & services, R, Python, SQL, etc.) Experience developing and implementing working, scalable Machine Learning & AI models & code Expert level understanding of deep learning algorithms & models Advanced skills in data acquisition and preparation (web scraping, data cleansing, ETL, etc.) Subject matter familiarity in one or more disease areas of interest to Novo Nordisk We commit to an inclusive recruitment process and equality of opportunity for all our job applicants. At Novo Nordisk we recognize that it is no longer good enough to aspire to be the best company in the world. We need to aspire to be the best company for the world and we know that this is only possible with talented employees with diverse perspectives, backgrounds and cultures. We are therefore committed to creating an inclusive culture that celebrates the diversity of our employees, the patients we serve and communities we operate in. Together, we’re life changing. Novo Nordisk is an equal opportunity employer. Qualified applicants will receive consideration for employment without regard to race, ethnicity, color, religion, sex, gender identity, sexual orientation, national origin, disability, protected veteran status or any other characteristic protected by local, state or federal laws, rules or regulations. If you are interested in applying to Novo Nordisk and need special assistance or an accommodation to apply, please call us at 1-855-411-5290. This contact is for accommodation requests only and cannot be used to inquire about the status of applications.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-09-08T03:07:10.000Z"
    },
    "company": {
        "name": "Novo Nordisk",
        "link": "https://dk.linkedin.com/company/novo-nordisk"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 84,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Plainsboro Center",
        "region": "NJ",
        "postal_code": "07001",
        "street_address": null,
        "latitude": 40.332214,
        "longitude": -74.58999
    }
}