{
    "job": {
        "title": "Payroll &amp; Benefits Administrator",
        "industry": "",
        "description": "Requisition # 1125 POSITION TITLE: Payroll and Benefits Administrator - This is not an entirely remote position but Hired offers a hybrid schedule working from home and office. Hiring Wage: $24.50 - $25.50 per hour Full Time Hired Overview At Hired, we believe every person is one good job away from a stable and promising future. We specialize in supporting individuals whose opportunities have been shaped by historic and systemic inequities. We strive to provide coaching and skill-building opportunities at every step of their journey while helping individuals stabilize by meeting their basic needs and navigating systems of support. Through the culmination of these efforts, we believe will ultimately enable them to provide for their families, advance in their career, and pursue their purpose. We look for these skills in a talented individual to join our team and strive to cultivate an environment that harnesses the collective power of these values and experiences each team member brings in pursuit of Hired’s mission and values. Hire’s mission is to nurture purpose and advance economic opportunity for all through individualized employment and career services. Our values include: Putting People First Going the Extra Mile Advancing Equity Working Together POSITION DESCRIPTION/PRIMARY OBJECTIVE HIRED is seeking a Payroll and Benefits Administrator. Hired payroll is processed using ADP Time and Attendance and Payroll. Previous experience with ADP Workforce Now is desirable. This person will work in partnership with the HR Director and Accounting Team. Hired offers a partial schedule working from home and the office. CORE RESPONSIBILITIES: Payroll Analyze, prepare, and input payroll data. Use payroll and time & attendance systems to produce accurate and timely payroll, including garnishments, child support, direct deposit, retirement plan, misc. deductions, and tax withholding updates. Ensure accurate payroll and benefit processing. Maintain up-to-date labor allocations in payroll system. Create and process journal entries for payroll, payroll, and vacation accruals. Maintain current knowledge of and ensure compliance with all applicable state and federal wage laws. Resolve payroll problems, respond to inquiries, and enforce payroll policies. Process and manage W-2 reporting and review quarterly tax returns for accuracy. Complete account reconciliations for payroll and benefit liability accounts. Payroll processing for Program Interns Set up interns in ADP for payroll processing Process I-9’s for new interns Prepare MN Wage Notice Receive paper timesheets for interns and process payroll. Coordinate delivery options with front desk and Youth counselors. Set up sick and safe accrual in ADP. Prepare monthly intern billing report for Youth Program Director and accounting Benefits Administration Process benefit enrollments, changes, and terminations. Ensure timely communication is sent to third party COBRA administrator. Communicate with 401K vendor and ensure timely remittance of employee and employer contributions. Run ADP reports to reconcile monthly benefit invoices prior to sending to accounts payable for payment. Partner with HR Director during open enrollments – Update benefit changes and set up open enrollment. HR and Administrative Support Administer parking and office access cards for North Loop Office Process background checks and I-9’s for new hires. Conduct new hire orientation in absence of HR Director. Train new hires in ADP timesheet entries and paid time off requests. Set up and maintain personnel files for new hires. Periodically cover for front desk receptionist as needed. All Hired employees must carry out their responsibilities in the spirit of equity and inclusion; and to actively participate in intercultural development trainings and events. Minimum Requirements Two years’ post-secondary education and three years’ experience with payroll administration and management. Efficient organizational and planning skills. Effective time management and ability to prioritize work. Excellent customer service. Skill in written and oral communication. Ability to work effectively with others. Ability and willingness to respond constructively to rapid change Computer proficiency (especially in Excel and Outlook) Preferred Experience/Credentials Previous experience processing payroll in ADP Workforce Now. Certified Payroll Profession (CPP) Knowledge of grant-funded payroll. Benefit offerings include Health and Dental; Health Savings Account (HSA), Flexible Spending Accounts (FSA); Employer Paid Short- & Long-Term Disability Insurance, Employer Paid Life Insurance; Paid Vacation, Personal Health and Holidays; 401(K) Retirement Plan with Employer Contribution; Voluntary Life, Vision and Legal Insurance. Hired is an Equal Opportunity Employer. Qualified applicants are considered for employment without regard to age, race, color, religion, national origin, sexual orientation, gender identity, disability, or veteran status. Apply online at www.hired.org/about/careers",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-25T17:24:09.000Z"
    },
    "company": {
        "name": "Hired",
        "link": "https://www.linkedin.com/company/hired"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Greater Minneapolis-St. Paul Area",
        "region": null,
        "postal_code": "55401",
        "street_address": null,
        "latitude": 44.981667,
        "longitude": -93.27795
    }
}