{
    "job": {
        "title": "Site Reliability Engineer, Americas",
        "industry": "Information Technology and Services,Computer Software,Internet",
        "description": "This role is an opportunity for a hands-on technologist with a passion for Linux to build a career with Canonical and drive the success with those leveraging Ubuntu and open source products. If you have an affinity for open source development and a passion for technology, then you will enjoy working with some of the best people in the industry at Canonical. Job Summary: The IS Team at Canonical supports and maintains all of Canonical's production services. Members of the team use real-life operational experiences to contribute to product improvements. The team is in charge of running services used by over 60 million Ubuntu users. As an SRE you'll be in a unique position to improve Canonical products and the open-source technologies they're based on. You'll do this by providing critical feedback to developers on how their products operate at scale as well as writing code, submitting bugs, and working with other teams within the company. You will also be encouraged to develop and submit fixes and enhancements directly and to collaborate with development teams during the design and implementation phases. You'll be part of a global team of SREs that work together and support each other to provide the best possible services to our company, Canonical's customers and the Ubuntu Community. As a Site Reliability Engineer you will: Maintain operational responsibility for all of Canonical's core services, networks, and infrastructure Develop new features and improve the resilience and scalability of the existing cloud and container portfolio at Canonical Automate operations for reuse across the worlds largest companies, taking into consideration the complexities of distributed systems Develop skills in troubleshooting, capacity planning, and performance investigation Collaborate with development teams to design service architecture, documentation, playbooks, policies and operational procedures Provide assistance and work with globally distributed engineering, operations, and support peers Be given uninterrupted software development time to focus on larger coding projects and automation of manual tasks Carry final responsibility for time-critical escalations The successful Site Reliability Engineer candidate will have: Bachelor's degree or greater, preferably in computer science or related engineering field A passion for writing, sharing, and maintaining enterprise open-source software solutions Python software development experience, with large projects Strong modern engineering background (peer-review, unit testing, SCM, CI/CD, Agile) Preference for treating configuration as code and automating to reliably solve problems Extensive knowledge of cloud computing concepts and technologies Practical knowledge of Linux networking, routing, and firewalls Hands-on experience administering enterprise Linux servers Able to communicate clearly and effectively in English over email, chat, video or voice calls and in-person Motivated and able to troubleshoot from kernel to web, and willing to ask others when appropriate A willingness to be flexible and able to learn new things quickly Be inspired by the needs of fast-changing environments Happy to work within distributed teams Be passionate and familiarized about open-source, especially Ubuntu or Debian About Canonical Canonical is a growing, international software company that works with the open-source community to deliver Ubuntu -- the world's #1 cloud operating system. Our mission is to realize the potential of free software in the lives of individuals and organisations. Our services are helping businesses worldwide to reduce costs, improve efficiency and enhance security with Ubuntu. We offer: 100% Work-from-home Learning and Development Recognition Rewards Annual Leave Priority Pass for travel Flexible working option Canonical believes a diverse workforce enhances our ability to deliver world class software and services which meet the world's computing needs. We are committed to ensuring equal employment opportunities to all qualified persons. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. #stack",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-30T17:16:28.000Z"
    },
    "company": {
        "name": "Canonical",
        "link": "https://uk.linkedin.com/company/canonical"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Baltimore",
        "region": "MD",
        "postal_code": "21226",
        "street_address": null,
        "latitude": 39.290443,
        "longitude": -76.612335
    }
}