{
    "job": {
        "title": "Full Stack Software Engineer ",
        "industry": "Information Technology and Services",
        "description": "Optomi in partnership with a major sports association who is looking for a junior level Full Stack Developer. This association is looking for someone eager and willing to have all hands on deck. The ideal candidate will work well in a collaborative environment and obtain great communications skills. Join a team of proud, passionate, and caring people that together share their diverse talents and backgrounds to serve the members of the association. Must Have Skills/ Requirements: Bachelor’s Degree (B.S.) in Computer Programming, Computer Science or related field. 2+ years experience. Full stack development experience. Has worked with Ruby on Rails. Test driven development. Web frameworks. What The Candidate Will Enjoy: Working for a major sports association to design, develop, test, deploy, maintain and improve software! Managing individual project priorities, deadlines and deliverables! Helping build a world-class team and cultivate innovation! Leading designs of major software components, systems, and features! Mentoring and training other team members on new technologies, design techniques, and coding standards!",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-17T13:34:42.000Z"
    },
    "company": {
        "name": "Optomi",
        "link": "https://www.linkedin.com/company/optomi"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Dallas-Fort Worth Metroplex",
        "region": null,
        "postal_code": "75049",
        "street_address": null,
        "latitude": 32.7513,
        "longitude": -97.08263
    }
}