{
    "job": {
        "title": "Full Stack Software Engineer - Apple Media Products, Apps",
        "industry": "Consumer Electronics",
        "description": "Summary The Apple Media Products Engineering team is one of the most exciting examples of Apple’s long-held passion for combining art and technology. These are the people who power the App Store, Apple TV, Apple Music, Apple Podcasts, and Apple Books. And they do it on a massive scale, meeting Apple’s high expectations with high performance to deliver a huge variety of entertainment in over 35 languages to more than 150 countries These engineers build secure, end-to-end solutions. They develop the custom software used to process all the creative work, the tools that providers use to deliver that media, all the server-side systems, and the APIs for many Apple services. Thanks to Apple’s unique integration of hardware, software, and services, engineers here partner to get behind a single unified vision. That vision always includes a deep commitment to strengthening Apple’s privacy policy, one of Apple’s core values. Although services are a bigger part of Apple’s business than ever before, these teams remain small, nimble, and cross-functional, offering greater exposure to the array of opportunities here. Key Qualifications Strong programming and debugging skills in Java JavaScript/React for front end development Python (TensorFlow/PyTorch/Keras) for application of ML models Knowledge of Swift or Objective-C a bonus, but not required Experience in building consumer-facing single-page applications in JavaScript ES6+, HTML/CSS Experience with developing rich, interactive and well-performing user interfaces using frameworks like React Working experience with RDBMS&NoSQL, technologies like PostgreSQL/Cassandra Docker and Kubernetes for internal cloud infrastructure Excellent writing and interpersonal skills We don’t expect prior experience with all the technologies involved, but you will be encouraged to learn to use them optimally. You will work together with Server, ML, and client engineers owning all the components of our stack, operations, and product teams to implement infrastructure and add product features vital for our efforts. Description We are looking for a full stack engineer to solve challenging problems for App Store review. This role will be responsible for developing software to deploy ML models, analyze apps submitted to the App Store, and visualize the output. Your efforts in the team will help ensure the quality of apps in the store, and will benefit millions of customers. You will be expected to help integrate models, implement software and infrastructure that will run them and process their output. Creative engineers will benefit from the chance to convert forward thinking ideas all the way from prototype to final product with the help of a great engineering and infrastructure team. Day to day duties (but not limited to): Design, implement, and evolve web applications Build a flexible ML service platform that can be easily customized toward different use cases Collaborate with multi-functional teams of engineers, data analytics, Machine Learning specialists, and products to build new features Education & Experience BS in Computer Science or equivalent work experience. MS or Ph.D in computer vision, machine learning, computer science a bonus. We are an equal opportunity employer and value diversity at our company. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. Role Number: 200195505",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-23T06:34:48.000Z"
    },
    "company": {
        "name": "Apple",
        "link": "https://www.linkedin.com/company/apple"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Cupertino",
        "region": "CA",
        "postal_code": "95014",
        "street_address": null,
        "latitude": 37.319313,
        "longitude": -122.02927
    }
}