{
    "job": {
        "title": "Front-End Software Engineer",
        "industry": "Information Technology and Services,Financial Services,Hospital &amp; Health Care",
        "description": "Overview Envision Healthcare is a multispecialty physician group and practice management company. Established in 1953, our organization provides anesthesia, emergency medicine, hospital medicine, radiology, primary/urgent care, surgical services, and women’s and children’s health services to hospitals and health systems nationwide. Sheridan Healthcare, EmCare, Reimbursement Technologies and Emergency Medical Associates have recently joined forces to form Envision Physician Services. As one organization, we now provide a greater scope of service than any other national physician group. Our collective experience from hundreds of local, customized engagements, culture of continuous lean process improvement, and team of experts in the business of healthcare enable us to better solve complex problems and consistently give healthcare organizations confidence in our execution. Our combined organization serves more than 780 healthcare facilities in 48 states and the District of Columbia. If you are looking for a stable, fast-paced, growing Company in the healthcare industry that is committed to innovation, excellence and integrity, then this may be a great next step in the advancement of your career. We currently have an exciting opportunity available for an experienced Front-End Software Engineer. THIS IS A 100% REMOTE WORK OPPORTUNITY for the largest provider of outsourced physician services in the world! As a Front-End Software Engineer you will be working in a fast-paced and growing environment helping to build a platform that will facilitate the reading of 30m+ radiology studies annually. You will be working in a microservice environment hosted in Kubernetes on AWS and using Angular for the front end. Responsibilities Work with a design team to develop the overall look and feel of websites Maintain existing and creating new customer-facing Angular applications Communicate/Demo features built to various stakeholders Assist with testing and validating of features built Work closely with architect to develop robust solutions Responsible for adhering to Information Security Policies and ensuring Envision is as secure as possible. Mentor teammates Perform other duties as assigned. Qualifications Bachelor's Degree from four-year university in Software Engineering, Computer Science, or related field, and 4 or more years of related experience 4 years experience designing, building, and testing enterprise software. 4+ years developing front-end applications with at least 2 years working with Angular 2+ Thorough knowledge of HTML, CSS Comfortable using version control and testing frameworks (Git, Jasmine, etc) Strong communication and collaboration skills Desire to work in a collaborative environment If you are ready to join an exciting, progressive company and have a strong work ethic, join our team of experts! We offer a highly competitive salary and a comprehensive benefits package. Envision Healthcare uses E-Verify to confirm the employment eligibility of all newly hired employees. To learn more about E-Verify, including your rights and responsibilities, please visit www.dhs.gov/E-Verify . Envision Healthcare is an Equal Opportunity Employer. Salary Range $107K to $132K #CB",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-15T21:50:23.000Z"
    },
    "company": {
        "name": "Envision Healthcare",
        "link": "https://www.linkedin.com/company/envision-healthcare"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 48,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Greenwood Village",
        "region": "CO",
        "postal_code": "80018",
        "street_address": null,
        "latitude": 39.616886,
        "longitude": -104.95051
    }
}