{
    "job": {
        "title": "Software Engineer, New Grad (0-1 years of experience)",
        "industry": "Information Technology and Services,Computer Software,Internet",
        "description": "You just joined the industry and started exploring how your software skills can accelerate workflows. You think — can I do more than this — can I help the transformation of industries at a pace faster than my efforts singularly? Airtable’s mission is to bring the power of software development to everyone. We are developing a toolkit that our customers can leverage to build solutions without writing code. It has been extremely rewarding to see what our users are accomplishing with this toolkit. From coordinating manufacturing to 3D printing pipelines, we see a variety of use cases on Airtable. Our goal is to make this toolkit even more powerful while keeping the experience easy to comprehend. To achieve this ambitious goal, we need growth-minded engineers who are passionate about Airtable's mission. At Airtable, you’ll join a highly talented and experienced team with diverse backgrounds, ready to move fast and ship high-quality features in collaboration with customer-facing teams. We practice inclusion, foster psychological safety, and proactively look to increase diversity on a variety of dimensions. You will have the opportunity to learn and grow, and your work enables Airtable’s mission of democratizing software engineering. What you'll do Spec and build high-quality product features that are fast and reliable. Work at all levels of the stack from AWS+Node.JS+SQL to React+HTML+CSS. Collaborate with other engineers to create reusable and maintainable frontend/backend features, systems, and abstractions. Identify opportunities to improve Airtable based on data, research, and your own intuition. Work alongside and learn from a talented group of engineers with a diverse range of experiences and backgrounds. Who you are You’re a software engineering generalist who values user-centric product development. You must be enrolled or recently graduated from a degree-seeking program in CS or similar fields You have a good understanding of frontend/backend technologies, modern frontend JavaScript frameworks and React, and/or backend systems, infrastructure and databases. You believe the best product is the one that helps users accomplish their goals while growing the business. You derive joy from refactoring and building clean abstractions in order to make complex systems fun to develop on and easy to understand You take a thoughtful approach to decision making; knowing when to move fast and when to do things right. What We Offer We have your medical, dental, and vision insurance 100% covered (and your dependents covered at 65%) Complimentary One Medical membership for individuals and dependents High deductible health plan with health spend account contribution $250 monthly wellness stipend for you to invest in your overall wellness Mental health support Family planning support (fertility, adoption, and surrogacy) Generous vacation and sick time 16 weeks of parental leave Learning & Development: we offer a $2,000 per year stipend for your personal career development About Airtable Airtable is working on the next computer revolution: one where anyone – even without technical training – can create customized applications that fit their needs, build more interconnected teams, and take part in a growing community of people who share what they create. Founded in 2012 and headquartered in San Francisco, Airtable powers teams at more than 250,000 organizations around the world. Our most recent funding round valued Airtable at $5.77 billion and raised $270 million in additional capital, and we're just getting started!",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-05T04:14:13.000Z"
    },
    "company": {
        "name": "Airtable",
        "link": "https://www.linkedin.com/company/airtable"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "San Francisco",
        "region": "CA",
        "postal_code": "94121",
        "street_address": null,
        "latitude": 37.78008,
        "longitude": -122.42016
    }
}