{
    "job": {
        "title": "Machine Learning Engineer",
        "industry": "Information Technology and Services",
        "description": "Job Description Machine Learning Engineer in Atlanta, GA 30092 Interview Logistics Video Required Skills Set Years of Experience: 5+ years Education Required: Bachelors Degree or equivalent work experience Machine Learning The position will require the candidate has experience with Machine Learning strategy, data preparation, visualization, splitting, modeling, and model deployments. SQL Writing efficient queries sourced from restful internal/external APIs, MS SQL Servers, Oracle, and Teradata sources. Python Data analysis MSSQL Server ETL Skills, SSIS C# Nice To Have Skills Additional Preferred Skills: Min.io Tableau Multi-Platform Machine Learning (Microsoft Azure, Google AI, open-source Client platforms) C# Machine Learning Libraries experience (Client.net, and extensions) C# MVC Java Microsoft Powershell EssBase Automation Project Description We are looking for a Machine Learning (Client) Engineer to help us create business intelligence products that support financial and technical objectives. Machine Learning Engineer responsibilities include staging and cleaning data, developing machine learning models, maintaining Client systems, and occasionally presenting findings to executives. To do this job successfully, you need exceptional skills in statistics and programming. This team member will be working with subject matter experts in Accounting, Marketing, Engineering, and Finance. Physical Environment And Working Conditions Remote until covid restrictions are lifted.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-18T08:14:34.000Z"
    },
    "company": {
        "name": "Turnberry Solutions",
        "link": "https://www.linkedin.com/company/turnberry-solutions"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Atlanta",
        "region": "GA",
        "postal_code": "30355",
        "street_address": null,
        "latitude": 33.748547,
        "longitude": -84.3915
    }
}