{
    "job": {
        "title": "Software Engineer",
        "industry": "Information Technology and Services,Computer Software,Financial Services",
        "description": "BrightLink: Software Engineer BrightLink ( The ideal team member has mastery of computer science and engineering fundamentals and is comfortable working in an Agile/Scrum/Lean development environment. The team member should be passionate about helping others, learning new technologies, leading a team by example, and solving difficult problems. Who is BrightLink? Because we build technology for the professional credentialing industry, BrightLink sits in the crossroads between what people were and what they're going to become. We help individuals demonstrate value, articulate trustworthiness, and move to a new chapter of life. Simply put: We help people prove themselves worthy of opportunity. What are our team’s core values? Be remarkable Practice humble service Nurture enduring partnerships Always drive to deliver Seek pragmatic perfection Create positive personal growth Engage in camaraderie Qualifications: BS in CS/CmpE or a related field 3-5 years experience in professional software development Significant expertise in the following areas: Full-stack, web-based application development Object-oriented programming Relational databases, including schema design, advanced SQL, and optimization UNIX-based software development A strong desire to learn and improve the quality of your craftsmanship A sense of ownership, urgency, and personal pride in your work The ability to adapt to changing situations and requirements Excellent communication skills (both verbal and written) Confidence in, and passion about, tackling the most challenging of problems Comfortable investing in junior team members, promoting a healthy development culture, and leading by example Mastery of any of the following things will be a plus: Python PostgreSQL JavaScript (specifically popular libraries/frameworks such as jQuery, React, Backbone, etc.) Bootstrap AWS Agile/Scrum/Lean development practices Responsibilities: Build planned software features, tools, and new products within a Scrum/Lean environment in collaboration with team members and stakeholders Write high-quality, testable software that is scalable, robust and maintainable Craft remarkable, high-performance user interfaces Work together with our Quality Assurance Engineers to identify and fix bugs Collaborate with other engineers on matters of architecture and solution design Participate in early-stage product design Constantly pursue knowledge, and seek to improve your skills and technical professionalism Share best practices and new technologies with the team and apply them to your work Benefits: Paid Vacation and Sick Days Health and Vision Insurance 401k Plan (with corporate match) Paid Sabbatical (every 7 years) Discounted Company Cell Phone Plan Reading Reward Program Quarterly Team / Company Activities Personal or Professional Growth Conference Stipends Friday Family Lunches for You, Your Spouse and Children Casual Dress Environment Paid Recess - Everyday! Awesome, Collaborative and Open Work Environment Sure, we look like a technology company. Sharp people working really hard to do something that changes the world in a meaningful way. However, if you look at our core values you'll notice BrightLink specifically focuses on positive personal growth. Whether it's our team members, clients, or client's clients this means our goal is to leave people better than we found them. You'll be surrounded by people with a drive to grow, discover, and build a better life. If this is something you're interested in, take a look at our currently open positions. Powered by JazzHR j7DWgWoKrg",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-14T07:19:43.000Z"
    },
    "company": {
        "name": "BrightLink ",
        "link": "https://www.linkedin.com/company/brightlink-technology-llc"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Atlanta",
        "region": "GA",
        "postal_code": "30355",
        "street_address": null,
        "latitude": 33.748547,
        "longitude": -84.3915
    }
}