{
    "job": {
        "title": "Engineer II, Software Development",
        "industry": "Financial Services",
        "description": "The Impact: Routinely impacts quality, timelines of results, planning and revenues or budgets of own team and related teams and frequently sets policies, procedures and standards What’s in it for you: The Application Development Manager will be for responsible managing and leading application development team focused on service delivery, talent and resource management, aligning to our overall technology strategy and roadmap. Responsibilities Drive the development of strategic initiatives and BAU in a timely manner working with various stakeholders. Provide effective leadership and exercise day-to-day management of assigned staff. Set priorities among competing goals and objectives and coordinates simultaneous workflows to ensure efficient contribution to S&P objectives. Promote an organization that is focused on outstanding customer service, high performance, team work, and accountability. Ensure roles and responsibilities are well defined with clearly identified goals, objectives and process in place. Contribute to and support S&P enterprise architecture, strategic roadmaps, transformation from current state to future state. Develop agile practices with continuous development, continuous integration & deployments, cloud enablement Leadership on talent acquisition, talent development and employee engagement. Collaborate with global technology leadership, regional leadership and cross-functional teams Create an open and professional working environment Basic Qualifications What we are looking for: A Bachelors or Master’s degree in Computer Science Current, technical hands-on experience Solid foundation in software engineering in architecture / design / development 4 years or more of technology leadership position with 5 or more years in financial industry Onsite experience in a client facing role with offshore service delivery Proven ability to manage and operate in a global environment Proven ability and experience delivering on large-scale projects Preferred Qualifications Must have at least 4 years of professional experience in software engineering, with at least 4 years in leadership Strong oral and written communication skills Excellent interpersonal and relationship-building skills Experience with Java, J2EE, Spring, Hibernate, RESTful APIs, HTTP/CSS Experience with modern web application development [ HTML5, Javascript, Angular, Python] Experience with API management and Cloud-based platforms and services [AWS, Google] Very strong understanding of Test Driven Development (TDD) practices as well as Automation Working knowledge of DevOps: Git, Jenkins, CI/CD pipelines, etc. Strong Agile practitioner Experience architecting and developing large scale enterprise applications Excellent oral/written communication skills and interpersonal skills, with the ability to articulate ideas to both technical and non-technical audiences Innovative, self-motivated and self-directed with keen attention to detail, exceptional service orientation and the ability to motivate others in a team-oriented, collaborative environment. Exceptional organizational skills Experience mentoring team members A curious mind that strives for continuous learning with desire to share with and learn from colleagues About Statement At S&P Global, we don’t give you intelligence—we give you essential intelligence. The essential intelligence you need to make decisions with conviction. We’re the world’s foremost provider of ratings, benchmarks and analytics in the global capital and commodity markets. Our divisions include: S&P Global Ratings, which provides credit ratings, research and insights essential to driving growth and transparency. S&P Global Market Intelligence, which provides insights into companies, markets and data so that business and financial decisions can be made with conviction. S&P Dow Jones Indices, the world’s largest resource for iconic and innovative indices, which helps investors pinpoint global opportunities. S&P Global Platts, which equips customers to identify and seize opportunities in energy and commodities, stimulating business growth and market transparency. 20 - Professional (EEO-2 Job Categories-United States of America), IFTECH202.1 - Middle Professional Tier I (EEO Job Group), SWP Priority – Ratings - (Strategic Workforce Planning) Job ID: 259148 Posted On: 2021-03-23 Location: Centennial, Colorado, United States",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-01T06:42:46.000Z"
    },
    "company": {
        "name": "S&amp;P Global Ratings",
        "link": "https://www.linkedin.com/company/spglobalratings"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Centennial",
        "region": "CO",
        "postal_code": "80018",
        "street_address": null,
        "latitude": 39.597305,
        "longitude": -104.85381
    }
}