{
    "job": {
        "title": "Machine Learning Engineer",
        "industry": "E-Learning",
        "description": "We are looking to hire an ML/NLP Tech lead who can own products and play a pivotal role in re-engineering our products, transformation, and scaling of AssessEd. WHAT ARE WE BUILDING? A revolutionary way of providing continuous assessments of a child’s skill and learning, pointing the way to the child’s potential in the future. This as opposed to the traditional one-time, dipstick the methodology of a test that hurriedly bundles the child into a slot, that in-turn ‘declares’ the child to be fit for a career in a specific area or a particular set of courses that would perhaps get him somewhere. At the core of our system is a lot of data – both structured and unstructured. We have books and questions and web resources and student reports that drive all our machine learning algorithms. Our goal is to not only figure out how a child is coping but also figure out how to help him by presenting relevant information and questions to him in topics that he is struggling to learn. Required Skillsets: • Wisdom to know when to hustle and when to be calm and dig deep. Strong can do mentality, who is joining us to build on a vision, not to do a job. • A deep hunger to learn, understand and apply your knowledge to create technology. • Ability and Experience tackling hard Natural Language Processing problems, to separate wheat from the chaff, knowledge of mathematical tools to succinctly describe the ideas to implement them in code. • Very Good understanding of Natural Language Processing and Machine Learning with projects to back the same. • Strong fundamental in Linear Algebra, Probability and Random Variables and Algorithms. • Strong Systems experience in Distributed Systems Pipeline: Hadoop, Spark, etc. • Good knowledge of at least one prototyping/scripting language: Python, MATLAB/Octave or R. • Good understanding of Algorithms and Data Structures. • Strong programming experience in C++/Java/Lisp/Haskell. • Good written and verbal communication. Desired Skillsets: • Passion for well-engineered product and you are ‘ticked off’ when something engineered is ‘off’ and you want to get your hands dirty and fix it. • 3+ years of research experience in Machine Learning, Deep Learning, and NLP • Top tier peer-reviewed research publication in areas like Algorithms, Computer Vision/Image Processing, Machine Learning or Optimization (CVPR, ICCV, ICML, NIPS, EMNLP, ACL, SODA, FOCS etc) • Open Source Contribution (include the link to your projects, Github, etc.) • Knowledge of functional programming. • International level participation in ACM ICPC, IOI, TopCoder, etc. • International level participation in Physics or Math Olympiad. • Intellectual curiosity about advanced math topics like Theoretical Computer Science, Abstract Algebra, Topology, Differential Geometry, Category Theory, etc. What can you expect: • Opportunity to work on interesting and hard research problem, to see the real application of state-of-the-art research into practice. • Opportunity to work on important problem with big social impact: Massive, and direct impact of the work you do on lives of students. • An intellectually invigorating, phenomenal work environment, with massive ownership and growth opportunities. • Learn effective engineering habits required to build/deploy large production-ready ML applications. • Ability to do quick iterations and deployments. • We would be excited to see you publish papers (though certain restrictions do apply).",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-23T12:15:27.000Z"
    },
    "company": {
        "name": "BYJU'S",
        "link": "https://in.linkedin.com/company/byjus"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "IN",
        "locality": "Bangalore Urban",
        "region": null,
        "postal_code": "577566",
        "street_address": null,
        "latitude": 12.951727,
        "longitude": 77.593636
    }
}