{
    "job": {
        "title": "Data Scientist (Reporting &amp; Insights)",
        "industry": "Research",
        "description": "Responsibilities The Data & Analytics team provides consumer research, data reporting, and advanced analytics to understand how consumers interact with our video content & other products. This role will focus primarily on reporting and insight generation. Apply quantitative expertise ranging from data visualization to advanced statistical models Support the analytics needs of clients across the following areas: Data Sourcing & Warehousing Data Cleaning & Preparation Exploratory Analysis Visualizations & Monitoring Key Metrics Statistical Analysis Insight generation Assist with the creation of deliverables (e.g. presentations) and messaging to business stakeholders Ensure the quality and timeliness of analytic deliverables meet client's expectations Contribute and build upon best practices and detailed documentation Qualifications/Requirements Bachelor’s in Statistics, Mathematics, Economics, Computer Science, or related technical field 3+ years of work experience in Business Intelligence, Analytics, or Data Science space Proficient in Python and databases (e.g., SQL, Mongo, etc.) Experience with Tableau or similar visualization tool Knowledge of statistics and data mining techniques (e.g., Hypothesis testing, regression modeling) Proficient in MS Word, Excel, and PowerPoint Desired Characteristics Ability to develop clear and concise thoughts into recommendations and findings Demonstrated verbal and written communication skills including effective visual representation of complex data Experience communicating results of analyses to leadership teams Prior experience in content, digital media, and/or technology",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-10T04:24:58.000Z"
    },
    "company": {
        "name": "SG Analytics",
        "link": "https://in.linkedin.com/company/sg-analytics"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "New York",
        "region": "United States",
        "postal_code": "13856",
        "street_address": null,
        "latitude": 42.93923,
        "longitude": -75.62005
    }
}