{
    "job": {
        "title": "Senior Software Engineer",
        "industry": "Information Technology and Services,Computer Software,Financial Services",
        "description": "At Northwestern Mutual, we are strong, innovative and growing. We invest in our people. We care and make a positive difference. Northwestern Mutual is looking for an experienced engineer to help us build the next generation of financial planning tools for our clients. The role requires an agile engineering approach, the patience and persistence to tackle sophisticated problems, the ability to get things done quickly but thoughtfully, and outstanding technical skills. Do you enjoy reading tech blogs in your spare time? Is your meme game strong? Then we want to hear from you! What are we looking for? 5+ years of professional experience Experience with Architecture Patterns and Engineering Familiarity with DevOps, Automation, and Infrastructure Effective Communication: Easily explains concepts to both technical and non-technical audiences. Teamwork: Mentors fellow engineers and leads cross-team initiatives. Autonomy: Identifies problems and seeks solutions independently. Ownership: Takes pride in their craft and responsibility for issues that may arise. What would make you stand out? Hands-on experience with JavaScript (Node, React), Java, or GraphQL Experience with Automation of CI/CD Pipelines Familiarity with AWS (databases, storage, networking, CloudFront) Ability to Debug/Troubleshoot across Infrastructure as Code (Terraform) Understanding of Docker and Kubernetes Knowledge of Security Practices (Application Firewalls) Why Northwestern Mutual? Highly competitive compensation, including annual bonus opportunities Medical/Dental/Vision plans, matching 401(k), pension programs Tuition reimbursement, commuter plans, and paid time off Extensive professional training opportunities Excellent work/life balance Hackathons/Commitment to innovation This job is not covered by the existing Collective Bargaining Agreement. Required Certifications Grow your career with a best-in-class company that puts our client’s interests at the center of all we do. Get started now! We are an equal opportunity/affirmative action employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, gender identity or expression, sexual orientation, national origin, disability, age or status as a protected veteran, or any other characteristic protected by law. FIND YOUR FUTURE We’re excited about the potential people bring to Northwestern Mutual. You can grow your career here while enjoying first-class perks, benefits, and commitment to diversity and inclusion.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-31T07:13:59.000Z"
    },
    "company": {
        "name": "Northwestern Mutual",
        "link": "https://www.linkedin.com/company/northwestern-mutual"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "New York",
        "region": "NY",
        "postal_code": "10132",
        "street_address": null,
        "latitude": 40.713047,
        "longitude": -74.00723
    }
}