{
    "job": {
        "title": "Data Scientist - Insights",
        "industry": "Marketing and Advertising,Computer Software,Internet",
        "description": "About The Role We are looking for data scientists to join our newly formed Executive Insights team. Data scientists in this group draw on a combination of quantitative methods and business intuition to find actionable insights that drive key business decisions at Udemy. Success in this role requires a combination of business intuition, broad knowledge of statistical methods, practical data analysis experience, and strong communication and collaboration skills. Data scientists on our team perform several highly critical functions: Serve as experts of our overall business trends when working with data scientists within the broader team Identify, scope, and execute on data-driven analyses to help guide executive level business decisions Present and discuss business trends to a broad audience of stakeholders and data peers Act as data evangelists to create a data-driven culture across the company Here Are Some Questions You Could Be Working On What metrics should the company be monitoring and goaling against? What are potential causes for changes in key business metrics? What learning actions differentiate our most engaged users from those who churn? Here Is What You Will Be Doing Collaborating with stakeholders to inform business direction Proactively influencing company-wide prioritization through data-driven insights Defining metrics and building dashboards to track product and business health Continuously improving the quality and accessibility of dataUsing the right tool (a scripted model, a dashboard, a presentation) for each analysis Providing technical mentorship to others Designing and analyzing standard experiments and conduct ad hoc analyses We Are Excited About You Because You Have 3+ years of relevant experience in a combination of business/analytics roles (e.g. data science/analytics, management consulting, or business operations) Ability to communicate effectively with non-technical stakeholders Strong business intuition and judgement Expert level data storytelling and data visualization ability Expert SQL ability and proficiency with 1+ programming languages (e.g., R or Python) Experience with BI tools (e.g. Looker, Chartio, or Tableau) About Udemy We believe anyone can build the life they imagine through online learning. Today, millions of students around the world are advancing their careers and passions by exploring and mastering new skills on Udemy, and expert instructors are able to share their knowledge with the world. Through our global marketplace and our solutions for businesses and governments, we connect people everywhere with the skills they need for success in work and life. We’re a close-knit bunch that enjoys problem-solving and collaboration, and we share a serious belief in the power of learning and teaching to change lives. Udemy’s culture encourages innovation, creativity, passion, and teamwork. We also celebrate our milestones and support each other every day. Founded in 2010, Udemy is privately owned and headquartered in San Francisco’s SOMA neighborhood with offices in Denver (Colorado), Dublin (Ireland), Ankara (Turkey), Gurugram (India), and São Paulo (Brazil). Udemy in the News Udemy Adds More than $1 Billion To Its Valuation in New Funding Round Udemy’s Workplace Learning Tool Just Surpassed $100M in ARR Paid Paternity Leave Should be the Norm in the U.S. Breakdown of Most In-Demand Skills for 2020—Finance, Marketing, Sales and Engineering How Investing in Yourself Today Will Set You Up for Career Success Tomorrow Feedback Isn’t the Problem, but the Way That We Deliver It Is Broken",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-30T02:53:01.000Z"
    },
    "company": {
        "name": "Udemy",
        "link": "https://www.linkedin.com/company/udemy"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "San Francisco",
        "region": "CA",
        "postal_code": "94121",
        "street_address": null,
        "latitude": 37.78008,
        "longitude": -122.42016
    }
}