{
    "job": {
        "title": "Site Reliability Engineer",
        "industry": "",
        "description": "The Remote Company is a network of remote-first tech companies. We're united by our values and approach to doing business. You will work with products like MailerLite, MailerSend, MailerCheck, and Ycode. We're looking for a Site Reliability Engineer (SRE) that is eager to maintain and improve our infrastructure. You're knowledgeable in Docker and Kubernetes, and have experience with IaC tools. Furthermore, you're a great team player with a positive attitude. Wh y The Remote Company? You won’t be bored We will consistently maintain and improve our infrastructure. You will work with Google Cloud, Kubernetes, and more. You will be challenged with interesting tasks Did you come up with an idea that could automate processes? We encourage you to share, own, and implement your ideas! You will take ownership We don’t micromanage and try not to interrupt your work with random tasks. We do expect you to take full responsibility and ownership for the stuff you build. You will have experts at hand Whenever you’re stuck, your teammates are eager to help you grow. And they’d love for you to share your knowledge too! You can pick where you want to work, every day At The Remote Company, we embrace the remote culture. Every day you get to choose what environment makes you most productive. You can count on stability You can count on us to offer you a stable workplace! We're continuously growing and our oldest company, MailerLite, has been around for more than 10 years. What we expect from you Knowledgeable in Docker and Kubernetes Experience with IaC tools (any) Experience with NGiNX, MySQL, PostgreSQL, PHP, Redis, ElasticSearch Background in Linux/Unix Experience with monitoring tools Networking knowledge You look for automation possibilities when doing redundant tasks You're a great team player with a positive attitude You have a sense of personal responsibility You consistently want to learn more and improve your skills Proficient verbal and written communication skills in English This position is full-time (40 hours per week) What we offer Salary: $50,000-$55,000 (gross) Remote-first culture with the team working remotely from all over the world Remote health insurance. Every team member gets global health insurance with full coverage in their home country and 175+ countries. No exclusions for pandemics. Company-paid retreats that we call workations. The whole company gathers once a year for a week in an exotic location to work, learn and have fun together. Team meet-up once a year. You and your team will get a budget to meet and bond in a location of your choice. Four weeks of vacation. We encourage you to unplug and recharge! Parenting budget. Anyone who becomes a parent through childbirth or adoption gets a budget as a gift from us to you! Annual benefits, which include a budget for home office setup, personal development, leisure trips, etc. MacBook and other tools that'll help you to do your job efficiently Interested? Please don’t send us your CV. Instead, simply send us an application email with the below information to jobs@remotecompany.com . Things we want to see in your email: The title of this role in your email subject line How you heard about this job Links to your Github, Gitlab, LinkedIn (necessary), Twitter, Facebook, or personal homepage Previous work experience, including your role and projects Why you want to join The Remote Company Your remote work experience A description of a project or product that you loved working on and why Expected salary W ish you all the best of luck!",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-06T11:28:34.000Z"
    },
    "company": {
        "name": "The Remote Company",
        "link": "https://www.linkedin.com/company/remotecompany"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Delaware",
        "region": "United States",
        "postal_code": "19977",
        "street_address": null,
        "latitude": 39.00876,
        "longitude": -75.46864
    }
}