{
    "job": {
        "title": "Data Scientist",
        "industry": "Marketing and Advertising,Computer Software,Internet",
        "description": "Known is a modern marketing company engineered to meet the unprecedented challenges and opportunities facing marketers today. We are setting a new standard by pairing data scientists with award-winning creatives, expert research teams, and strategists to deliver clients the most advanced, end-to-end solutions they need, in the most efficient, effective, and transparent ways. Anchored by two decades of groundbreaking market research and data science, we provide brands with consumer intelligence, strategy, media planning and buying, and renowned creative in all media, producing some of the most innovative, cutting-edge work in culture today. With offices in New York, Boston, Austin, Los Angeles and Seattle, we are a community of 300+ extraordinarily talented people, working as one team to help our clients succeed. The Role Known’s Data/Media Science team uses advanced analytics, machine learning, statistics, and algorithms to plan and optimize our client’s advertising and media dollars. We partner with our clients to translate their business goals into meaningful metrics, and buy media across all channels to drive those target outcomes. We are looking for a Data Scientist to join the team and work alongside other data analysts, data scientists, and software engineers. Data Scientists at Known have a diverse set of responsibilities which go beyond traditional technical disciplines like machine learning. This includes business strategy, client-facing engagement, and quantitative solution design. What You'll Do Responsible for the day-to-day management of the media spend you’re responsible for, including ideation on quantitative approaches for driving value, monitoring metrics, and troubleshooting issues Design and execute every technical aspect of an engagement, including machine learning, analytics, and visualization Develop new techniques (e.g., ML models, optimization algorithms, and automation) to optimize KPIs and improve Known IP Discuss and defend your analyses and ensure that it directly meets the client’s needs. Build presentations and present work to clients with the ability to articulate results Productionalize workflows and contributing code to our Known repos Operate existing software infrastructure to traffic, evaluate performance, and analyze media May mentor others You Have A Masters or PhD from a well-regarded college or university. STEM degrees are preferred 5+ years of hands-on experience doing quantitative analysis, predictive modeling, optimization and/or statistics Some professional experience in marketing, advertising or media is a plus Skills, Abilities, And Knowledge Experience utilizing Python (or similar language) and SQL Experience using Machine Learning Understanding of statistics/science/evidence/experimentation Proficient with Microsoft office suite of products (Excel, Word, PowerPoint) Ability to build and maintain external relationships (clients, vendors, etc.) Superb written and verbal communication and presentation skills Ability to articulate clearly and communicate a “data story” Ability to build a presentation deck A desire to work on advertising challenges that require flexibility in approach -- everything from on-the-fly analytics to statistics, big data, machine learning, and mathematical algorithms An ability to translate business challenges into quantitative problems, and solve them by whatever means necessary, which may not always be strict machine learning A willingness to learn foundational knowledge and skills rapidly An ability to think strategically, analytically, and proactively about diverse business problems A commitment to managing the quality & accuracy of analytics, ensuring high standards with your and others’ work Experience multi-tasking in a fast-paced environment Competencies Ability to prioritize time, work and effort while multitasking on multiple projects Desire to mentor and teach others Ability to think strategically, analytically, and proactively about diverse business problems Collaborative attitude Self motivated and exhibits initiative Willing & able to learn quickly Abundant intellectual curiosity and integrity Collaborative attitude Perks Include Unlimited paid time off Equity plan with profit sharing 401k with company matching and no vesting period Annual bonuses Vacation and anniversary cash bonuses Generous medical plan Paid parental leave In-house barista plus cold brew on tap! Known is an equal opportunity employer and does not discriminate against employees or qualified job applicants on the basis of race, color, sex, age, national origin, religion, sexual orientation, gender identity and/or expression, status as a veteran, and basis of disability or any other federal, state or locally protected class.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-20T23:12:36.000Z"
    },
    "company": {
        "name": "Known",
        "link": "https://www.linkedin.com/company/knownis"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Cambridge",
        "region": "MA",
        "postal_code": "02239",
        "street_address": null,
        "latitude": 42.36525,
        "longitude": -71.10502
    }
}