{
    "job": {
        "title": "Machine Learning Engineer",
        "industry": "",
        "description": "We are looking for a machine learning engineer with a mastery of AWS (training and deploying models, lambdas and endpoints). To succeed in this role, you should possess outstanding skills in machine learning methods and statistics. Responsibilities Create, implement, and train machine learning models Clean and structure data Create and test hypotheses Train the developed models to run evaluative experiments to refine models and increase accuracy Remain updated in the rapidly changing field of machine learning Requirements Strong command of structured and unstructured data preparation Master/commander of Python Mastery of AWS Experience in relational and non-relational databases (eg. dynamoDB, mySQL) Degree in Computer Science, Mathematics, Statistics, Computational Linguistics or similar field At least 2 years of experience in a non-academic production role. The ability to meet agreed upon deadlines and responsibilities. Desirable An analytical mind with problem-solving abilities Strong communication skills Interview Process: 1. Google meet interview (10-15 min.) 2. check your references 3. take-home project (1hr) 3. Google Meet interview (20-30min.) Compensation: Job Type: Full-time Pay: $90,000.00 - $150,000.00 per year",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-23T18:44:42.000Z"
    },
    "company": {
        "name": "TUP Solutions",
        "link": "https://www.linkedin.com/company/trackunderstandpredict"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "United States",
        "region": null,
        "postal_code": "99999",
        "street_address": null,
        "latitude": 39.50355,
        "longitude": -99.0183
    }
}