{
    "job": {
        "title": "Site Reliability Engineer (SRE)",
        "industry": "",
        "description": "Description: Person leaving – moving, wanted a hybrid model, Python, kubernetes, containerization, terraform, ansible Apex downloads – used python, Have an SRE – junior resource – offshore partner – managing that offshore resource He was introducing their stack into kubernetes and docker Setting up new environments In charge of their release CI/CD pipeline Bash script Python nice to have Responsibilities Manage deployments in AWS to support workloads and services Establish end-to-end monitoring and alerting on all critical components of the applications, including availability, latency and overall system health Participate in the on-call rotation supporting the platform and/or the production application(s) Work with development teams to make sure applications are production ready, scalable and reliable from the ground up Perform deployment, configuration changes, and integration testing of the workload and services Debug infrastructure/services/workloads and provide failure/root cause analysis Write automation code for provisioning and operating infrastructure at massive scale Work with security team to remediate security findings and implementing security features Requirements 5+ years of AWS experience 5+ year of system engineering experience 2-3 years of DevOps experience Proficient in tool development using one or more programming languages such as: Java, Ruby, Python, Perl and C. Passion for eliminating repetitive manual processes using automation and experience with Devops automation tools such as Terraform, Ansible, helm charts, Jenkins/Gitlab etc. Experience with CI/CD pipeline configuration, deployment, and support Understanding of DBs such as MySQL, ElasticSearch. Deep understanding of the Linux Operating System, including: Kernel, Memory, Process, Threads, Static / Shared Libraries, IPC, Signals. Understanding of standard networking protocols and components such as: HTTP, DNS, ECMP, TCP/IP, ICMP, the OSI Model, Subnetting and Load Balancing strategies. Knowledge of best practices related to security, performance, and disaster recovery Docker / Kubernetes experience Excellent problem solving and analytical skills Has general security awareness to support security remediation related to infrastructure Must have strong infrastructure background",
        "employment_type": "CONTRACTOR",
        "date_posted": "2021-09-01T19:18:45.000Z"
    },
    "company": {
        "name": "InfoObjects Inc.",
        "link": "https://www.linkedin.com/company/infoobjects-inc-"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "San Jose",
        "region": "CA",
        "postal_code": "95148",
        "street_address": null,
        "latitude": 37.334793,
        "longitude": -121.888145
    }
}