{
    "job": {
        "title": "Site Reliability Engineer (SRE)",
        "industry": "Computer Software,Internet,Financial Services",
        "description": "Who's Clearcover? Clearcover is the smarter car insurance company. We use powerful technology to offer everyday drivers better coverage for less money. We're proud to be one of the fastest growing startups in Chicago, and we're currently looking to add a few more extraordinary people to our team. What is a Site Reliability Engineer? Clearcover is looking for an energetic, experienced, and highly motivated Site Reliability Engineer (SRE) to join our team. SREs build, maintain, and monitor the platform that powers Clearcover's API products, applications, and machine-learning applications. We work every day to improve our build automation, strengthen our AWS and Kubernetes infrastructure, shift left on security and quality, and improve our reliability. The Site Reliability Engineer (SRE) role is an integral part of our Product and Technology organization, and requires a passion for technology and cloud architecture. Pragmatic and driven, you thrive in collaborative environments with high degrees of autonomy. If you're an expert generalist with an appetite for a variety of projects, a yen for automation and a zeal for driving out toil, we'd love to talk to you! What will you do? Develop, deploy, and operate our secure AWS infrastructure (EKS, S3, EC2, RDS, Lambda, etc). Ensure the high availability, resiliency, performance, business continuity and compliance capabilities of our cloud services. Build dashboards and alerting to monitor our apps and infrastructure Define standards for our containerized environments and Kubernetes clusters Work with our engineering teams to deploy and operate cloud services. Help develop and operate our build automation and continuous delivery systems. Participate in an on-call rotation, drive incident resolution and improve platform resiliency. What do you need? Experience with cloud IaaS offerings in AWS (strongly preferred), GCP, or Azure. Experience with automation/configuration management using Terraform, Ansible, or similar solutions. Experience with Kubernetes (strongly preferred) or other container orchestration platforms. Experience with continuous integration/deployment tools such as Jenkins. Experience with operational monitoring tools, such as Datadog, CloudWatch, Sumo Logic, and Prometheus. Proficient in Linux tools and shell scripting or other Linux automation An interest in designing, analyzing and troubleshooting large-scale distributed systems. Well-versed with the entire software development lifecycle, devops, and SRE practices. Nice to haves? Experience with automated unit and integration testing of infrastructure code Experience with container security Experience in one or more languages such as Python, Go, Ruby, or JavaScript What's in it for you? Unlimited PTO, we hire adults Equity for all employees, so you own a piece of the pie too Dental and Vision, we've got you covered 100% Medical, we cover the vast majority of your premiums to make the cost of you and your family's coverage affordable. Plus, we contribute to your HSA and HRA (cha-ching) We invest in your future by contributing 3% of your salary to a 401(K), even if you don't Come to work pre-taxed through our FSA commuter benefits and yes, we have unlimited LaCroix, beer, snacks and the occasional ice cream social (for once we're back in the office) Clearcover is an Equal Opportunity Employer (EOE) that welcomes and encourages all applicants to apply regardless of age, race, color, religion, sex, sexual orientation, gender identify and/or expression, national origin, disability, veteran status, marital or parental status, ancestry, citizenship status, pregnancy or other reasons prohibited by law.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-05T05:12:47.000Z"
    },
    "company": {
        "name": "Clearcover",
        "link": "https://www.linkedin.com/company/clearcover-inc."
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Chicago",
        "region": "IL",
        "postal_code": "60654",
        "street_address": null,
        "latitude": 41.88323,
        "longitude": -87.6324
    }
}