{
    "job": {
        "title": "Sr. Network Data Engineer",
        "industry": "Staffing and Recruiting",
        "description": "Position: Sr. Network Data Engineer Location: Greensboro, NC Broad IT knowledge (CISCO, MPLS, BGP, OSPF, RIP, VPN Riverbed, Internet,) Good knowledge and experience in Network WAN operations Experience in working in a global organization Good knowledge in Riverbed CCIE certificate in Routing & Switching CCNP Certificate In Design Requirements Good knowledge and practical experience in the WAN area in a global environment. Personal Profile: Excellent communication and presentation skills in English and Swedish, both written and spoken Customer oriented, service minded and result driven Analytic skills and ability to prioritize Excellent social and interpersonal skills Goal and result oriented with an open attitude Continuous personal development Documentation skills (1.) To perform value addition activities (CIP and SIP) and implement strategies to improve productivity. (2.) To implement Profit Implement Plan (PIP), review Budget vs. Actual Cost and analyse the deviation to plan strategies to reduce deviation through levers like Automation and self-driven initiatives. (3.) To ensure retention of accounts that are due for renewal or maintain high level of customer satisfaction (ACSAT) (4.) To ensure that all responsibilities and project deliverables are completed within SLAs through effective team management and monthly reviews (5.) To ensure generation of an account level EE and EN revenue (6.) To ensure absorption of freshers as per the defined account targets (7.) To identify attrition percentage in accounts and take up initiatives to reduce the same",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-09-12T03:52:26.000Z"
    },
    "company": {
        "name": "SoftHQ Inc",
        "link": "https://www.linkedin.com/company/softhq-inc"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Greensboro",
        "region": "NC",
        "postal_code": "27408",
        "street_address": null,
        "latitude": 36.09947,
        "longitude": -79.81628
    }
}