{
    "job": {
        "title": "Senior Software Engineer, Data Connectivity team (Full Stack)",
        "industry": "Computer Software,Information Technology and Services,Internet",
        "description": "To get the best candidate experience, please consider applying for a maximum of 3 roles within 12 months to ensure you are not duplicating efforts. Job Category Products and Technology Job Details The Data Connectivity team at Tableau manages the connectivity layer, which enables connections to various data sources and the ability to import that data into Tableau. Our team consists of individuals from diverse backgrounds with several years of experience at well-known tech companies. We follow a lightweight agile process with reduced meetings for scrum/sprint planning so each individual is responsible for managing their workload. Our team is fast-paced and has an incredible work-life balance. We try to ensure that folks take advantage of our unlimited vacation policy. We are building the next-generation connectivity framework using a modern tech stack and are looking for excellent problem solvers who will thrive in our fast-paced environment. About The Role As a Full Stack Engineer on the Data Connectivity team, you will be leading, building, and owning backend services, connectors, SDK, CLI, and various other components of the new architecture. You will work closely with folks across the organization to deliver high-impact features. You will gain insights into how the connectivity layer works with hundreds of databases and SaaS products. We strive for a high standard of engineering quality while solving unique scalability challenges and delivering delightful experiences. You will be working on a highly visible product that was a result of a recent hackathon. Tableau hires company builders; employees are expected to be on the constant lookout for the best talent to bring on board, helping Tableau continue to build one of the best companies in the world. You Are Fluent in the Javascript/Typescript/NodeJS ecosystem Comfortable driving features end-to-end and choosing the right tools & libraries for the job Able to tackle complex engineering problems and deliver results Solid understanding of REST APIs and good intuition designing customer-facing APIs Creative self-starter, excited to solve ambiguous and challenging problems Enjoy working with the latest tech and are motivated to learn and teach others Comfortable with design patterns, data structures, algorithms, and system design Key responsibilities Work with the team on product architecture and drive the implementation Build high quality, well-tested components with developer experience and customers in mind Understand the existing architecture and make improvements to the new system Manage your sprint work items Author design docs and drive design reviews with the broader team Other duties as assigned Technologies we use Modern Javascript / Typescript NodeJS / Electron React / Jest / Parcel Other projects use C++ / C# / Java / Python Bonus Experience working with Typescript and React You have developed and shipped customer-facing SDK / APIs Attention to detail and developer experience Experience decomposing a large monolith into microservices Comfortable working on new technologies Experience with plugin architectures Familiar building distributed systems You love to participate in hackathons! Accommodations If you require assistance due to a disability applying for open positions please submit a request via this Accommodations Request Form. Posting Statement At Salesforce we believe that the business of business is to improve the state of our world. Each of us has a responsibility to drive Equality in our communities and workplaces. We are committed to creating a workforce that reflects society through inclusive programs and initiatives such as equal pay, employee resource groups, inclusive benefits, and more. Learn more about Equality at Salesforce and explore our benefits. Salesforce.com and Salesforce.org are Equal Employment Opportunity and Affirmative Action Employers. Qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender perception or identity, national origin, age, marital status, protected veteran status, or disability status. Salesforce.com and Salesforce.org do not accept unsolicited headhunter and agency resumes. Salesforce.com and Salesforce.org will not pay any third-party agency or company that does not have a signed agreement with Salesforce.com or Salesforce.org . Salesforce welcomes all.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-17T23:36:37.000Z"
    },
    "company": {
        "name": "Salesforce",
        "link": "https://www.linkedin.com/company/salesforce"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Kirkland",
        "region": "WA",
        "postal_code": "98034",
        "street_address": null,
        "latitude": 47.675507,
        "longitude": -122.20336
    }
}