{
    "job": {
        "title": "Software Engineer, Backend",
        "industry": "Information Technology and Services,Computer Software,Internet",
        "description": "PatientPop is the leader in practice growth with the only all-in-one solution that empowers healthcare providers to improve every digital touchpoint of the patient journey. As experts in the healthcare technology space, PatientPop makes it easy for providers to promote their practices online, attract patients, and retain them for life. We've grown from a small, scrappy team to a workforce of 500+ driven individuals who are committed to scaling smarter. As we move into our next phase of growth, we're looking for passionate and dedicated people to focus on innovative solutions while ensuring that we maintain a superb customer experience. That, in part, means finding highly qualified candidates who want to invest their energy to align with our company's long-term goals. You will be joining our Scheduling team, which is part of a product offering that streamlines and automates the patient journey by booking appointments online. We are constantly building in new features and functionalities to improve the user experience. How you will contribute: Your primary focus will be the development of our event-driven, microservices architecture and developing workflows to help enhance parts of our product service offering. This highly technical and hands-on position requires you to contribute to all aspects of design, design review, peer development, unit testing, debugging and implementation while helping benchmark performance. You should be comfortable with taking on new engineering challenges, defining potential solutions, and implementing designs in a team environment. A self-starter with the ability to plan, organize and establish priorities to meet goals and achieve results. Our tech stack: Language: Python 3 Infrastructure: AWS Framework: Flask, Django Database: Postgres, Elasticsearch, DynamoDB, Redis Events: Kinesis, SQS, SNS About you: Bachelor’s or Master’s degree in computer science or relevant working experience Strong experience in Python, Java or PHP and a passion to learn new language Experience with event-driven technologies (Kafka, kinesis, SQS, ActiveMQ, RabbitMQ) Experience with relational databases (MySQL, Postgres) and a few non-relational databases (Redis, Dynamo, Cassandra, Elasticsearch, Hbase) Strong experience with Microservices and scalable object-oriented REST-ful web services You have an understanding of distributed design patterns using cloud-based systems including AWS You are team-oriented and collaborative, with the capacity to mentor team members In 90 days you will: Contribute to the development and support of microservices and workflow systems. You should prepare to have an immediate impact on the organization from day one. You’ll take this far beyond your first 90 days. Expect to constantly be learning, challenging yourself and strategizing with your team on building world-class engineering practices. Benefits : Opportunity to create impact Ownership and autonomy Opportunities to host PatientPop talks Paid maternity and paternity leave Remote friendly or relocation assistance provided 100% fully-paid health, dental and vision options Stock options 401 (k) Our HQ is 2 Blocks from the beach, next to the promenade and dog friendly And many more perks! We will consider for employment all qualified Applicants, including those with Criminal Histories, in a manner consistent with the requirements of applicable state and local laws, including the City of Los Angeles’ Fair Chance Initiative for Hiring Ordinance.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-09T17:40:54.000Z"
    },
    "company": {
        "name": "PatientPop Inc.",
        "link": "https://www.linkedin.com/company/patientpop-inc-"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Los Angeles",
        "region": "CA",
        "postal_code": "90101",
        "street_address": null,
        "latitude": 34.05224,
        "longitude": -118.24335
    }
}