{
    "job": {
        "title": "Machine Learning Engineer",
        "industry": "Health, Wellness and Fitness,Medical Practice,Hospital &amp; Health Care",
        "description": "Senior Machine Learning Engineer AI Driven HealthTech Start Up ⚡ New York (WFH possible) $200,000 - $250,000 + Equity + Benefits A Boston based HealthTech Analytics Company is looking to hire a Senior Machine Learning Engineer. The company was founded in 2019 has raised over $30million Series A Funding to assist their rapid growth. The Machine Learning Engineer will join a team of ML and NLP (Natural Language Processing) experts focusing on using AI to create a cutting data driven edge platform to provide real-time clinical insights to give patients the very best care. The senior Machine Learning Engineer will ideally have prior experience in the HealthTech space and if not, be a talented Machine Learning Engineer with an interest and passion for working on meaningful real world projects. Responsibilities Build and deploy robust, industrial scale Machine Learning Pipelines for NLP (Natural Language Processing) Take a lead in facilitating large scale machine learning model integration Work in a small team of ML and NLP engineers, collaborating with teams across the business in product, science, engineering and business development Continually innovate with the team to ensure the business is at the forefront of technology and medicine, attending conferences and publishing if desired Requirements MS/PhD in Computer Science, Computer Engineering or related Quantitative field Expert proficiency Machine Learning Pipelines Experience within Cloud Environments (GCP, AWS preferred) Expert proficiency with Python and related libraries Ideally experience with deep learning frameworks such as PyTorch and Tensorflow Strong communication skills as you will be required to collaborate with teams across data, engineering and product Experience or interest in the HealthTech. Experience working in a similar organization would be a big plus but not required Benefits Competitive Salary + Equity (negotiable and based on experience) Robust healthcare plans and matching 401K Unlimited vacation time Flexible working hours and WFH Stipend to spruce up your home office! Great people to work with – an extremely Diverse team and a company that cares about Diversity, Equity & Inclusion Lots of virtual events for you to connect with your team Weekly care packages The team has just started it’s search and with the fast growth plans is looking to secure a candidate as soon as possible. 🌎 The office is based in Boston. Remote may be a possibility. 📧 Interested in applying? Please click on the ‘Easy Apply’ button ⚡ Storm3 is a HealthTech recruitment firm with clients across London, Europe and North America. To discuss open opportunities or career options, please visit our website www.storm3.com and follow the Storm3 Linked In page for the latest jobs and intel",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-05T17:04:21.000Z"
    },
    "company": {
        "name": "Storm3",
        "link": "https://uk.linkedin.com/company/storm3"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Boston",
        "region": "MA",
        "postal_code": "02118",
        "street_address": null,
        "latitude": 42.358994,
        "longitude": -71.05863
    }
}