{
    "job": {
        "title": "Software Test Engineer",
        "industry": "Information Technology and Services,Financial Services,Hospital &amp; Health Care",
        "description": "Location: Weston, FL Salary: $50-$55 Hourly Description: Our client is currently seeking a Software Test Engineer We need a highly motivated and skilled Staff Software Test Engineer who is passionate about using modern software engineering and testing principles to deliver robust applications to our global users. The Staff Software Test Engineer will plan the schedule and manage test activities for features or projects as well as evaluate standards and special software.This is a role responsible for carrying out various tasks to ensure our test approaches are effectively and efficiently designed, implemented, and maintained for both legacy and new development. Responsibilities Highly proficient in test methodologies, tools, and techniques. Collaborate with team members across product, architecture, development, DevOps, and testing teams in designing testing approaches. Collaborate with product management teams in an Agile/Scrum environment to develop a comprehensive set of tests. Promote and support implementation of CI/CT/CD pipeline Able to provide in-depth analysis to resolve technical issues, anticipate risks and ensure timely management escalation Provide test solutions for both functional and non-functional software quality. Lead test effort estimation, test planning and risk analysis activities for features or projects. Manage resources, testing schedules, and quality expectations for features or projects. Develop manual/automation test strategy or design documentations. Create manual/automation procedure and process documentation to enable end-users to successful operate system software. Design and develop test platforms for new and existing complex products from concept to implementation. Provide mentoring and trainings as needed Participate in the software technical design reviews to mentor less experienced engineers as well as reinforce best design practices. Optimize, improve & maintain best test process and practices Liaise between less experienced Engineers and Sr. Staff/Principal Engineers. Partner with Chief/Principal Engineer in developing and maintaining best SDLC and test practices. Qualifications Required B.S. of Engineering or related discipline 4+ years of experience Knowledge of C++ and Python preferred. Demonstrated experience in system and software testing, both manual and automated testing. Demonstrated experience in the following: test strategy, test case development, software testing methods, software risk analysis across the complete system and software development practices. Demonstrated experience in leading complex product development initiatives from concept through release. Demonstrated experience in influencing cross-functional teams beyond own group (Process/Project Stakeholder) Demonstrated experience in developing and leading a well-defined strategy Demonstrated experience in identifying process gaps and implementing improvements in respected zones and correct/improve processes Contact: tfetter@judge.com This job and many more are available through The Judge Group. Find us on the web at www.judge.com",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-06-25T00:00:00.000Z"
    },
    "company": {
        "name": "The Judge Group",
        "link": "https://www.linkedin.com/company/the-judge-group"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 48,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Weston",
        "region": "FL",
        "postal_code": "33004",
        "street_address": null,
        "latitude": 26.100613,
        "longitude": -80.39994
    }
}