{
    "job": {
        "title": "Software Development Engineer",
        "industry": "Hospital &amp; Health Care",
        "description": "If you are a Colorado resident and this role is a field-based or remote role, you may be eligible to receive additional information about the compensation and benefits for this role, which we will provide upon request.  You may contact 888-367-7223, option 5, for assistance. Your Challenge The Software Development Engineer 3 position provides the successful candidate with an immediate opportunity to be involved with the manufacture of technology that is helping to save lives, improve patient outcomes and reduce the cost of medicine across the globe. The technology is a cornerstone in the Philips Healthtech portfolio and has proven to be elusive to our competitors. As an international organization, Philips is well placed to offer a broad range of technical and leadership opportunities in various organizations throughout the world. Your Team This role will be a part of the Ultrasound Software Development team in Cambridge, MA. Our Offer At Philips, we are driven by our mission to improve the lives of 2.5 billion people by 2030, and every day we move closer to achieving our goal by creating cutting-edge solutions that lead to confident diagnosis, improved care, and increased quality of life for patients. Thanks to our employees who share our passion for improving lives, we are at the forefront of the Healthcare industry leading in image guided interventions, ultrasound, patient monitoring, cardiology informatics, sleep therapy and respiratory care. We enable our employees to create a legacy in life through their work and support their development through people-centric learning, total rewards and personalized development planning programs. We are Looking For: BS or MS in Computer Science, Computer Engineering, Electrical Engineering, or equivalent At least four years experience in software development/engineering including requirements analysis, software development, installation, integration, evaluation, enhancement, maintenance, testing, and problem diagnosis/resolution. The individual must be able to communicate directions and provide guidance to junior engineers, as required Familiarity with embedded system development a plus Extensive Experience with object-oriented programming languages (e.g. C++), design and coding Signal image processing experience preferred, but not required Ability to analyze and solve complex problems. Strong desire to learn and adapt to new technologies and challenges Knowledge of software development lifecycle Strong interpersonal and communication skills with the ability to interface in a cross-disciplinary manner, including engineers, product managers, and clinical specialists Self-motivated individual with good organizational and time management skills Familiarity with medical devices and/or working in a regulated environment a plus Why should you join Philips? Working at Philips is more than a job. It’s a calling to create a healthier society through meaningful work, focused on improving 3 billion lives a year by delivering innovative solutions across the health continuum . Our people experience a variety of unexpected moments when their lives and careers come together in meaningful ways. Learn more by watching this video . To find out more about what it’s like working for Philips at a personal level, visit the Working at Philips page on our career website, where you can read stories from our employee blog . Once there, you can also learn about our recruitment process , or find answers to some of the frequently asked questions . It is the policy of Philips to provide equal employment and advancement opportunities to all colleagues and applicants for employment without regard to race, color, ethnicity, religion, gender, pregnancy/childbirth, age, national origin, sexual orientation, gender identity or expression, disability or perceived disability, genetic information, citizenship, veteran or military status or a person’s relationship or association with a protected veteran, including spouses and other family members, marital or domestic partner status, or any other category protected by federal, state and/or local laws. As an equal opportunity employer, Philips is committed to a diverse workforce. In order to ensure reasonable accommodation for individuals protected by Section 503 of the Rehabilitation Act of 1973, the Vietnam Veterans' Readjustment Act of 1974, and Title I of the Americans with Disabilities Act of 1990, applicants that require accommodation in the job application process may contact 888-367-7223, option 5, for assistance. Equal Employment and Opportunity Employer/Disabled/Veteran",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-22T01:12:08.000Z"
    },
    "company": {
        "name": "Philips",
        "link": "https://nl.linkedin.com/company/philips"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 48,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Cambridge",
        "region": "MA",
        "postal_code": "02239",
        "street_address": null,
        "latitude": 42.36525,
        "longitude": -71.10502
    }
}