{
    "job": {
        "title": "Site Reliability Engineer",
        "industry": "Computer Software,Information Technology and Services",
        "description": "Salt is working with a world-renowned AI leader whose groundbreaking technology has positively changed how we work with and handle data. The business is mission-driven and uses its advancements in data intelligence to better human intelligence as opposed to replacing it. Our client has a no-ego culture that puts its employees first with benefits such as uncapped paid time off, should you need it. The culture and work they are doing, have attracted some of the smartest minds in the country to join them. This role is for operationally savvy technical thinkers who are passionate about formulating, supervising, and automating technology to enhance the team’s productivity and overall product delivery. The ability to appropriately manage many fast-paced, complex applications simultaneously is key. You will be embedded in the technology team and collaborate with engineers in product development, customer support, and a variety of other business teams is central to this position. ·      Real-time troubleshooting of critical application workflows ·      Build scripts and automate operational tasks ·      Thrive in a fast-paced, mission-critical SDLC environment where attention to detail is essential ·      Overall understanding of systems architecture – CS Degree desirable ·      Worked on or confident in being able to deliver on L3/L4 Support ·      Excellent communicator with a passion for solving problems ·      Understanding of distributed systems and cloud infrastructure – Hadoop, Spark, Kubernetes AWS etc is a plus ·      Ability to code in one or more coding languages Java, Go, Python, Ruby, Django, Flask etc",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-30T17:20:30.000Z"
    },
    "company": {
        "name": "Salt",
        "link": "https://uk.linkedin.com/company/salt"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "San Francisco Bay Area",
        "region": null,
        "postal_code": "94112",
        "street_address": null,
        "latitude": 37.39271,
        "longitude": -122.042
    }
}