{
    "job": {
        "title": "Senior Data Scientist",
        "industry": "Computer Software",
        "description": "About Us Reify Health accelerates the development of new and life-saving therapies by creatively connecting and empowering the clinical trial ecosystem. We are helping thousands of research sites across 6 continents and 7 of the top-10 global biopharma sponsors, including Amgen, AstraZeneca, and Eli Lilly & Company. Our team is made up of a diverse group of researchers, entrepreneurs, technologists, data experts, and healthcare-obsessed professionals working to eliminate some of the biggest challenges in clinical research. We care about the people who care for people...and we have fun while doing it. Our unique, rapidly growing data streams are enabling unique opportunities to manage clinical trials more efficiently and predictably. The Data Analytics & Data Science group is looking for talented Senior Data Scientists to explore our data and distill novel insights which will unlock these opportunities for clinical professionals. If you're empathetic, results-driven, and want to put your unique analytical skills to work to help the clinical research community then this may be the role for you. As a fast-growing startup, we're looking for people who can effectively balance rapid execution and delivery with statistical/mathematical rigor to serve the business most effectively. You have strong opinions, weakly held, and while well-versed technically know when to choose the right tool, for the right job, at the right level of complexity. You will work in alignment with our Data Engineering and Data Products groups, benefitting from their architecture, tooling, and technical expertise, and also collaborate on projects with company stakeholders across Design, Product, and Software Engineering. What You'll Be Working On Exploring rich historical data from clinical sites, pharmaceutical sponsors, and other stakeholders and use it to uncover applicable insights to help our sites and sponsors make more effective trial support and enrollment management decisions as early as possible Work with our Data Products group to productionize your insights and models into recommendation systems and other intelligent features for our users Perform statistical analyses and support the analyses of our analytics team to demonstrate the relative efficacy of StudyTeam to key stakeholders Developing deep familiarity with HIPAA, GDPR, and other applicable regulatory and privacy frameworks and how they influence our analysis and model development decisions Regularly communicating your insights with a wide variety of technical and non-technical stakeholders in clear written, verbal, or presentation form Living our data philosophy, which focuses on ethical decision making, being aware of how biased data (and assumptions) can affect results (and people), and being laser-focused on business needs What You Bring to Reify Health At least 5 years of professional work experience in an applied data science role dealing with regulated health or clinical data (or similar highly regulated dataset) Expertise in several techniques including NLP, supervised/unsupervised learning, Bayesian/frequentist (bio)statistics, linear optimization, neural networks, and linear/nonlinear regression Experience with developing or integrating clinical or other medical taxonomies and ontologies Deeply understands not only how to use a technique but why it is or is not appropriate in a given situation, with available data, and for specific business needs Familiarity (or ability to become familiar) with privacy-preserving or identity protecting techniques such as differential privacy, privacy-preserving GAN, etc. Expertise in at least one of the following: Clojure, Python, or R (and deep familiarity with corresponding analytics and data processing libraries) Familiarity with various database, warehouse, and streaming platforms such as PostgreSQL, Redshift, and Kafka Familiarity with AWS ecosystem (Athena, Glue, Redshift, S3, Lambda) Understanding of the nuances of testing and addressing scalability/accuracy of analytical processes in distributed/probabilistic systems Advanced degree in computer science, biostatistics, or other related field Relevant published or publicized professional or academic work such as open-source contributions, blog posts, or publications You May Develop or expand enrollment prediction models for existing trials Collaborate on solutions to optimize enrollment planning for new trials Optimize the logistics, resourcing, and orchestration of complex trials Compensation & Benefits Competitive Salary and Stock Options Salary and stock options commensurate to your experience and expertise Remote First We have team members from around the United States and beyond and have a healthy and balanced remote work culture Flexible Hours Plan your workday as you wish, just give us the majority of your core, creative hours that coincide with that of your team Comprehensive Health/Wellness Coverage 100% premium coverage for you (and >50% for your dependents) for: Top-tier health plan (with option of HSA), Dental, Vision, Disability (short-term and long-term), Life insurance (for your entire tenure at Reify), 24/7 access to doctor by phone or online via telemedicine coverage Retirement Plan 401(k) plan with employer matching program Company-provided Workstation You will be issued a brand new MacBook Pro laptop Location Convenience & Transportation For employees who are local to Boston, and want to visit the office, we are located two blocks from Downtown Crossing. Free monthly T pass. Full suite of office accommodations provided by WeWork: unlimited coffee, infused water, and more Vacation and Holiday Flexibility Generous paid time-off policy that accrues with your tenure at Reify, which includes holiday flexibility and parental leave We value diversity and believe the unique contributions each of us brings drives our success. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. Additional Notes: For US-based candidates: We are only able to hire full-time employees with permanent residency or citizenship amenable to Eastern Standard Time working hours. We are not able to sponsor visas (such as H1-B) at this time. For internationally-based candidates: We are able to hire international contractors on a case-by-case basis who are amenable to significant overlap of their working hours with Eastern Time.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-09T20:18:00.000Z"
    },
    "company": {
        "name": "Reify Health",
        "link": "https://www.linkedin.com/company/reify-health"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Greater Boston",
        "region": null,
        "postal_code": "02119",
        "street_address": null,
        "latitude": 42.36041,
        "longitude": -71.05798
    }
}