{
    "job": {
        "title": "Identity Management Software QE Engineer (Early Career)",
        "industry": "Consumer Electronics",
        "description": "Summary Imagine what you could do here. At Apple, great ideas have a way of becoming great products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Apple’s Identity Management Services Quality Engineering group is looking for a highly motivated Engineer with a strong background in Software Development and Quality Engineering to join its team of highly skilled software engineers. You will be responsible for quality engineering of server side for customer-facing distributed platforms and applications in a fast paced, dynamic environment. Your job is to keep our high-quality bar set ridiculously high, and to help us identify and execute ways to raise it even higher. The Quality Engineer in this role will play a key function in delivering highly critical Identity Management Authentication & Authorization services and features for customers in a timely manner. In this role you are encouraged to learn and use latest technologies like ML and AI to improve the automation. Key Qualifications Internship or work experience in Software Development/Quality Engineering Experience working with Java, Python or other OO languages Familiar with QE automation architecture, methodologies, processes, tools Experience in testing Web Services (Rest & SOAP), databases, and batch processes Understanding of software build tools and CI/CD integrations Experience in automating functional, system, integration and failover tests at server level. Experience in tools like Selenium WebDriver, Appium, Postman, SOAPUI for API, Web, iOS and MacOS platforms. Proven track record to deliver high-quality work on tight schedules Ability to work in a fast-paced environment with frequent context switching Self-motivated, independent, and proactive Outstanding collaboration and organizational skills Excellent written and verbal communication skills Description Provide functional and integration quality-assurance testing for features at white-box and API using REST API tools or SOAPUI or API testing tools. Provide functional and integration quality-assurance testing for features at web, iOS and MacOS using tools like Selenium WebDriver, Appium, UI Automation or Robot framework etc., Build Quality test plans and cases with the goal of 100% automation and reduction of regression test cycle Take Quality to next level by using ML and AI in automation. Build test management tools/utilities and enhance existing automation platforms Work closely with cross-functional organizations, project teams and clients to develop test plans, execute test plans and cases, and deliver high quality products Act as a strong advocate for quality in the software development process Identify gaps or inefficiencies in workflows and suggest necessary process improvements Self-motivated, able to grasp issues quickly and make educated, critical judgment in the absence of complete requirements Provide project managers with timely and accurate testing status and progress during all testing phases, including summarizing Quality results at project conclusion Education & Experience Bachelors degree in CS, CE, ECE, EECS, IS, IT and other related fields of study Role Number: 200257937",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-23T06:29:33.000Z"
    },
    "company": {
        "name": "Apple",
        "link": "https://www.linkedin.com/company/apple"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Austin",
        "region": "TX",
        "postal_code": "78746",
        "street_address": null,
        "latitude": 30.264978,
        "longitude": -97.7466
    }
}