{
    "job": {
        "title": "Senior Software Engineer (PHP)",
        "industry": "Accounting",
        "description": "If you are a Senior Software Engineer with PHP experience, please read on! We are a fintech company that is leading the charge in the digital payments industry. We are located in Southern California and were established to streamline the diverse needs for businesses when making payments. Our platform helps to efficiently organize payments that need to be made and puts it all into a single dashboard to make payments easily. We understand that each business runs differently and has different needs, so we help to automate the process and really find that our product adds value to make the process easier so that people can spend time working on other important things to help the business run and grow! We are looking for a Senior Software Engineer that has experience working with PHP and a PHP framework, although we prefer CodeIgniter. This person will be responsible for providing efficient backend code while being highly autonomous. We are looking for someone that can deliver on mission critical projects, measure overall code quality and hep with testing and automation. We need an engineer that can participate and provide solutions on code reviews, design, and participate effectively in technical discussions on how to grow our product platform. Top Reasons to Work with Us Steady room for growth Make high-end tech products Awesome family like culture What You Will Be Doing Develop software and work with a highly functional Agile team Help design and implement overall best practices Provide quality code and help measure quality and track overall improvement Develop new features to the platform while also participate in testing and documentation Build third party API integrations and work on custom implementations What You Need for this Position 2+ years of experience in: PHP PHP framework: CodeIgniter (preferred), Laravel, Symfony, etc. MySQL GIT RESTful API's Nice To Have Docker/Kubernetes and overall CI/CD methodologies Jira and BitBucket Cloud technology: GCP/AWS So, if you are a Senior Software Engineer with PHP experience, please apply today! Email Your Resume In Word To Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also: Jonathan.Santo@CyberCoders.com Please do NOT change the email subject line in any way. You must keep the JobID: linkedin : JS25-1645591 -- in the email subject line for your application to be considered.*** Jonathan Santo - Executive Recruiter - CyberCoders Applicants must be authorized to work in the U.S. CyberCoders, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-25T17:39:06.000Z"
    },
    "company": {
        "name": "CyberCoders",
        "link": "https://www.linkedin.com/company/cybercoders"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Irvine",
        "region": "CA",
        "postal_code": "92717",
        "street_address": null,
        "latitude": 33.68591,
        "longitude": -117.82472
    }
}