{
    "job": {
        "title": "Machine Learning/Data Engineer-REMOTE",
        "industry": "Information Technology and Services,Computer Software",
        "description": "This AI Computer Software company located in Palo Alto, CA is looking to hire a sharp Machine Learning/Data Engineer to join their growing company This Jobot Job is hosted by Taylor Buckelew Are you a fit? Easy Apply now by clicking the \"Apply\" button and sending us your resume. Salary $135,000 - $170,000 per year A Bit About Us Located in the beautiful Palo Alto, CA we are the leading provider of AI- powered software products that transform healthcare claims and payment operations. Our platform has enabled us to develop and deploy, at high speed, industry-specific products. We are looking to hire a strong Machine Learning/Data Engineer to own out data ingestion and transformation process. You will ultimately own the data and make them available within the Data Science organization as well. Why join us? We offer a comprehensive compensation package including but not limited to A competitive base salary ranging from $135K-$165K (DOE) + EQUITY! 401k Benefits Health, Dental, Vision Collaborative team Trainings Paid time off Parties and team building events Job Details You will be responsible for and MUST have most or ALL of the following Hands-on experience with Machine Learning Data Engineering in either a lead developer or a management role SQL proficiency is a MUST Experience managing the delivery of complex data Experience with cloud-based services and enterprise software environments Strong data technical background Familiarity with frameworks and protocols for data transfer, data consumption and data manipulation Ability to balance trade offs among multiple competing priorities Experience with Machine Learning pipelines, Big Data PLUS, not required if candidate has worked with medical records before IF INTERESTED, APPLY DIRECTLY HERE OR EMAIL ME A RESUME AT taylor.buckelew@jobot.com Interested in hearing more? Easy Apply now by clicking the \"Apply\" button.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-03T21:11:13.000Z"
    },
    "company": {
        "name": "Jobot",
        "link": "https://www.linkedin.com/company/jobot"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "New York",
        "region": "NY",
        "postal_code": "10132",
        "street_address": null,
        "latitude": 40.713047,
        "longitude": -74.00723
    }
}