{
    "job": {
        "title": "Senior Software Engineer - Golang",
        "industry": "Information Technology and Services,Computer Software,Computer &amp; Network Security",
        "description": "We are looking for a dedicated, hard-working Sr. Software Engineer with expertise in Golang to complement our existing engineering staff. This position can be based out of our Lake Mary, FL location, or remote. We are a group that is passionate about making the Internet a safer place by helping identify the “who” behind malicious activity. As a Software Engineer at Team Cymru , you will be at the forefront of threat intelligence and surrounded by highly experienced professionals in the field of Internet Security. The right individual will share our passion and Mission to Save and Improve Human Lives by making the Internet safer. Team Cymru is THE LEADER in Internet intelligence providing unparalleled global coverage and insight to better monitor, analyze, and predict online activity. The skills you need 5+ years’ experience in enterprise software engineering 5+ years’ experience with Linux 1+ years’ experience with Golang 1+ years’ experience writing and using automated tests 1+ years’ experience as a team lead, leading 3+ other engineers Experience with Agile Software Development methodologies Experience creating highly concurrent systems Deep understanding of fundamental Internet concepts Ability to work effectively with various technical and non-technical departments Ability to work effectively with geographically distributed teams Ability to create and maintain SQL Database schemas Ability to assess and improve SQL Query performance Ability to use git for version control and code maintenance The attitude you need Passion for Software Development Not afraid of asking questions Enjoy learning and overcoming challenges Place high value on collaboration and team success Communication: early and often Your day-to-day will involve Writing code Planning development cycles for team Distilling concrete requirements from higher level strategic goals Guiding and tasking the team to meet deliverables Providing technical mentorship Tracking deliverables and coordinating with various teams and stakeholders Performing code reviews with the team Technologies you will be working with Golang CentOS PostgreSQL ElasticSearch Kafka Kubernetes Scala Min.io Ansible Jenkins Atlassian stack: JIRA, Confluence, Bitbucket What We Offer Competitive pay Medical, Dental, Vision Insurance Substantial PTO Company-matched 401(k) plan The most important benefit of working at Team Cymru is the privilege of being part of a company that works every day towards accomplishing our Mission: To Save and Improve Human Lives . This job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the employee. Duties, responsibilities and activities may change, or new ones may be assigned at any time with or without notice. Team Cymru is an equal opportunity employer that is committed to diversity and inclusion in the workplace. We prohibit discrimination and harassment of any kind based on race, color, sex, religion, sexual orientation, national origin, disability, genetic information, pregnancy, or any other protected characteristic as outlined by federal, state, or local laws.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-17T07:31:39.000Z"
    },
    "company": {
        "name": "Team Cymru",
        "link": "https://www.linkedin.com/company/team-cymru"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Lake Mary",
        "region": "FL",
        "postal_code": "32795",
        "street_address": null,
        "latitude": 28.759052,
        "longitude": -81.31781
    }
}