{
    "job": {
        "title": "Machine Learning Engineer",
        "industry": "Information Technology and Services,Government Administration",
        "description": "A-TEK Inc, Washington, DC A-TEK Inc, has an immediate opportunity for a Machine Learning Engineer in the Washington, DC metro area. Position Responsibilities: Supports client’s Target Data Architecture related to data technologies that includes future trend and innovation identification for AI/ML data analytics. Assists implementation of the client's Enterprise Data Catalog, an AI-driven (augmented) platform for data search and discovery. Develops operating software that can be used for artificial intelligence programs or other artificial intelligence applications. Works closely with NLP engineer as well as data architects, data scientists and strategist in order to produce systems that utilize artificial intelligence. Capability to adapt or change operating environments based on adding data. Programming systems to look for or seek out specific conditions and respond based on those factors. Clarify objectives to others in the team and may be responsible for supervising other programmers as part of overall duties. Responsible for working as part of a multidisciplinary team, analyze structured and unstructured data sources to determine the key business questions and hypotheses that can be explored within data sets. Evaluate approaches and algorithms based on available data and research objectives. Develop experimental prototypes to demonstrate concepts and communicate approach and results to decision-makers. Supports ongoing AI technology research. Familiarity with DevSecOps patterns and practices. Required Qualifications: Requires a BA or BS degree from an accredited institution in a management or technical discipline – Computer Science, Information Technology (related degrees will be considered) 3+ years of experience in a hands-on AI/ML role. Experience with at least one to two languages for implementing AI/ML algorithms (e.g., Python, R, C++, etc.), and SQL skills. Experience working with clients face-to-face Strong attention to detail and accuracy Ability to be a self-starter and manage competing priorities, multi-task, and continue to meet all deadlines and commitments while remaining flexible with continually changing priorities Excellent written and oral communication including technical writing; must be able to communicate fluently in English both verbally and in writing Preferred Skills and Experience: ·        Federal contracting experience supporting Federal civilian agencies",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-09-04T14:42:31.000Z"
    },
    "company": {
        "name": "A-TEK, Inc.",
        "link": "https://www.linkedin.com/company/a-tek-inc-"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Washington DC-Baltimore Area",
        "region": null,
        "postal_code": "21201",
        "street_address": null,
        "latitude": 38.873062,
        "longitude": -77.007385
    }
}