{
    "job": {
        "title": "Software Engineer, New Grad (Remote)",
        "industry": "Computer Software,Internet,Financial Services",
        "description": "Why join us Brex is reimagining financial systems so every growing company can realize their full potential. As the financial OS, we’re building software and services in one place—disrupting long-entrenched institutions with products and experiences that better serve the ambitions of our customers. Working at Brex allows you to push your limits, challenge the status quo, and collaborate with some of the brightest minds in the industry. We’re committed to building a diverse team and inclusive culture and believe your potential should only be limited by how big you can dream. We make this a reality by empowering you with the tools, resources, and support you need to grow your career. Engineering at Brex The Engineering team includes Data, IT, Security, and Software, and is responsible for building innovative products and infrastructure for Brex and our customers. We believe that engineers should accelerate the business through technology, and collaborate across multiple teams to accomplish that. Teams are autonomous, value inclusivity, eager to learn, teach and constantly improve how things work. The software we build today is the foundation for dozens of Brex systems in the future, so engineers have a strong sense of ownership and accountability and take pride in their craft. What You’ll Do We’re looking for folks with an interest in building products and tools, comfortable in dealing with lots of moving pieces. You’ll be building customer-facing products that will drive direct business impact and shape our long-term technical vision with a high-quality bar. You'll have the opportunity to learn and push the frontier of providing the best financial software experience to help companies grow. You’ll be encouraged to be metric and data-driven and to think creatively to help Brex scale and get prepared for the new markets we are about to enter. Design and build strong, resilient, and robust APIs, libraries, and tools to power Brex engineers and operations Own functionality and scalability features by taking responsibility from inception to deployment. Be responsible for full software development lifecycle - design, development, testing, operating in production Uphold our high engineering standards and bring consistency to the codebases, infrastructure, and processes you will encounter. Requirements Graduating in Spring 2022 Experience creating libraries and tools for engineers and operations Experience building and designing scalable backend systems Experience working with SQL or NoSQL databases Familiarity with software engineering development cycles Experience working with backend programming languages (Java, Kotlin, Python) Ability to hold yourself and the team to high standards Strong communication and interpersonal skills Bonus points Experience collaborating with experts in product, design, and operations Familiarity with functional programming languages Strong writing skills Proactive approach",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-13T02:25:32.000Z"
    },
    "company": {
        "name": "Brex",
        "link": "https://www.linkedin.com/company/brexhq"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "United States",
        "region": null,
        "postal_code": "99999",
        "street_address": null,
        "latitude": 39.50355,
        "longitude": -99.0183
    }
}