{
    "job": {
        "title": "Software Engineer",
        "industry": "",
        "description": "Role: Sr.Appain Developer / Appain Architect Location: Irving TX or Tampa FL/ India - Pune,Chennai,Hyderabad Or Mississauga, CA Type of Hire : Fulltime Position $120k-130k/annum. – can go higher salary for right candidates Job Detail •\tShould have worked on one or more end-to-end Appian BPM implementation (Design/Develop/Deploy/Package). •\tHands-on development on Appian (19x/20x) BPM applications. •\tExperience on Appian implementation knowing all aspects of Appian product and application methodology •\tExperience with Appian SAIL, Process Modeler, Rules, Expressions, Documents, Knowledge Center, Data Management through Complex Data Types XSDs and SQL queries, Custom plugin development. •\tGood understanding of Appian Objects such as Records, Sites, Actions, Expression Rules, Constants, Query Rules, SAIL Interfaces, CDTs, Process Models, Constants, Decisions, Integrations (Web API, Connected Systems etc), Data Stores, Groups, etc.\\ •\tExperience with Agile software development practices •\tExcellent oral and written communication skills. •\tAppian Level 2 Certification is plus •\tShould be able to effectively contribute in the area of screen and workflow designs for moderate sized projects. •\tShould be able to leverage Appian technical documentation and Appian user community to build new prototypes as required. •\tCode, configure, debug, unit test, integration test and document application enhancements. •\tSupport the development of user guides for new projects and enhancements. Regards, Bala bala.krishnan@scadea.com Direct: 862-319-4010 Desk: 908.636.2727 Ext. 2215",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-13T21:17:59.000Z"
    },
    "company": {
        "name": "Scadea Solutions, Inc.",
        "link": "https://www.linkedin.com/company/scadea-solutions-inc-usa"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Irving",
        "region": "TX",
        "postal_code": "75063",
        "street_address": null,
        "latitude": 32.813877,
        "longitude": -96.949936
    }
}