{
    "job": {
        "title": "Data Center Engineer",
        "industry": "Staffing and Recruiting",
        "description": "Kelly IT is recruiting for a Data Center Engineer ( 6+ Months: Contract ) opportunity with a growing and dynamic company located in Montgomery, TX (On-site position – No remote)! Requirements and Qualifications: Completed study (university) of electrical engineering or refrigeration engineering or constructional engineering or comparable education 6 years of Data Center Engineering experience Many years of professional experience or activity in the field of activity/area of responsibility also in an international or intercultural environment Many years of consulting experience in strategic projects (e.g. in flexible organizations) and complex processes Knowledge in business administration Experience in customer relationship management Experience in the business processes of customers Experience in negotiations with customers at different management levels Experience in technical management Competent knowledge in fields of high available power supply and secured cooling supply This position requires working on-site in Downers Grove, IL (no remote work) If you meet the qualifications please send your resume directly to: Miguel.Cruz@kellyit.com or, if you know of anyone who meets these qualifications and would like to take advantage of this great opportunity, please refer them to us!",
        "employment_type": "CONTRACTOR",
        "date_posted": "2021-07-09T20:19:58.000Z"
    },
    "company": {
        "name": "Kelly | IT Resources",
        "link": "https://www.linkedin.com/company/kelly-it-resources"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 72,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Montgomery",
        "region": "TX",
        "postal_code": "77356",
        "street_address": null,
        "latitude": 30.403498,
        "longitude": -95.677765
    }
}