{
    "job": {
        "title": "Senior Software Engineer (Remote)",
        "industry": "Information Technology and Services,Computer Software,Financial Services",
        "description": "URGENTLY HIRING REMOTE SENIOR FULL STACK ENGINEERS WITH HEAVY JAVASCRIPT + NODE EXPERIENCE!!-- Job Title: Senior Software Engineer Salary: $140k - $180k Job Location: 100% Remote Requirements: 8+ years software engineering experience with expiernece using JavaScript and Node (or TypeScript). The following are desired but not required: AWS, TypeScript, RUST, etc. We are a 350 person SaaS technology platform that uses AI to help eCommerce companies foster growth. Our software helps connect suppliers with top retailers across the world. With our technology and services there is no inventory risk which allows retailers to rapidly expand their product reach. We have grown immensely over the years having integrated with thousands of enterprise retailers and online shopping channels. Our channels include Amazon, e Bay, and Google Shopping, to name a few. Top Reasons to Work with Us Work Remote Competitive salary ($140k - $180k) 401k Match Stable / Fast Growing / Exciting company Work w/ Industry Pros who have a few impressive exits under their belts Full Benefits (health, dental, vision, etc.) What You Will Be Doing You will be responsible for the full stack development of our market changing platform Work directly with cross-functional development and product teams to determine new features to be built into the platform Build and maintain real-time, event-driven systems, services, and features Create new components and improve existing components What You Need for this Position 8+ years software development AWS (Kinesis, DynamoDB, Lambda, etc.) Node or TypeScript JavaScript RUST is a big plus Angular is a plus (or React, Vue, etc.) BS in CS (or related) is preferred So, if you are a Senior Software Engineer (Remote) with experience, please apply today! Email Your Resume In Word To Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also: Danny.Herries@Optello.com Please do NOT change the email subject line in any way. You must keep the JobID: linkedin : DH1-1642387 -- in the email subject line for your application to be considered.*** Danny Herries - Lead Recruiter - Optello Applicants must be authorized to work in the U.S. Optello is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-31T07:10:00.000Z"
    },
    "company": {
        "name": "Optello",
        "link": "https://www.linkedin.com/company/optello-us"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 96,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Seattle",
        "region": "WA",
        "postal_code": "98133",
        "street_address": null,
        "latitude": 47.60323,
        "longitude": -122.33028
    }
}