{
    "job": {
        "title": "Software Engineer",
        "industry": "Computer &amp; Network Security,Computer Software",
        "description": "It's fun to work in a company where people truly BELIEVE in what they're doing! We're committed to bringing passion and customer focus to the business. Company Overview At Proofpoint, we have a passion for protecting people, data, and brands from today’s advanced threats and compliance risks. We hire the best people in the business to Build and enhance our proven security platform Blend innovation and speed in a constantly evolving cloud architecture Analyze new threats and offer deep insight through data-driven intel Collaborate with customers to help solve their toughest security challenges We are singularly devoted to helping our customers protect what matters most. That’s why we’re a leader in next-generation cybersecurity—and why more than half of the Fortune 100 trust us as a security partner. The Role Proofpoint is seeking a highly skilled programmer with experience in full-stack development. \u2028\u2028You will be working with several teams across the company in identifying requirements and designing and implementing features for new and existing services to support internal needs. You will play a critical role in helping the company achieve its aggressive goals for revenue and market growth. The applications engineering team you of which you will be a part has a daily impact through its services on the Proofpoint’s ability to market, sale, deliver and monitor our products and services. Your day-to-day Enhance and maintain services on MEAN stack on Docker in AWS Design and develop new services on MERN or equivalent on Docker in AWS Work with individuals and teams across the globe via collaboration tools including chat, audio, and video conferencing What You Bring To The Team A passion for developing robust, performant and user-friendly systems An ability to drive the development of features and services from the requirements phase all the way through to deployment 5-7 year’s experience developing UI HTML, CSS, JavaScript and frameworks such as Angular or React Familiarity with version control tools like Git and issue tracking like Jira Understanding of continuous integration development and use of build automation tools (Jenkins, Harness, etc.) Experience using and designing RESTful APIs and micro-services Experience working with a container toolset (Docker, Kubernetes, etc.) Experience with NodeJS application development Ability to work with Agile software development methodologies Ability to mentor junior Software Engineers Ease in working with non-technical co-workers at all levels and in all areas of a large enterprise Why Proofpoint As a customer focused and driven-to-win organization with leading edge products, there are many exciting reasons to join the Proofpoint team. We believe in hiring the best the brightest and cultivating a culture of collaboration and appreciation. As we continue to grow and expand globally, we understand that hiring the right people and treating them well is key to our success! We are a multi-national company with locations in 10 countries, with each location contributing to Proofpoint’s amazing culture! If you like wild growth and working with happy, enthusiastic over-achievers, you'll enjoy your career with us!",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-18T22:03:11.000Z"
    },
    "company": {
        "name": "Proofpoint",
        "link": "https://www.linkedin.com/company/proofpoint"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Sunnyvale",
        "region": "CA",
        "postal_code": "94089",
        "street_address": null,
        "latitude": 37.373676,
        "longitude": -122.036575
    }
}