{
    "job": {
        "title": "Software Engineer, Backend",
        "industry": "Marketing and Advertising,Computer Software,Internet",
        "description": "DoorDash is building the world's most reliable on-demand, logistics engine for delivery! We're looking for experienced engineers to join our fast-growing engineering team to help us develop a 24x7, global infrastructure system that powers DoorDash’s three-sided marketplace of consumers, merchants, and dashers. Platform Evolution is a new DoorDash engineering team based out of our newly formed Pittsburgh engineering hub. The team will be focused on supporting DoorDash’s expansion globally through the modernization and evolution of DoorDash’s service architecture. As a centralized platform team focused on accelerating cross-team migration efforts, you’ll have the opportunity to learn and contribute to all of DoorDash’s products and internal services. Initially, the focus of the team will be moving away from our existing Python based service architecture to our new Kotlin based platform. What You’ll Do Join as a founding member of the Pittsburgh Engineering Team. Develop, release and run large-scale web applications Develop and define the backend architecture and tech stack for our products Improve performance, reliability, scalability and security for our backend systems Be involved in transitioning our monolithic codebase to a microservice-based architecture Completely disrupt logistics by tackling bleeding-edge, technical problems What We're Looking For B.S., M.S., or PhD. in Computer Science or equivalent 5+ years of industry experience Prior experience working with backend tech stacks Able to analyze and improve efficiency, scalability, and stability of various system resources Experience with service oriented architecture, writing REST API’s, unit testing, and architectural design Understanding of modern web stacks and architecture (HTTP, REST) Experience with SQL and NoSQL databases and other technologies (e.g. Postgres, Redis, Elasticsearch, RabbitMQ) Nice To Haves Experience building large scale, real-time applications Experience with Java/Kotlin Contributor to open source projects Why You’ll Love Working at DoorDash We are leaders - Leadership is not limited to our management team. It’s something everyone at DoorDash embraces and embodies. We are doers - We believe the only way to predict the future is to build it. Creating solutions that will lead our company and our industry is what we do -- on every project, every day. We are learners - We’re not afraid to dig in and uncover the truth, even if it’s scary or inconvenient. Everyone here is continually learning on the job, no matter if we’ve been in a role for one year or one minute. We are customer obsessed - Our mission is to grow and empower local economies. We are committed to our customers, merchants, and dashers and believe in connecting people with possibility. We are all DoorDash - The magic of DoorDash is our people, together making our inspiring goals attainable and driving us to greater heights. We offer great compensation packages and comprehensive health benefits. About DoorDash DoorDash is a technology company that connects customers with their favorite local and national businesses in all 50 US states, Canada, and Australia. Founded in 2013, DoorDash empowers merchants to grow their businesses by offering on-demand delivery, data-driven insights, and better in-store efficiency, providing delightful experiences from door to door. By building the last-mile delivery infrastructure for local cities, DoorDash is bringing communities closer, one doorstep at a time. Read more on the DoorDash blog or at www.doordash.com. Our Commitment to Diversity and Inclusion We’re committed to growing and empowering a more inclusive community within our company, industry, and cities. That’s why we hire and cultivate diverse teams of the best and brightest from all backgrounds, experiences, and perspectives. We believe that true innovation happens when everyone has room at the table and the tools, resources, and opportunity to excel. Pursuant to the San Francisco Fair Chance Ordinance, Los Angeles Fair Chance Initiative for Hiring Ordinance, and any other state or local hiring regulations, we will consider for employment any qualified applicant, including those with arrest and conviction records, in a manner consistent with the applicable regulation",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-30T01:14:16.000Z"
    },
    "company": {
        "name": "DoorDash",
        "link": "https://www.linkedin.com/company/doordash"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Pittsburgh",
        "region": "PA",
        "postal_code": "15235",
        "street_address": null,
        "latitude": 40.44217,
        "longitude": -79.99496
    }
}