{
    "job": {
        "title": "Senior Site Reliability Engineer",
        "industry": "Financial Services,Information Technology and Services",
        "description": "This leading LendTech has recently secured $25 million in Series A funding and is revolutionizing the previously dysfunctional home buying process in the US. In advancing the company’s internal operations, they are looking for an experienced Site Reliability Engineer to join the core infrastructure team and drive the scale-up of their systems, mentor engineers on DevOps best practices and solve existing problems within the company’s key subscriptions. What’s the Challenge? Design and build large-scale systems and optimize existing systems for scalability Work closely with developers to build and maintain CI/CD workflows on demand Be a problem solver that can diagnose and fix operational challenges by optimizing code Have a strong sense of ownership and a drive to get the job done regardless of the circumstances Technologies: AWS – main core infrastructure Infrastructure as Code – Terraform, Ansible or CloudFormation Containers and Orchestration – ability to run and manage any production workloads in Docker/Kubernetes/ECS Experience in programming and automating processes using at least one of the core languages (Python, GoLang, Java, Ruby, Bash) Nice to Haves: Experience in multiple cloud providers (GCP, Azure, AWS) Knowledge of cloud security and networking Monitoring – Prometheus and Grafana FinTech, Payments or financial services experience Experience using Node.js Experience with microservices You should apply if you want to join a company at an exciting phase in their growth journey and contribute significantly to the technical choices and see your work have an impact from day 1. 🌎 Austin 📧 Interested in applying? Please click on the ‘Easy Apply’ button ⚡ Storm2 is a FinTech recruitment firm with clients across London, Europe, APAC, and North America. To discuss open opportunities or career options, please visit our website www.storm2.com and follow the Storm2 Linked In page for the latest jobs and int el.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-12T15:24:46.000Z"
    },
    "company": {
        "name": "Storm2",
        "link": "https://uk.linkedin.com/company/storm2"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Austin",
        "region": "TX",
        "postal_code": "78746",
        "street_address": null,
        "latitude": 30.264978,
        "longitude": -97.7466
    }
}