{
    "job": {
        "title": "Software Engineer",
        "industry": "Hospital &amp; Health Care",
        "description": "Our mission is to deliver critical healthcare analytics that positively impact every care path In America. As we continue to grow, we are looking for a Software Engineer to join our team to help post-acute providers better partner with referral sources — so that more patients receive the care they need, where they need. You, as the Software Engineer, will be responsible for developing innovative solutions and high-quality products. We are looking for the highest levels of technical talent and programming skills, as well as a keen desire to deeply understand our products and services to push our technology forward with respect to functionality, performance, reliability, and scalability. Are you ready? Join us as we empower meaningful change in healthcare! Location: Philadelphia, PA Reports to: Lead Software Engineer As a member of the Technology team at Trella, you will: Be a core contributor to Trella’s software applications Create modern web applications using TypeScript, Sass, and Angular 10 Create back-end services using C#, SQL, ReST, Node.js, and/or JSON Build and develop new user-facing experiences Partner closely with cross-functional teams in design, product, and other business units Take ownership in product features that drive Trella’s mission Grow the company’s ever-evolving architecture Improve the team through the process and/or technical contributions Be results-driven – We prosper by delivering value to our customers. We need each team member to be customer-centric and focusing on actions that provide value to the customer This job might be a fit for you if you have: Strong applied experience. You’ve built, broken, and rebuilt software applications. We’re looking for creative thinkers who also know how to create real-world products Working knowledge of web technologies (such as HTTP, HTML/DOM, JavaScript, Sass, Angular 10, a modern Javascript framework) Working knowledge of C#, JSON, and SQL Understanding around concepts like Web Services, SOA, REST APIs, design patterns, best practices A constant desire to grow, learn and explore new things An ability to work pragmatically – balancing business needs with engineering needs and understanding what over-engineering is and what good design is An understanding and/or working knowledge of microservices Working knowledge with at least one modern cloud service provider such as AWS A burning desire for continually improving About Trella Health: Trella Health is a rapidly growing, VC-backed healthcare technology company dedicated to improving healthcare. By empowering post-acute care providers and their patient referral sources to advance the way they work together, we’re paving the way for healthier, more cost-effective outcomes. Our clients range from the largest national providers down to small standalone agencies. Our solutions give business leaders an active picture of the care continuum so they can better understand peer and provider performance metrics in their market. Our customers use analytics and insights to improve growth and performance in their business. The Trella Health Experience: Trella Health encourages diverse perspectives and celebrates curiosity, initiative, drive, and a passion for making a difference. Our collaborative culture is anchored by trust, transparency, and inclusion — and we also have a lot of fun. Other benefits include: Medical, dental, and vision healthcare Competitive salary and bonus structure Unlimited Paid Time Off Flexible work hours Share options/equity Equal Opportunity Employer Trella Health is an equal opportunity employer. All persons will receive consideration for employment without regard to race, color, gender, sexual orientation, gender identity or expression, religion, national origin, marital status, age, disability, handicap, veteran status, genetic information, or any other protected status as recognized by federal, state, or local laws.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-14T17:06:31.000Z"
    },
    "company": {
        "name": "Trella Health",
        "link": "https://www.linkedin.com/company/trellahealth"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Philadelphia",
        "region": "PA",
        "postal_code": "08051",
        "street_address": null,
        "latitude": 39.95106,
        "longitude": -75.16562
    }
}