{
    "job": {
        "title": "Sr. Site Reliability Engineer",
        "industry": "Computer Software",
        "description": "Lucas Group has partnered with a growing SaaS company on their search for a Remote Sr. Site Reliability Engineer. If you enjoy working in a fast-paced, collaborative environment and \"nerding out\" on technology, this is the company for you. Not to mention, you get to do it from your own home 100% of the time! Scope of Responsibilities : Building, and maintaining, robust, actionable alerting and monitoring systems and workflows. Influence across boundaries and at all levels of the organization. Implement, maintain and improve CI/CD processes and tools. Work closely with development teams to improve services, deployments and releases. Build enhancements within an existing software architecture and suggest improvements to the architecture. Assists in defining the appropriate operational planning. Skills Needed : A desire to automate everything. Whether that be infrastructure as code or tooling to eliminate toil, automation should be a core focus of your mindset and the elimination of repetitive tasks should be a constant desire in the role. A mindset of total ownership - you aren't afraid to dig into things you've never worked on before, from the browser all the way to the persistence layer. You've got a solid foundation in debugging and can jump in when needed to any problem you're asked to help with. An architectural mind. You understand the fundamentals of distributed computing and look for ways to make systems more resilient, self-healing, and eliminate the need for human intervention as much as possible. Educational & Work Requirements : Degree : B.S. Computer Science Work Experience : 5+ years in a Site Reliability role Title : Sr. Site Reliability Engineer Location : Remote Client Industry : SaaS company Lucas Group ID :1585969 About Lucas Group Lucas Group is North America's premier executive recruiting solutions firm. Since 1970, our culture and methodologies have driven superior results. We assist clients ranging in size from small to medium-sized businesses to Fortune 500 companies by providing staffing solutions on a contract, contract-to-hire, and direct-hire basis. Our national reach spans major U.S. cities, job functions and industries, with divisions specializing in Accounting & Finance, Human Resources, Information Technology, Legal, Military Transition, Sales & Marketing, Supply Chain & Operations. We are an Equal Opportunity Employer. To learn more, please visit Lucas Group at www.lucasgroup.com and connect with us on LinkedIn, Facebook, and Twitter.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-20T19:09:22.000Z"
    },
    "company": {
        "name": "Lucas Group",
        "link": "https://www.linkedin.com/company/lucas-group"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Cincinnati",
        "region": "OH",
        "postal_code": "45241",
        "street_address": null,
        "latitude": 39.1037,
        "longitude": -84.51361
    }
}