{
    "job": {
        "title": "Site Reliability Engineer",
        "industry": "Computer Software,Human Resources,Information Technology and Services",
        "description": "Do what you love. Love what you do. At Workday, we help the world’s largest organizations adapt to what’s next by bringing finance, HR, and planning into a single enterprise cloud. We work hard, and we’re serious about what we do. But we like to have fun, too. We put people first, celebrate diversity, drive innovation, and do good in the communities where we live and work. About the Team The Delivery Engineering team for Workday Analytics is a team of engineers for engineers. We get the opportunity to support a lot of different groups including back-end, front-end, SDETs, etc. We spend our time writing software and manage how we deliver, deploy, monitor and everything in-between.  We are responsible for the infrastructure around how we build Prism, how we support and test and, ultimately, how we deploy. We are a small but growing team with a diverse set of skills. This is an exciting area of growth at Workday that your contributions will have a direction impact on. Our team is keenly focused on several of Workday’s core values, including innovation, integrity, and employees. About the Role You will be a key contributor on the Analytics Delivery Engineering team. As an SRE, you will help in building a clean, scalable, reliable, and automated services framework. What You Will Do Work on projects ranging from building out robust CI/CD to automation for both the Prism engineering team and SRE team Work on enhancements and improvements for monitoring, alerting, and tracing of not only internal services but most importantly, production services. Collaborate with others on the SRE team to help set technical direction while ensuring requirements are met. Help enhance, build, and maintain internal infrastructure running in the public cloud as well as orchestration across the Workday Private Cloud. Interact and be the primary contact with multiple teams both internally in Workday Prism Analytics alongside external Workday teams Participate in and facilitate production on-call duties and events to ensure reliability of the analytics applications and play a pivotal role in building the foundation that delivers Workday Analytics to the cloud. About You Basic Qualifications MS in Computer Science or related field and 2 years relevant experience or BS in Computer Science or related field and 5 years relevant experience You have a strong coding background and can utilize various languages. We focus and build tooling and automation using Python, GoLang and Java. You prefer building infrastructure and tooling in the cloud and using managed services where possible, we focus on AWS You package and deliver immutable services and functions, utilizing Docker, Kubernetes and Serverless frameworks (AWS Lambda, API Gateway) Other Qualifications You have experience in designing, analyzing, and troubleshooting large-scale distributed systems build on technologies like Spark, YARN, Hadoop, Kubernetes You love to work in Unix/Linux from kernel to shell, file systems, client-server protocols, etc. You believe that everything should be repeatable and use orchestration and deployment tools and Infrastructure as Code such as terraform, Ansible You rely on CI/CD to automatically deliver build pipelines such as Jenkins, TeamCity, Bamboo, Artifactory You utilize and help create meaningful metrics and alerts using technologies like: Prometheus, Sensu, Nagios, Kafka, Grafana, Wavefront, BigPanda, DataDog, PagerDuty, CloudWatch You’ve worked with JVM’s and have debugged and tuned them in the past Workday is an Equal Opportunity Employer including individuals with disabilities and protected veterans.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-09-07T07:05:33.000Z"
    },
    "company": {
        "name": "Workday",
        "link": "https://www.linkedin.com/company/workday"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Pleasanton",
        "region": "CA",
        "postal_code": "94588",
        "street_address": null,
        "latitude": 37.658436,
        "longitude": -121.877
    }
}