{
    "job": {
        "title": "Software Engineer - Roku &amp; Web",
        "industry": "Information Technology and Services,Computer Software,Internet",
        "description": "Description Who are we? We are Accedo and have more than ten years of experience helping hundreds of TV platform operators, broadcasters, media companies, and consumer electronics manufacturers across the globe to design, deliver and manage the next generation video user experience across a vast range of connected devices. Accedo delivers rich media apps on multiple platforms ranging from Smart TVs, gaming consoles and media devices to smart phones and tablets. Our customers include over 350 of the world's leading video service providers, such as Netflix, Spotify, HBO, NBC Universal, SBS, Seven West Media, Channel 9, ABC, Telstra, Fox Sports among many others. What We Are Looking For Accedo is looking for talented Software Engineers to join the Australia team in Sydney. The primary responsibility will be the development of Roku applications, but also the opportunity to work on other Smart TV platforms and Web using JavaScript. You will play a key role in designing, building and maintaining large-scale, high availability front-end applications and integrating with the related platform infrastructure (e.g API services, build pipelines, automated testing, etc). Ensuring development best practices are followed (Clean Code, Clean Architecture, code reviews.) Actively communicate with the project managers, team members, and clients. At Accedo you will be part of a diverse and multi-disciplined development team, gaining exposure to cutting edge technologies and the opportunity to work with some of the largest global media brands in the industry. Working in a highly collaborative environment, you will help transform requirements and designs into high performing feature rich applications on a wide variety of web based platforms and devices. Skills And Experience Software development experience using Roku’s BrightScript with its UI Framework, SceneGraph. Experience in Web and/or CTV development using JavaScript and related frameworks and libraries is highly desirable, e.g. React, Gatsby, NextJS, Express Good understanding of development methodologies, testing practices, and tools and knowing when to apply each method to achieve the desired outcomes Experience and knowledge of Design and Architectural patterns and knows when to apply them Strong communication skills and knows when to ask for help and bounce ideas and solutions off peers What We Offer Entrepreneurial spirit: You will work in a dynamic and innovative organisation alongside the smartest and most dedicated people in the industry. Multicultural offices: You will be part of a truly inclusive and diverse environment, with employees from all over the world. We are proud of being an equal opportunity employer. Learning opportunities: You will benefit from a wide range of learning and transfer knowledge from/to your colleagues worldwide. Friendly environment: You will collaborate tightly with colleagues and make many friends beyond the professional context. Other then that we offer competitive salary and benefits, flexible work from home opportunities and access to the latest developments in the OTT industry. Eligibility Only those candidates who are an Australian / New Zealand Citizen, Australian Permanent Resident, or have a working visa for Australia, valid for at least the next 2 years, will be considered for this role. Accedo will not not offer any VISA support / Sponsorship for this role. Requirements Degree in Computer Science, Software Engineering, IT or related discipline 3 - 5 years professional experience developing software applications, 2+ in Roku development. Experience integrating open source or 3rd party API’s and Libraries highly desirable Good working knowledge of JavaScript Frameworks (React, Angular, Express, Gatsby, NextJS) Good knowledge of performance and memory optimisations, proficient usage of the tools available in SDK's and excellent debugging skills Proficient with source code management (Git/Bitbucket/GitHub) Exposure to Agile, Continuous Integration, Test Driven Development is a plus Must have excellent problem solving skills and love technical challenges Interest in learning new platforms and new technologies Experience in Video and media based development projects is highly desirable (DRM, OVPs, Advertising, Analytics) AWS experience is highly desirable Good command of English",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-18T22:13:19.000Z"
    },
    "company": {
        "name": "Accedo.tv",
        "link": "https://se.linkedin.com/company/accedo-tv"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 120,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "AU",
        "locality": "Sydney",
        "region": "NS",
        "postal_code": "2046",
        "street_address": null,
        "latitude": -33.872765,
        "longitude": 151.20534
    }
}