{
    "job": {
        "title": "Frontend Software Engineer ( Remote ) ( Full-Time )",
        "industry": "Staffing and Recruiting",
        "description": "Staff Frontend Software Engineer ( Remote ) ( Full-Time ) Location: Remote Must Haves: You have 5+ years of professional work experience. You have experience with CSS in large-scale web app development. You have hands-on experience utilizing React. You love the good parts of JavaScript and have an intimate relationship with the weird parts. Big Data experience would be considered a big plus Roles and Responsibilities: Use front-end technologies like ES6, React, and Redux to build modern, scalable web applications. Dive deep and solve challenging problems in both technical and cultural areas of working at a startup. Write functional and integration tests to ensure reliability across releases. Collaborate with multi-functional teams, working with other specialists to break down complex ideas and drive features from start to finish. Drive technical investments from the early exploration of ideas to delivering integral parts of our stack, balancing short-term goals with long-term architectural vision. Mentor others on your team to help them grow as engineers across many dimensions. Basic Qualifications: Bachelor's or Master's degree in computer science or related discipline. You have 5+ years of professional work experience. You have experience with CSS in large-scale web app development. You have hands-on experience utilizing React. You love the good parts of JavaScript and have an intimate relationship with the weird parts. You are a mindful, empathetic, and communicative teammate. You take pride in the things you build, from the visual polish of the user experience to the reliability of services. You believe in and thrive in test-driven development. You understand that being an effective software engineer is as much about communicating with people and understanding the problem to be solved as it is about writing code. You're interested in observing existing development patterns, identifying their strengths and weaknesses, and designing flexible and maintainable solutions to augment those patterns. You are a lifelong learner. Preferred Qualifications: Hands-on experience working within large data platforms. Technologies you will be exposed to: React Redux NodeJS CSS Python Docker AWS Cypress",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-10-05T17:13:27.000Z"
    },
    "company": {
        "name": "Career Developers, Inc.",
        "link": "https://www.linkedin.com/company/career-developers-inc-"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "California",
        "region": "United States",
        "postal_code": "93266",
        "street_address": null,
        "latitude": 37.254673,
        "longitude": -119.61728
    }
}