{
    "job": {
        "title": "Senior Site Reliability Engineer",
        "industry": "Marketing and Advertising,Information Technology and Services,Computer Software",
        "description": "Our Company Changing the world through digital experiences is what Adobe’s all about. We give everyone—from emerging artists to global brands—everything they need to design and deliver exceptional digital experiences! We’re passionate about empowering people to create beautiful and powerful images, videos, and apps, and transform how companies interact with customers across every screen. We’re on a mission to hire the very best and are committed to creating exceptional employee experiences where everyone is respected and has access to equal opportunity. We realize that new ideas can come from everywhere in the organization, and we know the next big idea could be yours! The Challenge Adobe Stock team is looking for an exceptional Site Reliability Engineer (SRE) to support the innovation we are bringing to the market through microservice and continuous integration/continuous deployment processes. We provide designers and businesses access to hundreds of millions high-quality, curated, royalty-free photos, videos, vectors, illustrations, templates, and 3D assets, for all their creative project needs. Adobe Stock is both a highly interactive web site and as well as integrated right into Adobe’s desktop and mobile apps providing search, browse, and purchase integration. We are a team with the excitement and energy of a startup, but the resources of a large software company committed to providing outstanding value to its customers! What You’ll Do Build and run large-scale, highly distributed, fault-tolerant systems Develop tools and automated solutions in support of hosted services Handle and resolve issues raised in the production environment Tackle performance, reliability, and scalability issues Collaborate with application engineers and train developers as needed What You Need To Succeed This SRE position requires strong technical skills, excellent communications and problem-solving skills, and the ability to engage and work well with other teams The ideal candidate will have skills and experience operating and supporting Internet hosted applications and protocols Build on industry leading infrastructure tools and technologies such as Terraform, Chef, AWS to create tailored solutions solving results-oriented problems at scale Must Have BSc in Computer Science or equivalent 5+ years programming experience with web technologies, infrastructure automation Knowledge of the best engineering practices around building high performance, reliable and scalable Web Services Experience in administration and automation of Linux Servers, both in cloud and in data centers Ability to dig deep, debug and solve problems on distributed systems Git proficiency Willingness to be part of a team on-call rotation Previous experience as a lead or in management, a plus. Technologies We Use Amazon Web Services New Relic, DataDog, Nagios Terraform, Chef Python, PHP, bash, Ruby Jenkins Splunk PostgreSQL, ElasticSearch NGINX, HAProxy",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-10-08T04:49:09.000Z"
    },
    "company": {
        "name": "Adobe",
        "link": "https://www.linkedin.com/company/adobe"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "San Francisco",
        "region": "CA",
        "postal_code": "94121",
        "street_address": null,
        "latitude": 37.78008,
        "longitude": -122.42016
    }
}