{
    "job": {
        "title": "DevOps Engineer",
        "industry": "Information Technology and Services,Computer Software,Financial Services",
        "description": "Are you a passionate DevOps Engineer with deep technical know-how and hands-on experience implementing various practices and tools in the DevOps toolchain? Are you interested in promoting the DevOps culture in our client organizations? Here at Accenture, we are changing the world through the most advanced DevOps solutions on the planet! Want to be a part of it? If you are about solving exciting problems and shaping the future of technology, we would love to talk with you. Accenture works with the world’s largest companies and government agencies to enable innovation at scale using cloud-based technologies. We are the leading systems integrator for all the major cloud providers including Amazon Web Services, Microsoft Azure, and Google Cloud Platform and we work with over 90% of Fortune 100 companies. Accenture is also committed to developing your skills and providing support to shape and grow your future. Our employees agree, as we have been consistently recognized on Fortune's 100 Best Companies To Work For list for 10 consecutive years. Basic Qualifications: Minimum of 3 years of experience designing and implementing continuous delivery and/or DevOps solutions or architecture patterns Minimum of 3 years experience with code repository management, code merge and quality checks, continuous integration, and automated deployment and management using tools like Jenkins, Git, Puppet, Terraform, Maven, UrbanCode, and Docker Minimum of 3 years of experience with approaches and tooling for automated build, delivery, and release of software Minimum of 1 year of experience working in an Agile delivery environment Minimum of 1 year of Java or other programming language A Bachelor’s Degree or equivalent work experience (12 years) or an Associate’s Degree with 6 years of work experience For now, all Accenture business travel, international and domestic, is currently restricted to client-essential sales/delivery activity only. Please note: The safety and well-being of our people continues to be the top priority, and our decisions around travel are informed by government COVID-19 response directives, recommendations from leading health authorities and guidance from a number of infectious disease experts. Preferred Qualifications: Experience in project or program management Experience in writing Dockerfiles and deploying containers Experience in defining and managing the roadmap for implementation of DevOps in an established operation Experience working in a structured environment, including use of structured methods, approaches, and modern development tools Experience with technical architecture – that is, the design and delivery of IT systems for a broad range of clients Experience using and/or implementing tools like Veracode, Fortify, Black Duck, AppScan enterprise, WebInspect or comparable tool Certifications or experience on cloud platforms, such as, AWS, Azure, Google Cloud Professional Skill Requirements: Proven success in contributing to a team-oriented environment Proven ability to work creatively and analytically in a problem-solving environment Desire to work in an information systems environment Excellent leadership, communication (written and oral) and interpersonal skills As required by the Colorado Equal Pay Transparency Act, Accenture provides a reasonable range of minimum compensation for roles that may be hired in Colorado. Actual compensation is influenced by a wide array of factors including but not limited to skill set, level of experience, and specific office location. For the state of Colorado only , the range of starting pay for this role is $72,400 - $134,999 and information on benefits offered is here. What We Believe We have an unwavering commitment to diversity with the aim that every one of our people has a full sense of belonging within our organization. As a business imperative, every person at Accenture has the responsibility to create and sustain an inclusive environment. Inclusion and diversity are fundamental to our culture and core values. Our rich diversity makes us more innovative and more creative, which helps us better serve our clients and our communities. Read more here Equal Employment Opportunity Statement Accenture is an Equal Opportunity Employer. We believe that no one should be discriminated against because of their differences, such as age, disability, ethnicity, gender, gender identity and expression, religion or sexual orientation. All employment decisions shall be made without regard to age, race, creed, color, religion, sex, national origin, ancestry, disability status, veteran status, sexual orientation, gender identity or expression, genetic information, marital status, citizenship status or any other basis as protected by federal, state, or local law. Accenture is committed to providing veteran employment opportunities to our service men and women. For details, view a copy of the Accenture Equal Opportunity and Affirmative Action Policy Statement. Requesting An Accommodation Accenture is committed to providing equal employment opportunities for persons with disabilities or religious observances, including reasonable accommodation when needed. If you are hired by Accenture and require accommodation to perform the essential functions of your role, you will be asked to participate in our reasonable accommodation process. Accommodations made to facilitate the recruiting process are not a guarantee of future or continued accommodations once hired. If you would like to be considered for employment opportunities with Accenture and have accommodation needs for a disability or religious observance, please call us toll free at 1 (877) 889-9009, send us an email or speak with your recruiter. Other Employment Statements Applicants for employment in the US must have work authorization that does not now or in the future require sponsorship of a visa for employment authorization in the United States. Candidates who are currently employed by a client of Accenture or an affiliated Accenture business may not be eligible for consideration. Job candidates will not be obligated to disclose sealed or expunged records of conviction or arrest as part of the hiring process. The Company will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. Additionally, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with the Company's legal duty to furnish information.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-27T05:28:18.000Z"
    },
    "company": {
        "name": "Accenture",
        "link": "https://ie.linkedin.com/company/accenture"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 144,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Sacramento",
        "region": "CA",
        "postal_code": "95820",
        "street_address": null,
        "latitude": 38.576935,
        "longitude": -121.49495
    }
}