{
    "job": {
        "title": "Software Engineer - .NET, C#, JavaScript",
        "industry": "Printing",
        "description": "If you are a Software Engineer with experience, please read on! We are a growing b2b media company that is an industry leader in digital publishing, live & virtual events, connecting buyers and sellers, and extending brands via a wide variety of digital tools. We continue to produce dynamic websites and marketing solutions through strategic research for our clients and audiences and are looking for a Software Engineer to help contribute to our success. What You Will Be Doing Designing, developing, maintaining and optimizing secure and scalable multi-tier websites and web-based applications. Testing/Debugging the website and identifying any technical problems and hitches. Develop websites/web-based applications through strategic planning of each project Work independently as well as collaborate with development team members Streamline project requirements by working with web developers Constantly research and learn new technology trends to make insightful recommendations What You Need for this Position Bachelors degree in computer science or related field/work experience Strong with ASP.NET/C# (.NET Framework and .NET Core) Knowledge of server-side programming and developing restful APIs Strong knowledge of relational databases (MS SQL) and working knowledge of NoSQL databases (RavenDB) Experience with JavaScript (jQuery, Node, Angular,and/or React) Strong experience of developing efficient and responsive websites in an agile/scrum environment Knowledge of code versioning tools like TFS and Git What's In It for You Collaborative and positive work environment Health Benefits-Medical, Dental, & Vision Free Coffee to fuel you all day long! PTO Paid Holidays (11)Long term disability (LTD) company paid Supplemental life & LTD plans Voluntary short term disability Flexible Spending Account Health & dependent care reimbursement Education reimbursement So, if you are a Software Engineer with experience, please apply today! Email Your Resume In Word To Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also: Kendall.Moore@CyberCoders.com Please do NOT change the email subject line in any way. You must keep the JobID: linkedin : KM14-1645576 -- in the email subject line for your application to be considered.*** Kendall Moore - Recruiter - CyberCoders Applicants must be authorized to work in the U.S. CyberCoders, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire. CyberCoders will consider for Employment in the City of Los Angeles qualified Applicants with Criminal Histories in a manner consistent with the requirements of the Los Angeles Fair Chance Initiative for Hiring (Ban the Box) Ordinance.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-25T17:38:53.000Z"
    },
    "company": {
        "name": "CyberCoders",
        "link": "https://www.linkedin.com/company/cybercoders"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Las Vegas",
        "region": "NV",
        "postal_code": "89159",
        "street_address": null,
        "latitude": 36.16909,
        "longitude": -115.14058
    }
}