{
    "job": {
        "title": "Software Engineer",
        "industry": "Computer Software,Financial Services,Accounting",
        "description": "Who We Are Same Seats. Better Prices. Among the fastest growing technology companies, TickPick is reshaping the secondary ticket marketplace, putting money back in the wallets of live event-goers. Since inception, we have saved our customers over $55 million in service fees. Our BestPrice Guarantee backs up our promise to deliver better prices than our competition. For the last five years, TickPick has been named a Deloitte Technology Fast 500 award winner and has landed on lists of Inc. 5000’s and Crain's New York Business’ Fast 50. If you are passionate about concerts, sports, theater or all of them, and want to see your skills and experience have a direct impact on a fast growing company, TickPick is the place for you. We are building a diverse team, committed to providing the most innovative, transparent, and cost-effective ticket marketplace in the industry. Who You Are We are looking for a Front-End Software Engineer who is curious about new digital technologies and aspires to combine usability with visual design. You will work alongside back end developers and user experience designers to bring the product to life. You will ensure that the site is optimized and running efficiently, paying special attention to SEO. You work well cross-functionally and you are a trusted and respected member of the team. Comfortable working in ambiguously defined problem spaces, you are a curious and creative problem solver, delivering tangible results. What You’ll Do Develop new user-facing features on web and mobile. Ensure the technical feasibility of UI/UX designs Ensure web design is optimized for smartphones. Build reusable code for future use. Optimize web pages for maximum speed and scalability. Collaborate with other team members and conduct code reviews. Technologies you'll use NodeJS, React, React Native, Express, Webpack, JQuery, Mustache Requirements Degree in computer science or related field. Proficiency in HTML, CSS, JavaScript. Understanding of modern frontend frameworks. Experience with mobile developement Experience with responsive and adaptive design. Understanding of SEO principles. Experience with Agile Software Development methodologies. Good problem-solving skills. Excellent verbal communication skills. Good interpersonal skills. Diversity at TickPick At TickPick, we know that diversity of all types, in an environment that pursues equity and inclusion, strengthens our organization’s culture. When our employees are representative of the communities we serve, with diversity in demographics and a broad set of backgrounds, we provide a superior experience for both our customers and our employees. Fostering an open and supportive environment where our employees are empowered and encouraged to bring their whole selves to the table enables TickPick to thrive. The diverse approaches and collaborative problem solving that result enable us to provide an innovative, nimble, and creative marketplace for our customers and sellers. This belief is central to who we are and what we do, and we are proud of it. TickPick, LLC is proud to be an equal opportunity employer open to all qualified candidates regardless of race, color, religion, national origin, gender, sexual orientation, gender identity or expression, age, mental or physical disability, marital status, citizenship status, military status, protected veteran status or any other category protected by law. Benefits Health Care Plan (Medical, Dental & Vision) Retirement Plan (401k, IRA) Life Insurance (Basic, Voluntary & AD&D) Paid Time Off (Vacation, Sick & Public Holidays) Family Leave (Maternity, Paternity) Training & Development Employee Outings Free Lunch & Snacks",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-17T16:37:42.000Z"
    },
    "company": {
        "name": "TickPick",
        "link": "https://www.linkedin.com/company/tickpick"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "New York",
        "region": "United States",
        "postal_code": "13856",
        "street_address": null,
        "latitude": 42.93923,
        "longitude": -75.62005
    }
}