{
    "job": {
        "title": "Software Engineer",
        "industry": "Computer Software,Information Technology and Services,Marketing and Advertising",
        "description": "Company Description Epsilon is the leader in outcome-based marketing. We enable marketing that’s built on proof, not promises. Through Epsilon PeopleCloud, the marketing platform for personalizing consumer journeys with performance transparency, Epsilon helps marketers anticipate, activate and prove measurable business outcomes. Powered by CORE ID®, the most accurate and stable identity management platform representing 200+ million people, Epsilon’s award-winning data and technology is rooted in privacy by design and underpinned by powerful AI. With more than 50 years of experience in personalization and performance working with the world’s top brands, agencies and publishers, Epsilon is a trusted partner leading CRM, digital media, loyalty and email programs. Positioned at the core of Publicis Groupe, Epsilon is a global company with over 8,000 employees in over 40 offices around the world. For more information, visit epsilon.com. Follow us on Twitter at @EpsilonMktg. Job Description As a Developer in MIS you will be working in a highly collaborative team developing web-based financial applications that serve our internal Account Management teams as well as Finance and Billing Teams. You will be responsible for all facets of front-end development but will also be expected to contribute to middle tier and backend development. You will be surrounded by passionate, high-performing individuals collaborating to solve complex problems and make a meaningful impact on our business. Duties And Responsibilities Main responsibility will be the development and maintenance of software components for use in finance and billing applications. Analyzing user requests and assisting with design activities. Assisting in the definition, development, and documentation of software’s objectives, business requirements, deliverables, and specifications in collaboration with internal users and departments. Developing and implementing highly-responsive user interface components using React concepts. Developing components based on business and/or application requirements. Collaborating with QA to define test cases, metrics, and resolve questions about test results. Minimum Qualifications Developer with 2-4 years of experience required. BS/BA degree or equivalent experience, working experience in a financial industry IT environment is a plus. Deep understanding of complex web applications and integrations with design systems. Familiar with Software Development Life Cycle, AGILE development methodologies, and able to independently participate in each phase. Strong proficiency in JavaScript, HTML and CSS. Experience with development technologies with particular focus on Python, React (Redux a plus), API development, RDBMS. Thorough understanding of React.js and its core principles Experience working with a Python back-end (Flask, Django) a plus. Familiarity with RESTful APIs Experience with Source Control Systems preferably GIT (or SVN) Ability to work well within a team environment that includes geographically distributed team members. Strong communication skills (verbal and written) and an ability to effectively communicate technical information to other development team members. Additional Information Great People, Deserve Great Benefits We know that we have some of the brightest and most talented associates in the world, and we believe in rewarding them accordingly. If you work here, expect competitive pay, comprehensive health coverage, and endless opportunities to advance your career. Epsilon is an Equal Opportunity Employer. Epsilon’s policy is not to discriminate against any applicant or employee based on actual or perceived race, age, sex or gender (including pregnancy), marital status, national origin, ancestry, citizenship status, mental or physical disability, religion, creed, color, sexual orientation, gender identity or expression (including transgender status), veteran status, genetic information, or any other characteristic protected by applicable federal, state or local law. Epsilon also prohibits harassment of applicants and employees based on any of these protected categories. Epsilon will provide accommodations to applicants needing accommodations to complete the application process. REF112700Y",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-13T05:48:36.000Z"
    },
    "company": {
        "name": "Epsilon",
        "link": "https://www.linkedin.com/company/epsilon"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Chicago",
        "region": "IL",
        "postal_code": "60654",
        "street_address": null,
        "latitude": 41.88323,
        "longitude": -87.6324
    }
}