{
    "job": {
        "title": "Senior Systems Administrator",
        "industry": "Construction,Information Technology and Services,Financial Services",
        "description": "Reporting to the Senior Managing Director of IT & Infrastructure, as Senior Systems Administrator/DevOps Engineer you are responsible for the core network and software development. This position requires technical acumen, customer focus, and a personable, professional and collaborative style to solve a range of issues. The focus of this position will be on the development of software and automation for our exhibits and mobile devices. The Senior Systems Administrator/DevOps Engineer is also responsible for the core network that runs our public- and staff-related systems, including a wide range of Cisco equipment, our Mac-based exhibit technology, AV systems, IP phone system, Comcast broadband, routing and switching, fail-over and redundancy technologies, and our internal copper and fiber and Wi-Fi technologies. What You Will Be Doing Systems Administration Help with systems upgrade and development Design and implement build, deployment, and configuration management Build and test automation tools for infrastructure provisioning Handle code deployments in all environments Provide technical guidance and educate team members and coworkers on development and operations Build, maintain, and monitor configuration standards Maintain day-to-day management and administration of projects Document and design various processes; update existing processes Improve infrastructure development and application development Monitor and maintain the operational health of the local and wide area networks. Install, configure, and support networking and security equipment from Cisco and other vendors as appropriate; What You Need for this Position 3+ years experience in a Sys Admin role or equivalent Background working with Cisco switches Cisco administration Scripting experience is highly preferred (bash, php, python) HTML/CSS and android mobile applications experience preferred So, if you are a Senior Systems Administrator with experience, please apply today! Email Your Resume In Word To Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also: Kyle.Martin@CyberCoders.com Please do NOT change the email subject line in any way. You must keep the JobID: linkedin : KM3-1649041 -- in the email subject line for your application to be considered.*** Kyle Martin - Recruiting Manager - CyberCoders Applicants must be authorized to work in the U.S. CyberCoders, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-09-02T05:32:20.000Z"
    },
    "company": {
        "name": "CyberCoders",
        "link": "https://www.linkedin.com/company/cybercoders"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Boston",
        "region": "MA",
        "postal_code": "02118",
        "street_address": null,
        "latitude": 42.358994,
        "longitude": -71.05863
    }
}