{
    "job": {
        "title": "Software Engineer, Global Business Intelligence",
        "industry": "Consumer Electronics",
        "description": "Summary At Apple, extraordinary ideas have a way of becoming excellent products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. Would you like to work in a fast-paced environment where your technical abilities will be challenged on a day-to-day basis? If so, Apple's Global Business Intelligence (GBI) team is seeking an experienced Software Engineer to build high quality, scalable and resilient distributed systems that power Apple's analytics platforms and data pipelines. Apple's Enterprise Data Warehouse landscape caters to a wide variety of real-time, near real-time and batch analytical solutions. These solutions are an integral part of business functions like Sales, Operations, Finance, AppleCare, Marketing and Internet Services, enabling business drivers to make critical decisions. We utilize proprietary and open source technologies, Kafka, Spark, Iceberg, Airflow, Presto, etc. If you are looking to solve infrastructure problems at scale, both on-prem or in cloud, focusing on ease of use, ease of maintenance and most importantly implement solutions that are scalable, you will have fun in GBI! If you enjoy learning new technologies, solving challenges with little mentorship, and are comfortable proposing and implementing solutions, demonstrating Software Engineering standard methodologies, you will find it rewarding to work in GBI! The ideal candidate for this position will be able to think outside of the box and should have passion for building engineering solutions to enable business in making time sensitive and critical decisions. Key Qualifications In-depth understanding of fundamentals of object-oriented design, data structures, algorithm design, and problem solving Demonstrate passion for excellence in Software Engineering processes, including test driven development Experience in crafting and implementing scalable solutions demonstrating standard methodologies such as Infrastructure as Code Strong experience in multi-thread, concurrent programming and synchronization Programming experience in building high quality software. Skills with Java, Python or Scala preferred Demonstrate strong understanding of development processes and agile methodologies Strong analytical and interpersonal skills Self-starter, highly motivated and ability to learn quickly Work/project experience with big data and advanced programming languages is a plus Experience developing Big Data/Hadoop applications using java, Spark, hive, oozie, Kafka, and Map Reduce is a huge plus! Experience in public cloud is a plus Description Drive data, AI/ML, infrastructure solutions Identify problem areas, suggest and deliver scalable solutions Collaborate with multi-functional teams – this is essential to be successful at Apple Education & Experience Bachelor's Degree Additional Requirements Apple is an Equal Opportunity Employer that is committed to inclusion and diversity. We also take affirmative action to offer employment and advancement opportunities to all applicants, including minorities, women, protected veterans, and individuals with disabilities. Apple will not discriminate or retaliate against applicants who inquire about, disclose, or discuss their compensation or that of other applicants. We at Apple we are committed to working with and providing reasonable accommodation to applicants with physical and mental disabilities. Learn more. Role Number: 200276527",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-23T06:38:58.000Z"
    },
    "company": {
        "name": "Apple",
        "link": "https://www.linkedin.com/company/apple"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Cupertino",
        "region": "CA",
        "postal_code": "95014",
        "street_address": null,
        "latitude": 37.319313,
        "longitude": -122.02927
    }
}