{
    "job": {
        "title": "Remote! Principal Full Stack Developer",
        "industry": "Information Technology and Services,Computer Software,Financial Services",
        "description": "Are you a Remote! Principal Full Stack Software Engineer with a passion for building large scale full stack applications in React/PHP ( or Go/Node.js) ? If so please read on! We are a SaaS company that is truly revolutionizing the way people learn in the medical space! We leverage education, technology and research to drive it all forward with the result of being one of the most widely used platforms globally. With a unique niche in EdTech we have a strong presence globally where our mission is creating technology that makes a difference in medicine and the way these individuals learn through our product! Due to our continued success, we are seeking an experienced Principal Full Stack Developer React/PHP to join our fast growing team! If this sounds like a match for you pls apply or send your resume to Bianca.oscal@Optello.com we are actively interviewing ! Top Reasons to Work with Us 100% remote! We are ventured back start up company! with a healthy career run rate We are a small but mighty engineering team! Your work with provide an impact on the future of the product + company. We are mission driven and thrive of off a successful culture We're creative, innovative, and helping businesses become more efficient. We ensuring that each member of our team feels fulfilled and on track to become the very best employee they can be We encourage our people to discover new ways of achieving specific goals. We fully believe that each and every individual part of our organization provides value, a new perspective and progress to growth and success. What You Will Be Doing 8-12+ years of demonstrable professional software development experience working on projects of increasing complexity and including proactive technical leadership and mentoring Willingness to work within a Lean Software Development process doing trunk-based development and continuous deployment Demonstrable applied knowledge of algorithms and data structures, dependency injection, unit testing and test-driven development, OOA&D, SOLID and packaging principles, design patterns, software architecture, microservice concepts and patterns, scalability, security, twelve-factor applications, distributed computing, and domain-driven design Proficiency with Full stack applications React/PHP (or if you have proficiency in Node or Go we will take that too!) Partner and work with key stake holders, lead, guide and mentor junior/sr developers What You Need for this Position Must Have: 5+ years of professional experience building large scale full stack applications React PHP (or Go/Node.js but we use PHP mainly!) JavaScript SQL Amazon Web Services RESTful API Nice To Have Angular Vue.js Computer science degree What's In It for You Vacation/PTO Medical Dental Vision 401k Unlimited PTO Paid paternity/Maternity Leave Flexible work from home $100k Life insurance Mental wellness benefits that include Calm, Ginger Apps Fitness Stipend and ClassPass Credits Choose your laptop and own it after a year! Funding for professional development So, if you are a Principal Full Stack Developer with experience, please apply today! Email Your Resume In Word To Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also: Bianca.Oscal@Optello.com Please do NOT change the email subject line in any way. You must keep the JobID: linkedin : BO3-1641306 -- in the email subject line for your application to be considered.*** Bianca Oscal - Executive Recruiter - Optello Applicants must be authorized to work in the U.S. Optello is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire. Optello will consider for Employment in the City of Los Angeles qualified Applicants with Criminal Histories in a manner consistent with the requirements of the Los Angeles Fair Chance Initiative for Hiring (Ban the Box) Ordinance.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-17T23:26:27.000Z"
    },
    "company": {
        "name": "Optello",
        "link": "https://www.linkedin.com/company/optello-us"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 96,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Chicago",
        "region": "IL",
        "postal_code": "60654",
        "street_address": null,
        "latitude": 41.88323,
        "longitude": -87.6324
    }
}