{
    "job": {
        "title": "DevOps/ Site Reliability Engineer ",
        "industry": "Health, Wellness and Fitness,Computer Software",
        "description": "Our client in the HealthTech space is looking for DevOps/SRE Engineer to join their growing team About You You are an energetic person with a passion to learn and can quickly and effectively take those learnings and apply them to their work. You prescribe to the DRY principle and have strong technical chops with an eye towards automation. You shine as a collaborator and excel as an individual contributor. A majority of our engineers work remotely. You are comfortable with working remotely and thrive in the balance it offers to pursue your personal passions. The Position Integral to the Engineering team, an SRE is a pivotal and growth driven role. They are at the intersection of operations and development. They use their software development craft to build a global operation to ensure our customers achieve their mission. Their performance will set the direction of their desired growth trajectory. As a fast-growing organization, we expect every engineer to put their fingerprint on what we do and how we do it. Our culture values every voice. What binds us is our commitment to make a long-lasting impact on quality of life. What You'll Be Working On: Work with the development team in the design and construction of software. Design, create and maintain cloud infrastructure on Amazon Web Services. Development automation, processes and tools with an eye towards availability, latency, performance and capacity. Provide an application security and compliance lens on designs and code reviews. Support a running production environment and aid Product Owners in responding to customer facing issue Develop and enhance tools to improve observability of the events of our sub-systems (as championed by Charity Majors) What You Bring: Strong development skills in any modern programming language. Knowledge of network architecture and internet security best practices Skilled at containerizing applications with Docker or similar technology Ability to create, manage, and deploy infrastructure-as-code using Terraform or CloudFormation Ability to deploy, configure, and utilize monitoring and tracing services, such as New Relic and Datadog Skilled at communicating technical concepts to peers and non-technical persons respectfully and clearly Ability to troubleshoot performance problems and system outages. Strong knowledge of Linux based operating systems Skilled at implementing secure, public facing AWS Cloud based systems. Ability to configure and manage AWS services such as CloudFront, IAM, Route 53, S3, RDS Stand Out Experience with regulatory regimes such as HIPAA and GDPR Experience implementing security controls for AWS environments, including setup and management of authentication controls, VPN’s, KMS, etc Experience operating and querying an ELK stack or similar solution Knowledge of functional programming languages and philosophy (or existing Clojure chops!) Experience in a startup environment, or as a fully remote employee - we use Slack and Zoom extensively, and our team is largely comprised of remoters",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-04T20:55:40.000Z"
    },
    "company": {
        "name": "Syntagma Group",
        "link": "https://www.linkedin.com/company/syntagmagroup"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "United States",
        "region": null,
        "postal_code": "99999",
        "street_address": null,
        "latitude": 39.50355,
        "longitude": -99.0183
    }
}