{
    "job": {
        "title": "Data Scientist",
        "industry": "Information Technology and Services",
        "description": "Title: Sr. Data Scientist Location: Saint Louis, MO 100% Remote Duration:  18 Months Job Description: At Client Companies, we are passionate about transforming the lives of pets and the people who love them. A key ambition of ours is to deliver new-to-world solutions that give pet owners the confidence and reassurance they are seeking in the decisions they make every day regarding their pets needs. We aim to do this by developing digital products and services for pet owners and vets that translate each pets behavior, health and nutrition data into current and predictive insights unique to each pet. To deliver on this ambition, we are looking for an exceptional senior data scientist with experience in AI and other Machine-Learning (ML) products. The ideal candidate will have a desire to leverage this experience to design, build and productionize AI/ML models that can be used at a global level . In this role, you’ll use AI/ML development strategies while collaborating with pet data acquisition, infrastructure, and AI-UX teams to deliver advanced analytics solutions that transform the lives of pets and the people who love them. Summary: The Client Companies Global Digital Solutions Group is seeking a dynamic and skilled Senior Data Scientist who will develop reliable Data Science solutions. This role is a key member of the dynamic new digital product development group’s team responsible for Client’s global expansion in “smart” and connected-pet product development as. This position is responsible for the development of Advanced Analytics and AI products that translate a pet’s data into unique behavior, health, and nutrition insights. Primary Responsibilities: Translate objectives into project plans and lead, and manage projects to successful end points Collaborate with internal and external teams to efficiently acquire labelled training data that can be used to create advanced analytic and AI products Extract, prepare, clean, analyze, visualize, and explore data using scripting languages Feature Engineering including signal processing of time series sensor data and cleaning and processing of longitudinal health record data Build and test AI and advanced analytic solutions using standard statistical programming languages (e.g. R, Python) Work closely with product teams to understand and deploy advanced analytics and AI products directly within devices or cloud environments using container-based solutions Maintain and monitor performance of models in production and iterate and improve models when necessary Work with internal/external vendors to assess needs, aid and resolve problems, using excellent problem-solving skills and verbal/written communication to non-technical audiences Additional Responsibilities: Policy Alignment. Conduct all activity in compliance with Good Manufacturing Practices (GMP), Good Laboratory Practices (GLP), and all required Company policies and procedures. Safety. Maintain a safe, clean, and sanitary work environment. Practice safety in the work area. Quality. Support quality assurance and regulatory compliance of all work performed. Travel. Travel as necessary (estimated not to exceed 15%-20%). Advocate for, and use, agile digital product development methodologies. Actively work to deliver products that meet consumer and business needs. Work effectively within cross-functional project teams to achieve excellent results Additional duties as assigned Supervision: This position reports to the lead of AI product development Job Qualifications (Education, Experience, and Knowledge): PhD or Master's degree from an accredited college/university in Computer Science, Statistics, Mathematics, Engineering, Physics, Chemistry or related fields preferred, with at least 7 years of relevant experience in statistics, machine learning, deep learning and/or neural networks. Deep understanding of and experience with standard machine learning algorithms (Random Forest, SVM, Logistic Regression, etc.) and deep learning algorithms and frameworks (CNN, LSTM, GANs, etc.) Proficiency in statistical programming languages (e.g. Python, R) and machine learning libraries and packages (Python: Scipy, Numpy, Pandas, TensorFlow, pyTorch, Theano, MXNet R: tidyverse, dplyr, randomForest, caret, glmnet, nnet) Experience as a data scientist on a team that has successfully delivered AI/ML products from inception to production for internal and/or external customers Deep experience extracting, cleaning, preparing, and modeling large / complex / segmented data sets and interpret data to identify meaningful insights Demonstrated experience working collaboratively with teams using Agile methodologies and version control repositories to develop, deploy and enhance high-performing data science deliverables. Experience with cloud computing platforms such as Azure. Possess a clear grasp of the fundamentals of microservices, containers and their orchestration Ability to communicate complex technical concepts clearly through written or oral communication Additional Desired Qualifications: Experience working with AWS cloud. Experience in applying deep learning models in the field of health diagnostics. Experience with CI/CD pipelines for AI solutions",
        "employment_type": "CONTRACTOR",
        "date_posted": "2021-08-30T20:35:17.000Z"
    },
    "company": {
        "name": "Denken Solutions, Inc",
        "link": "https://www.linkedin.com/company/denkensolutions"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 84,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Irvine",
        "region": "CA",
        "postal_code": "92717",
        "street_address": null,
        "latitude": 33.68591,
        "longitude": -117.82472
    }
}