{
    "job": {
        "title": "Cloud Software Engineer",
        "industry": "Computer Software",
        "description": "ClickHouse has arrived: we are the company behind the popular open-source, high-performance columnar OLAP database management system for real-time analytics. ClickHouse works 100-1000x faster than traditional approaches. By offering a true column-based DBMS, it allows for systems to generate reports from petabytes of raw data with sub-second latencies. With top adopters such as Uber, Cisco, and eBay - not only do our products work at lightning speed, so do we. ClickHouse is searching for individuals who are not just knowledgeable about what they do, but want to learn more. Our ideal candidates are thinkers and doers who are not afraid to take on various roles and responsibilities as they grow with the company. If you are looking for a place to build something new, be an agent of change, and have an opportunity to have a significant impact on the company’s success, this is the place for you. In this role, you will be working on developing a cloud service around the ClickHouse database. Additionally, you will collaborate with the SRE and security teams to ensure all SLAs and relevant compliances are met. This individual will also help to improve the robustness of ClickHouse cloud service by contributing to tests coverage and QA infrastructure. Requirements: BS, MS, or Ph.D. in Computer Science or equivalent practical experience. Professional software development experience in Go, C/C++, Java, or similar. Experience developing cloud infrastructure services, preferably with Kubernetes. Preferred Qualifications: Experience in security, privacy, and compliance. Experience with Linux and container environments. Experience with TCP/IP and network programming. Previous contributions to open source projects. Perks: Flexible work environment Comprehensive Health Benefits Equity Paid Holidays #LI-Remote ClickHouse, Inc. is an Equal Opportunity Employer. We respect and seek to empower each individual and support the diverse cultures, perspectives, skills and experiences within our workforce. We celebrate diversity and do not discriminate based on race, religion, color, national origin, sex, sexual orientation, age, veteran status, disability status, or any other applicable characteristics protected by law.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-10-05T17:19:41.000Z"
    },
    "company": {
        "name": "ClickHouse",
        "link": "https://www.linkedin.com/company/clickhouseinc"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "United States",
        "region": null,
        "postal_code": "99999",
        "street_address": null,
        "latitude": 39.50355,
        "longitude": -99.0183
    }
}