{
    "job": {
        "title": "Data Engineer",
        "industry": "Information Technology and Services,Computer Software",
        "description": "Fully remote venture-backed company in the healthcare industry! This Jobot Job is hosted by Chelsea Anderson Are you a fit? Easy Apply now by clicking the \"Apply\" button and sending us your resume. Salary $175,000 - $200,000 per year A Bit About Us We are a venture-backed company based in California inventing predictive analytics for healthcare leveraging the power of Artificial Intelligence. Action-ready insights are returned to enterprise healthcare data analysts to enable more effective early-intervention strategies that lead to improved revenues, better patient outcomes and lower overall costs of healthcare delivery. From a programming language perspective, we use Python, Scala, and NodeJS. For services and web applications, we use Flask (REST) and React with MySQL backends. On the Data/Machine Learning side, we use a variety of big data technologies such as Airflow, Big Query, Spark (DataProc), Google Cloud Storage, Google Pub/Sub, Cloud SQL, Tensorflow, KubeFlow, scikit-learn, XGBoost, Shap. Google Cloud is our cloud partner. Our long-term strategy is to be multi-cloud. Most of our infra is running on GKE and it’s managed via Terraform. Why join us? Discretionary PTO 401(k) Retirement Plan Health + Vision + Dental Benefits Employee Referral Program Paid Parental Leave Professional Development Job Details You have contributed to the delivery of complex applications spanning the full ML operational lifecycle. You are organized and able to explain your work, your challenges, your solutions, and the nature of your questions You like and appreciate the entrepreneurial environment of an early-stage start-up Your Background At least a BS in Computer Science or equivalent 5+ years of software engineering experience with Python, SQL and other modern programming languages. 3+ years as a software engineering Hands-on engineering experience with modern software stacks, cloud-based DaaS and SaaS platforms, and architectures Experience with modern development methodologies (Agile, Kanban, XP, etc.) Experience supporting teams doing ML model prototyping, training and productionalization. Experience with streaming and batch technologies such as Dask, Beam, Spark, etc. Experience in healthcare informatics and data Demonstrated technical project management skills Experience managing teams You are excited by the idea of using data to make the healthcare industry more efficient and effective. Interested in hearing more? Easy Apply now by clicking the \"Apply\" button.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-12T00:00:00.000Z"
    },
    "company": {
        "name": "Jobot",
        "link": "https://www.linkedin.com/company/jobot"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "San Mateo",
        "region": "CA",
        "postal_code": "94406",
        "street_address": null,
        "latitude": 37.54715,
        "longitude": -122.3144
    }
}