{
    "job": {
        "title": "Principal AI Consultant",
        "industry": "Information Technology and Services,Computer Software,Financial Services",
        "description": "Job Description Infosys is seeking a Principal AI Consultant for its AI and Automation team. In this role, you will help manage Cognitive Automation Projects, participate in requirements gathering sessions, and work with team members to identify requirements such as AS IS Process and automation opportunities. You'll articulate and explain the architecture options to a technical audience (IT), including advantages and constraints, and will apply knowledge of technologies, applications, methodologies, processes and tools to manage end to end automation projects. Qualifications Required Principal AI Consultant Qualifications Bachelor’s Degree or foreign equivalent, will also consider three years of progressive experience in the specialty in lieu of every year of education At least 12 years of Information Technology experience with at least 6 years of automation consulting experience 3 years of experience in managing complex Cognitive and Robotic Process Automation with different platforms like UiPath, Automation Anywhere, Conversation Engines. U.S. Citizenship or Permanent Residency required, we are not able to sponsor at this time This position may require extensive travel to project locations. Preferred Qualifications Preferred Principal AI Consultant Qualifications Advanced Developer and Architect Certifications from UiPath, Automation Anywhere Proven track record of interacting with senior client stakeholders (SVPs/Directors) and be a trusted consultant for their AI led automation journeys Prepare and justify AI/Automation business cases for clients. Analyze and document client enterprise business processes. Knowledge of Machine Learning (Classification and Information Extraction Models) Responsible for solution orchestration and design of Technical Documentation, Knowledge on Technical Documentation and creating high level diagrams. Design process solutions in accordance with recognized best practice industry design principles and conventions. Oversee the design of technical specifications, Provide architectural overview of solution designs. Ability to understand infra architecture for RPA automation implementations on cloud i.e. AWS, MS Azure, Google Able to identify automation opportunity from AS IS Process Experience in deployment of automation packages Capable of delivering on multiple competing priorities Excellent verbal and written communication skills, able to resolve business issues Experience and desire to work in a Global delivery environment About Us Infosys is a global leader in next-generation digital services and consulting. We enable clients in 46 countries to navigate their digital transformation. With over three decades of experience in managing the systems and workings of global enterprises, we expertly steer our clients through their digital journey. We do it by enabling the enterprise with an AI-powered core that helps prioritize the execution of change. We also empower the business with agile digital at scale to deliver unprecedented levels of performance and customer delight. Our always-on learning agenda drives their continuous improvement through building and transferring digital skills, expertise, and ideas from our innovation ecosystem. EOE/Minority/Female/Veteran/Disabled/Sexual Orientation/Gender Identity/National Origin Country USA State / Region / Province Arizona, Connecticut, Indiana, North Carolina, Rhode Island, Texas Work Location Hartford, CT, Indianapolis, IN, Phoenix, AZ, Providence, RI, Raleigh, NC, Richardson, TX Interest Group Infosys Limited Domain Artificial Intelligence Skillset Technology|Artificial Intelligence|Artificial Intelligence - ALL, Technology|Data Science|Machine Learning Company ITL USA",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-09T20:22:10.000Z"
    },
    "company": {
        "name": "Infosys",
        "link": "https://in.linkedin.com/company/infosys"
    },
    "education": {
        "required_credential": null
    },
    "experience": {
        "months_of_experience": 144,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Greater Hartford",
        "region": null,
        "postal_code": "06101",
        "street_address": null,
        "latitude": 41.77158,
        "longitude": -72.67429
    }
}