{
    "job": {
        "title": "Software Engineer III",
        "industry": "Information Technology and Services,Retail,Financial Services",
        "description": "Position Summary... What You'll Do... If you’re thinking ‘scale’, think bigger and don’t stop there. At Walmart Global Tech, we don’t just innovate, we enable transformations across stores and different channels for the Walmart experience. Take a regular day at Walmart and match that with 260 million customers a week, 11,695 stores, under 59 banners in 28 countries and e-commerce websites in 11 countries. That’s Walmart, Global Tech for you. Walmart employs approximately 2.3 million associates worldwide. We innovate to deliver a simple and seamless experience for our customers. Our tech talent solves the biggest and most complex problems. They drive digital transformation where data and analytics are enabling us to better serve our customers and create a digital relationship with them. As our customers evolve and adapt, we are taking it a few notches further here. We’re changing what customers can expect from the experience of shopping, from the physical stores, to mobile, social and even online; we’re not just ready for the future of shopping, we’re creating it. You’ll sweep us off our feet if… You have a deep interest and passion for technology. You love writing and owning code and enjoy working with people who will keep challenging you at every stage. You have strong problem solving, analytic, decision-making with interpersonal skills. You are self-driven and motivated with entrepreneurial passion and desire to work in a fast-paced, results-driven agile environment with varied responsibilities. You are innovative, talented, and committed individual with excellent communication, spirit of teamwork and Analytical abilities to drive excellence Responsibilities Include Primarily responsible for delivering high quality technical designs and code for the product requirements in a fast-paced agile scrum environment. Lead and participate in small to medium-scale projects by reviewing project requirements; translating requirements into technical solutions; gathering requested information (for example, design documents, product requirements, wire frames); writing and developing code; conducting unit testing; communicating status and issues to team members and stakeholders; collaborating with project team and cross functional teams; troubleshooting open issues and bug-fixes; ensuring on-time delivery and hand-offs; interacting with project manager to provide input on project plan; and providing leadership to the project team.. Strive for continuous improvement in efficiency. Troubleshoot business and production issues by gathering information (for example, issue, impact, criticality, possible root cause); engaging support teams to assist in the resolution of issues; formulating an action plan; performing actions as designated in the plan; interpreting the results to determine further action; performs root cause analysis to prevent future occurrence of issues; and completing online documentation. Provide support to the business by responding to user's questions, concerns, and issues (for example, technical feasibility, implementation strategies); identifying short- and long-term solutions; facilitating resolutions; and leading cross-functional partnership. About You You have and can implement big ideas with a positive attitude. You want to be a part of the team to disrupt this industry and you have these main skills: Must have strong knowledge & hands-on experience building React Native apps (on Android devices). Experience building customizable, reusable and dynamic components using ReactJS, React Hooks, Redux, JavaScript, ES6, Typescript, HTML, CSS and NodeJS. Ability to build products with focus on testability, someone who loves test coverage (well versed with using Jest and mocking frameworks). Experience in automation testing using tools such as Detox. Experience in implementing UI analytics to report customer behavior and improve UI accordingly. Experience with project build with CICD pipelines through Jenkins. A disciplined approach to development, code review, testing, documentation and code structure in a team environment. A constant desire to improve, learn more and take things to the next level and a passion for adopting the latest industry best practices. Experience with monitoring tools such as Dynatrace, Splunk, Grafana. Nice to Have Experience with GraphQL & NextJS. Experience with Cloud technologies (Azure preferred) & Kubernetes. Native iOS or Android experience is a plus. Minimum Qualifications... Outlined below are the required minimum qualifications for this position. If none are listed, there are no minimum qualifications. Bachelor’s degree in Computer Science and 2 years’ experience in software engineering or related field OR 4 years’ experience in software engineering or related field. Preferred Qualifications... Outlined below are the optional preferred qualifications for this position. If none are listed, there are no preferred qualifications. Masters: Computer Science Primary Location...805 SE MOBERLY LN, BENTONVILLE, AR 72712, United States of America",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-31T00:41:55.000Z"
    },
    "company": {
        "name": "Walmart",
        "link": "https://www.linkedin.com/company/walmart"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Bentonville",
        "region": "AR",
        "postal_code": "72716",
        "street_address": null,
        "latitude": 36.37187,
        "longitude": -94.20272
    }
}