{
    "job": {
        "title": "Data Scientist II - US Remote Eligible",
        "industry": "Financial Services",
        "description": "About-Us At Edward Jones, we help clients achieve their serious, long-term financial goals by understanding their needs and implementing tailored solutions. To ensure a personal client experience, we have located our 14,000+ branch offices where our more than 7 million clients live and work. A typical branch office has one financial advisor who meets with clients face-to-face and one branch office administrator who enhances the team's ability to build deep relationships with clients. Headquarters associates in St. Louis and Tempe provide support and expertise to help U.S. and Canada branch teams deliver an ideal client experience. Edward Jones currently has more branch offices than any other financial services firm, and we continue to grow to meet the needs of long-term individual investors. Job-Overview Data Scientist Firm Analytics The Data Scientist is responsible for the design and development of complex mathematical methods and statistical models in support of data driven strategies. The role requires the ability to leverage data from multiple sources to develop innovative solutions to business problems. An ideal candidate must be able to work closely with business partners to develop tailored analytic solutions and be responsible for guiding projects from design through implementation and final delivery to internal business partners. Key Responsibilities Define data needs and evaluate data quality for applicability to posed problems Use statistical modeling, machine learning and numerical optimization to discover and leverage patterns in data using...[Time Series Analysis, Classification Algorithms, Clustering, Regressions, Recommender Systems, Linear/Nonlinear Optimization, Monte-Carlo simulation, text mining, natural language processing] Ability to create features and develop models beyond standard toolset libraries to meet unique business challenges. Interpret and communicate findings and insights from the data to business partners Skills-Requirements Position Qualifications: Master of Science Degree in Statistics, Applied Mathematics, Industrial Engineering, Computer Science or related field required. PhD in Statistics desired 5+ years professional experience with predictive statistical models or numerical optimization, and working with typical data used in such analyses Proficient in one or more programming languages (Python, R, Scala) Comfortable manipulating data in one or more of (SQL, Hive, Impala, Pig, Spark) Ability to translate data into meaningful value propositions for business partners in order to facilitate understanding. Provide accurate and actionable business intelligence reporting Persons requiring sponsorship for an employment visa are ineligible for this position Awards-Accolades FORTUNE 2020 – Edward Jones was named No. 7 on the 2020 FORTUNE 100 Best Companies to Work For® list. From FORTUNE ©2020 FORTUNE Media IP Limited. All rights reserved. Used under license. FORTUNE and FORTUNE 100 Best Companies to Work For are registered trademarks of Fortune Media IP Limited and are used under license. FORTUNE and Fortune Media IP Limited are not affiliated with, and do not endorse products or services of, Edward Jones Investments. Edward Jones Ranked No. 6 of the 100 best workplaces for millennials by Great Place to Work and FORTUNE Magazine. 2020 Corporate Equality Index – Edward Jones joins the ranks of 680 major U.S businesses that received top marks in the HRC Foundations 18th Annual Scorecard on LBGTQ Workplace Equality Edward Jones named a top company for training, ranking No. 25 on Training magazine's 2020 Training Top 125 list – the highest ranking among the financial-services industry! Financial services firm Edward Jones has been named one of the 2019 Best Workplaces for Parents by Great Place to Work and FORTUNE magazine. The firm ranked No. 5 on the list of 50 companies, up two spots from last year. The Best Workplaces for Parents list is one of a series of rankings by Great Place to Work and FORTUNE based on employee feedback from Great Place to Work-Certified™ organizations. Edward Jones ranked No. 7 on the FORTUNE 100 Best Companies to Work for in 2019 list, the firm’s 20th appearance on the list. The firm also was ranked the No. 1 Best Workplace in Financial Services & Insurance and the No. 6 Best Workplace for Millennials by Great Place to Work and FORTUNE. EEO Edward Jones does not discriminate on the basis of race, color, gender, religion, national origin, age, disability, sexual orientation, pregnancy, veteran status, genetic information or any other basis prohibited by applicable law.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-20T06:16:05.000Z"
    },
    "company": {
        "name": "Edward Jones",
        "link": "https://www.linkedin.com/company/edward-jones"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Los Angeles",
        "region": "CA",
        "postal_code": "90101",
        "street_address": null,
        "latitude": 34.05224,
        "longitude": -118.24335
    }
}