{
    "job": {
        "title": "Senior Data Scientist",
        "industry": "Food &amp; Beverages",
        "description": "Who we are Founded in 2013, Thistle is an early-stage food-tech startup empowering our customers to get and stay healthy while improving our food system’s sustainability. We deliver delicious, organic, healthy, plant-forward meals, cold-pressed juices, and snacks to customers on the West Coast at the elusive intersection of convenience, health, and sustainability. We don’t want to be just another food delivery startup. Our focus is on our customers’ health and happiness, and we are revolutionizing how fresh, nutritious, high-quality food is purchased, manufactured, and delivered at scale.  Thistle is headquartered in San Francisco, and we are backed by some amazing investors in the Bay Area and beyond.  We're headquartered in San Francisco, but we are excited to be building out a remote Data team. Candidates should be located within California, Oregon, Washington, Nevada, Arizona, Tennessee, or Maine. About the Role Thistle is looking for a passionate Senior Data Scientist to drive decision-making through data. This position will have the opportunity to collaborate with a multi-disciplinary team on a wide array of problems, bringing scientific rigor and statistical methods to the challenges of product development, customer acquisition, operations forecasting, and more. Questions you might work on include How can we optimize ingredient forecasting models to drive efficiency and reduce food waste? How can we leverage meal feedback data to deliver personalized recommendations that delight customers? Which marketing channels most efficiently drive new customer acquisition? Where can we best allocate spend? What are the key measures of business health? How can we monitor performance and detect anomalies? What you'll do Build a data-driven decision culture throughout the company: empower teams to use data daily while partnering on the most important initiatives. Develop and deploy machine learning/statistical models to improve the customer experience and drive long-term business health. Design, analyze, and evaluate experiments. Determine appropriate decision criteria, and communicate results effectively to stakeholders across the company. Contribute to Thistle’s data model, including defining appropriate dimensions, creating data pipelines, and developing appropriate processes to ensure data quality. What you'll bring 3+ years of hands-on data science experience Bachelors/Masters/Ph.D. in a quantitative discipline or equivalent practical experience Strong statistical knowledge and intuition, including causal inference, experimentation, and statistical modeling Proficiency in 1+ programming languages (e.g. R, Python) Excellent business + product acumen, especially the ability to translate key business questions into an impactful analysis Solid SQL and data visualization skills A passion for our mission: to make it easy for everyone to get and stay healthy while improving the sustainability of our food system Life at Thistle Join a kind, diverse, passionate & driven team of all backgrounds Enjoy Thistle meals at a substantial discount! Team-building and Frequent Wellness Events Comprehensive health benefits (medical, dental, vision) Flexible time off policy and generous parental leave Choice of PC or Apple equipment We understand that everyone is going to have strengths and weaknesses with regard to different aspects of this role. We encourage you to apply even if you feel some of the expectations would be challenging to meet! Diversity, equity, and inclusion are essential values at Thistle. We know we'll do our best and most impactful work when we feel we're represented and we belong. We're proud to actively recruit and hire talented people from a wide variety of backgrounds and experiences. We do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. You can get some deeper insight into how we approach DEI, along with some statistics on the internal demographics of the company and leadership team, here: https://www.thistle.co/learn/thistle-thoughts/thistle-on-diversity-equity-and-inclusion.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-09T20:23:43.000Z"
    },
    "company": {
        "name": "Thistle",
        "link": "https://www.linkedin.com/company/thistle"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "San Francisco Bay Area",
        "region": null,
        "postal_code": "94112",
        "street_address": null,
        "latitude": 37.39271,
        "longitude": -122.042
    }
}