{
    "job": {
        "title": "Site Reliability Engineer",
        "industry": "",
        "description": "As a front engineer in the team, you will work with customers, product managers, and SRE experts to define observability product features and drive their requirements and implementation. Basic Qualification s: 3+ years of relevant work experi ence Proficiency in TypeScript, Javascript, CSS, HTML, and Rea ct.js Excellent programming skills - developing, debugging, testing and optimizing code. Passionate about building elegant and powerful user interfaces to solve customer pr oblems. Experience driving technical designs for frontend systems. Comfortable making usable design and layout decisions inde pendently Strong communication skills, both verbal an d written. Extensive knowledge of web standards and modern browsers and of the full web techno logy stack. Comfortable with technical ownership, managing multiple stakeholders, and working as part of a global team Strong knowledge of SDLC build tools, automated testing, and SPA packaging (Gitlab, NPM, Yarn, J est, Webpack) Preferred Qualifications: Experience building UIs for data-rich analytical applications fo r technical users Experience with front-end state management systems, such as re act-query or Redux Experience modifying open source software products, collaborating and upstreaming changes Experience with mainstream web transports an standards such as REST, W ebSockets, and OAuth Experience with back-end API development using Go Strong interpersonal skills, drive, and ownership.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-06T21:49:53.000Z"
    },
    "company": {
        "name": "Eleventh Hire, Inc.",
        "link": "https://www.linkedin.com/company/eleventh-hire-inc-"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Dallas",
        "region": "TX",
        "postal_code": "75342",
        "street_address": null,
        "latitude": 32.777977,
        "longitude": -96.79621
    }
}