{
    "job": {
        "title": "Data Scientist",
        "industry": "Marketing and Advertising,Computer Software,Internet",
        "description": "🚀 Whatnot Whatnot (YC W20) is a livestream shopping platform and marketplace backed by Andreessen Horowitz and Y Combinator. We’re one of YC’s top companies and one of the fastest growing marketplaces ever. We’re laser focused on creating an exceptional software company, team, and place to work. You can read our principles here. Our mission: enable anyone to turn their passion into a business and bring people together through commerce. We’re building the future of ecommerce; an interactive community where creators can make a living off their passion. Did we mention we’re high growth? We’ve 10x’d the company in 6 months! In January, Whatnot was 10 people. Today, our team is approaching 60 and will exceed 100 by year end. We’re hiring forward thinking problem solvers across all functional areas. We recruit thoughtfully, can move fast, and are scaling fully remotely. 📈 Opportunity Size The ecommerce experience has been static for 20+ years and is perhaps the largest opportunity in the startup space today. Livestream shopping is a $170B GMV market in China and has grown 100% YoY. Retail is a $5T market opportunity! About The Data Team We are looking for intellectually curious, highly motivated individuals to be foundational members of our Data Science and Machine Learning team. You will partner across the company to identify critical goals for the business, develop a deep understanding of them, and design scalable solutions. The ideal candidate will be able to navigate the data stack and support initiatives from data engineering, product analytics, exploratory data analysis to machine learning, service deployments, and monitoring. 💻 Role Partner closely across the business to find improvements and influence decisions using data science methodologies and tools. Enrich product, go-to-market, and operations with new kinds of advanced analytics and machine learning powered experiences. Design and implement end-to-end data pipelines and data systems that support MLOps and business processes. Create high quality communication devices such as dashboards, notebooks, documents, presentations to convey insights across a broad audience. Define and advance best practices within an experiment driven culture. 👋 You As our next data scientist you should have 3+ years of relevant experience, plus: Excellent verbal communications, including the ability to clearly and concisely articulate complex concepts to both technical and non-technical collaborators. Demonstrated history of knowledge in Computer Science, Statistics, Mathematics, Software Engineering or related technical field. Industry experience with proven ability to apply scientific methods to solve real-world problems on large scale data. Ability to lead initiatives across multiple product areas and communicate findings with leadership and product teams. Experience with operational databases such as PostgreSQL, DynamoDB. Proficiency with data warehouses and big data technologies such as Snowflake, Big Query, Spark. Extensive experience with Python for software development and data science. Aptitude and experience in applied statistics and machine learning techniques. Firm grasp of visualization tools, interactive and self-serving, such as BI dashboards and jupyter style notebooks. Familiarity with cloud computing platforms such as AWS or GCP. Experience launching production-quality machine learning models e.g. dataset construction, preprocessing, deployment, monitoring, quality assurance. 🎁 Benefits Competitive base salary and stock options benchmarked to 90th percentile Unlimited Vacation Policy and No Meeting Holidays Amazing Health Insurance options including a no premium plan, Dental and Vision Plans with less $1 monthly employee contribution, and no cost Life Insurance 13 Week Parental Leave $200 to spend within Whatnot App $3500 expense to buy your computer and at home work station $100 weekly expense for Lunch $75 monthly expense for Internet $75 monthly expense for Cell Phone plan 💛 Curious about who thrives at Whatnot? We’ve found that low ego, a growth mindset, and leaning into action and high impact goes a long way here. At Whatnot, we value diversity. We are an equal opportunity employer: we do not discriminate on the basis of race, religion, color, national origin, gender, sexual orientation, age, marital status, veteran status, or disability status. We recognize that diverse teams make the strongest teams, and we encourage people from all backgrounds to apply.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-18T05:14:01.000Z"
    },
    "company": {
        "name": "Whatnot",
        "link": "https://www.linkedin.com/company/whatnot-inc"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Los Angeles",
        "region": "CA",
        "postal_code": "90101",
        "street_address": null,
        "latitude": 34.05224,
        "longitude": -118.24335
    }
}