{
    "job": {
        "title": "Senior Site Reliability Engineer (SRE)",
        "industry": "Health, Wellness and Fitness",
        "description": "Quil, a digital health company, delivers actionable and personalized health itineraries for patients and caregivers, answering the question “What Happens Next?” in their healthcare journeys. We combine the powers of precision data, state-of-the-art technology, and security with unparalleled consumer reach to help individuals navigate today’s chaotic healthcare landscape. Headquartered in Philadelphia, PA, Quil is a joint venture of Comcast and Independence Health Group (Independence). We are seeking an experienced Site Reliability Engineer to join our rapidly growing organization. In this role, the engineer will develop software solutions to operations problems, embedding in development teams, and perform operations work. The selected candidate will be responsible for building developer tooling, APIs, infrastructure, pipelines, testing, monitoring, and all other tooling necessary to ship high quality code in an Agile environment. As a member of the Site Reliability Engineering team, you will: Write software to automate the entire lifecycle of production microservices and the environments they run on Tackle architectural challenges around highly available services and data Ensure our infrastructure and services are sufficiently observable Continue to learn and expand your knowledge and skill set You have the skills to be successful in this role if you have: Generally 5+ years of software development experience Writen code with empathy for the next person Previous experience in operating production systems, ideally including node.js or JVM services Bachelor of Science degree or greater in Computer Science, Electrical Engineering or another related field, or equivalent experience Experience in one or more of the following: node.js, Java, Python, Go, PHP or Ruby Desire to join a highly technical team in a fast-paced environment Proven track record of ownership of maintainable, stable and scalable software Expertise managing AWS infrastructure Good understanding of continuous delivery Good understanding of Monitoring/Alerting tools and best practices It is a plus if you have: Run Kubernetes in production Familiarity with managing Kafka, Elastic Search, RDS, DynamoDB Experience with AWS Lambda Contributed to existing open-source projects as well as your own Experience with Docker and/or Linux Containers Experience with Microservices/SOA Experience with HIPAA or SOC2 Personal Requirements: Curiosity and interest in investigating issues to reveal their root causes Have strong opinions that are loosely held Work constructively in a distributed team and collaborate effectively",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-10-04T14:42:14.000Z"
    },
    "company": {
        "name": "Quil",
        "link": "https://www.linkedin.com/company/quilhealth"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Philadelphia",
        "region": "PA",
        "postal_code": "08051",
        "street_address": null,
        "latitude": 39.95106,
        "longitude": -75.16562
    }
}