{
    "job": {
        "title": "Volunteer Virtual Classroom Speaker (Meet a Software Engineer)",
        "industry": "Computer Software,Higher Education,Information Technology and Services",
        "description": "The volunteer opportunity below is a request from an educator for you to interact with his or her classroom. The interaction is virtual so as long as you have a good internet connection and computer or device with a camera, you can participate from anywhere. The goal of the interaction is to bring real world application, professional experience and relevance to what the educator is teaching. Once you accept the request for one of the dates proposed by the educator, Nepris will provide support and next steps to help you prepare and make sure you are successful. You can also highlight this experience to strengthen the volunteer section of your LinkedIn profile. Volunteer Virtual Classroom Speaker (Meet a Software Engineer) Description We are investigating potential career pathways. The goal of this conversation is to provide a realistic view of the profession to the students to help them in their decision-making process. Key Questions What does a typical day look like in your occupation? What do you spend most of your time doing every day? What are the day to day responsibilities that someone outside of your field might not know about? What can you tell us about related occupations in your field? What levels of education and training are required? Once you complete the basic educational/training requirements for this occupation, are there other related occupations that a person would be qualified for? Tell us how what they are learning in school now applies to your occupation. What should their focus be as freshmen if this profession is their ultimate goal? Expected Outcomes I would like for my students to get a good overview of what to expect from a career in this field and what it takes to get there. Requester Susan Hollingsworth,K12 VIRTUAL SCHOOLS Proposed Dates 11/11/2021 11:00 AM America/New_York Duration 01 hrs00 mins Classes Subjects Other Grade level Middle School, High School No. of Students 23 Topic Meet a Software Engineer Sub Topic Not Specified Preferences Not Specified Specialties Not Specified Companies Not Specified",
        "employment_type": "OTHER",
        "date_posted": "2021-09-02T06:09:38.000Z"
    },
    "company": {
        "name": "Nepris Inc.",
        "link": "https://www.linkedin.com/company/nepris"
    },
    "education": {
        "required_credential": null
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "St Louis",
        "region": "MO",
        "postal_code": "63121",
        "street_address": null,
        "latitude": 38.635357,
        "longitude": -90.20099
    }
}