{
    "job": {
        "title": "Software Configuration Engineer, Senior",
        "industry": "Hospital &amp; Health Care,Insurance",
        "description": "Job Summary The Senior Release Engineer is responsible for defining, developing and delivering an innovative solution for our software delivery process and providing expert level knowledge on the tools and processes that constitute the SDLC. The candidate will be responsible to define and implement industry standard best practices for our build and deployment pipelines leading to continuous integration and continuous delivery. The candidate should be self-driven and posses good analytical and troubleshooting skills. The candidate will work with Development, Quality Assurance, Infrastructure, security and other technical and operational teams to continuously improve the quality, speed and methodologies used in delivering our capabilities to production while ensuring auditability and traceability of all changes. Candidate should be able to articulate the delivery, branching / merging, and environment maintenance process to succeed in this position. Candidate should be able to co-relate their work with how it impacts business. The candidate should be eager to learn new technologies, flexible and work with peers to create a cohesive team environment. Responsibilities Consult with other IT teams and Business teams to deliver high quality products to test and production environments. Develop scripts and automation tools used to build, integrate, and deploy software releases to various platforms. Maintains and enhances automated scripts. Troubleshoot complex environment, software, and workflow problems related to system deployment. Maintain advanced knowledge of development methodology, processes, and programming languages. Understand and/or implemented cloud technologies on-premises or on cloud on GCP or Azure cloud platforms. Working knowledge of Python and Groovy is a must. Coding experience in Java, .Net or any software language is a must. Good understanding or working knowledge of DevSecOps is a big plus. Working knowledge of Informatica and batch processing is a big plus. Able to create delivery metrics, report on KPIs and release cadence. Proponent of Agile transformation and lean delivery is a plus. Presentation of the new innovations, ideas or technical solutions to the Leadership team is a must have. After hours on-call support may be required. Knowledge And Experience BS/MS degree in computer science or equivalent preferred. Requires a minimum of 5+ years of Release engineering or a combination of Release and Development experience is needed. Knowledge of coding in Java, .NET or any software language is required. Experience taking initiatives and completing it by getting consensus with all stakeholders is preferred. Must possess great communication and presentation skills. Must have experience training Junior Engineers. Must have experience in promoting code to non-production and production environments and/or providing installation support for deployment teams.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-03T03:10:17.000Z"
    },
    "company": {
        "name": "Blue Shield of California",
        "link": "https://www.linkedin.com/company/blue-shield-of-california"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Oakland",
        "region": "CA",
        "postal_code": "94612",
        "street_address": null,
        "latitude": 37.80483,
        "longitude": -122.27248
    }
}