{
    "job": {
        "title": "Engineer, Software Engineering SAP SD/LE",
        "industry": "Hospital &amp; Health Care,Logistics and Supply Chain,Medical Devices",
        "description": "At Cardinal Health, we are developing the innovative products and services that make healthcare safer and more productive. Join a growing, global company genuinely committed to making a difference for our customers and communities. MED EIT Organization has an open job role for an Engineer, Software Engineer SAP SD/LE supporting Medical Core Systems. This position will be responsible for: What Software Engineering contributes to Cardinal Health Software Engineering is responsible for designing, developing, implementing and supporting applications, systems and IT products required to achieve the company's business objectives. Demonstrates knowledge of software development techniques and fluency in software languages and application programming interfaces. Demonstrates general understanding of hardware/software platforms including but not limited to operating systems, databases, application servers, web servers and integration technologies. Plans and executes system implementations that ensure success and minimize risk of system outages or other negative production impacts. Demonstrates conceptual knowledge of architecture standards and database and operating systems. Demonstrates problem solving ability that allows for effective and timely resolution of system issues including but not limited to production outages. Analyzes production system operations using tools such as monitoring, capacity analysis and outage root cause analysis to identify and drive change that ensures continuous improvement in system stability and performance. Demonstrates knowledge of software development, life cycle, modeling of business processes, application design patterns, business/functional documents. Estimates to high level business requirements and provide options analysis. Accountabilities Deliver on critical initiatives that move the business forward and identify new strategies that position us for growth Improve functionality, performance, productivity, and the overall user experience Collaborate with Business Partners and IT Colleagues in performing effective analysis to investigate business problems, identify and expose root causes, identify and evaluate options, and recommend solutions Demonstrate cross functional experience from MM/LE, SD/OTC, APO SCM and Automation to create cross functional configurations within multiple SAP modules to support supply chain processes and procedures Contribute to the complete set of cutover tasks and dependencies that will enable a successful release of program code and configuration Provide timely and effective communications, including appropriate status updates, to all impacted stakeholders / business partners / IT colleagues / management Coordinate with onshore teammates to develop overall test strategy and quality assurance plan Ability to convert technical/functional specifications into test scenarios and test scripts Execute test plan and resolve defects identified during testing Coordinate with support team to integrate test scripts into regression suite as needed Qualifications Bachelor’s Degree in related field or equivalent work experience 4+ years in SAP and experience with functional processes would be recommended SAP certification in Sales and Distribution module is preferred Hands-on SAP ERP (ECC) skills, with demonstrated experience in Sales and Distribution and Logistics Execution modules preferred SAP SD Configuration – Sales Document types, Item Categories, Output determination, Copy Control, Schedule line categories, Available to Promise, Idocs ABAP - Reading and de-bugging ABAP code Ability to design and build reports and/or queries for end users Experience in SPRO, ALE/IDOC, EDI, BADI, USER-EXIT and LSMW Excellent oral and written communication skills must convey thoughts and ideas simply and concisely Ability to complete assignments with attention to detail and high degree of accuracy What is expected of you and others at this level Applies comprehensive knowledge and a thorough understanding of concepts, principles, and technical capabilities to perform varied tasks and projects May contribute to the development of policies and procedures Works on complex projects of large scope Develops technical solutions to a wide range of difficult problems. Solutions are innovative and consistent with organization objectives Completes work independently; receives general guidance on new projects Work reviewed for purpose of meeting objectives May act as a mentor to less experienced colleagues Cardinal Health is an Equal Opportunity/Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, religion, color, national origin, ancestry, age, physical or mental disability, sex, sexual orientation, gender identity/expression, pregnancy, veteran status, marital status, creed, status with regard to public assistance, genetic status or any other status protected by federal, state or local law.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-18T21:59:01.000Z"
    },
    "company": {
        "name": "Cardinal Health",
        "link": "https://www.linkedin.com/company/cardinal-health"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 48,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Harrisburg",
        "region": "PA",
        "postal_code": "17101",
        "street_address": null,
        "latitude": 40.259594,
        "longitude": -76.881874
    }
}