{
    "job": {
        "title": "Junior Software Engineer - Remote (US)",
        "industry": "Marketing and Advertising,Information Technology and Services,Staffing and Recruiting",
        "description": "We're looking for a Junior Software Engineer who is excited about using bleeding edge technologies to help make the hiring process better and more equitable for millions of people. You'll be working on a small team at a rocketship-growth tech company that's focused on building out the conversational AI product in PandoLogic's offering. Your work will streamline the hiring process for millions of job seekers, reduce bias in hiring, and help companies solve some of the most ambitious challenges in the world. Responsibilities: Work with the team to scale our platform to handle millions of users Optimize our applications Performance and load testing Continuing to develop our microservices architecture Work on building data pipelines to process terabytes of data Requirements: 1-3 years of software experience Fluency with Java (Spring or Spring Boot experience is a plus) SQL AWS Nice to have: Demonstrated interest in data engineering Demonstrated interest in graph databases or graph theory Docker Kubernetes Terraform Available to work US ET time zone preferable (role is remote, though) Why PandoLogic? PandoLogic delivers Hire Intelligence to Talent Acquisition organizations by sourcing quality applicants faster and more efficiently through the use of big data, artificial intelligence, and proprietary campaign algorithms that fully-automate and optimize the job advertising and decision-making process. We bet you'll love our awesome company culture, great benefits, and crew of collaborative, bold, resilient, innovative, and caring people. We love it here, and we think you will too. Anything else you should know? PandoLogic is being acquired by Veritone Inc. (NASDAQ: VERI), a provider of an operating system for artificial intelligence, later this year. We were sought out by Veritone for our AI – our belief in it and our commitment to it – by a company that is focused on using AI for good. To build a safer, more vibrant, transparent, and empowered society. Veritone is supporting our destiny, keeping our team intact, and honoring our roadmap – this is an incredible growth opportunity. As a wholly-owned subsidiary of Veritone, there are no material changes expected for employees and customers. Integration with their platform will reinforce our tech backbone and allow us to bring trillions of data points – from all sorts of agnostic sources – together to create insights that will power the workforce of the future. To learn more visit http://www.pandologic.com. PandoLogic is committed to providing equal opportunity employment to all individuals regardless of race, color, religion, gender identity, sexual orientation, citizenship, national origin, disability, veteran status, or any other characteristic protected by law. We are flexible. We are kind. We are PandoLogic.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-18T05:20:32.000Z"
    },
    "company": {
        "name": "PandoLogic",
        "link": "https://www.linkedin.com/company/pandologic"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 12,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "New York",
        "region": "NY",
        "postal_code": "10132",
        "street_address": null,
        "latitude": 40.713047,
        "longitude": -74.00723
    }
}