{
    "job": {
        "title": "Data Scientist",
        "industry": "",
        "description": "Data Scientist Work Location: Tukwila, WA Job Type: Contract Education: Bachelors Experience: 9+ Candidate rate: $80 - $90/hr on W2 Work authorization: US citizen Required Skills: Agile; Data Analytics; Data Visualizations; JavaScript; Microsoft SQL Server; Software Architecture; SQL; Tableau; Visual Basic .Net (VB.Net); Visual Basic (VB); Web-based Systems Architectures Responsibilities: Leads cross-functional teams to determine, define and deploy complex predictive/prescriptive analytic solutions to meet business objectives. Evaluates business objectives and determines stakeholder needs. Chooses best fit methods, defines algorithms, validates and deploys models to achieve business results. Performs necessary data preparation and enhancements to models. Interfaces and leads other programmers in different time zones and cultures. Interfaces with other Data Analytics personnel to leverage best practices. Employs AGILE methodology. Candidate must have knowledge of design and development of web-based applications. Position requires expertise/experience in .Net Framework/.Net Core, Javascript with Vue, React or Angular, bootstrap or equivalent library, Web API. Candidate must have working experience with database preferred, but not limited to Microsoft SQL Server. Candidate should have experience in designing user interface and visualizations to communicate with a broad audience and influence decision making. Able to develop, maintain, and refine queries to present data. Should have experience with Microsoft Access \"Visual Basic applications“. Candidate is desired to have knowledge of data visualization frameworks such as D3.js, ChartJS or Tableau.",
        "employment_type": "CONTRACTOR",
        "date_posted": "2021-10-15T23:53:46.000Z"
    },
    "company": {
        "name": "Eworld Solutions",
        "link": "https://www.linkedin.com/company/eworld-consulting-corp"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Tukwila",
        "region": "WA",
        "postal_code": "98184",
        "street_address": null,
        "latitude": 47.47638,
        "longitude": -122.25912
    }
}