{
    "job": {
        "title": "Software Engineer",
        "industry": "Construction,Information Technology and Services,Computer Software",
        "description": "Dematic is a leading supplier of integrated automated technology, software, and services to optimize supply chain. Dematic employs over 9,000 skilled logistics professionals to serve its customers globally, with engineering centers and manufacturing facilities located around the world. Dematic is one brand under the KION Group of companies and has implemented more than 6,000 integrated systems for a customer base that includes small, medium, and large companies doing business in a variety of market sectors. This position will be part of the KION Group - Mobile Automation R&D team! KION Mobile Automation (KMA) is the world-leading, fast-growing, innovative frontrunner in the development of mobile robotics, robotic fleet controllers and cloud-based fleet logistics management systems. KMA has a focus on Automated Guided Vehicle (AGV) systems. AGVs are fully autonomous robots that move and transport items in production, warehouse, and distribution centers without manual intervention or permanent conveying systems. The Role The Key Responsibilities Of This Role Are This position is for an experienced Software Engineer to join our global KION Mobile Automation Research & Development team in Holland, Michigan. Developing quality software products for our internal and external customers with a focus on offboard software for AGVs and other mechatronic equipment Working closely within a cross functional agile R&D team for a range of software product development activities Involvement in the full software life cycle including Analysis, Build, Testing, Integration, Release and Support activities Working in an international environment collaborating with global agile development teams What We Are Looking For What We Are Looking For Successful candidates will possess the following qualifications, skills & experience: Degree in Software Engineering (or similar) or equivalent experience Minimum 5 years experience using C# / .NET Core, SQL, Git etc Experience with technologies including Object Oriented Programming, Docker/Kubernetes, Azure Cloud, TCP/IP, Web Services, Message Broker, and Angular would be a plus Experience designing, implementing, and delivering complex and interconnected solutions with multiple subsystems Experience in the logistics industry, warehouse automation or material handling would be a plus A passion for delivering high quality software and technical excellence Strong analytical and problem-solving skills with a high attention to detail Exceptional ability to work both autonomously and with cross-functional teams to build partnerships and get things done A good understanding of Agile software development and Testing principles and practices Ability to work well within a team environment Open to continious Innovation and learning Occasional travel may be required – up to 20% (including international)",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-20T05:45:52.000Z"
    },
    "company": {
        "name": "Dematic",
        "link": "https://www.linkedin.com/company/dematic"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Holland",
        "region": "MI",
        "postal_code": "99999",
        "street_address": null,
        "latitude": 42.789383,
        "longitude": -86.10719
    }
}