{
    "job": {
        "title": "Software Developer - C++ / Java / Linux",
        "industry": "Defense &amp; Space",
        "description": "We are a rapidly growing autonomy and robotics technology company that has been in business for over 20 years! We are transforming government and commercial transportation with programs that include self-driving cars and trucks; autonomous shuttles; UAV; UAS; and drones. As we grow our team, we are looking for passionate people who want to build long-term careers with us! What's In It for You Competitive Compensation Contingent On Experience Health, Vision, and Dental Benefits 401k Matching Parental Leave Life Insurance What You Need for this Position Experience as a Software Developer C++ or Java Linux Algorithm dev work Working knowledge of Object-Oriented programming BS or MS degree in Computer Science or similar Able to obtain Secret government clearance (Plus) Experience with Robotics, DoD, Government, and/or Aerospace (Plus) Strong Algebra and Calculus skills (Plus) What You Will Be Doing Develop innovative and creative software for battlefield management systems Optimize decision-making on the battlefield, synchronize communications between assets, and increase soldier survivability Work closely with software and test engineers developing and testing AI-based decision aid software So, if you have the experience above, please apply today or email me directly at edwin.ocampo@cybercoders.com! Email Your Resume In Word To Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also: Edwin.Ocampo@CyberCoders.com Please do NOT change the email subject line in any way. You must keep the JobID: linkedin : EO1-1641797 -- in the email subject line for your application to be considered.*** Edwin Ocampo - Recruiting Manager - CyberCoders Applicants must be authorized to work in the U.S. CyberCoders, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-25T17:39:42.000Z"
    },
    "company": {
        "name": "CyberCoders",
        "link": "https://www.linkedin.com/company/cybercoders"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Wharton",
        "region": "NJ",
        "postal_code": "07885",
        "street_address": null,
        "latitude": 40.90535,
        "longitude": -74.57993
    }
}