{
    "job": {
        "title": "Data Scientist",
        "industry": "",
        "description": "InveniAI is a company that is accelerating Drug Discovery and Development with Artificial Intelligence and Machine Learning. Our R&D Engine is significantly improving drug development's clinical and regulatory success. We pride ourselves on resourcefulness, collaboration, and our ability to tackle  Pharma's most demanding problems and look for exceptional talent to help us grow. Job Summary We are looking for a Data Scientist that will help us discover the information hidden in vast amounts of data and help us make more intelligent decisions to deliver even better products. As a Data Scientist and Statistician, you will work with a growing multidisciplinary team of Data Scientists, Engineers, and Solutions Experts with deep domain expertise, working to develop new skills and workflows to solve real-world problems of the pharma and healthcare domain. You will have the opportunity to work with unique healthcare data sets that cover all phases of the Pharma/Healthcare industry. Your responsibilities will be to apply data mining techniques, statistical analysis and build high-quality prediction systems integrated with our product. You will be helping to ensure that our models are accurate and parsimonious. You will also help to characterize, interpret, and share the results we achieve in our pharma/healthcare research studies. Responsibilities Strong computational skills and knowledge of machine learning, prediction methods, and/or systems biology Extensive background in developing classification and prediction models, including model selection and regularization techniques Doing ad-hoc analysis and presenting results in a clear manner Support the development and delivery of analytic models using skills such as data acquisition and management, algorithm design, and model development & refinement Acquire a deep understanding of the scientific problems and translate them into appropriate algorithmic representations Encode mathematical abstractions into prototype computer programs or models Ensure process documentation, overall quality of the data & solutions during the analytic development process Interpret results and communicate them to technical and non-technical audiences, cross-functional teams, and executive leadership A genuine interest in the scientific questions being investigated in the Center. Qualifications 1-4+ years of data analytics experience B.Tech/BE/M.Tech/MSc/PhD in IT/CS/Biotech/Bioinformatics/Mathematics/Life Science Expert knowledge of Python/KNIME Knowledge of NLP(Natural language procession) and NER(Named entity recognition) Knowledge of PostgreSQL/MySQL Extensive experience with machine learning and statistical modeling is imperative; text mining and topic modeling are a plus. Comfortable working in an environment where problems are not always well-defined Inquisitive, proactive, and interested in learning new tools and techniques Outstanding communication and collaboration skills. You can learn from and teach others. Strong drive for results. Well-organized, independent, and ready to work with minimal supervision Data-oriented personality with a desire to excel and work with talented people Experience working with healthcare data Ability to work with the integration of OMICS data with tools of Network Biology. Experience with data visualization tools, such as D3.js, GGplot, gephi, cytoscape, R-Shiny. Desirable Experience in applying advanced mathematics Good scripting and programming skills Full-time",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-04T16:55:01.000Z"
    },
    "company": {
        "name": "InveniAI",
        "link": "https://www.linkedin.com/company/inveniai"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 12,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Guilford",
        "region": "CT",
        "postal_code": "06437",
        "street_address": null,
        "latitude": 41.281227,
        "longitude": -72.68165
    }
}