{
    "job": {
        "title": "Fall 2021 - User Experience Researcher Intern - 90295395 - Washington",
        "industry": "Construction,Information Technology and Services,Financial Services",
        "description": "Your success is a train ride away. Amtrak connects businesses and communities across the country and we move America’s workforce toward the future. We employ more than 20,000 diverse, energetic professionals in a variety of career fields throughout the United States. The safety of our passengers, our employees, the public and our operating environment is our priority and the success of our railroad is the result of our employees. Are you ready to join our team? Summary This is a high impact position because the intern will be given an opportunity to create a market research report library, a highly desired feature by many colleagues from departments for many years. The output of this work will facilitate knowledge sharing and further collaboration among different departments within Amtrak. The intern will also support the day to day project management of existing market research projects and coordinate between research vendors and internal clients. The role requires excellent organization and project management skills and a strong client-centered mindset – How can I make it easier for my internal clients to find the reports that are most relevant to them with least amount of time? How can I train as many users to learn how to use this library as quickly as possible? Essential Functions Market Research Report Online Library Project: Create a market research report library indexing thousands of past market research and analysis reports. Develop a file labeling system that allows users to quickly find a list of research reports that fall under their interest. Develop a consistent report naming system. Upload the research reports onto Amtrak internal file sharing site (SharePoint). Maintain this library as new reports are created. Educate Amtrak colleagues about this new online research report library by written manuals or live presentations. Other Day-to-day Functions Keep track of ongoing market research projects using existing project management process. Collaborate with market research vendors to execute some research projects. Update internal clients on the status of existing market research projects. Other responsibilities as assigned. Minimum Qualifications Must be actively pursuing a degree at an accredited educational institution. Must be actively pursuing a graduate degree in Marketing, Business Management and/or related business field. Must have a cumulative GPA of 3.0 or higher Preferred Qualifications Strong knowledge in Market Research Excellent organization skills Excellent project management skills Strong communication skills Attention to details Self-starter, motivated Communication And Interpersonal Skills Must have excellent oral and written communication skills Requisition ID: 64941 Posting Location(s): District of Columbia; Maryland; Virginia Job Family/Function: Marketing Relocation Offered: No Travel Requirements: None Amtrak employees power our progress through their performance. We want your work at Amtrak to be more than a job – we want it to be a fulfilling experience where you find challenging and rewarding opportunities, respect among colleagues, competitive pay, benefits that protect you and your family, and a high performance culture that recognizes and values your contributions and helps you reach your career goals. We proudly support and encourage U.S. Veterans to apply for Amtrak job opportunities. All positions require pre-employment background verification, medical review and pre-employment drug screen. Amtrak is committed to a safe and drug-free workplace and performs pre-employment substance abuse testing. All new hires are required to undergo a hair drug test which detects the presence of illegal drugs for months prior to testing. Marijuana, notwithstanding any statute, ordinance, regulation, or other law that legalizes or decriminalizes the use or possession of marijuana, whether for medical, recreational, or other use. Candidates who engage in the usage of marijuana will not be qualified for hire. We appreciate your cooperation in keeping Amtrak safe and drug-free. In accordance with DOT regulations (49 CFR section 40.25), Amtrak is required to obtain prior drug and alcohol testing records for applicants/employees intending to perform safety- sensitive duties for covered Department of Transportation positions. If an applicant/employee refuses to provide written consent for Amtrak to obtain these records, he/she will not permitted to perform safety-sensitive functions. Note that any education requirement listed above may be deemed satisfied if you have an equivalent combination of education, training and experience. Amtrak is an Affirmative Action/Equal Opportunity Employer and we welcome all to apply. We consider candidates regardless of race, color, religion, sex, sexual orientation, gender identity, national origin, disability (including blindness), or veteran status. POSTING NOTES: Marketing || Internships & Co-Ops",
        "employment_type": "INTERN",
        "date_posted": "2021-08-01T07:16:13.000Z"
    },
    "company": {
        "name": "Amtrak",
        "link": "https://www.linkedin.com/company/amtrak"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Washington",
        "region": "DC",
        "postal_code": "20398",
        "street_address": null,
        "latitude": 38.892063,
        "longitude": -77.01991
    }
}