{
    "job": {
        "title": "Software Development Engineer",
        "industry": "Computer Software,Human Resources,Information Technology and Services",
        "description": "Do what you love. Love what you do. At Workday, we help the world’s largest organizations adapt to what’s next by bringing finance, HR, and planning into a single enterprise cloud. We work hard, and we’re serious about what we do. But we like to have fun, too. We put people first, celebrate diversity, drive innovation, and do good in the communities where we live and work. About the Team Inbox team has an excellent opportunity to rebuild and reinvent Inbox, including searching, tagging and new bespoke UI. The position presents the opportunity to work in a collaborative environment designing, developing, delivering, and maintaining Inbox used by 100% of Workday customers. About the Role Design and build REST APIs, highly scalable collaboration platform and features Collaborate in a small team using your engineering background to get work done Exert your independence and ability to learn unfamiliar technology Build and maintain robust and quality code and reliable automated tests About You Bachelor's Degree or higher. Computer Science/Engineering major is preferable. You have experience owning production systems Experience developing cloud software services and an understanding of design for scalability, performance and reliability, and tradeoffs therein Extensive experience developing distributed and concurrent systems; secure, fault tolerant, highly available, recoverable, consistent, scalable, and predictable and the tradeoffs therein Knowledge of Business Process Frameworks Basic Qualifications 3+ Years of development in object oriented design, Java or Workday Xpresso Previous experience developing in an Agile/Scrum environment A love for learning and a passion for helping others Other Qualifications 2+ Years of functional programming in Scala React, Typescript, Node experience a plus Workday is an Equal Opportunity Employer including individuals with disabilities and protected veterans.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-20T00:04:31.000Z"
    },
    "company": {
        "name": "Workday",
        "link": "https://www.linkedin.com/company/workday"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Salt Lake City",
        "region": "UT",
        "postal_code": "84101",
        "street_address": null,
        "latitude": 40.758476,
        "longitude": -111.888145
    }
}