{
    "job": {
        "title": "Software Engineer",
        "industry": "Information Technology and Services,Computer Software,Internet",
        "description": "Description The Position Do you dream about creating a more sustainable future? At Uplight, we are motivating energy users and providers to accelerate the clean energy ecosystem. We’re working with over 90 of the world’s leading electric and gas utilities to provide a personalized end-to-end customer energy experience that helps meet and accelerate carbon reduction goals. We are a certified B Corp, enabling us to put our values into action by not only making decisions for the benefit of our shareholders, but also for our customers, environment, employees, and community. We are seeking a Senior Software Engineer to join our team and help us achieve our ambitious goals for our business and for the planet. What You Get To Do We are looking for a Software Engineer to add to our Marketplace team. You’ll work with a talented group of engineers to build and maintain features on the front and back end of our applications using Python and Javascript. What You Will Contribute Be excited to work with talented, committed people in a fast-paced environment Be passionate about energy consumption and making a difference in the world Love developing great software -- some of your proudest moments involve pushing new features with high quality to delight your users Be capable of prioritizing your work to adhere to a deliverable schedule and ensure successful delivery that exceeds expectations Have a strong eye for detail and quality of your code Not be afraid to dig into hard problems, and enjoy experimenting to come up with simple, elegant solutions What You Bring To Uplight You have about 3-5 years of experience as an engineer writing software. You have Python experience Experience with modern front end development (Node, React, Webpack, etc) You consider improving test coverage and quality as a key to software development and have worked with CI/CD workflows before. Leverage different cloud based technologies in AWS and GCP to create stable and maintainable software systems. What Makes Working At Uplight Amazing In addition to all the standard medical and dental benefits, that kick in Day 1, we: Are proud to be over 500+ rebels with an important cause by helping to create a more sustainable planet. Are committed to the environment, our employees, and our communities Focus on career growth by following defined career ladders Take our work and mission seriously and.... we love to laugh! We Slo Provide Provide a 401k match Medical, vision, and dental insurance Monthly wellness stipend Peer to Peer recognition program Management by objectives bonus plan Innovated flexible time off Keep you energized with plenty of food and drink (when our offices reopen) Salary Range : $100,000 to $110,000 In accordance with the Colorado Equal Pay for Equal Work Act, the approximate annual base compensation range is listed above. The actual offer, reflecting the total compensation package and benefits, will be determined by a number of factors including the applicant's experience, knowledge, skills, and abilities, as well as internal equity among our team. Uplight provides equal employment opportunities to all employees and applicants and prohibits discrimination and harassment of any type without regard to race (including hair texture and hairstyles), color, religion (including head coverings), age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-10-17T21:16:01.000Z"
    },
    "company": {
        "name": "Uplight",
        "link": "https://www.linkedin.com/company/uplightenergy"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Boulder",
        "region": "CO",
        "postal_code": "80310",
        "street_address": null,
        "latitude": 40.016872,
        "longitude": -105.279625
    }
}