{
    "job": {
        "title": "Frontend Software Engineer",
        "industry": "Information Technology and Services,Computer Software,Automotive",
        "description": "Who We Are At Aurora, we’re on a mission to deliver the benefits of self-driving technology safely, quickly, and broadly. It all starts with the Aurora Driver, a platform created from industry-leading hardware and software and designed to adapt across a variety of vehicle types and industries. We’re led by a team of self-driving luminaries, and we’ve forged strategic partnerships with leading transportation companies—including ride-hailing network Uber, truck-manufacturers PACCAR and Volvo Trucks, and the world’s largest automaker Toyota—setting us up to deliver the Aurora Driver in both trucks and passenger vehicles. We are funded by Amazon, Uber, T Rowe Price, and some of Silicon Valley’s best venture capital firms, including Sequoia, Greylock, and Index Ventures. Aurora is in the best position to lead the self-driving space with a team of unparalleled depth and expertise, the technology to deliver, and the partnerships to build a transformative business for the long-term. Aurora hires talented people with diverse backgrounds who are ready to help build a transportation ecosystem that will make our roads safer, get crucial goods where they need to go, and make mobility more efficient and accessible for all. We’re searching for a Frontend Software Engineer. In this role, you will Build the tools and applications required to enable autonomy for our Fleet Command group, streamlining and automating processes, working across diverse data formats and types, to bring Aurora's driver to market safely, quickly, and broadly. Required Qualifications Phenomenal communication skills. We build software for people. We build software with people. You know how to write an effective technical spec, provide feedback to others, translate technical concepts into lay terms, and incorporate feedback into your efforts. You value and practice openness, empathy, kindness, and collaboration. A preference for action. You will use good judgment to balance speed and quality. You will deliver products that are built in a responsible and sustainable way. You will use a self-starter mentality to thrive in a growing environment where all hands are on deck, and consider no obstacle too big or too small. You will notice where there is a need and will hustle to fill it. The drive to make teams stronger. You're excited to work hard and fast to the finish line on new opportunities with a collaborative and integrated team. You will be proactive in engaging conflict with openness, patience and kindness in an environment where it is safe to lean on each other and learn from failures. Frontend Engineering. You are comfortable writing code in Javascript . We do the bulk of our work in React , but we welcome candidates with broader JS experience. Desirable Experience working with mapping or geospatial technologies. Working at Aurora At Aurora, we bring together people with extraordinary talent and experience united by the strength of our values. We operate with integrity, set outrageous goals, and continue to build a culture where we win together—all without any jerks. Benefits We also offer a competitive benefits package that supports the whole you, including We have offices in Pittsburgh, Mountain View, San Francisco, Bozeman, Dallas and Seattle. Competitive salary, bonus and RSU package Premium choices for Medical, vision, and dental 401k benefits Life and disability benefits 18 weeks paid leave for new parents and caregivers Flexible vacation and company paid holidays Fertility benefits through Carrot Working from home support Professional growth and mentorship opportunities through the Aurora Academy Wellness Platforms (Spring Health, Headspace, Aaptiv, Quit Genius) We believe that self-driving technology has broad benefits – including an increase in safety and access to transportation – and to achieve those benefits, we want and need a workforce with diverse experiences, insights, and perspectives; said another way, a workforce that reflects the communities and people our technology will benefit. Individuals seeking employment at Aurora are considered without regard to race, color, religion, national origin, age, sex, gender, gender identity, gender expression, sexual orientation, marital status, pregnancy status, parent or caregiver status, ancestry, political affiliation, veteran and/or military status, physical or mental disability, or any other status protected by federal or state law. Your responses, or your choice not to respond, will not be associated with your specific application, nor will they be used in the selection process or in making any hiring decision. About Aurora Founded in 2017, Aurora was started by industry luminaries, and now we’re a team with a multitude of perspectives and experiences. Chris Urmson helped lead Carnegie Mellon’s efforts in Darpa’s Grand Challenges, then was a founding member of Google’s self-driving team. Sterling Anderson worked on the tech at MIT before leading Tesla’s Model X and Autopilot programs. Drew Bagnell, also a Carnegie Mellon alum, is a machine learning expert who helped build Uber’s autonomy effort. Regarded as the most experienced leadership team in the industry, these three bring decades of expertise, passion and focus to realizing our mission.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-03T03:37:50.000Z"
    },
    "company": {
        "name": "Aurora",
        "link": "https://www.linkedin.com/company/auroradriver"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Mountain View",
        "region": "CA",
        "postal_code": "94040",
        "street_address": null,
        "latitude": 37.39008,
        "longitude": -122.08139
    }
}