{
    "job": {
        "title": "Social Media Marketing Intern",
        "industry": "",
        "description": "The Tease Media: Company Background The Tease is an inclusive digital media brand informed by insight, curiosity and commentary on all things hair, beauty and pop-culture. We keep professionals and consumers in-the-know and on-trend with smart, candid reporting, exclusive editorial content and podcasts. Position Overview The Tease Media team is seeking a Social Media Intern to support the day-to-day operations  for the brands social media platform in order to inspire and engage our audience, expand our reach and drive conversions. The Social Media Intern Will Write, edit and produce highly engaging daily posts for each social platform, including Facebook, Instagram and TikTok Cultivate an engaged audience with high-touch communication with users across public platforms and in comment threads and DMs Maintain cross-platform and platform-specific editorial calendar for social media content Work with print, video, and design teams to develop cross-platform, traffic-driving social campaigns Seamlessly execute partnership programs on social and digital channels Monitor competitors’ social media presence, identify new opportunities, and leverage best practices. Write, edit and curate email marketing programming for paid and non-paid issues Ideate continued ways to innovate salon professional hair-related content to elevate the brand, including pitching of content series campaigns, salon professional partnerships (stylists/barbers), etc. Maintain upstanding relationships with brands and salon professionals to continue building awareness within the market Have experience with newsroom analytics tools, such as Chartbeat and Crowdtangle About You You have a keen eye and a creative, forward-thinking mindset You’re passionate about salon professional and beauty brands, stories, and design, and have a fascination with how to apply that passion across social platforms You love working with tight-knit entrepreneurial teams You have an understanding of industry trends, best practices, and emerging user behaviors. You are an enthusiastic, highly-organized creative producer with the ability to work independently as well as in a team environment You are a confident, skillful communicator",
        "employment_type": "CONTRACTOR",
        "date_posted": "2021-08-25T17:24:57.000Z"
    },
    "company": {
        "name": "The Tease",
        "link": "https://www.linkedin.com/company/hello-salon-pro"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Los Angeles",
        "region": "CA",
        "postal_code": "90101",
        "street_address": null,
        "latitude": 34.05224,
        "longitude": -118.24335
    }
}