{
    "job": {
        "title": "Electrical Design Engineer",
        "industry": "Construction",
        "description": "If you are a Electrical Design Engineer with experience, please read on! We are a consulting firm that works in California and Texas, providing mechanical, electrical and plumbing support. We are looking for an Electrical Design engineer to assist our project managers with completing projects. We are currently experiencing growth, and need new talent to join our team! What You Will Be Doing You will be working alongside a Project Manager to oversee all projects and make sure they are completed in a timely manner. Using AutoCAD and Revit, you will develop detailed voltage drop calculations as well as single line drawings. You will conduct lighting calculations and designs. What You Need for this Position Required Master's Degree in Electrical Engineering, Data Analytics, or related fields. AutoCAD and Revit software experience What's In It for You $60K-110K DOE Medical/Dental/Vision PTO So, if you are a Electrical Design Engineer with experience, please apply today! Email Your Resume In Word To Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also: Amy.Flores@CyberCoders.com Please do NOT change the email subject line in any way. You must keep the JobID: linkedin : AF4-1647406 -- in the email subject line for your application to be considered.*** Amy Flores - Recruiter - CyberCoders Applicants must be authorized to work in the U.S. CyberCoders, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire. CyberCoders will consider for Employment in the City of Los Angeles qualified Applicants with Criminal Histories in a manner consistent with the requirements of the Los Angeles Fair Chance Initiative for Hiring (Ban the Box) Ordinance.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-25T17:32:10.000Z"
    },
    "company": {
        "name": "CyberCoders",
        "link": "https://www.linkedin.com/company/cybercoders"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Glendora",
        "region": "CA",
        "postal_code": "91740",
        "street_address": null,
        "latitude": 34.136,
        "longitude": -117.865486
    }
}