{
    "job": {
        "title": "Software Engineer",
        "industry": "",
        "description": "About Expedock We are reinventing the multi-trillion dollar industry of global shipping and supply chains using artificial intelligence and data processing. We work with some of the top logistics businesses in the world making their complex logistics processes more efficient and transparent. Want to build new products and features that help reinvent one of the world's largest industries that affects 90% of everything around you? Expedock is looking for full-stack Software Engineers to join our team. You can help build the next generation of products that revolutionize a centuries-old industry that's just now realizing the benefits of the technology adoption curve. Join us! Job Description As a Software Engineer, you will: Be involved in full-stack web application development with a variety of languages and frameworks including Python, TypeScript, HTML, React, Flask, Postgres, etc. Work closely with our PM and design teams to define feature specifications and build impactful products. Work closely with operations to build user-friendly data visualization and processing software. Minimum Qualifications 1-2+ years of experience in full stack web development B.S. Computer Science or related technical field preferred, fresh grad is also ok. Experience with Python and Javascript required 1-2+ years of experience with Python 1-2+ years of experience with Javascript 1-2+ years of experience with relational databases and SQL Experience in ReactJS and Flask preferred Experience with AWS and GCP a plus Experience with AI a plus Why Expedock? Competitive compensation package with perks like education allowances A very dynamic team and fun colleagues to work with Learning and mentorship from the best startup talent based around the world Work from home set up with flexible work hours so you have full ownership of your time Unparalleled professional growth by gaining experience in multiple functions Opportunity to fast track into leadership positions if you do very well Once in a lifetime experience to build the future of logistics and supply chain",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-23T18:16:32.000Z"
    },
    "company": {
        "name": "Expedock",
        "link": "https://www.linkedin.com/company/expedock"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 12,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "San Francisco",
        "region": "CA",
        "postal_code": "94121",
        "street_address": null,
        "latitude": 37.78008,
        "longitude": -122.42016
    }
}