{
    "job": {
        "title": "Current PhD - Data Science Internship - Summer 2022",
        "industry": "Computer Software,Internet,Financial Services",
        "description": "Center 1 (19052), United States of America, McLean, Virginia Current PhD - Data Science Internship - Summer 2022 Who We Are At Capital One, we’re building a leading information-based technology company. Still founder-led by Chairman and Chief Executive Officer Richard Fairbank, Capital One is on a mission to help our customers succeed by bringing ingenuity, simplicity, and humanity to banking. We measure our efforts by the success our customers enjoy and the advocacy they exhibit. We are succeeding because they are succeeding. Guided by our shared values, we thrive in an environment where collaboration and openness are valued. We believe that innovation is powered by perspective and that teamwork and respect for each other lead to superior results. We elevate each other and obsess about doing the right thing. Our associates serve with humility and a deep respect for their responsibility in helping our customers achieve their goals and realize their dreams. Together, we are on a quest to change banking for good. As a Data Scientist at Capital One, you’ll be part of a high-performing team that’s embracing the latest in computing technologies to unlock opportunities that help everyday people save money and improve their financial lives. You'll help our customers solve their financial services challenges by using groundbreaking techniques. You'll make valuable contributions from day one by continuously learning, engaging in diverse sets of experiences and building close-knit relationships across the company. On Any Given Day, You Might Evaluate open-source and internally-developed modeling and analytics tools using real business data Integrate internal data with external data sources and APIs to discover and implement actionable insights Design and craft rich data visualizations to communicate stories to customers and company leadership We'd love to find someone who is… Intellectually curious. You ask why, you explore, and you are excited to imagine and create new ideas by inventing self-adaptive models or by tapping into unstructured data sources. You love mining data for insights into behaviors, intent and sentiment A builder. You are passionate about delivering better experiences and better products to our customers and have a deep sense of ownership for your craft. An experimental scientist. You love putting on your lab coat and trying new things, new combinations of tools, techniques and feature engineering approaches even if you sometimes fail. Are you ready to join a community of talented individuals who embrace customer problems and use their passion and capabilities to make a difference every single day? If you're interested in a long-term career at Capital One, the Data Science internship could be a great way to begin your career journey! Basic Qualifications PhD degree obtained between December 2022 and August 2025 At least 6 months of experience or academic work in open source programming languages for data analysis Preferred Qualifications Direct experience with either Python or R, plus one other general-purpose programming language Experience or academic work in inferential statistics Experience or academic work in machine learning Experience or academic with relational databases Experience or academic with large scale data analysis This is a paid internship. This is a limited-time internship position, and Capital One will not sponsor a new applicant for employment authorization for this position. However, a full-time Data Science role, for which you may be considered upon completion of the internship (subject to business need, market conditions, and other factors) is eligible for employer immigration sponsorship. Job Category - Data Science, Product Innovators",
        "employment_type": "INTERN",
        "date_posted": "2021-08-03T03:42:02.000Z"
    },
    "company": {
        "name": "Capital One",
        "link": "https://www.linkedin.com/company/capital-one"
    },
    "education": {
        "required_credential": null
    },
    "experience": {
        "months_of_experience": 6,
        "seniority_level": "junior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Plano",
        "region": "TX",
        "postal_code": "75093",
        "street_address": null,
        "latitude": 33.019695,
        "longitude": -96.697586
    }
}