{
    "job": {
        "title": "Software Engineer",
        "industry": "Electrical/Electronic Manufacturing,Construction,Mechanical or Industrial Engineering",
        "description": "Job Summary Randstad is seeking a Software Engineer with experience in Aerospace or the Automotive industry to support the Embedded development of a state-of-the-art alternative fuel Aircraft Propulsion System. You will work with a diverse international team and head up the design and development of the Control Systems. Your work will truly revolutionize air transportation across North America and Europe. location: Everett, Washington job type: Permanent salary: $135,000 - 145,000 per year work hours: 8am to 4pm education: Bachelors Responsibilities Select appropriate HW/SW platforms and architectures to achieve real-time data acquisition and control of complex systems including Propulsion system, power management, and safety features Develop embedded code to perform system telemetry and control for these complex systems in real-time (< microseconds) Develop assorted software for a variety of subsystem test stands Develop database and post processing software to support system troubleshooting, development and analysis Be able and willing to build or adapt new software development environments as needed. Create graphical user interfaces for real time system telemetry and control panels Maintain high quality documentation of code base and architectures Help build our software engineering team as we grow Requirements Demonstrated self-starter / learning related to software and firmware Experience with relevant computer programming languages such as C/C++, Python Hands-on experience coding and testing prototype systems Ability to plan projects and be accountable for deliverables & schedules Proficiency in DO178C or ISO 26262 and applicable standard for Software Life Cycle Proficiency in multi-application, multi-layer design , verification and implementation Experience in Software in the loop and Hardware in the loop Emphasis on real time high bandwidth control system theory, design, and implementation Serial digital communication knowledge (UART, I2C, CAN, SPI) Hands on experience with measurement and test equipment (oscilloscopes, DAQ's, etc) Circuit design and PCB layout for mixed power/signal applications Application/GUI programming Experience with version control systems Altium experience Qualifications Experience level: Experienced Minimum 5 years of experience Education: Bachelors (required) Skills Embedded Software Full Lifecycle Equal Opportunity Employer: Race, Color, Religion, Sex, Sexual Orientation, Gender Identity, National Origin, Age, Genetic Information, Disability, Protected Veteran Status, or any other legally protected group status.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-20T06:12:35.000Z"
    },
    "company": {
        "name": "Randstad USA",
        "link": "https://www.linkedin.com/company/randstadusa"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Everett",
        "region": "WA",
        "postal_code": "98201",
        "street_address": null,
        "latitude": 47.97913,
        "longitude": -122.19589
    }
}