{
    "job": {
        "title": "REMOTE Sr. Software Engineer - Angular, Node.js, MongoDB",
        "industry": "Information Technology and Services,Computer Software,Financial Services",
        "description": "If you are a REMOTE Sr. Software Engineer with Angular / React, Node.js, and MongoDB experience, please read on! Job Title: Sr. Software Engineer - Angular / React, Node.js, MongoDB / PostgreSQL Job Location: 100% REMOTE as long as you're located in the Tri-State Area (NY / CT/ NJ) Compensation: $120K - $150K base salary Depending on Experience The problems we are solving are challenging and interesting and our solutions have an immediate impact on students and staff at urban schools in NYC. We are looking for a Lead / Senior engineer excited about public service and the prospect of joining a fun and growing team in an open, collaborative, and diverse environment. Top Reasons to Work with Us Competitive Base Salary ($120K - $150K Depending on Experience) Comprehensive Benefits Package - FREE health coverage for the employee and competitive rates for family! The chance to work for a mission-driven organization that supports NYC public education! Plenty of room to advance and grow your career - the chance to lead and mentor others while you grow your career! What You Will Be Doing Responsibilities Include The Following This candidate will help build, test and maintain our school management platform built on Angular, Node.js, and MongoDB, supplemented by RXJS, Typescript, GraphQL, PostgreSQL, and other technologies. Provide leadership around technical architecture and the establishment of robust design patterns. Completing programming and designing changes and improvements to our application Debugging any potential problems that come up and take note of areas that could be a problem down the line Writing clean code, coming up with new ideas, run tests on new code Lead / mentor other software engineers What You Need for this Position Bachelor's Degree with at least 4 - 7+ years of work experience in a production software engineering environment. Required Tech Stack Experience JavaScript (ES5 / ES6) Angular.js / React.js or similar Javascript frontend framework RESTful API development Node.js MongoDB and/or PostgreSQL CSS / SCSS Preferred TypeScript RxJS / NgRx GraphQL Prior experience in education So, if you are a REMOTE Sr. Software Engineer with experience, please apply today! or send an updated copy of your resume to Mike.Vandenbergh@Optello.com for immediate consideration! Email Your Resume In Word To Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also: Mike.Vandenbergh@Optello.com Please do NOT change the email subject line in any way. You must keep the JobID: linkedin : MV1-1643952 -- in the email subject line for your application to be considered.*** Mike Vandenbergh - Lead Recruiter - Optello Applicants must be authorized to work in the U.S. Optello is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire. Optello will consider for Employment in the City of Los Angeles qualified Applicants with Criminal Histories in a manner consistent with the requirements of the Los Angeles Fair Chance Initiative for Hiring (Ban the Box) Ordinance.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-31T07:16:32.000Z"
    },
    "company": {
        "name": "Optello",
        "link": "https://www.linkedin.com/company/optello-us"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 48,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "New York",
        "region": "NY",
        "postal_code": "10132",
        "street_address": null,
        "latitude": 40.713047,
        "longitude": -74.00723
    }
}