{
    "job": {
        "title": "Implementation Engineer",
        "industry": "Information Technology and Services",
        "description": "Implementation Engineer United States / Remote Our Vision: AI for Good We would like to make the world a better place Computer Vision. There are massive benefits to Chooch depending on the use case, from preventing fraud to decreasing medical mistakes, from increasing manufacturing quality to deepening our understanding of a changing world. We believe Chooch solves a fundamental problem in Computer Vision, the ability to acquire visual expertise in a structured way similar to human knowledge. This will allow us to share our intuitive system with others in a way that will be truly beneficial to humanity. The business opportunity is also tremendous. Chooch has partnered with leading global consultancies, hardware manufacturers and systems integrators to make this happen, and our company been covered by the leading analyst firms and press like the Washington Post and Techcrunch. Unleash Your Potential A career with Chooch gives you all the opportunities and benefits that can only come from working for the trusted industry leader. By joining our supportive group of globally diverse teammates, you will solve real-life problems, make a difference, and have a global impact. At Chooch we encourage you to be yourself, grow with us and unleash your potential. About the Role As an important member of our implementation team, you will work directly with our partners and customers to ensure the successful and timely implementation of our Computer Vision and edge computing solutions. You will be responsible for ensuring our customers gain an in-depth technical understanding of our solutions and how they integrate into their environment. You will also provide ongoing technical training to our partners allowing them to perform implementations on their own. To meet be successful you will need to keep up to date on our solutions as well as Computer Vision and AI technologies, the industry, and the competitive posture of the company. In our team environment it is important to represent the company to our customers and our customers’ needs to Chooch in all implementation and technical aspects. The implementation cycles are not long and will lead you working with several implementations concurrently. While this is a highly dynamic and hands-on role it is also part of a collaborative team effort. Essential Duties and Responsibilities Provide implementations for new and existing customers and partners, coordinating closely with internal technical resources as needed Develop and deliver customer technical solutions presentations and diagrams Develop and provide technical training for our customers in support of implementations and ongoing customer satisfaction Develop and provide ongoing technical training to our partners allowing them to perform implementations on their own Develop technical white papers and implementation guides Evangelize and demonstrate our solutions during and after implementation Assist in providing technical support for RFP/RFI, bids, technical evaluations, and proposals Respond to technical objections and create competitive differentiation Develop and lead white-boarding and technical sessions internally and with customers and partners Share customer knowledge and feedback within Chooch Stay up to date on technical trends and advances in computer vision and share internally Look for opportunities to develop professional demoes and technical whitepapers and videos that increase customer understanding Work closely with our technical teams to improve product fit and integration Communicate the technical strengths of our products and potential improvements that can be made to increase customer satisfaction and Chooch’s competitiveness About you Hands-on experience with Computer Vision and/or embedded edge AI or AI implementation or development experience, experience with cameras and camera technology a strong plus 5+ years’ experience working directly with customers and partners to deliver technical implementations Hands-on experience with Containers such as Docker, Docker Swarm or Kubernetes implementations and deployments Bachelor's degree in Computer Science or a related technical field Experience creating implementation and technical documentation and customer training Excellent customer-facing skills including a demonstrated track-record of interfacing with enterprise clients and partners Highly effective presentation, demonstration, and communication skills Track record of communicating complex technical concepts to non-technical customers Able to identify potential problems early and develop plans to avoid such problems Track record of learning new technologies quickly Knowledge of implementation processes Excellent team player and builds trust internally and with customers and partners Able to work independently and make decisions in real time Responsive and able to prioritize workload based on customer and company needs Strong work ethic and a \"get-the-job-done\" attitude in a fast-paced, startup-like environment Knowledge of Python is a plus Government clearance is a strong plus Able to travel up to 20% Chooch is an equal opportunity employer. We do not make hiring, employment or promotion decisions based on race, religion, color, sex, age, national origin, ancestry, sexual orientation, gender or identity or expression, pregnancy or pregnancy-related condition, marital status, height and/or weight.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-20T23:08:11.000Z"
    },
    "company": {
        "name": "Chooch AI",
        "link": "https://www.linkedin.com/company/chooch-ai"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "United States",
        "region": null,
        "postal_code": "99999",
        "street_address": null,
        "latitude": 39.50355,
        "longitude": -99.0183
    }
}