{
    "job": {
        "title": "Embedded Software Engineer - C/C++/Microcontrollers",
        "industry": "Electrical/Electronic Manufacturing",
        "description": "If you are a Embedded Software Engineer - C/C++/Microcontrollers with experience, please read on! Top Reasons to Work with Us Terrific benefits and compensation package Wonderful company culture and a great mission that everyone can get behind Growing company where career opportunities abound! Great family and fun culture What You Will Be Doing The Embedded Software Engineer will be developing embedded software for advanced medical devices. General responsibilities to include: Contribute to all phases of the SDLC Generate task estimates, requirement specifications, and documentation Analysis and design Determine technical approaches to coding requirements Generate and maintain software documentation Contribute to existing architecture What You Need for this Position Qualified candidates will possess as much of the following experience as possible: Bachelors degree in Computer Science/Engineering, Electrical Engineering, or relevant STEM field 2+ yrs of professional embedded software development experience Strong grasp of 8-bit microprocessors Strong grasp of microcontroller architecture Strong experience developing in C Strong experience developing in C++ Strong grasp of OOP design concepts Previous experience with defect tracking tools and configuration management Previous experience debugging in microcontroller environments Special Consideration For Candidates With Masters degree in Computer Science/Engineering, Electrical Engineering, or relevant STEM field Previous experience in highly regulated environments (FDA, ISO, etc) Experience developing software for low power applications Experience with communication protocols like Bluetooth Experience with medical devices and/or medical hardware What's In It for You Competitive base salary Vacation/PTO Medical Dental Vision Relocation Assistance 401(k) with a match So, if you are a Embedded Software Engineer - C/C++/Microcontrollers with experience, please apply today! Email Your Resume In Word To Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also: Melanie.McElwee@CyberCoders.com Please do NOT change the email subject line in any way. You must keep the JobID: linkedin : JP13-1616809 -- in the email subject line for your application to be considered.*** Melanie McElwee - Sr. Executive Recruiter - CyberCoders Applicants must be authorized to work in the U.S. CyberCoders, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-31T07:23:27.000Z"
    },
    "company": {
        "name": "CyberCoders",
        "link": "https://www.linkedin.com/company/cybercoders"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Lake Oswego",
        "region": "OR",
        "postal_code": "97034",
        "street_address": null,
        "latitude": 45.421093,
        "longitude": -122.667694
    }
}