{
    "job": {
        "title": "Software Engineer",
        "industry": "Internet,Marketing and Advertising,Computer Software",
        "description": "Software Engineer Surfside is an end-to-end marketing technology company that has built a first of its kind data activation and customer acquisition platform that provides brands and retailers the ability to manage, enrich and activate all of their customer data in order to increase awareness, traffic, and ultimately sales. We partner with many of the leading brands, retailers, and advertisers across Direct-to-Consumer Cannabis, Healthcare, and their adjacent industries. Our success is driving organic growth and we are looking for innovative, action-oriented professionals with the desire and initiative to make a major impact on the business. The work environment is collaborative, fast-paced and team-driven. Opportunities for growth are significant and immediate as the engineering team is expected to grow 100% in 2021 alone, with no sign of slowing down. We are looking for a customer-focused engineer to join our team as a Software Engineer. The ideal candidate is front end focused and has 1-3 years of experience in software engineering. This is an opportunity to build best in class e-commerce experiences for our customers, implement features that directly impact the business, and collaborate cross functionally with Product and Design. What you will be responsible for: Building beautiful user interfaces that align with our Design System Architecting, implementing, and maintaining React components within our component library Shipping features that move the needle on key performance indicators Collaborating cross functionally with Product, Design, Data, and Marketing Implementing pixel and user tracking metrics Optimizing and improving our code base Working with 3rd party integrations Participating in code reviews What we’ll love about you: Agile and excited to work in collaborative and cross-functional team environment You care about the customer journey and fight for what is best for the customer You have excellent analytical and problem-solving skills, and can communicate your ideas clearly A team player who is willing and happy to help Strong written and verbal communication skills Belief in our mission and understand the importance of giving-back Inquisitive, love to learn, embrace failure, and never give up Comfortable working in an open office environment while staying focused What you’ll love about us: We are a team of smart, interesting, diverse, funny, and loving people. We offer competitive compensation, health, medical and dental benefits, snacks and a fun, relaxed office environment. We take the responsibility to make sure you are excited, happy, and find fulfillment in your work very seriously. We value fun, hosting office lunches, offsite team outings, and are currently planning our inaugural annual company retreat. We believe success comes from the collective effort of all, which is why all full-time employees receive equity in the business. We offer flexible paid time off for all full-time employees. This includes unlimited vacation, sick days, and wellness days because we understand the value of health, relaxation, spending time with friends and family, and traveling the world. About you: 1-3 years of experience in software engineering Comfortable with modern web technologies including JavaScript, HTML5, CSS/SASS Familiarity with Front End frameworks such as React, VueJS, Angular Experience integrating with backend services Interest in test driven development Some e-commerce experience (a plus) Surfside is an Equal Opportunity Employer and recognizes that a diverse workforce is crucial to our success as a business. We encourage and welcome you to apply irrespective of age, gender identity, race, religion, sexual orientation, color, pregnancy, family responsibilities, national and social origin, political opinion, marital, veteran, or disability status.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-21T00:39:46.000Z"
    },
    "company": {
        "name": "Surfside",
        "link": "https://www.linkedin.com/company/surfside"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 12,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "New York",
        "region": "NY",
        "postal_code": "10132",
        "street_address": null,
        "latitude": 40.713047,
        "longitude": -74.00723
    }
}