{
    "job": {
        "title": "Software Engineer - Notes",
        "industry": "Consumer Electronics",
        "description": "Summary Imagine what you could do here. At Apple, new ideas have a way of becoming extraordinary products, services, and customer experiences very quickly. Bring passion and dedication to your job and there's no telling what you could accomplish. The Notes team is looking for talented software engineers to build & influence the future of Notes. Key Qualifications You are excited by the idea of working on a product that makes a tangible difference in people's lives. You have extensive experience developing applications for iOS and/or macOS. You’re proficient with common data structures and computer science fundamentals. You have a keen eye for detail and care about the little things that make an experience great. You have a strong sense of personal responsibility and strive for continual self-improvement. You have a track record working cross-functionally with other engineering teams, design, QA, and product to drive features to completion with great quality. You communicate effectively and are able to provide and receive constructive feedback. Description Notes is an app used by millions of people every day to capture and organize the thoughts and information in their daily lives. Our goal is to continue to deliver great new features and incredible value to our users while maintaining the simplicity and reliability that people love about Notes. You’ll be joining our small team of engineers to deliver on this exciting product roadmap. As a senior engineer, you’ll be directly responsible for major feature efforts in Notes. It’ll be your job to take a feature from conception to completion, drawing on your talent and experience in the industry. A typical release for you will involve: - Helping us define and appropriately scope new features. - Planning and organizing the execution plan with other engineers who will be helping you. - Working directly with cross-functional partners (like UIKit, AppKit, etc) to make sure we have what we need. - Iterating with HI and Design teams to ensure we have the best user experience. - Landing high-quality code that is well-tested. - Participating in code reviews for other in-development features. - Screening bugs filed for features in your area of expertise. Education & Experience A bachelors or masters degree in computer science is preferred; however, demonstrating that you understand software and computer science fundamentals through your own study or industry experience is totally fine. Role Number: 200254762",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-09T20:03:14.000Z"
    },
    "company": {
        "name": "Apple",
        "link": "https://www.linkedin.com/company/apple"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Cupertino",
        "region": "CA",
        "postal_code": "95014",
        "street_address": null,
        "latitude": 37.319313,
        "longitude": -122.02927
    }
}