{
    "job": {
        "title": "Senior Site Reliability Engineer",
        "industry": "Information Technology and Services,Computer Software",
        "description": "About Kraken Kraken is changing the world. Join the revolution! Our mission is to accelerate the adoption of cryptocurrency so that you and the rest of the world can achieve financial freedom and inclusion. Founded in 2011 and with over 4 million clients, Kraken is one of the world’s largest, most successful bitcoin exchanges and we are growing faster than ever. Our range of successful products are playing an important role in the mainstream adoption of crypto assets. We attract people who constantly push themselves to think differently and chart exciting new paths in a rapidly growing industry. Kraken is a diverse group of dreamers and doers who see value in being radically transparent. In our first decade Kraken has risen to become one of the best and most respected crypto exchanges in the world. We are changing the way the world thinks about money and finance. The crypto industry is experiencing unprecedented growth and Kraken is leading the charge. We’ve grown from 70 Krakenites in January 2017 to over 1800 today and we have no intention of slowing down. About the Role This is a fully remote role however, we are only considering candidates who plan to work from the US Pacific or Mountain Time zone. Our Engineering team is having a blast while delivering the most sophisticated crypto-trading platform out there. Help us continue to define and lead the industry. As part of Kraken's Frontend SRE Team, you will work within a world-class team of engineers building Kraken's infrastructure. As a Site Reliability Engineer, you will be keeping one of the fastest growing companies in the world up and available in a 24/7 environment. You will bring your own technical expertise to monitor and support staging and production environments, build tooling, CI/CD pipelines, deployment specs and generally automate internal processes to empower developers and improve team efficiency. Responsibilities Monitor and support Staging and Production environments Improve Developer Tooling, help with building Docker images, manage our Continuous Integration (CI) pipelines for automating quality testing Manage releases using Kubernetes Implement tooling to keep track of key metrics and generate alerts Collaborate with Dev, QA, and Product teams, jump in to support and improve development and release cycle Develop tools and bots to improve and automate internal processes Support a fully distributed team operating across numerous timezones Requirements 3+ years in a DevOps role (DevOps, SRE, etc) 1+ years experience with a programming language (NodeJS or Rust) Extensive experience with monitoring tools such as Grafana and Prometheus Thorough knowledge of Docker and extensive experience with Kubernetes, Terraform and Helm Charts Ability to configure and maintain different types of proxy services such as Nginx and Traefik Proficient in Git source version-control Passion for improving process and products Experience configuring Continuous Integration (CI) Ability to thrive while working independently and remotely in a team-based environment Self-starter, ability to context-switch between various projects, codebases and concepts Ability to independently debug problems involving the network and operating system Well-versed in scripting languages, building and administration of Linux Interest in security and a thoughtful and thorough consideration of the security implications of development decisions Nice to Haves... Passion for open-source and contributing back to the community Knowledge about Cloudflare Caching, Page Rules and Workers Experience with Hashicorp Vault and its PKI features Experience with Kubernetes for Local development tools such as Tilt Experience with ReactJS and/or NextJS frameworks Experience with Cloud infrastructure Experience benchmarking applications and identifying bottlenecks Experience with Slack, Jira, Google, and/or Gitlab APIs Experience with monitoring / alerting (primarily with Prometheus / Grafana) and knowledge of best practices in the area Experience with distributed systems and technologies (gRPC, Kafka, NoSQL, SQL, Redis, ...) We’re powered by people from around the world with their own unique backgrounds and experiences. We value all Krakenites and their talents, contributions, and perspectives. Check out all our open roles at https://www.kraken.com/careers. We’re excited to see what you’re made of. Learn more about us Follow us on Twitter: https://twitter.com/krakenfx Catch up on our blog: https://blog.kraken.com/ Follow us on LinkedIn: https://www.linkedin.com/company/kraken-exchange/",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-09-28T17:38:31.000Z"
    },
    "company": {
        "name": "Kraken Digital Asset Exchange",
        "link": "https://www.linkedin.com/company/krakenfx"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "San Francisco Bay Area",
        "region": null,
        "postal_code": "94112",
        "street_address": null,
        "latitude": 37.39271,
        "longitude": -122.042
    }
}