{
    "job": {
        "title": "Principal Software Engineer (Python)",
        "industry": "Broadcast Media",
        "description": "If you are a Principal Software Engineer (Python) with experience, please read on! What You Will Be Doing Key Responsibilities Define technical architecture & roadmap to realize it Deliver features on a cadence within an agile framework Write code across all areas of the product Define quality & process standards Support definition of user stories Working with product team, estimate time & resources needed to achieve goals What You Need for this Position BS in Computer Science or equivalent 10+ years experience in software engineering 5+ years experience with Python, including one web framework & pandas/numpy 1+ years experience with React 1+ years research or industry experience building ML models Expertise with multiple data storage platforms/architectures Expertise in AWS Strong Unix/Linux fundamentals Nice to have: MS in Computer Science or equivalent -Nice to have: Exposure to ad tech concepts & terminology- What's In It for You Competitive salary Collaborative and creative atmosphere, with inspired leadership Career advancement opportunities Recognition and reward for outstanding performance, with high bonus potential Great medical, dental & vision Insurance packages Competitive 401K with company match to plan for the long term Unlimited paid-time-off Transportation benefits & cell phone reimbursement Casual dress all day, every day So, if you are a Principal Software Engineer (Python) with experience, please apply today! Email Your Resume In Word To Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also: Shiv.Warrier@CyberCoders.com Please do NOT change the email subject line in any way. You must keep the JobID: linkedin : SW3-1637254 -- in the email subject line for your application to be considered.*** Shiv Warrier - Sr. Executive Recruiter - CyberCoders Applicants must be authorized to work in the U.S. CyberCoders, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-31T07:17:56.000Z"
    },
    "company": {
        "name": "CyberCoders",
        "link": "https://www.linkedin.com/company/cybercoders"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 120,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Alexandria",
        "region": "VA",
        "postal_code": "22336",
        "street_address": null,
        "latitude": 38.804665,
        "longitude": -77.04362
    }
}