{
    "job": {
        "title": "Product Engineer Controls Software",
        "industry": "Automotive,Transportation/Trucking/Railroad",
        "description": "Position Overview Navistar Vehicle and Powertrain Controls Software Team is responsible for electronic controls and software requirements, design, coding, testing, software integration, releases, and product delivery management. This position is part of the product delivery management team responsible for identifying and developing Software Development work plans to meet program objectives and timing. The Controls Product Delivery Engineer will work with different departments within the Vehicle and Powertrain Controls Software Team to identify, develop, coordinate, maintain, and report out on the status of software delivery. Roles And Responsibilities Develop and maintain program software plan Identify software needs based on Navistar vehicle architecture to support program scopes Provide estimates and maintain resource plan to meet software plan Coordinate Internal Controls Software Team reviews Coordinate software releases Identify and coordinate vehicle level tests in support of new software or vehicle needs Present software status at program team meetings Track and manage software resources Basic Requirements Bachelor’s degree in Engineering or Engineering Technology At least 12 years of experience in product design/development or new technologies At least 2 years of experience leading new technologies or specialized technologies OR Master’s degree in Engineering or Engineering Technology At least 8 years of experience in product design/development or new technologies At least 2 years of experience leading new technologies or specialized technologies OR PhD in Engineering or Engineering Technology At least 5 years of experience in product design/development or new technologies At least 2 years of experience leading new technologies or specialized technologies Additional Requirements Qualified candidates, excluding current Navistar employees, must be legally authorized on an unrestricted basis (US Citizen, Legal Permanent Resident, Refugee or Asylee) to be employed in the United States. Navistar does not anticipate providing employment related work sponsorship for this position (e.g., H-1B status) Desired Skills Embedded software experience Experience with Vehicle, Powertrain or Engine Controls System design Experience with engineering and quality design and development methodologies: (8D, FMEA, DVP&R) Experience in functional areas, such as Cybersecurity, Electric Vehicle Electronics, Autonomous Electronics (Radar, Lidar, Camera, Autonomous processor, etc..), Functional Safety (ISO26262), Vehicle Communications and Network, AUTOSAR Software, Telematics Software, Instrument Cluster software Company Overview Navistar is a purpose-driven company, reimagining how to deliver what matters to create more cohesive relationships, build higher-performing teams and find solutions where others don't. Navistar is the Lisle, Illinois-based parent company of International® brand commercial trucks and engines, IC Bus® brand school and commercial buses, all-makes OnCommand® Connection advanced connectivity services, aftermarket parts brands Fleetrite®, ReNEWed® and Diamond Advantage® and Brazilian manufacturer of engines and gensets MWM Motores Diesel e Geradores. With a history of innovation dating back to 1831, Navistar has more than 12,000 employees worldwide and is part of TRATON SE, a global champion of the truck and transport services industry. Reimagining How To Deliver What Matters Visit us at www.Navistar.com to discover more about our organization Navistar is an Equal Opportunity Employer. We evaluate qualified applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran status, and other legally protected characteristics. #ridewithnavistar",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-09-12T04:19:00.000Z"
    },
    "company": {
        "name": "Navistar Inc",
        "link": "https://www.linkedin.com/company/navistar-inc"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 144,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Home",
        "region": "KS",
        "postal_code": "66438",
        "street_address": null,
        "latitude": 39.84155,
        "longitude": -96.5224
    }
}