{
    "job": {
        "title": "Sr. Associate, Cyber Security – Cloud DevOps Engineer",
        "industry": "Management Consulting",
        "description": "Requisition Number: 69156 - 84 Description Known for being a great place to work and build a career, KPMG provides audit, tax and advisory services for organizations in today's most important industries. Our growth is driven by delivering real results for our clients. It's also enabled by our culture, which encourages individual development, embraces an inclusive environment, rewards innovative excellence and supports our communities. With qualities like those, it's no wonder we're consistently ranked among the best companies to work for by Fortune Magazine, Consulting Magazine, Working Mother Magazine, Diversity Inc. and others. If you're as passionate about your future as we are, join our team. KPMG is currently seeking a Sr. Associate, Cyber Security – Cloud DevOps Engineer– to join our Cyber Security Consulting practice Responsibilities Coordinate the design and implementation of Secure DevOps engineering solutions Automate, build, deploy and integrate security tools with application pipelines Design & configure automation of cloud infrastructure (compute, network, storage, security) Build process for operations of the automated pipelines and applications Assist in deploying, configuring, and maintaining security baselines within the Cloud Infrastructure and Application environments Effectively apply relevant knowledge and experience to provide both technical and operational support to new and existing implementation efforts Deliver support to both new design and implementation efforts as well as existing, deployed applications, automations, cloud infrastructures and services Qualifications A minimum of 3 years of experience in application development, security, infrastructure, cloud and related technology platforms Bachelor’s Degree Ability to provide expert strategic advice for cloud application development, cloud application deployment, private versus public cloud options and virtualization Strong understanding of DevOps practices ools including CICD, Pipelines, IaC\\ARM templates Working knowledge with Source Code Management systems like GitHub, Azure DevOps andCI/CD platforms like Jenkins and GitHub Actions Familiarity and experience with Kubernetes and container services in AWS/Azure or GCP; experience with managing Infrastructure as Code (IaC) platforms like Terraform, Ansible and Packer are a plus Experience with security tools for SAST/DAST/RASP like SonarQube, Snyk etc Travel may be up to 80-100%, work in a fast paced, results driven environment, grasp new technology, and contribute at a rapid pace KPMG LLP (the U.S. member firm of KPMG International) offers a comprehensive compensation and benefits package. KPMG is an affirmative action-equal opportunity employer. KPMG complies with all applicable federal, state and local laws regarding recruitment and hiring. All qualified applicants are considered for employment without regard to race, color, religion, age, sex, sexual orientation, gender identity, national origin, disability, protected veteran status, or any other category protected by applicable federal, state or local laws. The attached link contains further information regarding the firm's compliance with federal, state and local recruitment and hiring laws. No phone calls or agencies please.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-20T22:44:52.000Z"
    },
    "company": {
        "name": "KPMG US",
        "link": "https://www.linkedin.com/company/kpmg-us"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Dallas",
        "region": "TX",
        "postal_code": "75342",
        "street_address": null,
        "latitude": 32.777977,
        "longitude": -96.79621
    }
}