{
    "job": {
        "title": "SAP ABAP Software Engineer",
        "industry": "Information Technology and Services,Staffing and Recruiting,Hospital &amp; Health Care",
        "description": "Cerebral Staffing, LLC is seeking a SAP ABAP Software Engineer to work at our direct client John Deere in Moline, IL. SAP ABAP with focus on FICO and Sales & Distribution (SD) Required Skills: 5+ years of experience in developing using core SAP ABAP. This includes using OOP and all SAP enhancement techniques 2+ years of experience in HANA data modeling using Hana Studio. This includes creating and maintaining attribute, analytic and calculation views 2+ years of experience in development using Fiori/UI5 2+ years of experience working with IDocs, Proxies, and Webservices 2+ years of experience in developing in Gateway, and OData technologies 2+ years of functional and technical experience in FICO and SD modules Desired Skills/Experience 1+ years of experience configuring, developing, and/or troubleshooting PI interfaces 1+ years of functional and technical experience the following core SAP modules SD, FICO and MM. 1+ years of experience in cloud development with platforms like AWS, Azure, SAP Cloud Platform 1+ years of experience working with agile software design methodology for development and documentation Cerebral Staffing offers health/vision/dental insurance, Paid Holiday/PTO short-time disability, 401k and paid life insurance Powered by JazzHR jNaIdRZsdV",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-13T07:57:21.000Z"
    },
    "company": {
        "name": "Cerebral Staffing, LLC",
        "link": "https://www.linkedin.com/company/cerebral-staffing-llc"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Moline",
        "region": "IL",
        "postal_code": "61266",
        "street_address": null,
        "latitude": 41.492226,
        "longitude": -90.48927
    }
}