{
    "job": {
        "title": "Software Engineer",
        "industry": "",
        "description": "We are looking for multiple excellent software engineers to join our team. You are a good fit if you love to get hands-on and solve any problem on the way to building our first product, which can include obtaining and cleaning data, training ML models, putting models into production, front-end and back-end development, and more. You have an enthusiastic attitude and you know how to combine scrappiness with discipline and quality. Responsibilities: Create point-in-time data repositories updated in real time or daily Understand the fixed income domain in detail and prepare data using this understanding Train state of the art deep learning models using TensorFlow Productionize models in APIs that are easy to use by our customers Build web interfaces for human consumptios Qualifications: Degree in computer science or a related area Excellent communication and interpersonal skills Significant experience as a professional software engineer Strong interest in capital markets and in joining a startup Preferred: Experience with Python, cloud computing, TensorFlow, and serverless Preferred: Experience building for high availability, low latency, and high throughput Preferred: Degree in finance or similar qualification such as CFA Preferred: Ability to grow rapidly into a manager, and/or into a principal engineer What We Offer: Diverse and inclusive environment committed to equal opportunity Excellent salary, equity, health insurance, 401K, and other benefits Opportunity to work directly with founders who include a top professor of machine learning, a successful serial entrepreneur, and a managing director from a top-ranked investment bank Rapid U.S. visa sponsorship available",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-02T22:08:27.000Z"
    },
    "company": {
        "name": "ficc.ai",
        "link": "https://www.linkedin.com/company/ficc-ai"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Greater Seattle Area",
        "region": null,
        "postal_code": "98109",
        "street_address": null,
        "latitude": 47.591396,
        "longitude": -122.33279
    }
}