{
    "job": {
        "title": "Leon Springs Seafood - Perishables Rep - Part-Time",
        "industry": "Food &amp; Beverages,Food Production,Retail",
        "description": "H-E-B needs energetic and motivated Partners willing to work hard and have fun while making our Customers feel welcome. No matter what background you bring, or where you are in your career, we welcome you to join our community where People come first. As a Perishable Representative, you are responsible for providing a well-stocked and well-maintained department while providing superior customer service. You will prepare, package, and merchandise fresh product on a daily basis, while maintaining all department and food safety / sanitation standards. Once you're eligible, you'll become an Owner in the company, so we're looking for commitment, hard work, and focus on quality and Customer service. 'Partner-owned' means our most important resources--People--drive the innovation, growth, and success that makes H-E-B The Greatest Omnichannel Retailing Company. Do You Have a HEART FOR PEOPLE... commitment to work hard to make sure People come first? HEAD FOR BUSINESS... a strong sense of how what you do affects our Customers and our success? PASSION FOR RESULTS... initiative to step up and do what needs doing? We Are Looking For a high school diploma; customer service and communication skills ability to work in a fast-paced environment What is the work? Customer Service Provides superior customer service Takes orders from customers by telephone or in person Answers customer questions regarding products and assists them with selections Food Service Prepares, packages, and merchandises fresh product Slices, packages, labels, and rotates products Scans in items on Telxon for production Assists in technical areas as needed Sales Merchandises product effectively Uses suggestive selling techniques to meet customer needs and build department sales Makes regular announcements related to freshly-produced items, and to increase sales Food Safety / Sanitation Cleans and sanitizes display cases; properly operates / maintains equipment Complies with H-E-B food safety and sanitation standards Complies with departmental SOPs and store operating procedures Additional Department-Specific Responsibilities Aguas: Peels, cuts, and chops fresh fruits and vegetables Prepares fresh specialty drinks and food products specific to the Aguas department Floral: Designs floral arrangements; provides a variety of fresh, quality products Designs and executes merchandising programs Tracks seasonal record when appropriate Market: Cuts, trims, and prepares meat for service meat counter and self-service counter Ensures proper product rotation and storage Maintains coolers and freezers Weighs, prices, and packages selections Operates power meat prep and process equipment Produce: Stocks and rotates product to ensure freshness Assists floral department when needed Communicates product knowledge to customers by explaining and providing samples Cuts, wraps, and prices produce to be placed on sales floor Maintains signing program Seafood: Knowledgeable about various fish and shellfish Weighs, prices, and packages selections Maintains coolers and freezers What is your background? Minimum age 18 (mandatory) High school diploma (or equivalent) Completion of Company Orientation and Safety Training Do you have what it takes to be a fit as an H-E-B Perishable Representative? Computer systems knowledge (Telxon, ACR, label machine) Strong customer service skills Communication and interpersonal skills Reading and writing skills Planning and organizing skills Can you... Function in a fast-paced, retail environment Work with Customers, staying attentive to their needs Perform the following, based on your Department Market Constantly* reach at waist Frequently stand, walk, pivot, push / pull arms, grasp, cervical flexion Frequently be exposed to wet, cold conditions Occasionally reach overhead, reach at shoulder, reach at knee, reach at floor, bend, stoop, squat, crouch, kneel, stair climb, twist, pinch, perform fine motor movements Occasionally be exposed to hot conditions, ambient temperatures, loud noise Demonstrate the ability to lift 90 lbs, and manage in excess of 90 lbs** Seafood Constantly* reach at waist Frequently stand, walk, pivot, push / pull with arms, grasp Frequently be exposed to wet, cold conditions Occasionally reach overhead, reach at shoulder, knees, and at floor, bend, stoop, squat, crouch, kneel, stair climb, twist, pinch, perform fine motor movements, cervical flexion Occasionally be exposed to hot conditions, ambient temperatures, loud noise Demonstrate the ability to lift 50 lbs, and manage in excess of 50 lbs** While there may be exceptions, the measurements noted are generally defined as--Constantly: 5.5+ hours per 8-hour day; Frequently: 2.5 - 5.5 hours per 8-hour day; Occasionally: 0 - 2.5 hours per 8-hour day It is the responsibility of each individual Partner to never lift beyond his or her own safe lifting limit. If an item is too heavy to lift, push or pull, and / or carry, the Partner must break the box down into lighter, smaller, more manageable components, or ask for assistance from another Partner or a manager. 05-2014 H-E-B Job Title Perishables Rep Shift Variable Hours Schedule Part-time Primary Location US-TX-San Antonio Unposting Date Aug 2, 2021, 11:59:00 PM",
        "employment_type": "PART_TIME",
        "date_posted": "2021-08-03T03:27:24.000Z"
    },
    "company": {
        "name": "H-E-B",
        "link": "https://www.linkedin.com/company/heb"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "San Antonio",
        "region": "TX",
        "postal_code": "78266",
        "street_address": null,
        "latitude": 29.42517,
        "longitude": -98.49461
    }
}