{
    "job": {
        "title": "Software Engineer",
        "industry": "Information Technology and Services",
        "description": "About NetApp NetApp is a Fortune 500 company that believes in the transformative power of data – to expand customer touchpoints, to foster greater innovation, and to optimize operations. We are designed for simplicity, focused on data protection, and open to enriching customer solutions for on premise and/or cloud environments. We’ve built a Data Fabric for a data-driven world – to simplify and integrate data management across the resources that are best for the business. We bring enterprise-grade data services customers rely on into the cloud, and the simple flexibility of cloud into the data center. And we do it with industry-leading solutions that work across diverse environments and the world’s biggest hyper-scale cloud providers. At NetApp, we fully embrace and advance a diverse, inclusive workforce with a culture of belonging that enables our employees to bring their whole selves to do their life’s best work. Who do we look for? Are you a continuous learner who wants to join an empowered team of forward-thinking, smart, dedicated technologists that approaches every problem with fresh eyes? If you answered yes, you may be who NetApp is looking for! We recognize that not everyone fits neatly into any checklist, but below are some of the skills and experience we think will help make you successful in this role. If you don’t match everything on this list, but are excited about the opportunity and think you could contribute, we’d love to hear from you. Job Description Participate in product design, development, verification, troubleshooting, and delivery of a system or major subsystems Collaborate with team members on designing and implementing software with a focus on simplicity, reliability, and manageability using C++ Write unit and automated integration tests Participate in technical discussions within the team and with other groups within the Business Unit Receive guidance and mentoring on assigned tasks from senior engineers, managers, and technical team Participate in virtual and cloud environments Contribute in the area of certificates, encryption, key management or other security related areas. Job Requirements Experience with multiple programming languages is a plus Proficiency in C, C++, and/or Python Experience with Linux/FreeBSD development. Understanding of multi-threaded & multi process environments Familiarity with TCP/IP protocols and networking applications development Possess exceptional written and verbal communication skills Strong aptitude for learning new technologies Ability to work on a diverse team Education and Experience Less than 3 years of software development experience A Bachelor of Science degree in Computer Science or equivalent (December 2021 graduates encouraged to apply) Passion for writing and testing high quality code Broad knowledge of computer science fundamentals Projects, professional experience, or coursework related to operating systems, computer architecture, multi-threading, data structures & algorithms “At NetApp, we fully embrace and advance a diverse, inclusive global workforce with a culture of belonging that leverages the backgrounds and perspectives of all employees, customers, partners, and communities to foster a higher performing organization.” – George Kurian, CEO",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-05T14:38:18.000Z"
    },
    "company": {
        "name": "NetApp",
        "link": "https://www.linkedin.com/company/netapp"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Raleigh",
        "region": "NC",
        "postal_code": "27699",
        "street_address": null,
        "latitude": 35.781303,
        "longitude": -78.64168
    }
}