{
    "job": {
        "title": "Quality Assurance Engineer / Software Developer in Test (SDET) - Karate",
        "industry": "Information Technology and Services,Computer Software,Financial Services",
        "description": "pureIntegration is seeking a Quality Assurance Engineer / Software Developer in Test (SDET) - Karate Core Responsibilities: Automate test cases in Cypress framework Attend daily scrum. Give status everyday about the progress of in progress work and blocker if any Write test cases for feature Work on the automation framework which is based on JavaScript Location: Philadelphia, PA (currently remote but will be onsite in July) Work Authorization : We DO NOT sponsor H1B Visas, nor do we enter into C2C partnerships. EAD, GC, USCIT Only Requirements: Bachelor's Degree in Computer Science, Information Systems, or similar. Or equivalent work experience. 5+ years of overall QA automated testing experience QA API Backend Testing utlizing Karate QA testing JAVA/Javascript and Selenium in Required 5+ years of Windows software QA and testing experience in an agile environment using the scrum framework Experience in Agile, Jira, Confluence, Splunk Experience with API testing Familiarity with media planning and buying workflows and/or software systems Ability to function well within their team, working with POs, BAs, developers, and other team members. Strong organization skills and the ability to work on multiple concurrent projects, with a high standard of quality Excellent analytical and troubleshooting abilities Strong oral and written communication skills The ability to quickly shift priorities and adapt to change At pureIntegration, we believe Digital Transformation is less about tools and platforms and more about developing the people who use them, supported by innovative business strategy and expert integration. By engaging our clients as expert consultants in operational process design, we synthesize and harmonize strategy, process and evolving technologies to catapult the modern enterprise well into the 21st century. In over 15 years of Digital Transformation consulting and professional services, pureIntegration has successfully designed, integrated, and deployed winning solutions at scale which have resulted in measurable performance increases. Most importantly, we have done it while maintaining 97% client satisfaction for the past 15 years. With a rich heritage in Communications, Media and Entertainment, our diverse and expanding portfolio includes Fortune 500 enterprises spanning Utilities, Manufacturing, Insurance, CPG, Healthcare, Logistics and other select verticals. pureIntegration is an Equal Opportunity Employer (EOE), qualified applicants are considered for employment without regard to age, race, color, religion, sex, national origin, sexual orientation, disability, or veteran status.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-06-19T05:34:59.000Z"
    },
    "company": {
        "name": "pureIntegration",
        "link": "https://www.linkedin.com/company/pureintegration"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Philadelphia",
        "region": "PA",
        "postal_code": "08051",
        "street_address": null,
        "latitude": 39.95106,
        "longitude": -75.16562
    }
}