{
    "job": {
        "title": "Site Reliability Engineer",
        "industry": "",
        "description": "Why Coil? Coil makes it easy for creators to monetize content on the web without using ads or collecting user data. All a creator needs to do is embed a special monetization meta tag with their payment details into their website. When a Coil member visits the site, our extension checks for the presence of the monetization meta tag and starts sending a continuous stream of micropayments to the creator. This is based on an open standard called Web Monetization. At Coil, our goal is to bring users to the Web Monetization ecosystem so creators can make money off of their content. We want to give creators a chance to be fairly paid for their content directly by those who consume it, without resorting to pushing ads or selling out to a large content aggregator. Our Ideal Candidate Is excited about Web Monetization Thrives working in fast moving startup environment Desires to be part of a small and creative team As a Site Reliability Engineer you will Design, develop and iterate Chaos Engineering practices, disaster recovery protocol, and run books etc. Debug production issues across all services and levels of the stack. Monitor and proactively address symptoms rather than solely addressing outages. Implement and educate the team on best practices for monitoring, observability, and reliability. Build tooling and automation to reduce toil. Lead improvements to our CI/CD pipeline allowing us to ship code faster with confidence. Work with engineering to improve the developer experience. Mentor and assist team members on how to build reliable, maintainable infrastructure. Collaborate with the team to determine which features to build and how to architect them. Perform code reviews. Be part of the on-call engineering rotation. What you bring to the table 2-3 years of professional working experience. Track record of building and maintaining performant micro service oriented software products. Know how to build resilience and durability into cloud infrastructure. Know the ins and outs of Kubernetes. Knowledgeable about Node.js and are up for working in Typescript. Demonstrated ability to proactively manage tasks, project, and issues. Outstanding all-round communication skills and ability to work collaboratively. Experience leading projects to improve infrastructure and building a team from scratch to support the growth of the organization. Leadership and communication skills. Authorization to work in the U.S. Pluses Extensive experience with major cloud providers (GCP, AWS, Azure). Experience scaling micro services architecture to handle large loads. Experience with Kubernetes, Terraform, Helm, Docker at scale. Background in building payout infrastructure or content platforms. Demonstrated ability to create custom slack emojis. Location Coil has offices in San Francisco and Cape Town and remote employees and contractors in the US and abroad. This full-time role is located in our San Francisco headquarters, but can be done remotely from anywhere in North America provided that your availability includes Coil’s core business hours of 9 am to 3 pm PT. About Coil Coil was founded in 2018 to build a better business model for the Web. Coil makes it easy for publishers and creators to monetize their content across the internet, and provides an alternative to advertising and site-by-site subscription models. As Coil Members enjoy content, Coil uses a proposed open web standard called Web Monetization to stream micropayments to creators in real time. In 2019, Coil, in collaboration with Mozilla and Creative Commons, launched the $100 million Grant for the Web to boost open, fair and inclusive standards and innovation in Web Monetization. Coil also invested $20 million in Imgur, the community-powered entertainment platform reaching 300 million people each month. Benefits - Platinum health coverage with no premiums for employees and 75% of premiums paid for dependents - Dental and Vision insurance with no premiums for employees - 401(k) with matching - Stock option plan - Gym / Fitness Studio benefits - Paid Family Leave - Flexible Vacation Coil is proud to be an equal opportunity employer.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-12T17:50:28.000Z"
    },
    "company": {
        "name": "Coil",
        "link": "https://www.linkedin.com/company/coilhq"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "San Francisco Bay Area",
        "region": null,
        "postal_code": "94112",
        "street_address": null,
        "latitude": 37.39271,
        "longitude": -122.042
    }
}