{
    "job": {
        "title": "Software Development Engineer I",
        "industry": "Financial Services,Information Technology and Services,Internet",
        "description": "Our Purpose We work to connect and power an inclusive, digital economy that benefits everyone, everywhere by making transactions safe, simple, smart and accessible. Using secure data and networks, partnerships and passion, our innovations and solutions help individuals, financial institutions, governments and businesses realize their greatest potential. Our decency quotient, or DQ, drives our culture and everything we do inside and outside of our company. We cultivate a culture of inclusion for all employees that respects their individual strengths, views, and experiences. We believe that our differences enable us to be a better team – one that makes better decisions, drives innovation and delivers better business results. Job Title Software Development Engineer I Overview Be part of the Operations & Technology Fraud Products team developing new capabilities for MasterCard's Decision Management Platform, which serves as the core for multiple business solutions to combat fraud and validate cardholder identity. Our patented Java-based platform processes billions of transactions per month in tens of milliseconds using a multi-tiered, message-oriented approach for high performance and availability. Would you like to develop industry leading solutions for fighting fraud? Are you motivated by speeding business solutions to market? Do you want to innovate, using cutting edge technologies on challenging business problems? Role Work closely with technical leads for assigned projects to assist in design and implementation tasks Responsible for the analysis, design, development and delivery of software solutions Defines requirements for new applications and customizations, adhering to standards, processes and best practices Be an integral part of the Agile SAFe discover and elaboration sessions. Perform requirements and design reviews, peer code reviews and PCI security reviews to ensure compliance with MasterCard standards. All About You Must be high-energy, detail-oriented, proactive and have the ability to function under pressure in an independent environment. Must provide the necessary skills to have a high degree of initiative and self-motivation to drive results. Possesses strong communication skills -- both verbal and written – and strong relationship, collaborative skills and organizational skills. Willingness and ability to learn and take on challenging opportunities and to work as a member of matrix based diverse and geographically distributed project team. Knowledge of software development processes including agile processes and test driven development Responsibilities May manage smaller project/initiatives as an experienced individual contributor with specialized knowledge within assigned discipline Creates documentation such as user guides and software development guides for moderately-complex projects Assists team members in the development of applications, components, system to system interfaces and complete software solutions Significant code development, code review and day-to-day support duties Essential Skills Required At least four year degree in a related field (or certifications and comparable experience) Fundamental Knowledge and Exposure to multiple types of coding Java/JEE Linux, shell scripting Oracle & PL/SQL IDE such as JBoss Developer Studio/IntelliJ Spring Framework (including Spring Boot) Due to COVID-19, most of our employees are working from home. We’ve implemented a virtual hiring process and continue to interview candidates by phone or video and are onboarding new hires remotely. We value the safety of each member of our community because we know we’re all in this together. Mastercard is an inclusive Equal Employment Opportunity employer that considers applicants without regard to gender, gender identity, sexual orientation, race, ethnicity, disabled or veteran status, or any other characteristic protected by law. If you require accommodations or assistance to complete the online application process, please contact reasonable.accommodation@mastercard.com and identify the type of accommodation or assistance you are requesting. Do not include any medical or health information in this email. The Reasonable Accommodations team will respond to your email promptly.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-25T18:25:31.000Z"
    },
    "company": {
        "name": "Mastercard",
        "link": "https://www.linkedin.com/company/mastercard"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 48,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "O'Fallon",
        "region": "MO",
        "postal_code": "63304",
        "street_address": null,
        "latitude": 38.808643,
        "longitude": -90.69996
    }
}