{
    "job": {
        "title": "Senior Front End Software Engineer (Websites &amp; Payments)",
        "industry": "Information Technology and Services,Computer Software,Internet",
        "description": "Sr. Backend Software Engineer (Websites & Payments) PatientPop is a healthcare technology company that helps practices thrive with an all in one practice growth solution. Our platform empowers practices to promote themselves online, attract patients, and retain them for life. We improve every digital touchpoint along the patient journey, so patients can easily find and choose a practice, and become their advocate. We also improve every aspect of a practice’s online presence to help them attract the right patients to their services, and keep them coming back. We've helped thousands of providers since our founding in 2014. Along the way, we cultivated an incredible work environment — one of the best, according to Great Place to Work. Now, we want you to be a part of it all. How you will contribute: This position requires you to contribute to all aspects of development, code review, unit testing, debugging and implementation. You should be comfortable with taking on new engineering challenges. A self-starter with the ability to plan, organize and establish priorities to meet goals and achieve results. Skills you’ll bring: Bachelor’s or Master’s degree in computer science You should be comfortable with taking on new engineering challenges, defining potential solutions, and implementing designs in a team environment Experience in Java, Python or PHP and a passion to learn new languages Experience with JS frameworks on the front end (Vue.js a major plus!) Experience in microservices development, working at scale, and data Knowledge of micro-frontend is a plus Why you're important to us: To win and keep our customer’s love we obsess over our platform. Our products depend on our ability to remain reliable as we grow. We’re looking for someone who shares our passion for engineering and can work with us to produce solutions of the highest quality, delivering clear and simple, cleanly documented code. In 90 days you will: Contribute to the development and support of micro services and automations. You should prepare to have an immediate impact on the organization from day one. You’ll take this far beyond your first 90 days. Expect to constantly be learning, challenging yourself and strategizing with your team on building a world-class engineering practice. PatientPop has one simple mission: help healthcare practices thrive. Our solution is the leading all-in-one practice growth platform that's HIPAA-compliant and helps providers promote their practice online, attract patients, and retain them for life. Learn more at patientpop.com Benefits: Opportunity to create impact Ownership and autonomy Opportunities to host PatientPop talks Paid maternity and paternity leave Remote friendly or relocation assistance provided 100% fully-paid health, dental and vision options Stock options 401 (k) Our HQ is 2 Blocks from the beach, next to the promenade and dog friendly And many more perks! We will consider for employment all qualified Applicants, including those with Criminal Histories, in a manner consistent with the requirements of applicable state and local laws, including the City of Los Angeles’ Fair Chance Initiative for Hiring Ordinance.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-09T17:42:02.000Z"
    },
    "company": {
        "name": "PatientPop Inc.",
        "link": "https://www.linkedin.com/company/patientpop-inc-"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Los Angeles Metropolitan Area",
        "region": null,
        "postal_code": "90021",
        "street_address": null,
        "latitude": 34.073666,
        "longitude": -118.23985
    }
}