{
    "job": {
        "title": "Web Developer and Software Engineer - ASP.NET C#",
        "industry": "Internet",
        "description": "Are you interested in helping to transform the way people communicate? Multimedia Solutions is a cutting-edge digital consulting firm focused on revolutionizing the way our Fortune 2000 clients reach their clients. As a Website Developer and Software Engineer, your responsibilities will include designing, developing, and maintaining software application components using C# (programming language), ASP.NET, AJAX, Model-View Controller (MVC), JQuery, Web Services, XML, XSD, XSLT, etc. If you embrace a close-knit small business environment and want to have a big impact on the firm, our clients, and your career, please read on. Software Developer Benefits Opportunity to work on web development projects for Fortune 2000 companies Opportunity to work on the Multimedia Solutions Digital Experience platform vision Work with the latest programming technologies on websites, mobile computing, content management, and social media Competitive salary with benefits, bonus opportunities, and training. Plus, you get to work with really smart people A culture founded on the principles of excellence, respect, accountability, integrity, enjoyment, and diversity The exciting and ideal work environment of feeling part of a start-up but yet in a company with a solid 28-year reputation Health and Dental Benefits H1 Sponsorship 401K Plan Requirements C# .NET ASP.NET ASP.NET MVC Razor Umbraco CMS or other .NET based CMS exposure JavaScript / AJAX",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-06T14:09:32.000Z"
    },
    "company": {
        "name": "Multimedia Solutions",
        "link": "https://www.linkedin.com/company/multimedia-solutions"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Edgewater",
        "region": "NJ",
        "postal_code": "07020",
        "street_address": null,
        "latitude": 40.828438,
        "longitude": -73.97255
    }
}