{
    "job": {
        "title": "Associate Director/Director, Regulatory Affairs (Oncology) - Remote",
        "industry": "Biotechnology,Hospital &amp; Health Care,Pharmaceuticals",
        "description": "Description Position at Regulatory Professionals Regulatory Professionals, a division of Premier Research, is a consultancy firm specializing in drug, biologics and device regulatory affairs. Our purpose as a company is to support our clients by furthering the development of human therapeutics that will benefit the health and well-being of patients around the world. With a presence in the US, EU, Canada and Australia we are growing and looking for talented people to grow our business, advance the goals of our clients and contribute to our unique culture. Our focus is to provide strategic and tactical support in all aspects of regulatory affairs, including preclinical, CMC and clinical development for drugs, biologics, devices, and combination products. We’re looking to hire a talented and energetic Associate Director, Regulatory Affairs to join our innovative team. As the Associate Director, Regulatory Affairs, you’ll have the opportunity to develop, implement and lead both regional and international strategy for assigned projects with various cross-functional teams. You’ll execute regulatory strategies for earliest possible approvals of the company’s regulatory applications at all stages of development and post approval and address the analysis and evaluation of regulatory procedures and changes to ensure attainment of corporate goals. You’ll provide guidance for, and contribute to, the development of documents for regulatory agencies e.g. Investigational New Drug applications (INDs)/Investigational Medicinal Product Dossiers (IMPDs)/Clinical Trial Applications (CTAs), and New Drug Applications (NDAs)/Biologics License Applications (BLAs)/Marketing Authorization Applications (MAAs), ensuring that they meet current regulatory requirements and industry standards, are high quality, consistent, complete, and approvable on the first review cycle. This position may supervise or manage others within the Regulatory Affairs skill group. You’ll Be Responsible To Develop and execute international and regional strategies and contingencies for assigned projects Provide guidance to and supervise both international and regional regulatory teams on assigned projects Develop and implement creative approaches to ensure regulatory success Provide efficient and effective Regulatory representation across the organization and interact with the Food and Drug Administration (FDA), European Medicines Agency (EMA) and other regulatory agencies Lead the preparation of submissions, which may include INDs, briefing documents, orphan drug applications, breakthrough designations, and support NDAs/BLAs/MAAs Coordinate with cross-functional teams to define contributions to submissions Think ‘analytically and strategically’ and convey complex concepts in an understandable manner On assigned projects, lead regulatory for submission teams Interface with international affiliates on regional regulatory strategy and implementation plans Maintain knowledge of global competitive landscape, regulatory environment, regulations and guidelines Conduct business development efforts Contribute to the development and maintenance the Regulatory Affairs working practices and procedures Effectively communicate comments/recommendations and proactively engage program teams to establish solutions to issues Provide coaching, mentoring and knowledge sharing within the Regulatory Affairs skill group Review and approve timesheets and expense reports and guide the performance of assigned staff You’ll Need This To Be Considered Bachelor’s degree, or international equivalent from an accredited institution, in a science or health related field; PhD preferred 10+ years of experience in the CRO, pharmaceutical, biotechnology or device/diagnostics industry; an advanced degree will be considered in lieu of a portion of industry experience 7-9 years progressive regulatory affairs experience in a CRO, pharmaceutical,device/diagnostics or biotechnology company with 5-6 years supervisory/management experience Demonstrated experience interacting with the Food and Drug Administration (FDA) required, experience with other regulatory agencies preferred Demonstrated experience in the establishment of INDs and supporting approvals of NDAs/BLAs/MAAs Results driven and team-oriented, with the ability to influence outcomes as necessary Able to innovate, analyze, and solve problems with minimal supervision Exceptionally keen attention to detail Demonstrated ability to manage a staff to achieve company and client goal Ability to communicate and interact effectively within department, across departments and on project team Travel may be required up to 25% Oncology experience required",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-25T17:28:08.000Z"
    },
    "company": {
        "name": "Premier Research",
        "link": "https://www.linkedin.com/company/premier-research"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 120,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "United States",
        "region": null,
        "postal_code": "99999",
        "street_address": null,
        "latitude": 39.50355,
        "longitude": -99.0183
    }
}