{
    "job": {
        "title": "Software Engineer (Entry Level)",
        "industry": "Human Resources",
        "description": "Entry Level Software Developer ( Java Developer,.Net developer, DevOps Engineer, QA Analysts, Python Developer, Salesforce Developer, Front end developer, full-stack developer) Location : (Anywhere in USA East coast, Central and pacific Regions) Experience :  Training Experience - 1year Job type : Full time and Corp to crop Visa : valid ead/opt Job Description : We are looking for Entry level - mid level Software Developers. we have few positions across US with our clients and We can help you inputting on the project . Basic experience as a Software Developer with 5 months and 1 year Basic knowledge on your technology is required. we will assist you with training recordings and materials to recover the skills., résumé preparation, technical support, interview based session, project base training and on job support. About TEKtalent Inc . TEKtalent Inc. is one of the leading staffing companies, providing quality staffing solutions. Our team aims to provide you with the highest quality staffing services for both our clients and our employees. TEKtalent has proved to be reliable in the provision of employment to those who are actively looking for work. We have over 10 years of experience in the staffing industry and have successfully provided career opportunities and new ventures, permanent/temporary employment to many.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-16T14:03:52.000Z"
    },
    "company": {
        "name": "TEKtalent Inc",
        "link": "https://www.linkedin.com/company/tektalent-staffing"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 120,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "California",
        "region": "United States",
        "postal_code": "93266",
        "street_address": null,
        "latitude": 37.254673,
        "longitude": -119.61728
    }
}