{
    "job": {
        "title": "Research Scientist I – Cancer Immunology / Pharmacology",
        "industry": "Research,Biotechnology,Hospital &amp; Health Care",
        "description": "Job Description Research Scientist I – Cancer Immunology / Pharmacology Broad Institute’s Center for the Development of Therapeutics Embedded within the Broad Institute, the Center for the Development of Therapeutics (CDoT) is a highly collaborative organization of professional drug discovery scientists. Our mission is to translate cutting edge biological insights originating from the Broad community into impactful drug discovery projects. We partner with faculty from MIT, Harvard, and the Harvard teaching hospitals together with industry partners in pharmaceutical, biotechnology and Venture Capital firms to validate druggable targets and identify lead compounds. We combine our deep expertise in drug discovery with the knowledge and unique capabilities of the Broad Institute to address a wide range of disease areas (including oncology, cardiovascular, psychiatry, infectious and rare diseases). We use systematic approaches in genomics, biology, chemistry, and machine learning coupled with the Broad's culture of creativity, risk taking, and open sharing, to successfully advance science, develop new treatments, and positively impact patients. Job Description We are currently seeking a dynamic cancer immunologist to join the CDoT Translational Pharmacology team. In this role, you will bring your knowledge of cancer immunology along with cell-based and in vivo assay development to tackle new drug discovery challenges. Working within multi-disciplinary teams of academic and industrial scientists including biochemists, structural biologists, medicinal chemists, in vivo pharmacologists and academic cancer immunology experts, you will drive the development and execution of cell-based and in vivo assays to empower the discovery and development of novel immune-oncology therapies. Within the CDoT Translational Pharmacology team, you will play a key role in driving forward therapeutics projects within an exciting portfolio of novel immune-oncology targets. You will serve as a core therapeutics project team member, leading and executing development of cell-based and in vivo immune-oncology assays directly, while working with colleagues to implement these assays at scale and support screening activities to drive therapeutics programs. This role will afford the opportunity to apply your deep knowledge of cancer immunology and technical expertise in cell and molecular immunology to the development of novel therapies in collaboration with a dynamic set of academic and biopharmaceutical partners. Responsibilities Lead development of cell-based and in vivo assays to support development of new immune-oncology therapies Execute experiments, interpret and validate results, and communicate findings to internal project teams, external collaborators, and strategic leadership teams Serve as a resource for collaborating scientists working within a portfolio of cancer immunology therapeutics projects Skills & Abilities Deep knowledge of cell and molecular immunology, particularly cancer immunology Strong experimental background developing immune cell-based and in vivo assays Highly adaptable and responsive to technical and collaborative project needs; comfortable delivering against challenging commitments Outstanding verbal and written communication abilities; capable of conveying technical and strategic information in a clear and concise manner Confident, goal oriented, and highly collaborative; ability to adapt to and effectively manage change in fast paced and dynamic environments Previous industry experience with understanding of the drug discovery process from hit identification through late pre-clinical discovery is a plus A sense of urgency to find new medicines to benefit patients. Education & Experience PhD or equivalent in immunology, immune-oncology or a related field 2+ post-PhD years of relevant laboratory experience, in academic, pharmaceutical or biotechnology settings. Demonstrated ability in working in multi-disciplinary project teams in a fast-paced, matrixed environments. The Broad Institute will not offer visa sponsorship for this opportunity. All Broad employees, regardless of work location, must be fully vaccinated for COVID-19 byTuesday, October 12, 2021. Requests for exemption for medical or sincerely held religious beliefs will be considered. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or protected veteran status . Equal Opportunity Employer Minorities/Women/Protected Veterans/Disabled All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or protected veteran status. EEO is The Law - click here for more information Equal Opportunity Employer Minorities/Women/Protected Veterans/Disabled Check out this video for a look into our community!",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-09-08T03:05:20.000Z"
    },
    "company": {
        "name": "Broad Institute of MIT and Harvard",
        "link": "https://www.linkedin.com/company/broad-institute_2"
    },
    "education": {
        "required_credential": null
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Cambridge",
        "region": "MA",
        "postal_code": "02239",
        "street_address": null,
        "latitude": 42.36525,
        "longitude": -71.10502
    }
}