{
    "job": {
        "title": "Site Reliability Engineer",
        "industry": "Information Technology and Services,Computer Software",
        "description": "Our client is a large hedge fund that prides themselves as being innovative and offering an environment that breeds uniqueness. Our client is looking to identify a Site Reliability Engineer to live in between systems operations and development by being on the front line in ensuring that the firm’s technology works. What You Will Get: -Competitive compensation package -Unique work culture -Diverse team environment What You Will Do as a Site Reliability Engineer: -Design and develop software and reliability into architecture -Create automated tests, deploy and validate services -Improve service reliability through DevOps capabilities -Gather and analyze metrics from systems and applications What You Will Need as a Site Reliability Engineer: -BS degree in Computer Science or related field preferred -3+ year(s) working with cloud providers like AWS, Azure and Google Cloud Platform -Experience with Ansible, Terraform, Chef, RunDeck and other similar technologies -Knowledge of systems and platforms such as Unix/Linux Our client is not offering relocation packages. Our client is unable to transfer or sponsor visas at this time.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-19T00:58:44.000Z"
    },
    "company": {
        "name": "RightClick",
        "link": "https://www.linkedin.com/company/rightclick"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "New York",
        "region": "United States",
        "postal_code": "13856",
        "street_address": null,
        "latitude": 42.93923,
        "longitude": -75.62005
    }
}