{
    "job": {
        "title": "Software Engineer",
        "industry": "",
        "description": "SUMMARY: Research, design, and develop computer software systems compliant with systems-level interface, operational, and performance requirements. Analyze systems and software requirements and elaborate them into designs within the constraints of fidelity, quality, cost, and schedule. Develop and test software for these designs. ESSENTIAL DUTIES AND RESPONSIBILITIES: • Analyze computer processing requirements. Specify and recommend the purchase of computational systems which provide the computational capabilities required. • Review program specifications and computational system specifications and consults project, systems, and hardware engineers to identify and evaluate interface requirements between the hardware and software. Define top-level interface requirements within the software consistent with system interfaces. • Analyze operational and performance requirements of the overall system and define candidate top-level systems and software design approaches consistent with these requirements. These analyses include consideration of hardware computational capabilities, system latencies, spare time requirements, etc. • Perform value engineering trade studies of candidate top-level design solutions to determine the optimum solution given fidelity, quality, schedule, and cost constraints. • Develop detailed systems and software designs via analyses, elaboration and decomposition of top-level interface, operational, and performance requirements. Develop software computer code compliant with detailed design requirements. • Perform integration test, acceptance test, and delivery of software embedded products. • Identify and manage risks to eliminate unplanned problems and minimize costs. • Develop proposal inputs, technical reports, design specifications, test specifications, and test procedures as required for assigned programs. • Perform other related tasks as assigned by supervisor. EDUCATION and/or EXPERIENCE: Bachelors Degree (B.S.) in engineering, physics, or equivalent; up to 6 years related experience and/or training; or equivalent combination of education and experience. Background must demonstrate a thorough knowledge of the sciences underlying software engineering. COMPUTER SKILLS: Bachelor’s degree in Computer Engineering, Computer Science, or Electrical Engineering (with a Software emphasis) 2-5 years and another position requiring  5+ years experience programming in C++ Recent experience with Linux OS Experience with systems engineering processes, including requirements analysis, system architecture definition, and design, and system verification testing Relocation to Tulsa, Oklahoma. CITIZENSHIP: U.S. Citizenship. Must be able to obtain a Secret Level Clearance",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-20T17:39:21.000Z"
    },
    "company": {
        "name": "STS Federal",
        "link": "https://www.linkedin.com/company/stsfederal"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 72,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Tulsa",
        "region": "OK",
        "postal_code": "74116",
        "street_address": null,
        "latitude": 36.155327,
        "longitude": -95.99208
    }
}