{
    "job": {
        "title": "Software Engineer - Graduate",
        "industry": "Information Technology and Services,Computer Software,Telecommunications",
        "description": "Job ID: 109877 Required Travel : No Travel Managerial - No Location: : USA- Plano (Amdocs Site) Who are we? At Amdocs, our purpose is to enrich lives and progress society. With our creativity and technology, we help make a better connected world. Amdocs and its 25,000 employees serve the top tier players in the communications and media industry, enabling next-generation experiences in 85 countries. Our cloud-native, open and dynamic portfolio of digital solutions, platforms and services brings greater choice, faster time to market and flexibility, to better meet the evolving needs of our customers as they drive growth, transform and take their business to the cloud. Listed on the NASDAQ Global Select Market, Amdocs had revenue of $4.1 billion in fiscal 2019. For more information, visit Amdocs at http://www.amdocs.com In one sentence Responsible for design, develop, modify, debug and/or maintain software systems, in addition to being responsible for one or more specific modules within a large software system scope What will your job look like? You will design, develop, modify, debug and/or maintain software code according to functional, non-functional and technical design specifications. You will follow Amdocs software engineering standards, applicable software development methodology and release processes, to ensure code is maintainable, scalable, and supportable, and demo the software products to stakeholders. You will investigate issues by reviewing/debugging code, provide fixes and workarounds, and review changes for operability to maintain existing software solutions. You will work within a team, collaborate and add value through participation in peer code reviews, provide comments and suggestions, and work with cross functional teams to achieve goals. You will assume technical accountability for your specific work products within an application and provide technical support during solution design for new requirements. You will be encouraged to actively look for innovation, continuous improvement, and efficiency in all assigned tasks. All you need is... Bachelor's degree in Science/IT/Computing or equivalent Experience in writing software code in Java and/or C/C++ programming language Knowledge of SQL Good knowledge in Object Oriented Design and development Experience with IDE Candidates who stand out from the crowd… Experience with Spring framework and Spring Boot development Experience with Unix/Linux as application runtime Unix/Linux scripting knowledge [KSH, BASH, AWK] JEE development experience Why You Will Love This Job You will be challenged with design and develop new software applications This is an opportunity to work in a growing organization, with ever expanding opportunities for personal growth! You will have the opportunity to work with the industry most advanced technologies We offer a wide range of stellar benefits including health, dental, vision, and life insurance as well as paid time off, sick time, and parental leave! Amdocs is an equal opportunity employer. We welcome applicants from all backgrounds and are committed to fostering a diverse and inclusive workforce",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-08T23:11:13.000Z"
    },
    "company": {
        "name": "Amdocs",
        "link": "https://www.linkedin.com/company/amdocs"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Plano",
        "region": "TX",
        "postal_code": "75093",
        "street_address": null,
        "latitude": 33.019695,
        "longitude": -96.697586
    }
}