{
    "job": {
        "title": "Junior Data Scientist",
        "industry": "Information Technology and Services,Computer Software,Hospital &amp; Health Care",
        "description": "Medalogix is a one-of-a-kind data analytics company in the post-acute care space. We are transforming home health and hospice agencies by leveraging cutting-edge data science, machine learning, and innovative cloud technology to equip clinicians and agencies to provide the right care at the right time. The Company's five machine learning products have demonstrated improved patient outcomes and reduced cost to the healthcare system, including reduced hospitalization, appropriate and timely transitions to end-of-life care, and optimized visit utilization for patients. Medalogix is poised for tremendous growth, as skilled home health and hospice care are positioned as the lowest cost providers in an industry shifting to value-based care. Medalogix is currently seeking a hungry, humble, and smart Junior Data Scientist to join our technology innovators that are bringing home health and hospice to the next level. Why Medalogix? High growth & awesome culture – Medalogix has grown 100%+ for three straight years, with continued material growth planned over the next three years.  This success is achieved through passionate, high-functioning talent focused on success.  We work hard through our core virtues Be Badass, Dream Big/Act Small, Do No Harm, and Row Together. Meaningful work – Our products are used by healthcare providers in their day-to-day care programs.  Our company’s work directly impacts patient care in the home. Modern technology products – At the core Medalogix is a technology company. We build modern, cloud-based SaaS software underpinned by data science and data engineering. Our technology team is passionate about using leading tools and practices in our daily work. We build market-leading products that delight our customers. Medalogix products have received recognition from The Boston Globe, Fierce Healthcare, Becker's Hospital Review, HIMSS, and Harvard Business Review. Competitive compensation & benefits – Medalogix provides big company benefits in a smaller company environment. We provide competitive compensation along with awesome benefits including 401(k) matching. Role Overview Reporting to the VP of Data Science, the Junior Data Scientist will assist in the development of our next-generation, machine learning models. This team member will also develop and expand the current model monitoring capabilities for the team and elevate our documentation practices. A great candidate will bring passion and discipline for building scalable and explainable solutions focused on the customer. A successful candidate will bring significant value and have a meaningful impact on our success. The development of our new solutions will generate material and incremental revenue for the company. They will transform the company’s ability to solve meaningful health care problems through innovative and cutting-edge data science development. Requirements Develop interactive or static data visualizations/dashboards using BI tools such as Tableau, PowerBI, or SiSense to track model performance. Develop and maintain up-to-date documentation for analyses and models developed by the Data Science team. Generate and manage monitoring tools to measure model efficacy and model drift. Support the development of predictive models and other analytics solutions. What would make you a strong fit for this role Undergraduate degree from an accredited college/university in Computer Science, Statistics, Mathematics, Engineering, Bioinformatics, Physics, or related fields. Demonstrated experience with a coding language such as C, C++, C#, Java, Python, or similar. Ability to understand data models and work with relational databases structures and SQL. Demonstrated analytical and creative problem-solving abilities. General curiosity and desire to learn machine learning processes and techniques and related conceptual materials.Willingness to work in a highly collaborative, team-based culture Benefits Highly sponsored Health insurance with HSA and FSA option Optional Dental and Vision insurance 401(k) company match Education Assistance Program/Employee Assistance Program We celebrate our wins with team events/outings Generous Paid Time Off + Eight Paid Holidays Free downtown parking Discounted in-building gym",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-21T03:36:50.000Z"
    },
    "company": {
        "name": "Medalogix",
        "link": "https://www.linkedin.com/company/medalogix"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Nashville",
        "region": "TN",
        "postal_code": "37221",
        "street_address": null,
        "latitude": 36.166344,
        "longitude": -86.77907
    }
}