{
    "job": {
        "title": "Data Engineer (Machine Learning)",
        "industry": "Information Technology and Services,Computer Software,Internet",
        "description": "Life at MX We are driven by our moral imperative to advance mankind - and it all starts with our people, product and purpose. We always carry a deep sense of drive and passion with us. If you thrive in a challenging work environment, surrounded by incredible team members who will help you grow, MX is the right place for you. Come build with us and be part of an award-winning company that’s helping create meaningful and lasting change in the financial industry. MX is on a mission to improve the financial lives of everyone. We believe each of us has a moral imperative to use our time and talents to change the world for the better. For this reason, we are creating innovative software and partnering with financial institutions and digital banking providers to bring financial freedom to the lives of individuals, families, and communities. MX is an award-winning financial management, online/mobile banking and innovative wealth management tools. We’re looking for smart, creative individuals to come build with us! We are looking for a Data Engineer (Machine Learning) with a mindset of accuracy and practical application, working alongside Data Scientists, to build the infrastructure required to take us into a new level of “finances as they should be.” MX continues to expand its data science and engineering capabilities providing our clients and their customers with deeper information about their financial state. What you’ll get to do… Evaluate data pipeline and machine learning pipeline technologies Implement platforms that will simplify and improve the work of data analysts and scientists Build tools to allow Data Scientists to own machine learning models for the entire life cycle Be a bridge between Data Scientists and Engineers while effectively communicating business needs You’ll do it using your… Fundamental understanding of various machine learning techniques Foundational knowledge in Event Source design and Stream Processing architecture Foundational knowledge in MLOps Experience in deploying machine learning models to production 3 years of professional Python or R experience 3 years of professional SQL experience Strong mathematical background including Statistics Experience working with non-relational data Experience (not required) with MLFlow, Ruby/Rails, Postgres, Large data structures (Vertica, Clickhouse, Redshift, ElasticSearch, Hadoop or similar). Kafka , Rabbit, Prefect, Airflow, Celery and Luig You’ll fit in by… Thinking like an owner Balancing independent problem solving with collaboration Not being afraid to make mistakes and learn from them Communicating with honesty, candor, and respect Being bold and resourceful Being a passionate and empathetic team member You’ll love it because… You will build and share products that are making a difference in the lives of others You will collaborate with other brilliant minds You will be rewarded and recognized for your high-caliber work You will enjoy autonomy You will build products that outshine all of our competitors You will be working with established design standards and libraries You will work with a deeply technical engineering team Videos to Watch MX Effect Why MX Mission and Vision",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-02T22:37:39.000Z"
    },
    "company": {
        "name": "MX",
        "link": "https://www.linkedin.com/company/mxenabled"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "United States",
        "region": null,
        "postal_code": "99999",
        "street_address": null,
        "latitude": 39.50355,
        "longitude": -99.0183
    }
}