{
    "job": {
        "title": "Machine Learning Engineer",
        "industry": "Information Technology and Services,Computer Software,Financial Services",
        "description": "We are a top rated think tank focused within machine learning, signal processing, wireless communications and robotics. We work on both private and government contracts with a team of 40% PhD researchers and supporting industry leading engineers to develop the latest technologies and solutions. We are currently looking for a Machine Learning Expert to focus on AI, NLP, Deep Learning and Imaging Processing. This will be a research heavy position with proposal writing and publications a regular component of the role. Existing research / publication experience and a MS or PHD is preferred. Top Reasons to Work with Us Top Benefits Guaranteed Bonus and Promotion Structure Collaborative PhD level teams What You Need for this Position Machine Learning Research Deep Learning NLP Image Processing Proposal Writing So, if you are a Machine Learning Engineer with NLP Experience, please apply today! Email Your Resume In Word To Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also: Katherine.Tempel@Optello.com Please do NOT change the email subject line in any way. You must keep the JobID: linkedin : KT4-1640492 -- in the email subject line for your application to be considered.*** Katherine Tempel - Associate Manager - Optello Applicants must be authorized to work in the U.S. Optello is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-07T14:47:31.000Z"
    },
    "company": {
        "name": "Optello",
        "link": "https://www.linkedin.com/company/optello-us"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Rockville",
        "region": "MD",
        "postal_code": "20850",
        "street_address": null,
        "latitude": 39.08418,
        "longitude": -77.1529
    }
}