{
    "job": {
        "title": "Data Scientist",
        "industry": "Biotechnology",
        "description": "Satellite Biosciences is pioneering the development and implementation of proprietary, off-the-shelf, implantable satellite organs as living therapeutic solutions that can transform the lives of millions of patients who suffer from serious diseases.  Building on 25 years of work in award-winning labs at top academic institutions, the platform is supported by a strong IP portfolio and is backed by a top tier syndicate, led by Polaris Partners. We are seeking an experienced, creative, and motivated Data Scientist to join our rapidly growing team. In this role you will contribute to the company’s platform technology of engineered satellite organs. Specifically, you will contribute towards our efforts to characterize and optimize the satellite organs using data driven approaches and modeling techniques such as unsupervised and supervised machine learning. This role is a unique opportunity to join an early-stage, well-funded Biotech startup. You will report directly to our Senior Data Scientist. The position is full time and offers flexibility for working remotely. Responsibilities: Wrangle data of multi-omic datasets and images in preparation for algorithm development and machine learning Evaluate open access databases of sequencing results for disease modeling Develop 2D and 3D image analysis algorithms Parse sequencing results and use unsupervised, semi-supervised, and machine learning techniques for outcomes prediction Analyze peptide and nucleic acid sequence data sets Manage cloud relational databases of analysis outputs (e.g., PostgreSQL) Construct and optimize code for machine learning algorithms Assist in using convolutional neural networks with and without transfer learning techniques to develop prediction algorithms. Support running statistical hypothesis tests and generate power curves. Required Qualifications & Experience: BS, MS, or PhD in a quantitative discipline 0 to 5 years of experience in the biotechnology industry Proficiency with Python or Julia Competency with data wrangling from imaging and tabular data (e.g., pandas) Experience with machine learning and at least one deep learning library (e.g., Tensorflow, PyTorch, MXNet, Flux) a plus. Understanding of statistical hypothesis testing with multi-factor and multi-level datasets a plus. Experience with at least one of the following: Imaging analysis and algorithm development RNA-Seq datasets and analysis Machine learning and convolutional neural networks Histology images Experience preferred but not required: Linux and Git AWS or other cloud computing platforms Possesses documentation skills and attention to detail. Excellent communication, presentation, collaboration, time-management, and organizational skills are required. The successful candidate will be an ambitious self-starter, have a strong work ethic, be able to generate high quality work under tight deadlines, and enjoy working in a fast-paced team environment.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-20T18:46:12.000Z"
    },
    "company": {
        "name": "Satellite Bio",
        "link": "https://www.linkedin.com/company/satellite-bio"
    },
    "education": {
        "required_credential": null
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Cambridge",
        "region": "MA",
        "postal_code": "02239",
        "street_address": null,
        "latitude": 42.36525,
        "longitude": -71.10502
    }
}