{
    "job": {
        "title": "Machine Learning Engineer",
        "industry": "Hospital &amp; Health Care",
        "description": "AI – Machine Learning Engineer New York, New York $150,000 - $160,000 You will be working with a rapidly growing, financially stable health-tech start-up. They are leaders in their industry and are at an exciting point in their growth, with data science at the heart of everything they do. They have high funding and over 5 million patients. They are looking for an experienced Data Scientist who has a strong background in Bayesian statistics and machine learning. THE ROLE As the Senior Data Scientist, you will be required to: Work with a variety of healthcare data, including healthcare provider profile data, longitudinal claims data, to quantify the relationship between healthcare quality and patient outcomes, costs, and care patterns. Apply techniques to assess clinical questions, including the implementation of interpretable machine learning methods Innovate, extend, and confirm models and methods for causal analysis and outcome prediction. Collaborate with data science team members and other colleagues on data analysis and research projects. Share the results of analysis and research projects to stakeholders. Prepare and contribute material for academic publication and present in scientific conferences. YOUR SKILLS AND EXPERIENCE The successful Senior Data Scientist will have the following skills and experience: Ph.D. or M.S. in statistics, biostatistics, healthcare economics, applied math, epidemiology, computer science, or a related field. Experience with random forests, ensemble techniques, supervised and unsupervised learning Exposure to causal inference methods such as propensity score matching, and weighting is a plus. Experience with Python and/or R. Experience developing code that is leveraged by a wider team and/or contributing to a collaborative code base. Strong communicator with excellent ability to work in a team environment. Experience working with real-world medical data or claims data. Excited to learn new techniques and work at the intersection of machine learning and causal inference. KEYWORDS NLP | Engineering | Natural Language Processing | Machine Learning | Deep Learning | Data Science | Healthcare | Software Engineering | Natural Language Understanding | Natural Language Generation",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-18T21:45:02.000Z"
    },
    "company": {
        "name": "Harnham",
        "link": "https://uk.linkedin.com/company/harnham"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "New York City Metropolitan Area",
        "region": null,
        "postal_code": "10021",
        "street_address": null,
        "latitude": 40.748295,
        "longitude": -73.98556
    }
}