{
    "job": {
        "title": "100% REMOTE - Lead Data Science Engineer",
        "industry": "Computer Software",
        "description": "If you are a 100% REMOTE - Lead Data Science Engineer with experience, please read on! Job Title: 100% REMOTE - Lead Data Science Engineer Job Location: WORK FROM HOME Salary: $180,000-$230,000 Requirements: Ph.D, Data Science, Python, SQL, Tableau, R, Matlab, AI technology, imaging Top Reasons to Work with Us Founded by some of the same people behind companies like AngelList, Vengo & WeWork, we are an exciting and rapidly expanding Machine Vision/ AI tech company based in San Francisco but HIRE REMOTE. Our founders are nothing shy of extraordinary! Our CEO sold his first company to a 200+ person Robotics company that made $45M in their first year. Our CTO has a Ph.D. from MIT. The Chief Science Officer has his Ph.D. from MIT and sold his company to Twitter as one of their largest acquisitions to date. We are working on patent-pending video processing algorithms for use by builders to automate their photo capturing system. What You Will Be Doing Support Product and Marketing operations user growth specifically Work with data utilizing SQL, python, visualization tools (tableau) Utilize statistical analysis R, Matlab, etc. Analyze customer behavior, segmentation, metrics analysis, market funnel analysis, feature adoption and usage, etc. Communicate with cross functional teams What You Need for this Position MS or Ph.D. in computer science or another related field At least five years of professional experience with Data Science Expert with Python, SQL, and visualization tools (Tableau) Expert communication skills Knowledge of business models What's In It for You Competitive Compensation Equity Remote or base in San Francisco Flexible PTO Medical, Dental, Vision Bonus & 401k Plan Grow within our company! So, if you are a 100% REMOTE - Lead Data Science Engineer with experience, please apply today! Email Your Resume In Word To Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also: Parker.Graham@CyberCoders.com Please do NOT change the email subject line in any way. You must keep the JobID: linkedin : PG2-1639541 -- in the email subject line for your application to be considered.*** Parker Graham - Lead Recruiter - CyberCoders Applicants must be authorized to work in the U.S. CyberCoders, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-31T07:11:19.000Z"
    },
    "company": {
        "name": "CyberCoders",
        "link": "https://www.linkedin.com/company/cybercoders"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "San Francisco",
        "region": "CA",
        "postal_code": "94121",
        "street_address": null,
        "latitude": 37.78008,
        "longitude": -122.42016
    }
}