{
    "job": {
        "title": "Firmware Engineer - Embedded C, Cloud, Wearables, IoT",
        "industry": "Construction,Information Technology and Services,Financial Services",
        "description": "If you are a Firmware Engineer with experience, please read on! With locations around the world, we are a fast-growing developer and manufacturer of medical devices. We are seeking an experienced Firmware Engineer with C programming skills who ideally has worked with embedded systems/firmware for wearable devices collecting real-time data. As a Senior Engineer, you'll be responsible for product ownership and have a great deal of say and autonomy with system architecture including design, development, and implementation. Employee development, career growth, and employee autonomy are all important aspects of our company culture. Your input is valuable, encouraged and celebrated. If this is you, please apply today! Top Reasons to Work with Us Firm dedicated to employee development and growth! Opportunity to develop products that save lives! Competitive base salary, benefits and excellent company culture! What You Will Be Doing Developing embedded systems/firmware for medical devices measuring real-time data Working with embedded systems that integrate with cloud infrastructure Design, develop, and implement prototype systems for R&D C/C++ algorithm development (signal processing, encryption, compression) Maintain firmware libraries for hardware What You Need for this Position 5+ years of embedded systems/firmware development experience using C programming Recent product development experience for embedded systems that integrate with cloud infrastructure for real-time data collection/transfer (IoT) C++ development ARM Processors Signal Processing Communication Protocols (USB, I2C, SPI) Custom driver development and implementation (sensors, actuators, ASICs, DACs, etc.) Self-starter with a passion for product development and ownership Bachelor's Degree in Computer Science, Electrical Engineering or relevant experience What's In It for You Benefits For your hard work and dedication, you will be rewarded with a competitive base salary, benefits and work environment including but not limited to Medical Dental Vision 401(k) Vacation Partial work from home So, if you are a Firmware Engineer with experience, please apply today! Email Your Resume In Word To Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also: Pat.Befort@CyberCoders.com Please do NOT change the email subject line in any way. You must keep the JobID: linkedin : PB2-1645018 -- in the email subject line for your application to be considered.*** Pat Befort - Recruiting Manager - CyberCoders Applicants must be authorized to work in the U.S. CyberCoders, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-25T17:39:53.000Z"
    },
    "company": {
        "name": "CyberCoders",
        "link": "https://www.linkedin.com/company/cybercoders"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Redwood City",
        "region": "CA",
        "postal_code": "94064",
        "street_address": null,
        "latitude": 37.4805,
        "longitude": -122.21528
    }
}