{
    "job": {
        "title": "Software Engineer I",
        "industry": "Information Technology and Services,Computer Software,Logistics and Supply Chain",
        "description": "Join a team recognized for leadership, innovation and diversity The future is what you make it. When you join Honeywell, you become a member of our global team of thinkers, innovators, dreamers and doers who make the things that make the future. That means changing the way we fly, fueling jets in an eco-friendly way, keeping buildings smart and safe and even making it possible to breathe on Mars. Working at Honeywell isn’t just about developing cool things. That’s why all of our employees enjoy access to dynamic career opportunities across different fields and industries. Are you ready to help us make the future? Honeywell Intelligrated is a leading North American-based, single-source provider of intelligent automated material handling solutions that drive fulfillment productivity for retailers, manufacturers and logistics providers around the world. Through a broad portfolio of automation equipment, software, service and support, Intelligrated solutions give businesses a competitive edge and optimize operational performance through increased flexibility, efficiency and accuracy. Honeywell Intelligrated is seeking a Software Engineer to join our growing team based out of the West Chester OH office. A Software Engineer at Honeywell Intelligrated is passionate about automated control systems, a self-motivated professional, and strives to be at the leading edge of control system technology. Honeywell Intelligrated Software Engineer will work with experienced software engineers to learn, understand and implement complex automated control systems. You will be part of a group of highly committed professionals who provide expertise and ensure the success of engineering projects Key Responsibilities Work with experienced software engineers to conceptualize, design, engineer, and execute industry leading projects from start to finish. Develop complete and concise system Description of Operation (DOO), test plans and user guides. Interface with industry leading customers. Integrate cutting edge bar code reading technology to track and sort cases. Deliver successful material handling solutions to the customer by developing and implementing detailed commissioning plans. Attends all project related turnover meetings, functional design reviews and team meetings. Understands scope, budgets, and schedules for the project. Maintains and tracks issues list, reporting to Supervisor / Manager as required. Completes all in-house testing and emulation. Provides site/field reports daily, including progress, issues, and next steps, as requested. Ability to travel up to 40%, work nights and/or weekends YOU MUST HAVE Bachelor’s degree in Engineering or Computer Science Basic knowledge of object oriented languages (C++, C#, & Java) and ‘C’ WE VALUE Automation programming experience Ability to code in multiple languages Basic Fieldbus knowledge (Profibus, EthernetIP, ControlNet etc.) SQL experience Ability to influence cross-functional teams to deliver optimal solutions Clearly and concisely convey subtle or complex messages to a non-technical audience Capability to follow guidelines and ensure efficiency on given project tasks Excellent computer literacy Ability to focus on essential information and identify key details Ability to quickly analyze, incorporate and apply latest information and concepts Individuals who are self-motivated and able to work without supervision #CB #INDEED Additional Information JOB ID: HRD136098 Category: Engineering Location: 7901 Innovation Way,Mason,Ohio,45040,United States Exempt Customer Experience (GLOBAL) Honeywell is an equal opportunity employer. Qualified applicants will be considered without regard to age, race, creed, color, national origin, ancestry, marital status, affectional or sexual orientation, gender identity or expression, disability, nationality, sex, or veteran status.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-09-22T07:16:02.000Z"
    },
    "company": {
        "name": "Honeywell",
        "link": "https://www.linkedin.com/company/honeywell"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Mason",
        "region": "OH",
        "postal_code": "45040",
        "street_address": null,
        "latitude": 39.360252,
        "longitude": -84.309105
    }
}