{
    "job": {
        "title": "Data Scientist I, Product Analytics",
        "industry": "Marketing and Advertising,Computer Software,Internet",
        "description": "Tinder brings people together. With tens of millions of users and a presence in every country on earth, our reach is expansive and rapidly growing. The Analytics team powers data-informed decision-making at Tinder. We are looking to add a creative Data Scientist to our growing Analytics team. As a Data Scientist I on the Analytics team, you will partner with Product, Marketing, Engineering, and Finance to improve our outstanding platform. You will use comprehensive datasets to develop experiments, understand metrics, develop automated reports, and generate exploratory insights to guide our business solutions. You will collaborate with other members of our team to surface important insights - exploratory analysis, experiment results, collaborations with other teams (consumer insights/strategy/etc) - to our partner teams and across the company. These insights influence both the performance of our business and the experience of our members. This role has the opportunity to work on either the Core, Revenue, or Growth features of the Tinder app - during the interview process, we will work closely with you to define what team would be the best match. The position can sit either in Los Angeles, Palo Alto, or our San Francisco office. Responsibilities: Design and analyze experiments to rigorously test a specific hypothesis. Find the “story” in the data and readily share insights with product, engineering, and design as well as at a company level. Be an authority with a point of view for the organization, using data to constantly challenge and reshape our current understanding of customer behavior and business performance. Derive and communicate data-driven recommendations regarding both the prioritization of potential product/marketing initiatives and performance of current initiatives. Define and operationalize the detailed tracking of company-wide, team-specific, and product-specific performance metrics via rollout tables, dashboards, and automated reporting. Skills Required: We are looking for candidates who have 1-2 years of experience; candidates with an MA or PhD will be considered in the absence of professional working experience. Experience with SQL and data visualization tools (e.g. Tableau or Mode) is highly recommended. Familiarity with scripting languages, machine learning, sophisticated statistical techniques, and A/B testing is a plus. Ability to develop a nuanced business understanding, testable hypotheses, and meaningful findings from data. Eagerness to identify and explore new product opportunities, potential improvements to our data infrastructure, and unanswered questions about member behavior. Comfort using descriptive and inferential statistics. As part of our team, you’ll enjoy: Working on a product that has an immediate impact on people’s lives all around the world Collaborating with a team of creative, fun and driven colleagues Comprehensive health coverage, competitive salary, 401(k) employer match, Employee Stock Purchase Plan (ESPP) Other perks and wellness benefits like a fitness membership subsidy, paid concierge medical membership, pet insurance offerings, and a commuter subsidy A robust Learning + Development offering including our MentorMatch program, access to a library of 6,000+ online learning courses through Udemy, and an annual L+D stipend Access to mental health resources Fertility preservation benefits No Meeting Wednesdays and access to a wide range of product and service discounts through Perkspot Charitable donations match up to $15,000 annually Monthly and weekly interactive virtual events including Book Club, trivia with prizes and yoga workouts The opportunity to join six active Employee Resource Groups (ERGs) At Tinder, we don’t just accept difference — we celebrate it, we support it, and we thrive on it for the benefit of our employees, our product, and our community. We strive to make our workplace an inclusive and diverse environment, giving people from all walks of life the opportunity to have a voice. We champion and encourage those who bring different perspectives, ideas, and creativity to join our team dedicated to bringing people together across the globe. Tinder is proud to be an equal opportunity workplace where we welcome all people regardless of sex, gender identity, race, ethnicity, disability, or other lived experience.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-10-07T19:43:22.000Z"
    },
    "company": {
        "name": "Tinder",
        "link": "https://www.linkedin.com/company/tinder-incorporated"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 12,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "San Francisco",
        "region": "CA",
        "postal_code": "94121",
        "street_address": null,
        "latitude": 37.78008,
        "longitude": -122.42016
    }
}