{
    "job": {
        "title": "Associate Data Scientist",
        "industry": "Information Technology and Services,Computer Software,Financial Services",
        "description": "Current Employees of LendingClub: Please apply via your internal Workday Account LendingClub Corporation (NYSE: LC) is the parent company of LendingClub Bank, National Association, Member FDIC, and the only full-spectrum fintech marketplace bank. Members can gain access to a broad range of financial products and services through a technology-driven platform, designed to help them pay less when borrowing and earn more when saving. Since 2007, more than 3 million members have joined the Club to help reach their financial goals. We’re leading the governance of a new industry by developing ethical, responsible ways to bring greater value and better opportunities to our members. Everyone deserves a better financial future and our team is committed to making that a reality. Come join us! About The Role What You'll Do Mine and analyze data from company databases to drive optimization and improvement of acquisition marketing, fraud mitigation, retention and business strategies Design and build queries, reports, and dashboards using business intelligence tools adhering to established frameworks and standards Champion a data-driven culture across the enterprise developing methods and controls to ensure consistent application and use of data Actively participate in and influence discussions around reporting requirements, infrastructure needs, and design Assess the effectiveness and accuracy of new data sources and data gathering techniques Develop custom data models and algorithms to apply to data sets Use predictive modeling to improve applicant conversions, optimize customer experiences and reduce fraud. Develop processes and tools to monitor and analyze model performance and data accuracy Interface directly with clients and project team members to understand the needs and objectives of the business Consistently deliver high-quality business intelligence solutions and services to clients on schedule Bring structure to ambiguous business problems and recommend visualization solutions that can be easily interpreted by users Follow, maintain and improve all documentation and procedures for report design and production Sponsor teamwork and encourage collaboration About You Bachelor’s degree in Economics, Statistics, Computer Science, Information Technology, Business Analytics or related discipline. Advanced degree a plus. Minimum of 1+ years of experience as a Data Analyst or Decision Science Analyst, in a dynamic business environment, with demonstrated reporting, analytical, and database experience. E-commerce or digital banking experience a strong plus. Key strengths include business and technical acumen, the ability to think broadly, create a shared vision, and embrace change as an opportunity Outstanding ability to clearly communicate data, context, and implications to business and technology stakeholders Ability to think creatively, to deal with ambiguity, to manage changing priorities, and to drive initiatives to completion in a fast-paced, dynamic environment Smart, self-starter who is intellectually curious, thoughtful, analytical, and has the highest ethical standards Strong capacity to work with complex data and the ability to invent, design and build robust data & analytical solutions Experience and proficiency with Tableau Desktop, Tableau Online and Tableau Prep is preferred Experience using SQL and statistical languages (R, Python, SAS, etc.) to manipulate data and draw insights from large data sets Experience visualizing/presenting data for stakeholders in a meaningful and readily accessible way Experience working with and creating data architectures to support business data reporting and modeling Excellent verbal, written communication and presentation skills Possess personal qualities of integrity, credibility and commitment to corporate mission LendingClub is an equal opportunity employer and dedicated to diversity, equity, and inclusion in the workplace. We do not discriminate on the basis of race, religion, color, national origin, sex (including pregnancy, childbirth, reproductive health decisions, or related medical conditions), gender, gender identity, gender expression, sexual orientation, age, marital status, veteran status, disability status, political views or activity, or other applicable legally protected characteristics. We believe that a variety of perspectives will make our teams and business stronger as we work together to transform the traditional banking system. We are committed to providing reasonable accommodations for qualified individuals with disabilities in our job application process. If you need assistance or an accommodation due to a disability, please contact us at interviewaccommodations@lendingclub.com.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-09-08T03:22:07.000Z"
    },
    "company": {
        "name": "LendingClub",
        "link": "https://www.linkedin.com/company/lending-club"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 12,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "San Francisco",
        "region": "CA",
        "postal_code": "94121",
        "street_address": null,
        "latitude": 37.78008,
        "longitude": -122.42016
    }
}