{
    "job": {
        "title": "Senior DevOps/Cloud Engineer (AWS, Azure, GCP)",
        "industry": "Information Technology and Services",
        "description": "Cloud & DevOps Engineer Ippon Technologies is a global technology consulting firm that unlocks possibilities by setting new standards for excellence and delivery. We accelerate our customers’ digital roadmaps and our consultants’ careers. The Ippon story started in 2002 in Paris, France - cue in the accordion. Our founder and CEO Stephane Nomis used his unique experience as an international Judo champion to create a culture based on the sports values of ambition and excellence. Ippon Technologies has the brains and brawn summarized by our five COACH values: Creative, Open, Agile, Courageous, and Hungry. Do you want to work with other talented individuals who are driven and fun to work with? Do you enjoy providing solutions and value to clients? Then Ippon is where you belong! It’s your lucky day because we are growing fast in the US and are currently seeking a Cloud Engineer to join our team! Are you an experienced DevOps Engineer with expertise in the leading cloud solutions? Then take your next career step with Ippon Technologies! What you will do: Working within a team of like-minded professionals to plan, deploy, and maintain critical business applications in a production cloud environment. Designing and implementing appropriate environments for those applications, engineer suitable release management procedures and provide production support. Influencing other teams and broader Engineering groups in adopting Cloud technologies, processes, and best practices. Redesigning legacy applications for Cloud implementation. Automating the provisioning of environments with Chef or Ansible, and deploying environments using containers, like Docker or Kubernetes. Designing and developing automation workflows, performing unit tests and conducting reviews to make sure your work is rigorously designed, elegantly coded, and effectively tuned for platform performance, and assess the overall quality of delivered components. Troubleshooting problems, involving the appropriate resources and driving resolution of issues with a focus on minimizing impact to our clients Participating in the Agile DevOps design, development, testing, and release of new capabilities and features. Representing production support for the suite of apps in the domain in Agile stand-ups, planning sessions and deployment activities. Driving improvements to processes and design enhancements to automation to continuously improve the production environment. What we are looking for: 4+ years of professional experience in IT services or consulting work 2+ years working with the leading cloud-based solutions, including AWS, Azure, GCP, etc. Cloud Certification(s) [bonus] Experience working with Agile Development practices. Experience with Deployment Management tools such as Chef, Ansible or Puppet 2+ years of experience Production Support experience in Unix and Windows environments 2+ years of experience in technology delivery in a DevOps environment 2+ years of experience with Linux server automation and scripting 2+ years of experience with Container technology such as ECS, Nomad, and Kubernetes 2+ years of experience with OOP scripting languages and frameworks 2+ years of database experience with Oracle, SQL Server, PostgreSQL (NoSQL a plus!) Ability to communicate clearly and effectively in interpersonal and written formats Knowledge of IT strategy and management is desirable. Job Type: Full-time We value the diversity and different perspectives each of our employees bring to Ippon Technologies. Ippon Technologies is an equal opportunity employer. All applicants will be considered for employment without attention to race, color, religion, sex, sexual orientation, gender identity, national origin, veteran or disability status. So, do YOU speak Ippon? Tell us about yourself!",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-10-05T17:29:18.000Z"
    },
    "company": {
        "name": "Ippon Technologies USA",
        "link": "https://www.linkedin.com/company/ippon-technology"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 48,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Washington DC-Baltimore Area",
        "region": null,
        "postal_code": "21201",
        "street_address": null,
        "latitude": 38.873062,
        "longitude": -77.007385
    }
}