{
    "job": {
        "title": "ISE, Input Experience - Sr. Research Engineer, Text Understanding Platform",
        "industry": "Consumer Electronics",
        "description": "Summary Apple and its Intelligent System Experience organization are on a mission to create software that feels intimate, humane and personal, by building models that understand who you are and what you use your device for in order to adapt and personalize your experience. Users interact with countless amounts of text through their daily interactions, and understanding what that text means to them is central to creating a truly personalized user experience. The Text Understanding Platform team provides some of the core system-level capabilities for semantic analysis of text used to benefit a range of features across Apple platforms. As a member of this organization, you’ll have the opportunity have a broad impact on millions of iOS users worldwide. We’re looking for a motivated and experienced software architect with deep experience in building high-performance and maintainable software, to help us to design and implement the next generation of our text understanding platform. Prior work in NLP is not strictly necessary here — this could be a great role for a very experienced infrastructure engineer looking to learn about NLP. If you’ve got a passion for delivering personalized and intelligent user experience, in ways consistent with Apple’s core values of fairness, privacy, and attention to detail, are comfortable working collaboratively and navigating ambiguity, we want to hear from you! Key Qualifications Strong object-oriented programming and design skills, at both the systems level and application level. Experience as a tech lead or architect, including work at the design, implementation, and maintenance phases. Ability to understand and manage the performance and privacy constraints of client-side engineering. Ability to navigate a large organization and work with internal partners to understand and satisfy requirements. Engineering experience working on ML or data processing infrastructure. Practical knowledge of Objective-C (useful but not required) Knowledge of and experience with practical applications of NLP algorithms. (useful but not required) Description In this role, you will: - Participate in the design of systems that allow us to bring the state of the art in NLP algorithms on device. - Handle performance optimization and maintenance of the text processing engine. - Establish a culture of excellence in code quality and testing. - Work with internal client teams to identify critical needs and adapt your design to serve them. Education & Experience Bachelor's, Master's, or Ph.D in Computer Science or related field, or relevant experience Role Number: 200229604",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-23T06:38:43.000Z"
    },
    "company": {
        "name": "Apple",
        "link": "https://www.linkedin.com/company/apple"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Seattle",
        "region": "WA",
        "postal_code": "98133",
        "street_address": null,
        "latitude": 47.60323,
        "longitude": -122.33028
    }
}