{
    "job": {
        "title": "Clinical Trial Assistant",
        "industry": "Research",
        "description": "JOB DESCRIPTION As a Clinical Trial Assistant, you will be responsible for assisting Clinical Operations staff in the performance of their duties, and with administrative tasks related to the conduct and implementation of clinical trials. A DAY IN THE LIFE Administrative tasks Providing assistance to CRAs, regulatory operations staff and/or CPMs Undergoing CRA training activities Logging, filing and copying of clinical regulatory and other documents Preparing site initiation and monitoring materials Assisting with maintenance of study tracking tools Attendance at company meetings, completion of timesheets and documentation of training Assisting with other projects within the company Adherence to Proxima or client Standard Operating Procedures (as applicable) Professionally represent Proxima in business interactions MUST HAVE KNOWLEDGE AND SKILLS Good interpersonal skills. Good oral and written communication skills. Ability to articulate issues. Self-management skills, including the ability to multi-task. Attention to detail and accuracy in work. Keyboarding, word processing, and computer skills preferred. Ability to maintain confidentiality NICE TO HAVE KNOWLEDGE AND SKILL BA, BS or Associate’s degree or equivalent in a scientific or healthcare field preferred, but not required. Minimum high school degree required, relevant experience preferred. Familiarity with common medical terminology preferred.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-25T17:27:59.000Z"
    },
    "company": {
        "name": "Proxima Clinical Research, Inc.",
        "link": "https://www.linkedin.com/company/proxima-clinical-research"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Houston",
        "region": "TX",
        "postal_code": "77208",
        "street_address": null,
        "latitude": 29.760803,
        "longitude": -95.36951
    }
}