{
    "job": {
        "title": "Data Scientist",
        "industry": "Biotechnology",
        "description": "What will you do? Leverage your intellectual curiosity, a broad array of statistical and machine learning techniques to investigate problems, detect patterns and trends in the data and build predictive models to assess the performance of our clinical test and enable development of high accuracy clinical calling algorithms. Deliver key findings and recommendations to internal and external stakeholders with diverse backgrounds. Automate methods, deploy tools and models to internal users. Collaborate cross-functionally with a wide variety of people and teams such as algorithm developers, experimental scientists, and software engineers Requirements 3+ years of data scientist or similar role (biotechnology industry preferred) Strong hands on data analysis, modeling, and classifiers experience Strong knowledge of data structures and common methods in data transformation Hands on experience with statistical packages, pattern recognition and predictive modeling Proficient in one or more programming languages like C++, Java and Python Experience utilizing Matlab, JMP, R, or SPSS Knowledge, Skills, Abilities Understanding of clinical trial design and evaluation Knowledge in Molecular Biology and Clinical Diagnostics Strong understanding of qPCR and amplification curve data Prior experience with US-FDA 510k product development/submission, 21 CFR Part 11, and ISO 13485 is highly preferred Ability to present and communicate data analysis results to non-experts Bachelor’s degree in Applied Mathematics, Physics, Electrical Engineering, Computational Biology, Biostatistics, Computer Science or related discipline; postgraduate degree (Master’s, PhD) is highly preferred Knowledge, Skills, Abilities • Understanding of clinical trial design and evaluation • Knowledge in Molecular Biology and Clinical Diagnostics • Strong understanding of qPCR and amplification curve data • Prior experience with US-FDA 510k product development/submission, 21 CFR Part 11, and ISO 13485 is highly preferred • Ability to present and communicate data analysis results to non-experts",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-06T18:37:02.000Z"
    },
    "company": {
        "name": "Theery",
        "link": "https://www.linkedin.com/company/theery"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "South San Francisco",
        "region": "CA",
        "postal_code": "94083",
        "street_address": null,
        "latitude": 37.65568,
        "longitude": -122.41248
    }
}