{
    "job": {
        "title": "Sensing Systems Engineer",
        "industry": "Consumer Electronics",
        "description": "Summary The Camera Systems Engineering Group is responsible for the systems-level analysis, design and development of new camera features and technologies for performance enhancement. The team is seeking an exceptional systems engineer with broad skills to lead research projects. Key Qualifications Expertise with sensing systems (preferably in magnetic sensing) Expertise in MATLAB and familiarity with Python Experience with signal processing, preferably in MATLAB Experience with magneto-static simulations of CAD using FEA methods. Experience with analog and digital electronics Experience in system-level requirements and documentation Broad knowledge of engineering concepts (device behavior, data analysis, and systems modeling) and associated tools: MATLAB, JMP Familiarity with control systems Familiarity with digital camera and optics technology Familiarity with CMOS image sensor technology Exposure to optical concepts and optical design Excellent written and verbal communication skills Great interpersonal skills - the ability to collaborate across groups Self-motivated, able to lead projects independently Description Duties include performing the systems-level analysis and modeling of sensing and imaging systems, the design and construction of prototypes to guide systems development and assess user impact, and the definition of system level tests for parametric specifications. Candidates should be highly skilled in several of these areas: - Performing the systems-level analysis and modeling of sensing and imaging systems using Matlab - Defining and documenting systems architecture, requirements, use case analysis, and tests for camera features and technologies - Creating subsystem specifications by analyzing / modeling / characterizing electrical, optical, and optoelectronic components -  Defining subsystem and system level tests to characterize and/or guarantee parametric specifications -  Designing and performing laboratory experiments, and documenting the results -  Using computer control (Matlab, Python, etc..) to automate repetitive measurements. -  Managing project deliverables and schedules to meet commitments to product development teams Education & Experience BS/MS/PhD in a relevant field (EE or Physics) or equivalent Role Number: 200107323",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-23T06:37:52.000Z"
    },
    "company": {
        "name": "Apple",
        "link": "https://www.linkedin.com/company/apple"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Cupertino",
        "region": "CA",
        "postal_code": "95014",
        "street_address": null,
        "latitude": 37.319313,
        "longitude": -122.02927
    }
}