{
    "job": {
        "title": "Entry Level Software Engineer ",
        "industry": "Information Technology and Services",
        "description": "Entry Level Software Engineer West Chester, PA (Temporarily remote due to Covid-19) Pay Rate - $25.00 - $28.00/hr (Depending on Experience) As Software Engineer, you would be responsible for the development and testing of the services that comprise the back-office platform for a Fortune 50 company. We are seeking a Computer Science or related major graduate (or 0-3 years of experience), who has a technical foundation with problem-solving skills and a passion for learning new technologies. As an Associate level Engineer, you would work with guidance from senior-level engineers on designs and implementation. If you feel that this describes you, keep reading and apply! Responsibilities Work within an Agile environment with 2-3 week sprints Create edits to new and existing applications within Java Work through the full Software Development Life Cycle Implement testing and debugging software components Document all development activities Requirements Completed Bachelors degree in Computer Science, Information Technology or a related field Experience working with Python and SQL Worked within a Linux environment Interested in Big Data Platforms and tools Strong written and oral communication Strong willingness to learn Additional Benefits Technical Training to provide accelerated impact to team’s initiatives Exposure to cutting edge technologies and methodologies Ongoing professional development training Collaborative team environment Healthcare coverage Holiday paid time off Eight Eleven Group provides equal employment opportunities (EEO) to all employees and applicants for employment without regard to race, color, religion, national origin, age, sex, citizenship, disability, genetic information, sexual orientation, gender identity, marital status, amnesty or status as a covered veteran in accordance with applicable federal, state, and local laws.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-27T19:20:01.000Z"
    },
    "company": {
        "name": "Brooksource",
        "link": "https://www.linkedin.com/company/brooksource"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "West Chester",
        "region": "PA",
        "postal_code": "19381",
        "street_address": null,
        "latitude": 39.96048,
        "longitude": -75.60522
    }
}