{
    "job": {
        "title": "C++ Submarine Sonar Applications Software Engineer",
        "industry": "Defense &amp; Space,Computer Software,Aviation &amp; Aerospace",
        "description": "Responsibilities to Anticipate: Develop robust and scalable software in C++ running Linux or UNIX operating systems on a variety of computing platforms using Agile development methods. Design, implement, debug and problem solve Submarine Sonar Software Applications while providing feedback to other team members. Help improve code quality by supporting software integration, verification, and code reviews. Participate in brainstorming sessions and contribute ideas to our technology, algorithms, and products. Work in a team environment with the product and design teams to understand end-user requirements, formulate use cases, and then translate that into a pragmatic and effective technical solution. Dive into difficult problems and successfully deliver results on schedule along with other duties as assigned Qualifications you must have: Bachelor’s degree in Computer Science, Computer Engineering, Electrical Engineering, Mathematics, Software Engineering, or related STEM field. Sonar domain knowledge Signal Processing code development 5 plus years of experience in Software Engineering to include: Experience with C++ and Linux/UNIX and strong Object-Oriented Knowledge The ability to obtain and maintain a DoD Security Clearance within in one year. U.S. citizenship is required as only U.S. citizens are eligible for a security clearance. Experience developing software in a team-based development environment Qualifications we value: Broad software development experience, including unit testing, real-time, or working in a DoD environment Experience in Agile development methods, including Scrum, automated testing and continuous integration Strong problem solving ability Self-starter and ability to lead development, integration and test activities Familiarity with the following Software Tools: Version control tools (e.g. GitHub), Jenkins, Jira, Coverity, Valgrind Master's Degree in Computer Science, Computer Engineering, Electrical Engineering, Mathematics, or Software Engineering",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-20T00:23:14.000Z"
    },
    "company": {
        "name": "Raytheon Missiles &amp; Defense",
        "link": "https://www.linkedin.com/company/raytheonmissilesanddefense"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Portsmouth",
        "region": "RI",
        "postal_code": "02871",
        "street_address": null,
        "latitude": 41.60228,
        "longitude": -71.247765
    }
}