{
    "job": {
        "title": "Data Scientist/Machine Learning Engineer-100%  Remote",
        "industry": "",
        "description": "Position Responsibilities/Duties: Research and implement new image search models and improvements to existing ones using big data to solve real-world problems. Collaborate and contribute with other engineers to facilitate creation of novel architectures. Building scalable, enterprise grade implementations using Python and other technologies executing in a multi-server cloud context Analyzing data form(architecture), storage, transfer, and representation to improve performance for clients and users. Work directly with PMs POs, DB engineers, DevOps, engineers, and others, as necessary. Required Skills and Abilities: 3+ years using Python Experience with OpenCV or other computer vision libraries Experience with Computer Vision such as Image Recognition, Segmentation, Classification Hand-on experience with classical Machine Learning and Deep Learning Understanding of denormalized database structures and retrieval methods e.g., SQL) Experience with NumPy/TensorFlow/torch/pandas Experience with Flask Experience with Docker is a plus Experience with Spark is a plus Experience with Azure is a plus Qualifications: Ph.D. or MS in Computer Science or a related field 3+ years’ experience in machine learning Hands-on experience in developing deep learning solutions Experience with search algorithms/models Company Benefits for Full Time employees: Insurance Benefits (Health, Dental, Vision, STD, LTD, V-Life). Paid Time Off including Paid Sick time off. Paid Company Holidays. Retirement Plan-401(K) & ROTH; contributions from Company to retirement plan is in the form of profit sharing.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-06T17:20:24.000Z"
    },
    "company": {
        "name": "OrbitJobs.Org",
        "link": "https://www.linkedin.com/company/orbitjobs.org"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Evanston",
        "region": "IL",
        "postal_code": "60203",
        "street_address": null,
        "latitude": 42.05216,
        "longitude": -87.68787
    }
}