{
    "job": {
        "title": "REMOTE Imaging Research Scientist",
        "industry": "Information Technology and Services,Computer Software,Financial Services",
        "description": "If you are a Research Scientist with imaging experience, please read on! Based in Newark, CA, we are a top defense and screening technology company with a broad global presence. Our unique and innovative company ensures continued safety and support is provided for our clients' staff and systems, as well as the general public. Due to growth and demand for our services, we are in need of a talented Research Scientist to join our diverse team and help us continue to drive success for many years to come! What You Will Be Doing Work within our team on algorithm development and system characterization for our systems Use existing tools and software to perform experiments pertaining to system design and analysis Help to enhance existing software modules Design prototypes and test new algorithms Report findings to broad audience, both technical and non-technical personnel Work cross-organizationally with multiple teams and individuals What You Need for this Position Bachelor's degree, Master's degree, or greater in Physics, Applied Mathematics, Electrical Engineering, or similar 2+ years of experience in implementing algorithms using C++ Experience with image or signal processing Comfortable working in a Linux environment Nice To Haves Experience with CUDA & GPU programming Experience with forward projectors & ray tracing Experience with x-ray physics, CT image generation, Fourier analysis, signal processing, stochastic processes, or image quality Experience with image processing toolkits / libraries like. Matlab, VTK, ITK, or similar What's In It for You Competitive base salary Annual incentive bonus plan Health benefits (Medical, Dental, Vision) PTO 401(K) Flexible hours Work/life balance Tuition assistance Paid maternity/paternity leave Growth Opportunities Amazing internal culture/team! So if this sounds like you and you're looking to grow with an incredible organization, please apply today! Email Your Resume In Word To Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also: Brennen.Leftwick@Optello.com Please do NOT change the email subject line in any way. You must keep the JobID: linkedin : BL1-1639054 -- in the email subject line for your application to be considered.*** Brennen Leftwick - Associate Manager - Optello Applicants must be authorized to work in the U.S. Optello is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-31T07:26:21.000Z"
    },
    "company": {
        "name": "Optello",
        "link": "https://www.linkedin.com/company/optello-us"
    },
    "education": {
        "required_credential": null
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Newark",
        "region": "CA",
        "postal_code": "94560",
        "street_address": null,
        "latitude": 37.540813,
        "longitude": -122.033394
    }
}