{
    "job": {
        "title": "Machine Learning Engineer",
        "industry": "人材",
        "description": "Must be located in Japan!! Responsibilities Develop ML / NLP applications on top of our core machine learning assets. Architect and develop a scalable cloud AI service. Application development on machine learning / deep learning assets Design and construction of cloud architecture to provide AI services in a scalable manner Minimum Skill / Experience Required requirements Strong background in Computer Science or a related field Extensive experiences in application development Working experiences with AWS or other cloud platforms Strong experiences with ML frameworks such as Scipy / Numpy, Scikit-Learn, Pandas, Tensorflow / Keras / PyTorch Good working knowledge of machine learning models (linear regression, ensemble methods, boosting, RNN, CNN, GCN, GAN, etc .) Experiences with git, GitHub, CI / CD Good communication skill Computer science or peripheral background- Experience in application development Experience in practical development on cloud platforms such as AWS Understanding machine learning frameworks ( Scipy / Numpy, Scikit-Learn, Pandas, Tensorflow / Keras / PyTorch ) Sufficient Japanese or English Communication skills ** We have many other roles available from our clients, please feel free to share your updated resume and contact us for details.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-16T06:47:51.000Z"
    },
    "company": {
        "name": "Talisman Corporation",
        "link": "https://jp.linkedin.com/company/talisman-corporation"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "JP",
        "locality": "東京",
        "region": null,
        "postal_code": null,
        "street_address": null,
        "latitude": 35.686962,
        "longitude": 139.74947
    }
}