{
    "job": {
        "title": "Data Scientist, Machine Learning",
        "industry": "Information Technology and Services,Computer Software,Financial Services",
        "description": "Interested in Machine Learning techniques in the areas of Predictive Modeling, Time-Series Forecasting, and Survival Analysis? As a Data Scientist at GoHealth, you will work with partners to build end-to-end data science models throughout our diverse business. This includes projects for call-center traffic projection, agent-behavior modeling, and customer retention decay curves. You will also contribute to the maintenance and improvement of our real-time production models, and the underlying AWS deployment pipeline. You will report directly to our Director of Data Science. Frequently cited statistics show that women and members of underrepresented groups apply to jobs only if they meet 100% of the qualifications. GoHealth encourages you to break that statistic and to apply. No one ever meets 100% of the qualifications. We look forward to your application. Responsibilities Develop data and predictive models for solving business problems, and in improving GoHealth's software products and business processes Evangelize software engineering best practices and proactively identify technical debt and other issues related to improving SLA Seek out ways to automate and accelerate development of data-driven products, and then implementing them Maintain and look to improve our Machine Learning Deployment Pipeline on AWS Sagemaker Collaborate with business stakeholders, business operations, and product engineering teams in analyzing business problems, building and testing solutions and data models, and implementing the algorithms and results of the models Work closely with Data Engineers in designing the schemas and data pipelines needed for downstream use by regression models and jobs Author formal and informal reports that effectively communicate the models and the results to both technical and non-technical audiences Confer with Data Science, Product, and Engineering stakeholders: To define and implement new data-powered products, and predictive models To deploy and maintain them in production as RESTful services and/or batch jobs Skills And Experience Master's or PhD in Statistics, Mathematics, Computer Science, Economics, or related quantitative field. 2+ years of experience demonstrating trajectory of professional growth in data science or machine learning Skilled in the the following: Machine learning, data science modeling - using scikit-learn, tensorflow, pytorch, and relevant technologies Python - scikit-learn, pandas, numpy Python unit testing framework - pytest, nosetest, or other testing frameworks AWS ecosystem, and preferably with docker and/or Linux/Unix experience Relational databases and SQL including MySQL, Postgres, SQL Server, Oracle, or equivalent Web service architecture, e.g. REST, SOAP, etc. Version control systems using Git, Bitbucket, SVN, or Team Foundation Software engineering practices Strong analytical and problem solving ability with strong attention to detail and accuracy. Benefits And Perks Open vacation policy because work life balance is important 401k program with company match Employee Stock Purchase Program Medical, dental, vision, and life insurance benefits Paid maternity and paternity leave Professional growth opportunities Generous employee referral bonuses Employee Resource Groups Work from Home Stipend GoHealth is an Equal Opportunity Employer Due to the unprecedented situation of COVID-19, GoHealth has decided to protect our current and future employees by managing our business remotely. This is inclusive of interviewing, onboarding and each role day-to-day. Please consider that our roles will not be remote long-term and will return to an office setting once we're safe to do so following the guidance of local health authorities’ and the CDC.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-12T22:15:25.000Z"
    },
    "company": {
        "name": "GoHealth",
        "link": "https://www.linkedin.com/company/gohealth"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Illinois",
        "region": "United States",
        "postal_code": "61709",
        "street_address": null,
        "latitude": 40.12414,
        "longitude": -89.14863
    }
}