{
    "job": {
        "title": " ITEC770465 - Software Engineer (Manufacturing ERP)",
        "industry": "Retail",
        "description": "Albertsons Companies is one of the largest food and drug retailers with 2,300+ stores. The Albertsons Companies family of brands includes some of the most prominent brands in food retailing, with a growing base of loyal shoppers. Thanks to the professionalism, diversity, spirit and friendliness of our people, we have locations across the U.S. The Information Technology Department has an opening for a Software Engineer. This position is located in Pleasanton, California or Plano, TX. Position Purpose Albertsons Companies is looking for an individual with application design / implementation / integration experience in the area of Sales, Manufacturing and Supply Chain in a retail distribution environment. Our company operates 2300 Grocery stores, 27 distribution centers and 18 Manufacturing plants across the USA, using a variety of manufacturing, outbound / inbound transportation routing / scheduling, fleet maintenance, distribution center yard management, and shipment delivery tracking systems. This position is to work on our Manufacturing ERP implementation which require integrations with other applications and midrange solutions This role will design and deliver accurate, efficient and reliable solutions to our Manufacturing Plants along with associated enhancements through the whole implementation cycle. In many cases, these solutions will have to comply with federal government regulations. Key Responsibilities include, but are not limited to: Consultation Develop strong working relationships at various levels throughout the business and IT community to ensure overall project satisfaction Assist in managing expectations with both business and IT stakeholders regarding functionality, scope, and deliverables Provide application design guidance and consultation, based on a thorough understanding of applicable technology, tools and existing designs Advise business partners on intended and optimal use of the provided systems, and assists with process development Design Analyze highly complex business requirements Design and create technical specifications to design / redesign complex computer platforms and applications Analyze problems outlined by Business Systems Analysts, to determine detailed technology requirements and capabilities Ensure design is in alignment with the core architecture of the systems / applications Analyze existing product software and recommend modifications which will enhance operating capacity and meet business requirements Development Act as an expert technical resource for modeling, simulation and analysis efforts Verify program logic by overseeing the preparation of test data, testing and debugging of programs Oversee systems testing and the migration of platforms and applications to production, with Albertsons project teams (onshore and offshore) Coordinate application & enhancement releases / user acceptance testing, with Albertsons project teams (onshore and offshore), third party application vendors, and business stakeholders Documentation Develop new documentation, departmental technical procedures and user guides Develop documentation standards, procedures and approval hierarchies Leadership Lead troubleshooting and root cause determination and proactively identify opportunities to fix issues Must be able to make sound decisions based on incomplete information, under pressure and maintain project focus Qualifications: 4-year degree (Computer Science, Information Systems) and / or equivalent combination of education or work experience 3+ years of analysis / design of ERP systems and the related business processes 3+ years' experience with the design / implementation of applications with different range of infrastructure solutions including Cloud based 2+ years of Supply Chain / Manufacturing applications development experience 6 years of programming experience, including experience integrating applications across diverse technical platforms and Object Oriented Development/Analysis/Design. Strong experience with database technologies (Oracle, SQL Server) Strong experience with File Transfer technologies (MIM, Kafka, MQ, EDI) Strong knowledge of technologies such as .Net, Java, Windows, and implementing applications in Cloud environments Strong experience with the full software development lifecycle and software development methodologies (Experience on Agile methodology with JIRA during previous project implementations will be a plus) Strong experience in capacity planning, systems performance analysis and optimization in a distributed environment Excellent organizational and troubleshooting skills with attention to detail Strong knowledge of programming documentation processes / procedures Strong ability to understand client expectations and to resolve issues that may affect delivery Ability to build constructive relationships with senior application architects and project managers and gain their trust Strong interpersonal skills with the ability to work effectively in a matrixed organization Demonstrated ability to work effectively with external resource contracting vendors and software application providers Strong ability to mentor, coach and train lower level programmer analysts Self-starter, with a demonstrated ability to learn beyond formal training, with a strong aptitude for delivering quality products Excellent communications skills (written and oral), customer service and problem-solving skills Understanding of emerging business solutions, technologies, and delivery methodologies Ability to contribute to making critical and successful decisions under pressure Infor M3 and MEC/ION experience is highly desirable Understanding of financial system integration with Manufacturing desirable Manufacturing Cost Accounting knowledge desirable Knowledge of DevOps Tools and technologies for CI/CD (Continuous Integration/Continuous Development) is highly desirable. About us Albertsons Companies is at the forefront of the revolution in retail. With a fixation on innovation and building culture, our team is rallying our company around a unique vision: forging a retail winner that is admired for national strength, deep roots in the communities we serve, and a team that has passion for food and delivering great service. Albertsons Culture Principles Compassion : We always treat each other with kindness and respect Team : We always support and recognize each other Inclusive : We always value everyone's perspective Learning : We always strive to grow and develop ourselves and others Competitive : We always act with integrity to win over the customer Ownership : We always take actions to drive our success Physical Environment: Work may be performed in a temperature-controlled environment. Must sit, stand, or walk for extended periods of time. May spend long periods of time at desk or computer terminal. Will use keyboards, telephone, and other office equipment during the course of normal workday. Stooping, bending, twisting, and reaching may be required in completion of job duties. Work day is fast paced; some evening and weekend work may be required.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-18T22:01:25.000Z"
    },
    "company": {
        "name": "Albertsons Companies",
        "link": "https://www.linkedin.com/company/albertsons"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 72,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Plano",
        "region": "TX",
        "postal_code": "75093",
        "street_address": null,
        "latitude": 33.019695,
        "longitude": -96.697586
    }
}