{
    "job": {
        "title": "Software Engineer I",
        "industry": "Information Technology and Services,Computer Software,Financial Services",
        "description": "Join a team recognized for leadership, innovation and diversity Honeywell changes the way the world works. For more than 130 years, we’ve solved the toughest customer challenges through a rare combination of our industrial expertise and our innovations in groundbreaking software and technology, and industry-leading automation. This perfection is built on a foundation of inclusion, diversity and driving a performance culture that values integrity and ethics. Are you ready to help us make the future? We lead with software and innovation. Whether we’re turning mustard seeds into fuel, creating quantum algorithms or making taxis fly, our software engineering team is home to the world’s leading technological talent. We want software engineers who not only have a solid foundation in coding, development, designing, testing and even hacking, but who also have a passion for empowering the world and making it a better place for everyone – today and tomorrow. Join a team that designs, develops and integrates highly complex software applications within Honeywell Aerospace. You will be an active and integral member of a team to achieve the completion of goals. You will also generate innovative solutions in work situations; trying different and novel ways to deal with problems and opportunities. Key Responsibilities Requirements and design Software architecture and coding Integration Certification Test Feature Definition Customer Support Verification and Validation YOU MUST HAVE Bachelors degree in Engineering, Computer Science or Engineering Technology 1+ years of experience in software development and data acquisition hardware and installation WE VALUE Understanding various software development lifecycle Demonstrate the ability to develop efficient and high quality software Knowledge of software configuration management and change management practices Diverse and global teaming and collaboration Effective communicator Can quickly analyze, incorporate and apply new information and concepts Ability to consistently make timely decisions even in the face of complexity, balancing systematic analysis with decisiveness Ability to convey subtle or complex messages clearly, as appropriate for the topic and audience Ability to code in multiple languages Additional Information JOB ID: req297485 Category: Engineering Location: 3520 Westmoor St,South Bend,Indiana,46628-1373,United States Exempt Due to US export control laws, must be a US citizen, permanent resident or have protected status. Human Resources (CORPORATE HR) Honeywell is an equal opportunity employer. Qualified applicants will be considered without regard to age, race, creed, color, national origin, ancestry, marital status, affectional or sexual orientation, gender identity or expression, disability, nationality, sex, or veteran status.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-05T00:00:00.000Z"
    },
    "company": {
        "name": "Honeywell",
        "link": "https://www.linkedin.com/company/honeywell"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 12,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "South Bend",
        "region": "IN",
        "postal_code": "46619",
        "street_address": null,
        "latitude": 41.675034,
        "longitude": -86.25196
    }
}