{
    "job": {
        "title": "Mid Level Software Engineer",
        "industry": "Defense &amp; Space",
        "description": "If you are a Mid Level Software Engineer with experience, please read on! We are an employee owned company in the simulation space that is responsible for providing software solutions to both government and commercial industries! If you are looking for a great company with a ton of career growth and the chance to work on very interesting projects than this is the role for you! We offer a strong compensation package, are employee owned ( so what you say and do is actually implemented), great leadership team and a ton of career growth opportunities! What You Will Be Doing Will be developing software requirements specifications and test plans Develop complex software systems for surface and subsurface trainers What You Need for this Position Training Simulation Modeling So, if you are a Mid Level Software Engineer with experience, please apply today! Email Your Resume In Word To Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also: Keith.Ellis@CyberCoders.com Please do NOT change the email subject line in any way. You must keep the JobID: linkedin : KE2-1626558 -- in the email subject line for your application to be considered.*** Keith Ellis - Recruiting Manager - CyberCoders Applicants must be authorized to work in the U.S. CyberCoders, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-31T07:22:47.000Z"
    },
    "company": {
        "name": "CyberCoders",
        "link": "https://www.linkedin.com/company/cybercoders"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Oviedo",
        "region": "FL",
        "postal_code": "32766",
        "street_address": null,
        "latitude": 28.67029,
        "longitude": -81.20848
    }
}