{
    "job": {
        "title": "Real World Data Analyst Programmer",
        "industry": "Information Technology and Services,Staffing and Recruiting,Pharmaceuticals",
        "description": "Alphanumeric is hiring a \"Real World Data Analyst\" to work remotely with one of the world's largest pharmaceutical organizations based in Collegeville, PA. Role = Real World Data Analyst / Programmer Duration = One year from start date Standard Day Shift (Mon-Fri; 40 hrs/wk; 8 hrs/day) Location = Worker can be 100% remote, but should be willing to work east coast time so they can overlap with UK time. This is an exciting opportunity to be part of a Real World Analytics team (RWA) that partners closely with Real World Evidence & Epidemiology, and Value Evidence & Outcomes to support drug development and patient access. We are an in-house data and analytics team set up to provide insight into the patterns, burden, and occurrence of disease, cost and healthcare utilisation, and the safety and effectiveness and other outcomes of treatment. Our goal is to provide objective evidence of the value of our medicines through the analysis of electronic health records, administrative claims, patient registries and other observational health data sources. Roles And Responsibilities Transform real-world data into actionable insights in Epidemiology and Health Outcomes research through hands-on manipulation of complex health datasets. Consult and collaborate with research partners to conduct, interpret and report studies using real world healthcare data. Qualifications Bachelor’s degree, or equivalent experience, in a quantitative discipline such as statistics, epidemiology, health economics or biostatistics. Proficient in manipulating large, complex datasets in a statistical programming language such as SAS, R or Stata. Prior experience working with population-based health outcomes data is highly desirable Excellent problem-solving and enjoy finding efficient and innovative solutions to challenging problems. Self-reliant with the ability to deliver robust, timely, high-quality analytics. Enjoy working on a wide range of projects.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-09-02T05:48:00.000Z"
    },
    "company": {
        "name": "Alphanumeric Systems",
        "link": "https://www.linkedin.com/company/alphanumeric-systems"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Collegeville",
        "region": "PA",
        "postal_code": "19426",
        "street_address": null,
        "latitude": 40.192528,
        "longitude": -75.46108
    }
}