{
    "job": {
        "title": "Front-end Software Engineer, Data Products &amp; Tools",
        "industry": "Marketing and Advertising,Computer Software,Internet",
        "description": "Come help us build the world's most reliable on-demand, logistics engine for delivery! We're bringing on experienced engineers to help us create and maintain a 24x7, no downtime, global infrastructure system that powers DoorDash’s three-sided marketplace of consumers, merchants, and dashers. At DoorDash, our software engineers work on everything from backend systems to beautiful and thoughtful user interfaces, to scaling products that will automate human processes and make deliveries happen as fast as possible. About The Team Our goal is to enable all of DoorDash to collect, compute and utilize timely, data-driven insights by providing a reliable, flexible and high quality Data Platform. Data Platform encompasses Data Products, Analytics Engine, Data Infrastructure, plus Streaming, ML, and Experimentation Platform teams. About The Role As a front-end engineer at DoorDash Data Platform team, you’ll help design and build beautiful, intuitive user interfaces for web applications to find data assets, standardize and enhance metrics definitions, and build a knowledge graph in order to accelerate data driven product innovation and customer value for DoorDash. Your Responsibilities Include Delight Data Platform users with the best customer experience through technical and product decisions. Write robust, highly tested, well-crafted code that you can be proud of. Work on developing, releasing, and running web applications. Maintaining a positive and supportive work culture. You’re Excited About This Opportunity Because You Will… Join a growing company and grow right along with us. Get the chance to work on cutting-edge technologies and use world-class tooling to get the job done. Make a large impact across the company through business deliverables and continuous innovation. Opportunity to build 0 to 1 solutions focussed on Data democratization. Have the ability to shape and improve our engineering culture. What We're Looking For B.S., M.S. or PhD in relevant fields or 4+ years of industry experience. Mastery of the foundations of the web: vanilla JS, HTML5, CSS3. Understanding of cross-browser compatibility, progressive enhancement and graceful degradation, responsive design, website performance, and accessibility. Understanding of REST principles and experience working with and implementing backend APIs. Experience with React/Redux, or similar frameworks. Able to analyse and improve efficiency, scalability, and stability of various system resources. Experience with documentation, unit and integration testing. Adaptability, resilience, and being able to thrive in ambiguity - things change quickly in our fast-paced team and you’ll need to be able to keep up! Nice to have Engage with or contribute to Big Data related open source projects. Familiar with real-time stream processing challenges. Familiar with a cloud based environment such as AWS. Contributions to open source projects. Why You’ll Love Working at DoorDash We are leaders - Leadership is not limited to our management team. It’s something everyone at DoorDash embraces and embodies. We are doers - We believe the only way to predict the future is to build it. Creating solutions that will lead our company and our industry is what we do -- on every project, every day. We are learning - We’re not afraid to dig in and uncover the truth, even if it’s scary or inconvenient. Everyone here is continually learning on the job, no matter if we’ve been in a role for one year or one minute. We are customer-obsessed - Our mission is to grow and empower local economies. We are committed to our customers, merchants, and dashers and believe in connecting people with possibility. We are all DoorDash - The magic of DoorDash is our people, together making our inspiring goals attainable and driving us to greater heights. We offer great compensation packages and comprehensive health benefits. About DoorDash DoorDash is a technology company that connects customers with their favorite local and national businesses in over 4,000 cities and all 50 states across the United States and Canada. Founded in 2013, DoorDash empowers merchants to grow their businesses by offering on-demand delivery, data-driven insights, and better in-store efficiency, providing delightful experiences from door to door. By building the last-mile delivery infrastructure for local cities, DoorDash is bringing communities closer, one doorstep at a time. Read more on the DoorDash blog or at www.doordash.com. Our Commitment to Diversity and Inclusion We’re committed to growing and empowering a more inclusive community within our company, industry, and cities. That’s why we hire and cultivate diverse teams of the best and brightest from all backgrounds, experiences, and perspectives. We believe that true innovation happens when everyone has room at the table and the tools, resources, and opportunity to excel.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-24T01:19:29.000Z"
    },
    "company": {
        "name": "DoorDash",
        "link": "https://www.linkedin.com/company/doordash"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 48,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Seattle",
        "region": "WA",
        "postal_code": "98133",
        "street_address": null,
        "latitude": 47.60323,
        "longitude": -122.33028
    }
}