{
    "job": {
        "title": "Staff Embedded Software Engineer",
        "industry": "Information Technology and Services,Computer &amp; Network Security,Computer Software",
        "description": "Job Description Job Responsibilities: Develop and maintain software components on current and future products. Hands on in bug fixing current products. Implement software features of high quality and on schedule. Communicate effectively, both verbal and written. Job Requirements Minimum of 4 years of experience in networking related software development. Strong C experience in embedded Unix/Linux environment is essential. Experience programming in Linux Kernel routing system, netfilter, and packet forwarding. Experience with multi process/thread programming. Experience in router, firewall, VPN. Knowledge of general QA procedures and met.hodologies as well as software development fundamentals. Good verbal and written communication and teamwork for cross team collaboration. Quick learning ability, adaptability, and curiosity about new technology. Education Requirement B.S. in Computer Science or Electrical Engineering; M.S. preferred #GD About Us Fortinet (NASDAQ: FTNT) secures the largest enterprise, service provider, and government organizations around the world. Fortinet empowers its customers with intelligent, seamless protection across the expanding attack surface and the power to take on ever-increasing performance requirements of the borderless network - today and into the future. Only the Fortinet Security Fabric architecture can deliver security features without compromise to address the most critical security challenges, whether in networked, application, cloud or mobile environments. Fortinet ranks number one in the most security appliances shipped worldwide and more than 450,000 customers trust Fortinet to protect their businesses. We are committed to providing reasonable accommodations for all qualified individuals with disabilities. If you require assistance or accommodation due to a disability, please contact us at accommadations@fortinet.com. Fortinet is an equal opportunity employer. We value diversity in our company, and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, or any other applicable legally protected characteristics in the location in which the candidate is applying.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-09T17:43:31.000Z"
    },
    "company": {
        "name": "Fortinet",
        "link": "https://www.linkedin.com/company/fortinet"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 48,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Sunnyvale",
        "region": "CA",
        "postal_code": "94089",
        "street_address": null,
        "latitude": 37.373676,
        "longitude": -122.036575
    }
}