{
    "job": {
        "title": "Sr. Software Engineer",
        "industry": "Pharmaceuticals,Biotechnology",
        "description": "2120- Certara is hiring an Product Manager to support our Software Division! This position can be based out of any of our US offices, or full time remote. At Certara, we accelerate medicines to patients by partnering with life science innovators. Our Integrated And Proprietary End-to-end Platform With Biosimulation, Regulatory Science, And Market Access Solutions Combined With Our Strong Team Of Scientists And Subject Matter Experts Enable Our Clients To Have In the past 6 years, over 90% of companies that received new drug approvals by the FDA used our software or services. informed decision-making & reduced clinical trial burden higher R&D productivity improved patient outcomes & increased patient access to medicines accelerated regulatory approval Certara is a global team that fosters and nurtures a diverse and inclusive culture. We are proud to be an Equal Opportunity Employer. The collective sum of our individual differences, life experiences, knowledge, innovation, self-expression, and unique capabilities and talent represents a significant part of our culture, our reputation and our achievement. Together with our partners, we use biosimulation and technology-enabled services to transform drug discovery and development across all therapeutic areas and innovative therapies. Responsibilities Participate in the definition, design, coding, testing and debugging of software platform/products/toolkits, either new or existing. Support the implementation of new and improvements to current software development processes and technologies. Conduct feasibility of proposed designs to determine their ability to function as intended. Write and maintain documentation throughout all phases of software development Contribute to software architecture design Participate in code reviews, scrum-related meetings and standups on a daily basis Interact with development team members (both Certara employees and contractors) on project scope, activities, timeline and risks. Mentor and coach team members on software development best practices and standards Qualifications Education, Experience, Training, and Knowledge: BS or MS in Computer Science or similar engineering discipline, or equivalent experience. 10+ years of software development experience, including software analysis, design, and delivery with a focus on Microsoft technologies, including desktop, web-based, and client-server applications 5+ years w/ Relational Database Experience 5+ year JavaScript 5+ year Typescript 5+ Year Angular 5 or greater, experience with the latest Angular versions Experience leading a team, on shore or off shore Experience with NPM and Angular CLI in building Angular applications Experience with Cloud Technologies Experience with Unit Test Technologies Understanding of SOLID Principles Requires knowledge of and/or experience with Clean Code Preferable knowledge of and/or experience with Test Driven Development Must be self-thinker able to build solutions from general requirements without exacting specifications Proven knowledge and experience in agile development methodologies, techniques, and approaches Experience developing scientific/statistical software is preferred Excellent experience in SDLC Methodologies, Agile, SCRUM, SDLC / Waterfall Skills & Abilities Excellent communication skills (written and verbal) Excellent analysis, trouble-shooting and debugging skills Strong critical thinking, problem solving, planning and organizing, and decision-making skills Familiarity with reporting requirements for Clinical/Pre-Clinical Pharmacology, DMPK, or Clinical/Preclinical Pharmacokinetics departments Familiarity with various operating systems Required: C# NET Core 2.0 Relational Database Experience (Oracle, MS SQL Server, MySQL, etc) LINQ REST Angular 5+ Angular CLI Typescript Javascript HTML, CSS, (LESS, SASS) Karma/Jasmine NPM Node.js AWS Lambda functions Writing Unit Tests (.NET & angular or typescript) Visual Studio GIT (github) Nice to have: AWS Elastic Beanstalk AWS RDS AWS S3 AWS EC2 Docker (for local development) Docker (for production role out) Visual Studio Code Jenkins Powershell SonarCube Perforce Certara bases all employment-related decision on merit, taking into consideration qualifications, skills, achievement, and performance. We treat all applicants and employees without regard to personal characteristics such as race, color, ethnicity, religion, sex, sexual orientation, age, nationality, marital status, pregnancy, physical or mental condition, genetic information, military service, or other characteristic protected by law.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-09-02T05:37:44.000Z"
    },
    "company": {
        "name": "Certara",
        "link": "https://www.linkedin.com/company/certara"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 120,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Philadelphia",
        "region": "PA",
        "postal_code": "08051",
        "street_address": null,
        "latitude": 39.95106,
        "longitude": -75.16562
    }
}