{
    "job": {
        "title": "Data Engineer",
        "industry": "Information Technology and Services",
        "description": "Position: Data Engineer Location: Bridgewater, New Jersey, United States Responsibilities Position Summary The Data Engineer will work with the business to understanding data requirements and will become a data platform expert in designing and building data solutions focused on Cloud based Big Data ecosystems. You will work closely with other data science teams and take ownership of your projects and deliver high quality data driven advanced analytics applications. You will solve diverse business problems by utilizing a variety of different tools strategies algorithms and programming languages. What about you You are highly collaborative creative and intellectually curious individual who is passionate about data engineering and supporting cutting edge computing capabilities. You are able work well both individually and within a team. You are adaptable and able to overcome technical challenges. You are a self starter and motivated to learn and succeed. You are data driven and are able to identify and solution problems as they arise Responsibilities Collaborate and work with global data management stakeholders to identify requirements for complex business problems that may be loosely defined. Work with the business applications owners solutions architects and with technical architects to understand proposed solution architectures. Build deploy and monitor Batch and near real time data pipelines to load structured and unstructured data into data lake platforms Identify evaluate and implement leading edge data management frameworks required to address complex large scale data challenges. Work within multi functional agile teams with end to end responsibility for product development and delivery. Provide architectural support by building proof of concepts prototypes. Desired Qualifications Experienced in programming languages such as python SQL and spark. Experience or exposure Jupyter Notebook etc. Experience building Data engineering pipelines in corporate data lake environment handling large structured and unstructured datasets. Good understanding of linux os security and scripting. Energetic able to build and sustain long term relationships across a multitude of stakeholders in a fast paced multi national work environment. Strong time management and organizational skills Possess strong verbal and written communication skills and ability to present persuade and influence peers Bachelor s degree in Information systems or related field with GPA of 3 0 required. Excellent data analysis skills Experience in performing analysis and design for data management and data driven projects Familiarity with data science and analytic tool sets Bonus Skills Exposure or experience with Cloud Platforms Azure Databricks SQLDW and COSMOSDB. Experience in designing and leading the conceptual logical and physical design for distributed databases. Experience with operating system command languages such as bash or ksh. Experience with development tools such as git and integrated development environments. Understanding of the SAFe Agile development methodology Thank you Soni Arya",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-09T20:09:30.000Z"
    },
    "company": {
        "name": "Confidencial",
        "link": "https://br.linkedin.com/company/econfidencial"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Bridgewater",
        "region": "NJ",
        "postal_code": "08807",
        "street_address": null,
        "latitude": 40.593002,
        "longitude": -74.626434
    }
}