{
    "job": {
        "title": "Full Stack Software Engineer - 100% Remote",
        "industry": "Financial Services",
        "description": "Title: Full Stack Software Engineer Location: 100% Remote Full time/Direct Hire What We're Looking For We are looking for someone who takes pride in the craft and wants to be part of a team of talented engineers working to further Till's growth. You'll partner with engineering teams, product managers, analysts, and customer success to design, build, and maintain our technology platform. Responsibilities Own one or multiple projects from start to finish and be guided by the support of a dedicated manager, mentor or lead engineer Participate in daily team processes and learn all aspects of the software development lifecycle Track data that will allow us to better understand how we can improve our products Learn about the business and engineering practices Incrementally increased the quality and reliability of our payment processing system About You Excellent written and verbal communication and interpersonal skills, able to effectively collaborate with technical and business partners Have the ability to learn quickly Enjoy working independently and as part of a team Possess the ability to solve real-time technology problems Are a self-starter and possess strong sense of self-motivation Are selfless. Ideas don't have to originate from you in order for you to commit to a path forward Value ownership and autonomy Fluency in at least one non-Bash programming language such as Python, Ruby, Go, JavaScript / Node.js, Java, C#, or C/C Experience with (or a willingness to learn) at least one major front end development framework React, Vue, Angular) Experience with at least one cloud platform such as AWS, Azure, or GCP Bonus Points Experience with CloudFormation or Terraform Familiarity with at least one CI / CD tool such as Harness, GitHub Actions, Spinnaker, Jenkins, or CircleCI Experience with at least one log/metrics/alerting tools such as DataDog, Sumologic, FluentD, Prometheus, ELK, or Splunk Experience with DynamoDB, Security Scanning Tools, AWS Multi-Region configuration, Snowflake Our Tech Stack Experience with some of these would be helpful. We'll teach you the rest! AWS Lambda | DynamoDB | ECS | Docker | SQS | CloudFormation JavaScript | Python Vue.js Snowflake Benefits Health insurance with 100% premium covered for employee Flexible/Untracked PTO / sick leave Child care and health FSA Paid parental leave 401K Interested candidate please send your latest resume at sarath@mindsource.com",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-20T00:31:43.000Z"
    },
    "company": {
        "name": "MindSource",
        "link": "https://www.linkedin.com/company/mindsource"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Alexandria",
        "region": "VA",
        "postal_code": "22336",
        "street_address": null,
        "latitude": 38.804665,
        "longitude": -77.04362
    }
}