{
    "job": {
        "title": "Data Scientist I",
        "industry": "Information Technology and Services,Banking,Financial Services",
        "description": "Develop and program methods, processes, and systems to consolidate and analyze diverse data sets to generate insights and solutions for customer solutions and program enhancement. Identify and interpret insights from data sources and communicate findings to management. Principal Responsibilities Mine, model, and analyze large datasets utilizing descriptive, predictive, and prescriptive analytics. Develop insights from historical loan performance data, identify swap-in opportunities to underwrite new customer populations, and develop credit solutions for customer base using various analytical techniques. Develop and support custom score models for underwriting, pricing. and profitability. Forecast performance of marketing campaigns and track actual performance against target. Design and deploy model monitoring frameworks to assess the performance of partner underwriting portfolios, new product launches, and existing customer portfolios. Advise senior management of emerging trends and risks. Collaborate with vendors and technology teams to ensure new strategies and models are implemented accurately and as designed. Conduct other ad hoc analyses as required to support team goals. Other duties as assigned. Leveling Criteria Learns to use professional concepts. Applies company policies and procedures to resolve routine issues. Works on problems of limited scope. Follows standard practices and procedures in analyzing situations or data from which answers can be readily obtained. Builds stable working relationships internally. Education/Certification Bachelor's degree in Statistics, Math, Economics, Finance, a related field, or equivalent education and work experience. Experience Up to 2+ years with bachelor's or equivalent. Strong technical skills using SAS, SQL, R/Python, etc. The ability to independently access, mine, model, and analyze relational data sets Knowledge and experience with statistical analysis techniques, customer segmentation and credit bureau data. Experience in the consumer credit industry is a plus Competencies The ability to handle large volume of data and derive actionable insights. Strong analytical and problem-solving skills, combined with solid business acumen Strong written and communication skills with ability to explain complex insights to a range of audiences Experience in the consumer credit industry is a plus The ability to thrive in a fast-paced startup environment Successful team members possess a combination of three virtues — they are humble, hungry, and smart. Humble is a lack of excessive ego or concerns about status Hungry is always looking for more; intrinsically motivated, diligent, with a strong desire to do more by going above and beyond. Smart is emotional intelligence and interpersonal awareness; capability to conduct oneself in a group situation and deal with others in the most effective way. Equal Opportunity Employer/Disabled/Veterans The responsibilities listed above are not all inclusive and may be changed at any time.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-04T21:57:33.000Z"
    },
    "company": {
        "name": "MetaBank",
        "link": "https://www.linkedin.com/company/metabank"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Seattle",
        "region": "WA",
        "postal_code": "98133",
        "street_address": null,
        "latitude": 47.60323,
        "longitude": -122.33028
    }
}