{
    "job": {
        "title": "Software Engineer - Recent Grad",
        "industry": "Marketing and Advertising,Information Technology and Services,Computer Software",
        "description": "About Datadog We're on a mission to build the best monitoring platform in the world for engineers to understand and scale their systems, applications, and teams. We operate at high scale—trillions of data points per day—providing always-on alerting, metrics visualization, logs, and application tracing for tens of thousands of companies. Our engineering culture values pragmatism, honesty, and simplicity to solve hard problems the right way. Students can sign up anytime for a free Datadog Pro account! The Opportunity We’re looking for recent graduates to join us to help collect, aggregate, visualize, and analyze extremely high-scale metrics, logs, and application data. You'll join one of Datadog's software teams and work alongside other engineers to help solve complex problems. Whether you are writing a new integration, building data pipelines, or working with the open source community, our interns are key contributors to our product. This role will be based in our New York or Boston offices. In This Role You Will Solve a scaling bottleneck in a critical service, deploy a new feature to production and progressively roll it out with feature flags, and investigate and fix a production issue from a service your team owns. You will also create a way to optimize a service to handle more traffic and in partnership, with your team, planning the most important projects to work on next. Requirements You are in the process of receiving/have a degree in Computer Science, Software Engineering, or a related field You are targeting a 2022 full-time start date You are comfortable coding in one or more languages You value code simplicity and performance You have worked as a software engineering intern or have related industry experience You want to work in a fast-paced environment that values its employees and customers You are a self-starter who enjoys partnering with other engineers and solving difficult problems Bonus Points You have worked at high scale with systems like Redis, Cassandra, or Kafka You wrote your own data pipelines once or twice before You have significant experience with Go or Python Why You Should Apply Mentorship opportunities with team members, leadership, and beyond Continuous career and professional development opportunities Training to develop an in-depth understanding of our product and space Relocation stipend and travel benefits Intern cohort and monthly company social events Networking opportunities with across all teams at Datadog Unlimited snacks & drinks in our office Catered Lunches on Monday, Wednesday, and Friday Commuter benefits Beautiful offices in convenient locations with amazing views As the COVID-19 crisis continues to change globally, our hiring plans will change with it. We are following current company safety guidelines with the goal to hire team members who will work within one of our offices (NYC, Boston, Paris) once it’s safe to do so. We will update all applicants with the appropriate changes when necessary. Equal Opportunity At Datadog Datadog is an Affirmative Action and Equal Opportunity Employer and is proud to offer equal employment opportunity to everyone regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity, veteran status, and more. We also consider qualified applicants regardless of criminal histories, consistent with legal requirements. Your Privacy Any information you submit to Datadog as part of your application will be processed in accordance with Datadog’s Applicant and Candidate Privacy Notice.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-09T23:42:47.000Z"
    },
    "company": {
        "name": "Datadog",
        "link": "https://www.linkedin.com/company/datadog"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "New York",
        "region": "NY",
        "postal_code": "10132",
        "street_address": null,
        "latitude": 40.713047,
        "longitude": -74.00723
    }
}