{
    "job": {
        "title": "Site Reliability Engineer",
        "industry": "Information Technology and Services,Computer Software,Financial Services",
        "description": "Coinbase has built the world's leading compliant cryptocurrency platform serving over 30 million accounts in more than 100 countries. With multiple successful products, and our vocal advocacy for blockchain technology, we have played a major part in mainstream awareness and adoption of cryptocurrency. We are proud to offer an entire suite of products that are helping build the cryptoeconomy and increase economic freedom around the world. There are a few things we look for across all hires we make at Coinbase, regardless of role or team. First, we look for signals that a candidate will thrive in a culture like ours, where we default to trust, embrace feedback, disrupt ourselves, and expect sustained high performance because we play as a championship team. Second, we expect all employees to commit to our mission-focused approach to our work. Finally, we seek people with the desire and capacity to build and share expertise in the frontier technologies of crypto and blockchain, in whatever way is most relevant to their role. Coinbase Cloud is the leading blockchain infrastructure provider, and we are looking for an Experienced DevOps Engineer to join our highly-skilled and passionate team in the US or Canada. We believe in the power of blockchain technology and building a decentralized future that enables greater participation in global financial networks. Our mission is to provide superior infrastructure for multiple blockchains, strengthen the entire ecosystem, and enable the pioneers of tomorrow. What You'll Be Doing Build services and infrastructure that help to automate the deployment of blockchain network infrastructure. Write cloud-agnostic infrastructure as code. Infrastructure is in our DNA and is our primary output as a team. You will produce Terraform HCL and Kubernetes YAML on a daily basis. Interact and collaborate with other engineers and team members; we have a highly focused and collaborative team. We prioritize creating a shared understanding of our systems and supported networks, and we are dedicated to supporting each other on a daily basis. Incorporate monitoring, alerting, and observability into our platform to promote the highest standards of system health, reliability, and uptime. Maintain security and compliance standards; the security of our infrastructure and our customers’ infrastructure is our utmost priority. Build easy-to-use tooling that helps accelerate our engineering teams and processes. Automate deployment, validation, and quality control procedures across our entire company. Write integration tests and contribute to maintaining a healthy CI/CD pipeline. What We Look For In You The ability to proactively manage the needs of a growing company with minimal oversight. An analytical mindset; you should feel comfortable using qualitative and quantitative data to inform your decision-making. In-depth knowledge of Unix or Linux and the command line. Proficiency in a modern programming language such as Go, Python, or Rust. Experience in containerizing modern applications with Docker. Skill in defining infrastructure as code with Terraform or other similar tools. Familiarity with container orchestration and the Cloud Native ecosystem The ability to identify human processes that can be scripted and automated and the skills to script and automate them. Excellent written and verbal communication skills. The drive to build something meaningful in a groundbreaking, entrepreneurial environment. This role does not require a degree in computer science. We think creativity and excellence benefit from diverse backgrounds and disciplines. Nice To Haves Experience with more than one of the leading cloud providers (AWS/GCP/Azure) Experience with a service mesh technology such as Istio or Consul Experience running blockchain infrastructure Commitment to Equal Opportunity Coinbase is committed to diversity in its workforce and is proud to be an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, creed, gender, national origin, age, disability, veteran status, sex, gender expression or identity, sexual orientation or any other basis protected by applicable law. Coinbase will also consider for employment qualified applicants with criminal histories in a manner consistent with applicable federal, state and local law. For US applicants, you may view Pay Transparency, Employee Rights and Equal Employment Opportunity is the Law notices by clicking on their corresponding links. Additionally, Coinbase participates in the E-Verify program in certain locations, as required by law. Coinbase is also committed to providing reasonable accommodations to individuals with disabilities. If you need a reasonable accommodation because of a disability for any part of the employment process, please send an e-mail to accommodations@ coinbase.com and let us know the nature of your request and your contact information. For quick access to screen reading technology compatible with this site click here to download a free compatible screen reader (free step by step tutorial can be found here). Please contact accommodations@ coinbase.com for additional information or to request accommodations. Global Data Privacy Notice for Job Candidates and Applicants Depending on your location, the General Data Protection Regulation (GDPR) and California Consumer Privacy Act (CCPA) may regulate the way we manage the data of job applicants. Our full notice outlining how data will be processed as part of the application procedure for applicable locations is available here: Ireland/EU, United Kingdom, and California. By submitting your application, you are agreeing to our use and processing of your data as required.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-09-02T01:29:30.000Z"
    },
    "company": {
        "name": "Coinbase",
        "link": "https://www.linkedin.com/company/coinbase"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Boulder",
        "region": "CO",
        "postal_code": "80310",
        "street_address": null,
        "latitude": 40.016872,
        "longitude": -105.279625
    }
}