{
    "job": {
        "title": "Sr. DevOps Engineer (Service Infrastructure TuConnect)",
        "industry": "Information Technology and Services,Computer Software,Internet",
        "description": "Job Description 100% Remote Job Description Senior DevOps Engineer I is a DevOps evangelist and is accountable for employing best practices and principles that make development cycles shorter and continuous delivery of high-quality software possible. He or she builds, tests, and maintains the infrastructure and tools to allow for the speedy development and release of software and Infrastructure as a code. In collaboration with software engineers, they enable scaling the growth of software product capabilities. The incumbent is responsible for all things backend including leveraging infrastructure as code, CI/CD pipelines, and other supporting service components. The Senior DevOps Engineer I takes an automation-first approach while supporting platforms, services, and various tools. The incumbent fosters strong relationships with stakeholders, has a systems thinking mindset, and promotes a learning environment within a continuous improvement framework. Responsibilities Supports the development, deployment, and evolution of platforms, business critical services, and tools such as Jira, Jenkins, Confluence, MathLab etc. Delivers high-quality software in a rapid iteration environment with short turnaround times. Builds cloud infrastructure automation, handles CI/CD pipeline, calibrates alerting and incident response procedures, and supports software engineers in identifying and analyzing performance bottlenecks. Develops and maintains standards and procedures to ensure that configuration management controls are capable of supporting deployment activities and implementations to meet business needs. Evaluates and builds upon the foundation of the existing infrastructure to support and enhance the productivity of the entire engineering team. Builds and improves APIs so that they are as scalable, performant, intuitive as can be. Interprets configuration management activities and tools, and applies them to project activities. Assists with developing configuration management plans, milestones, and schedules for projects. Revises and assists in implementing new strategies as appropriate. Designs and builds backend systems that power a variety of internal projects. Works with the engineering teams to plan, deploy and maintain solutions in an AWS cloud environment. Develops testable scripts to maintain infrastructure-as-code and operate IoT-cloud services with high uptime requirements. Writes automation scripts following best-practice coding principles. Helps improve the infrastructure to ensure high availability and performance of software components are upheld. Continually evaluates the security of systems and applications, with an emphasis on data security. Collaborates with software engineers to figure out tool requirements, then drives the implementation, documentation, maintenance, and improvement of these tools. Tackles problems and resolves active production issues. Supports the end to end (E2E) delivery of the service; advocates for logging, monitoring, metrics, alerting, and alarming. Provides guidance and training to other members of the DevOps team, as necessary. Collaborates with the QA team in order to set up quality gates, execute automated tests in the delivery pipeline, and ensure continuity of service. Experience 4&plus; years of experience as a DevOps Engineer, Cloud Operations, SRE, Services Engineer, Systems Engineer or Software Engineer, focused on creating software to automate systems and processes, including: 2&plus; years of experience working on mid to large-scale sized production systems. Experience building or managing highly distributed, high volume services with 24/7/365 operational needs, preferred. Experience solving infrastructure problems in complex distributed systems. Experience with infrastructure automation tools, such as Terraform and Ansible. Fluency in web languages such as Python or Go. Expertise with AWS including account management and best practices including the AWS Well-Architected Framework. Keen ability to write scalable and testable code to automate repeatable processes. Experience supporting CI/CD platforms and related software development tools. Experience with security services and technologies such as TLS and AWS KMS. Experience building solutions with cloud native services like Kubernetes and serverless technologies. Experience with service-oriented architecture (SOA) and external integrations. Experience deploying continuous integration and delivery systems such as Jenkins, Travis, Circle CI, etc. Fundamental knowledge of DevOps methodologies in a production environment. Proven ability to learn new technologies and to maintain a high degree of technical involvement with the team. DevOps evangelist: achieves buy-in from development and operational teams, identifies the key roles to support DevOps delivery methods, and makes sure IT professionals are trained and empowered to make those changes. Self-starter, able to work and deliver in a fast-paced stream-alignment environment. Embraces change and advocates for best practices. Intellectually curious with a strong bias to action. Driven to understand and collaborate with multiple stakeholders, able understand and interpret stakeholder needs - translating needs into clear objectives Displays competency and confidence in suggesting and rationalizing test approaches. Analytical, judgment, persuasion and consensus building abilities where there are competing interests. Exceptional interpersonal, oral, and written communication skills. Capable of listening and obtaining clarification, changing approach or method to best fit the situation. Able to effectively partner with cross-functional teams to coordinate activities and accomplish goals. Ability to clearly and succinctly communicate verbally and in writing, translating technical jargon to correspond with the audiences knowledge and understanding. Demonstrated experience building and improving processes and promoting quality. Strong organizational skills, ability to coordinate multiple tasks and support projects of varying complexity concurrently within tight deadlines. Proven ability to work independently in a matrix organization, tech start-up experience preferred. Ability to maintain resilience throughout aggressive deadlines, changing priorities, and evolving operations, as common to progresive start-up environments. ITCO Overview Performance. Excellence, Value. Founded in 1997, our success is built on our relationships with our clients and our ability to deliver real value. ITCO Solutions is a technology services organization specializing in Workforce Solutions, Consulting Services, and Software Licensing. At ITCO Solutions, our goal is to create a long-term relationship by providing quality service and delivering real value to our consultants and clients. We are not a staffing firm that will just submit resumes with little value. The ITCO team works directly with the hiring manager to understand requirements so we can deliver a consultant that fits. Workforce Solutions Providing qualified IT talent to fill client resource needs, augment staff, and deliver projects on time. Engage ITCO Workforce Solutions to bolster the capacity of your IT staff and/or extend your capabilities beyond your existing skill sets. Consulting Services Streamline your adoption of technology and ensure optimal investment with ITCO Consultants. Turn-Key project delivery Reduce complexity Infrastructure, Virtualization, Cloud, and Managed services SmartSoft Licensing Solutions has set a new standard of value in helping companies maximize their purchasing power across the software spectrum. Hard-dollar costs savings by as much as 30% for enterprise software licensing Simplify the management and maintenance of software purchases Provide an assessment of your existing licensing",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-01T07:32:25.000Z"
    },
    "company": {
        "name": "ITCO Solutions, Inc.",
        "link": "https://www.linkedin.com/company/itco-solutions-inc-"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "San Diego",
        "region": "CA",
        "postal_code": "92161",
        "street_address": null,
        "latitude": 32.71576,
        "longitude": -117.16382
    }
}