{
    "job": {
        "title": "Entry-Level Software Engineer",
        "industry": "",
        "description": "At Motorola Solutions, we create technologies our customers refer to as their lifeline. Our technology platforms in communications, software, video and services help our customers work safely and more efficiently. Whether it’s helping firefighters see through smoke, enabling police officers to see around street corners, or reliably keeping the lights on in homes and businesses around the world, our work supports those who put their lives on the line to keep us safe. Bring your passion, potential and talents to Motorola Solutions, and help us usher in a new era in public safety and security. Department Overview At Motorola Solutions, we create technologies our customers refer to as their lifeline. Our technology platforms in communications, software, video and services help our customers work safely and more efficiently. Whether it’s helping firefighters see through smoke, enabling police officers to see around street corners, or reliably keeping the lights on in homes and businesses around the world, our work supports those who put their lives on the line to keep us safe. Bring your passion, potential and talents to Motorola Solutions, and help us usher in a new era in public safety and security. Our team consists of experienced professionals always looking for new ways of doing things and introducing techniques that promote adaptability and flexibility in the face of unpredictable circumstances. That includes technologies and practices. We are looking for self motivated, innovative individuals to help drive the next generation public safety experience. Job Description We work in Scrum methodology. You will be responsible for designing, developing, unit testing, and integrating software to support the development, enhancement, and maintenance of elements of the telecommunication infrastructure. You will collaborate with other teams across our global organization. Desired Skills: Practical knowledge of using a version control system like GIT Basic knowledge of telecommunications technologies Experience with automation environments (eg. Jenkins) Knowledge of software micro-services technologies such as Docker, Kubernetes, Elastic Stack, Nodejs. Knowledge of Perl / Powershell, Python Knowledge of Network Protocols (TCP/IP, TLS, UDP) Awareness of widely successful Agile techniques: User Stories, ATDD, TDD, Continuous Integration, Continuous Testing, Pairing, Automated Testing Basic Requirements Bachelor's degree or Master's degree in Computer Science, Computer Engineering, or a related technical discipline is required. Referral Payment Plan No Our U.S. Benefits include: Incentive Bonus Plans Medical, Dental, Vision benefits effective Day 1 401K with Company Match and Day 1 vesting 9 Paid Holidays Generous Paid Time Off Packages Employee Stock Purchase Plan Paid Parental & Family Leave and more! EEO Statement Motorola Solutions is an Equal Opportunity Employer and all qualified applicants will receive consideration for employment without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability, veteran's status, or, any other protected characteristic.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-31T02:59:59.000Z"
    },
    "company": {
        "name": "Motorola Home &amp; Networks Mobility",
        "link": "https://www.linkedin.com/company/motorola-home-networks-mobility"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Jurupa Valley",
        "region": "CA",
        "postal_code": "91752",
        "street_address": null,
        "latitude": 33.97609,
        "longitude": -117.46219
    }
}