{
    "job": {
        "title": "REMOTE - Software Engineer - Golang, PostgreSQL, AWS",
        "industry": "Computer Software",
        "description": "If you are a Software Engineer with experience, please read on! Top Reasons to Work with Us We are an innovative fintech trust company with unique access that allows us to create payment and banking platforms with unmatched speed, scale and cost. We are breaking new ground in the world of B2B payments and just getting started! We are looking for an impressive Software Engineer to join our team. What You Will Be Doing Build and maintain high-performance scalable distributed services Develop integrations to national and international payments networks Develop elegant solutions to complex problems primarily using Go Work closely with risk managers and payment operations Operate the platform Rapidly fix bugs and solve problems What You Need for this Position Golang PostgreSQL AWS Devops CI/CD Docker SSH What's In It for You Competitve Salary Stock Options Vacation/PTO Medical Dental Vision Bonus 401k Home Office Stipend So, if you are a Software Engineer with experience, please apply today! Email Your Resume In Word To Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also: Alison.Barker@CyberCoders.com Please do NOT change the email subject line in any way. You must keep the JobID: linkedin : AB12-1629860 -- in the email subject line for your application to be considered.*** Alison Barker - Executive Recruiter - CyberCoders Applicants must be authorized to work in the U.S. CyberCoders, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-06-26T16:18:57.000Z"
    },
    "company": {
        "name": "CyberCoders",
        "link": "https://www.linkedin.com/company/cybercoders"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Denver",
        "region": "CO",
        "postal_code": "80247",
        "street_address": null,
        "latitude": 39.738453,
        "longitude": -104.984856
    }
}