{
    "job": {
        "title": "Data Engineer",
        "industry": "Information Technology and Services,Computer Software,Hospital &amp; Health Care",
        "description": "We at Vatica Health are looking for a passionate Data Engineer and Analyst to turn data into information, information into insight and insight into business decisions. You will conduct full life-cycle activities to include requirements analysis and design, develop analysis and reporting capabilities, and continuously monitor performance and quality control plans to identify improvements. Essential Duties And Responsibilities Develop and implement data collection systems and other strategies that optimize statistical efficiency and data quality Interpret data, analyze results using statistical techniques and provide ongoing reports Acquire data from primary and secondary data sources Identify, analyze, and interpret trends or patterns in complex data sets Filter and “clean” data, and review trends of bad data to identify problems Work closely with management to prioritize business and information needs Locate and define new process improvement opportunities Document and maintain documentation around data handling activities and customer Requirements BSc/BA in Computer Science, Engineering or relevant field Proven working experience as a Data & Reporting Analyst Technical expertise regarding data models, database design development, data mining and reporting techniques Strong knowledge of and experience with Microsoft SQL Server, Microsoft SQL Server Integration Services, SQL Server Reporting Services, T-SQL, Microsoft Excel, and Microsoft Powerpoint Strong analytical skills with the ability to collect, organize, analyze, and disseminate significant amounts of information with attention to detail and accuracy Adept at writing T-SQL queries, report writing and presenting findings Risk adjustment and/or Quality experience is a plus Healthcare Industry experience is preferred Benefits WORKING AT VATICA HEALTH ADVANTAGES Prosperity Competitive salary based on your experience and skills – we believe the top talent deserves the top dollar Bonus Potential (based on role and is discretionary) – if you go above and beyond, you should be rewarded 401k plans– we want to empower you to prepare for your future Room for growth and advancement- we love our employees and want to develop within Good Health Comprehensive Medical, Dental, and Vision insurance plans Tax-free Dependent Care Account Life insurance, short-term, and long-term disability Happiness Excellent PTO policy (everyone deserves a vacation now and then) Great work-life balance environment- We believe family comes first! Strong supportive teams- There is always a helping hand when you need it Are you up to the challenge? What are you waiting for? Apply today!",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-17T03:23:49.000Z"
    },
    "company": {
        "name": "Vatica Health",
        "link": "https://www.linkedin.com/company/vatica-health"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Alpharetta",
        "region": "GA",
        "postal_code": "30022",
        "street_address": null,
        "latitude": 34.075615,
        "longitude": -84.29455
    }
}