{
    "job": {
        "title": "Autonomy/AI Machine Learning Research Engineer",
        "industry": "Defense &amp; Space",
        "description": "Summary Description Focuses on research & development of technologies that enable and advance semi and fully autonomous systems for both defense and commercial customers. Serves as the algorithm expert working to enhance machine learning and robotic algorithms. Investigates, optimizes, and applies upto- date knowledge on modern AI research with latest machine learning and deep learning techniques. Develops algorithm implementation requirements. Develops prototypes and may be involved in the inception of ideas and drive the development cycles from research to test of prototypes for a major project or component of a major project. Key Responsibilities Researches and discovers improvements to machine learning and robotic algorithms Drives advancements in techniques used in signal processing, computer vision (CV), and control systems Develops AI algorithms for mission systems Applies latest research on AI algorithms and trains machine learning / deep learning models to solve a variety of problems Investigates and applies the latest machine learning and deep learning techniques Optimizes the performance of AI algorithms, applications, and platforms Develops and documents algorithm and implementation requirements Develops prototypes that will enable autonomous functionality in LM products and platforms Interfaces with other teams involved the development lifecycle for perception, mission and motion planning, simulation and modeling, testing, etc.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-05T14:30:02.000Z"
    },
    "company": {
        "name": "Lockheed Martin",
        "link": "https://www.linkedin.com/company/lockheed-martin"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Littleton",
        "region": "CO",
        "postal_code": "80018",
        "street_address": null,
        "latitude": 39.61265,
        "longitude": -105.0162
    }
}