{
    "job": {
        "title": "Machine Learning Engineer",
        "industry": "Health, Wellness and Fitness,Medical Practice,Hospital &amp; Health Care",
        "description": "Senior Machine Learning Engineer HealthTech Start Up ⚡ ✨ Remote ✨ $200,000 - $250,000 + Equity + Benefits A West Coast HealthTech Company is looking to hire a Senior Machine Learning Engineer. The company has raised over $57 million in Series C Funding to assist their rapid growth. The Machine Learning Engineer will join a multidisciplinary team of talented data scientists, other statisticians, engineers, and researchers to leverage unique healthcare data to answer novel clinical questions. The senior Machine Learning Engineer will ideally have prior experience in the HealthTech space and if not, be a talented Machine Learning Engineer with an interest and passion for working on meaningful real world projects. Responsibilities Build and deploy robust, industrial scale Machine Learning Pipelines Take a lead in facilitating large scale machine learning model integration Collaborate with data science team members and other colleagues across the business in product, science, engineering and business development Continually innovate with the team to ensure the business is at the forefront of technology and medicine, attending conferences and publishing if desired Progress within role to become a leader within the team Requirements MS/PhD in Computer Science, Computer Engineering or related Quantitative field Expert proficiency Machine Learning Pipelines Experience within Cloud Environments (GCP, AWS preferred) Expert proficiency with Python and related libraries Ideally experience with deep learning frameworks such as PyTorch and Tensorflow Strong communication skills as you will be required to collaborate with teams across data, engineering and product Experience or interest in the HealthTech. Experience working in a similar organization would be a big plus but not required Benefits Competitive Salary + Equity/ Stock options Robust healthcare plans and matching 401K opportunity for internal progression Flexible working hours and WFH Unique, talented team within a company that cares about Diversity, Equity & Inclusion The team has just began it’s search and is looking to secure a candidate as soon as possible. 🌎 The office is based in New York but the role is exclusively remote. 📧 Interested in applying? Please click on the ‘Easy Apply’ button or contact tola.adeleye@storm3.com ⚡ Storm3 is a HealthTech recruitment firm with clients across London, Europe and North America. To discuss open opportunities or career options, please visit our website www.storm3.com and follow the Storm3 Linked In page for the latest jobs and intel",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-09-07T09:00:34.000Z"
    },
    "company": {
        "name": "Storm3",
        "link": "https://uk.linkedin.com/company/storm3"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "United States",
        "region": null,
        "postal_code": "99999",
        "street_address": null,
        "latitude": 39.50355,
        "longitude": -99.0183
    }
}