{
    "job": {
        "title": "Senior Software Engineer – Java EE",
        "industry": "Information Technology and Services,Computer Software,Computer Networking",
        "description": "Job Title: Senior Software Engineer – Java EE Location: Milwaukee, WI (Onsite from Day 1) Type: Long Term Contract Key Responsibilities Contribute to software design and architecture, including design reviews Develop high-quality code along with automated unit tests for cloud-based and self-hosted SaaS products Contribute to integration, system, and performance testing, including test tools Take ownership as a highly motivated member of a scrum team Assist with troubleshooting customer problems and finding solutions in a timely fashion Write test cases within an automated test framework for development projects Work within a Scrum environment to plan and deliver incremental software in defined sprints Build strong partnerships with UX designers, Software Developers, and Product Managers Develop software with Java EE for projects Provide technical support to customers on-site Train customers and key-users on installed applications Maintain excellent relationships with all internal and external customers through provision of high-quality service Work within an Agile environment Travel to site during software commissioning phases to ensure that integration testing and site acceptance testing is completed as required Perform presentation(s) of complex technical findings and developments to internal and external customers Design database schemas and contribute to database performance tuning Provide mentorship and training to software team Travel is approximately ~30% Education And Knowledge Bachelor’s degree in Computer Science, Computer Engineering or Software Engineering Master’s degree in Computer Science, Computer Engineering or Software Engineering Preferred Ten or more years in software development Expert in minimum of 3 object-oriented languages Expert knowledge of at least 2 operating systems Knowledge and/or experience with concurrency and/or scalability Expert knowledge of Relational Databases Experience with web-based development for Java applications Software Methodologies: Agile / Scrum Preferred Skills Experience with Tomcat. Experience with JQuery, Bootstrap/AngularJS, JSF, Hibernate, Git, and Apache Ant. Experience with Spring/Struts frameworks, RESTful services. Experience working in a large, enterprise environment. logistics industry experience You can apply via: http://jobd.info/?id=vzGmwz Recruiter Details Praveen Rao (302) 214-0551 praveen_us@falconsmartit.com Find all current job openings at our Career Page https://www.falconsmartit.com/FalconCareer.html Follow us on LinkedIn for Job Opportunities https://www.linkedin.com/company/falconsmartit/",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-20T22:42:26.000Z"
    },
    "company": {
        "name": "Falcon Smart IT (FalconSmartIT)",
        "link": "https://uk.linkedin.com/company/falconsmartit"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 120,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Dover",
        "region": "DE",
        "postal_code": "19901",
        "street_address": null,
        "latitude": 39.15883,
        "longitude": -75.52114
    }
}