{
    "job": {
        "title": "Senior Scientist - Biomarker Development, Translational Medicine",
        "industry": "Pharmaceuticals",
        "description": "Job Description 38! Soluble Biomarkers contributed to advance science in 8 First In Human and >10 Proof of Concept studies. Data contributed to demonstrate pathway engagement, proof of biology and identify the right drug and the optimal dose for the right patient! 25 innovative soluble biomarker methods were developed in >5 disease relevant tissues. 1 purpose...to reimagine medicine! This is an exciting opportunity to join the Molecular & Cellular Sciences (MCS) team within Biomarker Development (BMD) and Translational Medicine (TM) at the Novartis Institutes for Biomedical Research (NIBR). BMD focuses on delivering fit for purpose integrated biomarkers leveraging diverse expertise and knowledge in immunology, genomics, protein and cellular biology and state of the art data sciences. Our innovative spirit enables the development and application of cutting-edge technologies which address key clinical questions such as target engagement, defining disease stage or progression, predict the safety or efficacy of medication, select a group of patients who would benefit most from a given therapy, and identify additional clinical indications suitable for a innovative molecule. As a Senior Scientist within MCS in BMD, you will work in close collaboration with project and clinical teams to develop novel exploratory assays in our state of the art laboratories, implement internal and external biomarker activities and interpret results to enable proof of mechanism, proof of biology, safety and efficacy understanding. As a soluble biomarker assay expert, you will be developing and validating innovative biomarker solutions implementing new methodologies, delivering high quality data and playing a pivotal role in human clinical trials. Your responsibilities will include, but not limited to: Development and validation of soluble biomarker assays with special focus on ligand binding assays (ELISA, MSD, Luminex) and other state of the art technologies. Implementation (sample measurement and data transfer) of validated biomarker assays in clinical studies. Generate and interpret data to enable proof of mechanism, dose selection & proof of biology across early clinical programs and present results at internal meetings Providing subject matter expertise to transition, implement and monitor assay development and validation at CROs Ensuring quality and timely delivery of data generated through outsourced activities Empowered for experimental design, execution, interpretation and reporting (oral and written) of assigned projects under Unboss culture. Contributing to write quality reports and laboratory manuals. Cross training on a variety of biomarker modalities and technologies Our Expectations Develop and validate fit-for-purpose soluble biomarker solutions Independently design, execute, and interpret experiments Ensure high quality and timely delivery of internal and external results Providing subject matter expertise for transferring, implementation and monitoring of soluble biomarker assay development, validation and sample analysis at external provider EEO Statement The Novartis Group of Companies are Equal Opportunity Employers and take pride in maintaining a diverse environment. We do not discriminate in recruitment, hiring, training, promotion or other employment practices for reasons of race, color, religion, gender, national origin, age, sexual orientation, gender identity or expression, marital or veteran status, disability, or any other legally protected status. We are committed to building diverse teams, representative of the patients and communities we serve, and we strive to create an inclusive workplace that cultivates bold innovation through collaboration and empowers our people to unleash their full potential. Minimum Requirements What you will bring to the role: BS/MS degree in Biology, Immunology, Cell biology or equivalent with wide experience as a laboratory technician with 5+ year in the pharmaceutical or biotechnology environment Extensive understanding, knowledge and practical experience in ligand binding assays are essential, and experience on Mass spectrometry and other related technologies will be a plus. Analytical thinking, willingness to accept responsibility, and teamwork skills Experience working in a global organization and matrix-resourcing model Good Computer skills (Excel, Word, PowerPoint, Soft MaxPro, SMART Book, GraphPad Prism, Watson LIMS) Good communication skills for oral and written in English Understanding of regulatory requirement relevant to Biomarker Development (e.g. GCLP, ICH) What Novartis can offer you? Yes, we offer exceptional benefits and competitive salaries. However, we can offer more. Here you will: Work with the latest technologies and applications Get a first hand experience in Translational Medicine for human clinical trials Be part of a world class organization dedicated to providing solutions to unmet medical needs Join an organization that is committed to your development and advancement Why consider Novartis? 769 million patients were impacted by Novartis products in 2020. And while we’re proud of that fact, in this world of digital and technological transformation, we must also ask ourselves this: how can we continue to improve and extend even more people’s lives? We believe the answers are found when curious, courageous and collaborative people like you are brought together in an inspiring environment. Where you are given opportunities to explore the power of digital and data. Where you are empowered to risk failure by taking smart risks, and where people who share your determination to tackle the world’s toughest medical challenges surround you. We are Novartis. Join us and help us reimagine medicine. Division NIBR Business Unit Translational Medicine Country USA Work Location Cambridge, MA Company/Legal Entity NIBRI Functional Area Research & Development Job Type Full Time Employment Type Regular Shift Work No Early Talent No",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-30T23:52:23.000Z"
    },
    "company": {
        "name": "Novartis Institutes for BioMedical Research (NIBR)",
        "link": "https://www.linkedin.com/company/novartis-institutes-for-biomedical-research"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Cambridge",
        "region": "MA",
        "postal_code": "02239",
        "street_address": null,
        "latitude": 42.36525,
        "longitude": -71.10502
    }
}