{
    "job": {
        "title": "Remote Software Engineer",
        "industry": "Information Technology and Services",
        "description": "Modis is hiring for multiple Software Engineers on a Direct Hire basis. These Software Engineers will have the opportunity to work for a growing team. A brief synopsis of the requirements and responsibilities are provided below. Responsibilities Working as part of an Agile Development team, drives feature implementation from planning to release. Confers with the product management team and fellow development team members to gain understanding of needed changes or modifications of existing programs. Resolves questions of program intent, data input, output requirements, and inclusion of internal checks and controls. Writes and maintains programming documentation. Understands and implements role-specific information security access and responsibilities. Ensures safety and confidentiality of data and systems by adhering to the organization's information security policies. Requirements: Bachelor's degree in Computer Science, Information Technology, or equivalent experience 4+ years developing full stack web applications using JavaScript frameworks such as Node.Js, Express, Vue.Js, or other similar JavaScript tools. 4+ years working with database technologies such as MySQL or Microsoft SQL. Hands-on software development experience with a major subset of web technologies such as, REST API multi-tiered solutions, HTML 5 / CSS, and interacting with various Web Servers. Experience with Bootstrap, responsive, fluid design frameworks a plus. Experience with software development concepts such as object-oriented. programming, testing and debugging software, and software deployment. Understanding of systems security, data protection, and data privacy.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-09T17:43:54.000Z"
    },
    "company": {
        "name": "Modis",
        "link": "https://ch.linkedin.com/company/modis"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 48,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Jacksonville",
        "region": "FL",
        "postal_code": "32277",
        "street_address": null,
        "latitude": 30.325968,
        "longitude": -81.65676
    }
}