{
    "job": {
        "title": "Senior Data Scientist (Decision Science)",
        "industry": "",
        "description": "At Retina, we enable businesses to tell data stories about their customers. We use data science to predict future buying behavior of consumers and recommend actions that businesses can take around those predictions. Our founding team has led data science teams at Facebook and Paypal, built and sold companies, and built the core tech behind several startups. We are venture-funded and looking for the next few passionate team members who want the opportunity to transform the world. The Decision Sciences pod is a new product development team with the mission to empower better decisioning using customer data. We build and sell products that drive actionability for savvy marketers and customer analytics managers. Our scientists, engineers, and designers leverage Retina’s trusted CLV scores to design world-class solutions using optimization theory, control theory, and machine learning. As a Senior Data Scientist for Decision Sciences, you’ll be responsible for posing and solving modeling problems for Retina’s new wave of products. You will own the proof of concept solutions to challenging product research problems. You will pose, research, build, and test the team’s models and algorithms, as well as master all available data sources. You will report to the Head of Data as you progress along your career track, and work closely with the Decision Sciences Pod Lead to drive company impact. Responsibilities : Translate real-world problems into well-posed data science questions with product-oriented specifications Identify models, algorithms, and approaches that solve problems and meet constraints Build, implement, and test your concepts in Jupyter notebooks and Python, using real and simulated data Deliver innovative and data-driven results on pace with the team’s Sprint cycle Collaborate with software developers to write and test packages that execute at scale Collaborate with product to craft an intuitive narrative about our team’s competitive advantage and “secret sauce” Prioritize simple, correct, and effective solutions above complex, interesting, and riskier ideas Qualifications : 5+ years of experience successfully delivering data science projects to stakeholders Advanced degree in a related field or equivalent Familiarity with at least two of the following: A/B testing, bandits, control theory, mathematical optimization, convex optimization, machine learning Experience working with engineers and product managers to launch successful software products Experience working with SaaS and knowledge of marketing tech stack products Experience with Python, Spark, Jupyter Notebooks, unit testing, or equivalent Join a team of innovators. Here's why you'll love working at Retina: Ownership: Take ownership of products, client relationships, and the trajectory of your role. Working in a startup means you’re a vital member of a small team — and your work will definitely be noticed. Exciting challenges: Our product is solving business challenges in new and exciting ways. You’ll deliver capabilities companies don’t even know they need yet, and learn amazing things along the way. Innovation: Your coworkers will be the type of people who take risks, welcome new perspectives, and live for great new ideas. Learn how to approach problems differently and with agility. Unlimited opportunities: Encounter endless opportunities that fall outside of your wheelhouse. At Retina, you will try out new skills and gain valuable experience that puts you on a career path you love. Great culture: You can always rely on your team. Our culture is all about learning, growing, and working together to build something great. Find out what it’s like to work with the best.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-09T20:16:46.000Z"
    },
    "company": {
        "name": "Retina AI",
        "link": "https://www.linkedin.com/company/retina.ai"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Santa Monica",
        "region": "CA",
        "postal_code": "90403",
        "street_address": null,
        "latitude": 34.010933,
        "longitude": -118.491516
    }
}