{
    "job": {
        "title": "Member Of Technical Staff - DevOps and Site Reliability Engineer (SRE)",
        "industry": "Information Technology and Services,Computer Software,Financial Services",
        "description": "Job Description DevOps and Site Reliability Engineer (SRE) - Oracle Business Objects Services Team Oracle is a leader in enterprise cloud applications powering many of the world’s largest organizations, and we’re in the process of revolutionizing our application user experiences with our new Redwood user interface components and enterprise-scale backend services . We are on a quest to provide the most productive platform with extremely fast, secure, and extensible REST services to back these user experiences. Our goal is to create a universal services and transaction service s that is metadata-oriented and is simple to uptake, test, debug, and monitor. These services must be highly scalable and dynamic to meet the varying work loads for our customers. We have many large scale customers who are ready to work with you on this fabulous journey. We’re looking for talented DevOps/SRE engineers to build, deploy and monitor the service on Oracle Cloud. If you have experience as a DevOps engineer supporting CI/CD, rollout, patching, monitoring enterprise scalable micro services using cloud native infrastructure please contact us right away. What You'll Do Bringing in the right “DevOps” mindset among the teams developing software, conducting training on tools and processes that makes software development and testing easier. Participate in the entire software Lifecycle – development, testing, CI and production operations of critical cloud native microservices Automate release and deployment process from development to production rollout following CI/CD process using standard DevOps toolset Solve complex problems related to infrastructure cloud services and build automation to prevent problem recurrence. Take ownership of maintaining and managing the environments. Maintain separation between Dev, UAT, stage and production environments. Monitoring, orchestration, and configuration management experience in cloud infrastructure Serve as part of a 24x7 On Call rotation in support of the SAAS Infrastructure Service Suite with the engineering team Act as ultimate escalation point for complex or critical issues that have not yet been documented as Standard Operating Procedures (SOPs). Work with customers and ISVs and service developers to troubleshoot issues in production systems. Mentor new employees and constantly improve the process of knowledge sharing across the team Required Knowledge And Skills B.S., M.S. in Computer Science, Electrical Engineering with 2-3 years of professional experience in Cloud Infrastructure and Cloud Solutions Professional work experience working on complex applications/services with DevOps Experience. Strong knowledge of Linux/UNIX Shell scripting, package management etc Hands on experience working with standard DevOps tools Kubernetes, Docker, Istio, Grafana, Helm Charts, Terrafarm Experience with Build A utomation tools like Maven, ANT, Gradle, Jenkins and bug tracking tools like JIRA Source control tools like Git, GitHub, SVN or equivalent Container administration and development utilizing Kubernetes, Docker, Mesos, or similar Excellent Java development experience (JDK 9 or above) Knowledge of Monitoring technologies (Enterprise Manager, Thousand Eyes, Prometheus) will be an advantage. Teamwork is key here. We are looking for developers who believe in the value of cross team collaboration. Excellent oral and written communication skills. Self motivated to continuously learn and improve. Design, develop, troubleshoot and debug software programs for databases, applications, tools, networks etc. As a member of the software engineering division, you will apply basic to intermediate knowledge of software architecture to perform software development tasks associated with developing, debugging or designing software applications or operating systems according to provided design specifications. Build enhancements within an existing software architecture and occasionally suggest improvements to the architecture. Duties and tasks are standard with some variation; displays understanding of roles, processes and procedures. Performs moderately complex problem solving with assistance and guidance in understanding and applying company policies and processes. BS degree or equivalent experience relevant to functional area. 1 year of software engineering or related experience. About Us Innovation starts with inclusion at Oracle. We are committed to creating a workplace where all kinds of people can be themselves and do their best work. It’s when everyone’s voice is heard and valued, that we are inspired to go beyond what’s been done before. That’s why we need people with diverse backgrounds, beliefs, and abilities to help us create the future, and are proud to be an affirmative-action equal opportunity employer. Oracle is an Equal Employment Opportunity Employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability and protected veterans status, age, or any other characteristic protected by law. Oracle will consider for employment qualified applicants with arrest and conviction records pursuant to applicable law.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-16T18:25:30.000Z"
    },
    "company": {
        "name": "Oracle",
        "link": "https://www.linkedin.com/company/oracle"
    },
    "education": {
        "required_credential": null
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Redwood City",
        "region": "CA",
        "postal_code": "94064",
        "street_address": null,
        "latitude": 37.4805,
        "longitude": -122.21528
    }
}