{
    "job": {
        "title": "Software Engineer",
        "industry": "Financial Services",
        "description": "Finland Fast Track Program This role is under the Finland Fast Track Program, an initiative of the Finland government to encourage exceptional international talent, specifically from the USA, to find fulfilling roles in the budding gaming and ICT industry in Finland. This role is based in Finland. Applicants are encouraged to and offered fast-track support to relocate there for this role, and the city you’ll move to will welcome you and your family with several relocation services. Job Description ABOUT ENFUCE The thing with us is that we certainly are not an uptight corporation but a highly eager group of people who are admittedly very skilled with tech and we know the ins and outs of the Payment Industry. We are Finland’s biggest fintech startup and an award-winning innovative service provider operating from the cloud. We are at the forefront in the Payment Industry and enable players in the Payment Industry to partner up fast and reliably. Our company consists of Industry experts with vast knowledge and experience within payments and tech and together we enable the ecosystem around payments to evolve and grow. Innovative technology is the core of our services. We provide a wide range of Payment, Open Banking, and Sustainability services run in the cloud. All of our services are designed for security, compliance, and scalability. As of this moment, we have over 10 million end-users, are operating globally, and constantly innovating new services to better serve our customers. What is the role all about? At Enfuce, the Software Engineer is part of the team that develops and maintains our software as well as our infrastructure. We do not mind exploring new technologies as we want to find the best solution to fulfil the need. Which means that you can be working on everything from Linux and Windows, Oracle databases, Java code to python scripts. What you will be working on depends on your skills and your will to learn new and the latest things. Keys to success in this role You'll definitely succeed in this role by being curious, persistent and logical – a true techie who enjoys living by the code of your craft by developing elegant solutions for complex problems. If this sounds like you, then this is the perfect opportunity to join us! If you have one or several of these attributes, we are definitely interested: AWS experience Experience from DevOps tools Java skills Natural curiosity for thinking in systems and logical problem solving Agile mindset (understanding and interest towards agile principles) Willingness to take responsibility and ownership of your work A team player with good communication skills What we can offer you At Enfuce, one of our key characteristics is constant knowledge sharing and willingness to help each other. In fact we have people who are highly experienced in the field and are experts in tech. This is a permanent position and you would be working mostly from our Espoo or Mariehamn Office but we are a modern workplace where remote working is also possible. Along with salary and other perks & benefits, we offer a stock option program. A background check for employment is conducted for this role.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-14T14:42:56.000Z"
    },
    "company": {
        "name": "Enfuce",
        "link": "https://fi.linkedin.com/company/enfuce"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Colorado",
        "region": "United States",
        "postal_code": "80425",
        "street_address": null,
        "latitude": 38.99855,
        "longitude": -105.54783
    }
}