{
    "job": {
        "title": "Software Engineer",
        "industry": "Computer Software,Internet,Hospital &amp; Health Care",
        "description": "In 2017, the U.S. alone spent over $80 billion a year researching and treating cancer. Despite new developments and the progress being made: Treatment approaches are complex and vary widely We don’t really know how treatments perform outside of clinical trials, in the real world Patients have a hard time understanding their disease and navigating their care The Position Outcomes4Me is seeking a Software Engineer to take a founding position on our engineering team. You should have a high degree of comfort developing high-quality, lovable experiences and robust, scalable systems. What you'll work on : Work closely with cross-functional teams to design, architect, and implement new products and features Execute and drive all phases of the product development lifecycle (conception, design, build and scale) Drive your ideas and help evolve the technical roadmap Contribute to all areas where software is needed: backend, frontend, back office, data warehousing, reporting, etc. Regularly communicate with other engineers, team leads, and executives Promote teamwork, research cutting-edge technology, and create a work atmosphere that encourages continuous innovation What we're looking for: 2+ years of full-time hands-on engineering experience Experience with TypeScript, JavaScript, React, React Native, and/or Node Competency in data structures, algorithms, and software design Eagerness to work in a full-stack, collaborative environment Familiarity with AWS Bachelor’s degree or higher in computer science or engineering You're a good fit if you're a: Confident leader Energetic spirit Insightful thinker Thoughtful do-gooder Caring human What you'll find here : Purpose: If you gain strength from doing important work, you belong on our team. Challenge: We’re improving the lives of people who need us. We have big challenges ahead and the motivation to overcome them. Trust: We’re building a culture of independence. That means we’re going to trust and support you in making the right decisions. Transparency: You need to see the whole picture if you’re going to make an impact. Modernity: We took a vote, and Git narrowly beat out SVN and CVS. Yippee! (j/k) This full-time role is based in Cambridge, MA. Learn more about us at We are committed to building a diverse team that represents a variety of backgrounds, viewpoints, and skills. We believe that the more inclusive we are, the better the products we build will be. Outcomes4Me is an equal opportunity employer and will not discriminate against any employee or applicant on the basis of age, color, disability, gender, national origin, race, religion, sexual orientation, veteran status, or any classification protected by federal, state, or local law. Powered by JazzHR J6AzD2xMUr",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-04T19:16:27.000Z"
    },
    "company": {
        "name": "Outcomes4Me ",
        "link": "https://www.linkedin.com/company/outcomes4me"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Cambridge",
        "region": "MA",
        "postal_code": "02239",
        "street_address": null,
        "latitude": 42.36525,
        "longitude": -71.10502
    }
}