{
    "job": {
        "title": "Senior DevOps Engineer",
        "industry": "Information Technology and Services,Insurance,Hospital &amp; Health Care",
        "description": "DevOps Engineer / Senior DevOps Engineer U.S. citizenship is required for this position due to Department of Defense restrictions* Role Summary This position can be filed at the Professional level or the Senior level. Part of a dynamic team, you will be responsible for the installation, upgrade, and support of enterprise Linux servers and applications. As WPS embraces DevSecOps, most of our Linux systems are automated through a continuous delivery pipeline. To be successful in this role, you must be passionate about infrastructure automation, DevSecOps and must love to help customers solve complex issues with automated solutions. In This Role You Will Use and develop WPS’ continuous delivery pipeline to build, deploy, patch and manage Linux servers and applications. Help ensure security of WPS systems and data by automating compliance checks and standards through the CI/CD pipeline. Learn all aspects of compliance on Linux based systems as you secure systems and participate in system audits. Work with other team members and teams to facilitate adoption of DevSecOps processes. Introduce, design, and implement new technologies to streamline business processes. Work on automation of COTS deployment using CI/CD technology, and design & implement solutions based on design requirements. This Role Could Be a Good Fit If You Want to work on moderately complex projects independently or as part of a larger project team. Can handle multiple competing initiatives and escalate issues effectively, efficiently and independently. Are interested in working with technically adept team members that collaborate to solve complex problems. Would thrive working with a leader that encourages autonomy, ideation and independence while maintaining strong team cohesion. Have a passion for technology, process improvement, and a strong interest in innovation and automation. Are experienced with configuration management concepts and infrastructure automation. You have demonstrated experience in customer-focused solution development. Are extremely detail oriented You enjoy improving your own (and your teammates’) technical skills You’ll Benefit From This Experience By Providing technical assistance to clients both internal and external. Working in an environment that will challenge you, and allow you to challenge others. Working in an environment that serves our Nation’s military, veterans, Guard and Reserves along with their families. You Need To Have U.S. citizenship is required for this position due to Department of Defense restrictions. Bachelor's Degree in related field or equivalent post high school and/or related work experience. Senior Level: 1 year or more of related work experience. We Highly Prefer Senior level: - 4 or more years in information systems performing system administration. Professional level: - 2 or more years in information systems performing system administration. Strong grasp of the Linux platform, including understanding how the operating systems functions and package deployment methodology. Strong programming and scripting skills in at least one of the following languages: Bash, Python, Java or Ruby. Hands-on experience with at least one configuration/deployment management system, such as Chef, Puppet, Ansible, Salt or other similar tools. Proficiency with version control system workflows, such as TFS, Git, Subversion, etc. CI/CD pipeline development experience for software delivery using Jenkins, GitLab, Bamboo or similar tools. Knowledge and hands-on experience with source code repository processes and tools, such as Artifactory. We Also Prefer Experience with ServiceNow or similar ticketing systems Experience working in a highly secure environment Puppet code testing with rspec or similar tools. Experience with unit/system testing Understanding of DISA, NIST, FISMA, DoD, and/or CMS audit requirements Nice To Have Experience with container management using OpenShift or Kubernetes. Experience with working in cloud environments like AWS, Azure and Google. This role is open to 100% remote work Approved States: Arizona, Colorado, Connecticut, Florida, Georgia, Illinois, Indiana, Iowa, Michigan, Minnesota, Missouri, Nebraska, New Jersey, North Carolina, North Dakota, South Carolina, Texas, Virginia, Wisconsin Your Team You will be part of the DevOps - Linux and Core Infrastructure team, responsible for building and configuring the key technology components relied upon by WPS and all our business units. This is a small team, responsible for Linux, Unix, VMware, and server hardware. Two Senior and one Junior Linux Administrators will be your mentors. Our Sr. level individuals eventually will help train, coach, and support other team members (and other WPS teams) to write code that will manage infrastructure and application configurations. Compensation And Benefits Eligible for annual Performance Bonus Program 401(k) with dollar-per-dollar match up to 6% of salary Competitive paid time off Health and dental insurance start DAY 1 Vision insurance Flexible spending, dependent care, and health savings accounts Short- and long-term disability, group life insurance Innovative professional and cognitive development programs Who We Are WPS Health Solutions is an innovator in health insurance and a worldwide leader in claims administration, serving millions of beneficiaries in the United States and abroad. Founded in 1946, WPS offers health insurance plans for individuals, families, and seniors, and group plans for small and large businesses. We are a world-class claims processor and program administrator for the government’s Medicare program. And we manage benefits for millions of active-duty and retired military personnel and their families. WPS has been named one of the World's Most Ethical Companies® by the Ethisphere® Institute for 10 years in a row . Learn more about WPS . Our Purpose and Values Our purpose is to make healthcare easier for those we serve. Click Here Our values - Customer Focused, Individual Responsibility, Mutual Respect, and Driven & Passionate - are the core of who we are and how we conduct business every day. Health Insurance WPS Health Insurance offers high-quality health insurance plans for individuals and families, Medicare supplement plans for seniors, and group health plans for businesses of every size. http://wpshealthsolutions.com/business-units/wpshi.shtml Military and Veterans Health WPS Military and Veterans Health administers claims and provides customer service and related activities for the U.S. Department of Defense and the U.S. Department of Veterans Affairs and their beneficiaries. http://wpshealthsolutions.com/business-units/wpsmvh.shtml Government Health Administrators WPS Government Health Administrators manages Medicare Part A and Part B benefits for more than 7 million beneficiaries. As one of the largest contractors for the Centers for Medicare & Medicare Services, we’ve served Medicare beneficiaries and their health care providers since 1966. http://wpshealthsolutions.com/business-units/wpsgha.shtml WPS Health Plan WPS Health Plan offers Health Maintenance Organization and Point-of-Service plans to the group and individual markets in eastern and north-central Wisconsin, plus third-party administrator services. http://wpshealthsolutions.com/business-units/wpshi.shtml EPIC Specialty Benefits EPIC Specialty Benefits provides businesses group insurance products that cover: Life Disability Dental Vision Voluntary benefits http://wpshealthsolutions.com/business-units/epicsb.shtml Stay connected: Sign-up for Job Alerts FOLLOW US! Facebook Twitter LinkedIn",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-25T17:51:30.000Z"
    },
    "company": {
        "name": "WPS Health Solutions",
        "link": "https://www.linkedin.com/company/wps-health-solutions"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 48,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Iowa",
        "region": "United States",
        "postal_code": "50056",
        "street_address": null,
        "latitude": 42.074657,
        "longitude": -93.50006
    }
}