{
    "job": {
        "title": "Data Scientist",
        "industry": "Marketing and Advertising,Information Technology and Services,Computer Software",
        "description": "Nice to meet you. Simply put, we’re a growth firm. Leading companies hire us to help their organizations reach their full potential by putting people first and creating change that matters. How, you ask? We help our clients find and engage new markets & customers, pioneer new ventures, and create new products, services and business models that will transform their organizations. Who We Want. We love passionately curious people who think of themselves as lifelong learners. They are humble, engaging and intelligent. They have strong opinions with open minds. They are proactive and entrepreneurial. Critical thinking is their sharpest tool, and they fearlessly tackle tough problems. They understand that understanding is a key part of building trust and driving positive outcomes. That’s why they lead with empathy—motivating internally and externally, and having the hard conversations when needed. They believe that teams do it best, and the best outcomes come from hearing perspectives that aren’t their own. At Three Five Two, we push for everyone to find and use their voice, and respecting each others’ is non-negotiable. What’s the Day to Day Role? We are looking for a Data Scientist to help our clients and internal teams interpret and act on their data. You will work alongside diverse teams of passionate strategists, researchers, developers, designers, and marketers to create comprehensive business strategies and digital solutions. Your clients could include SaaS products, startups, Fortune 100 companies, and more. We are looking for someone with a solid blend of technical aptitude, strategic thinking, and great communication skills. Requirements 2+ years working in a data science role Comfortable using SQL and working with data across disparate, complex data sources Strong knowledge of Python or R Strong understanding of applied statistics and machine learning algorithms, including methodologies for regressions, classification, clustering, and causality Excellent ability to interpret problems, synthesize analysis, and present information in an effective way Able to confidently build data science driven solutions to understand and solve business challenges Strong communication skills and comfort working directly with partners and clients Enthusiasm for learning and desire to develop new skills Extra Credit Experience with experimental design and A/B Testing analysis Comfortable using BI tools including Tableau and PowerBI Experience working directly with software development teams and deploying data science solutions Previous consulting or professional services experience Benefits What You'll Get Freedom We trust you to do your thing and do it well. Professional Development We set aside a training budget because we want to invest in you. Benefits Health and dental insurance, employer-match 401K retirement program, PTO policy and more. A few more important things we as a company support, understand & value Black lives matter Great ideas and talent can come from anywhere Non-traditional paths are OK So are traditional ones We welcome people from all backgrounds who seek the opportunity to help build a future where everyone and everything can move independently. If you have curiosity, passion, and collaborative spirit, work with us, and let’s move the world forward, together. Three Five Two is an Equal Opportunity Employer and Prohibits Discrimination and Harassment of Any Kind Three Five Two is committed to the principle of equal employment opportunity for all employees and to providing employees with a work environment free of discrimination and harassment. All employment decisions at Three Five Two are based on business needs, job requirements and individual qualifications, without regard to race, color, religion or belief, national, social or ethnic origin, sex (including pregnancy), age, physical, mental or sensory disability, HIV Status, sexual orientation, gender identity and/or expression, marital, civil union or domestic partnership status, past or present military service, family medical history or genetic information, family or parental status, or any other status protected by the laws or regulations in the locations where we operate. Three Five Two will not tolerate discrimination or harassment based on any of these characteristics. Three Five Two encourages applicants of all ages. Three Five Two will provide reasonable accommodation to employees who have protected disabilities consistent with local law.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-06-26T05:43:28.000Z"
    },
    "company": {
        "name": "Three Five Two",
        "link": "https://www.linkedin.com/company/threefivetwo"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Gainesville",
        "region": "FL",
        "postal_code": "32641",
        "street_address": null,
        "latitude": 29.651976,
        "longitude": -82.32502
    }
}