{
    "job": {
        "title": "Jasper Reports Developer and Software Engineer",
        "industry": "",
        "description": "Jasper Reports Developer and Software Engineer Systems & Software - Remote As a Developer for Systems & Software, you will be placed into a small Agile Development team. Your primary responsibilities in this role will include new feature implementation, troubleshooting bug fixes, new quotes, and supporting complex technical systems (where you will play an important role in helping design, build, test and deploy our products). You will work with other members on your team to support our current product lines and build out the future of our product. You will have access to the latest tools, hardware, and some of the brightest software engineers in the industry. The successful candidate will report to the Client Development Manager, Professional Services. What will be your impact? ·       Provide technical leadership and mentoring to team members ·       Facilitate thorough root cause testing/research on major findings and ensure appropriate corrective and preventive actions are developed and implemented in a timely manner ·       Implement product designs by programming in a variety of languages and using a variety of technologies ·       Produce accurate effort estimates for large- and small-scale tasks, and work with the Client Development Manager to track development progress and timelines ·       Complete software development tasks – bug fixes, customer-driven feature development, product enhancements ·       Collaborate with the R&D team on development methodology, processes, and associated tools ·       Assist Professional Services, R&D and Support Departments with design reviews and escalated issues ·       Work with QA, promote best practices to ensure a high level of quality within the team ·       Manage code reviews and closely participate in providing feedback on others’ designs/code. ·       Identify when junior engineers need help and providing it in a positive way that promotes confidence. ·       Identify and mitigate issues and risks that could negatively impact project timelines. What are we looking for? ·       B.S. in Computer Science or Computer Information Systems or equivalent work experience. ·       3+ years experience with Jasper Reports. Ability to create professional forms, letters, and Bills using Jasper Reports. ·       Proven experience with Oracle and PL/SQL or MS SQL Server and Transact-SQL ·       Experience with billing and/or accounting applications ·       Experience building cloud-based architectures ·       Experience with Web Services (REST, SOAP, JSON, and MultiSpeak) preferred ·       Ability to design and develop well-structured, custom application software following such principles as object-oriented design and service oriented architecture ·       Possess an excellent work ethic, high level of initiative, aptitude and energy in order to succeed in a fast-paced environment ·       Effectively worked with all levels of management across the organization ·       Has excellent interpersonal skills and effectively communicates well with both internal and external resources ·       Has mindset and desire to embrace learning, working well within a team or unsupervised What will help you stand out: ·       1+ years as a Full Stack software developer working with some or all of the following technologies: Front End technologies (Angular, React, one of many JavaScript libraries, JSP) Core Technologies (Java, Python, Procedural SQL, SOA & MVC Architecture, Micro Focus COBOL) ·       Proven Unix/Linux knowledge/background ·       Solid experience delivering highly scalable web applications ·       Knowledge of the public utility sector ·       Experience working directly with clients and Third-Party vendors on system integrations What we offer: ·       The opportunity to work on challenging projects ·       3 weeks' vacation and 5 personal days ·       Comprehensive Medical, Dental and Vision coverage from your first day of employment ·       Employee stock ownership and RRSP/401k matching programs ·       Flexible work options Salary/Benefits Salary will be commensurate with experience and job responsibilities. Harris offers excellent fringe benefits including vacation, retirement plan, health, dental, life and disability insurance. Location This opportunity can be performed remotely or from our office in Winooski, VT. About Us – Systems & Software We are an agile development organization, utilizing Kanban on the support side and Scrum for our development teams. We use industry standard software development tools such as Jira, Git, Docker, Slack, and Confluence to manage our iterative design, build, test, and deploy process. Since 1973 it has been our unrelenting mission at Systems and Software to provide quality customer information system solutions to municipal and investor-owned utilities. To achieve that mission, we fully understand the importance of a committed, engaged group of developers, implementers and support staff. Click here (https://www.ssivt.com/) to learn more about Systems and Software!",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-09T20:21:36.000Z"
    },
    "company": {
        "name": "Systems &amp; Software",
        "link": "https://www.linkedin.com/company/systems-and-software"
    },
    "education": {
        "required_credential": null
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Las Vegas",
        "region": "NV",
        "postal_code": "89159",
        "street_address": null,
        "latitude": 36.16909,
        "longitude": -115.14058
    }
}