{
    "job": {
        "title": "Deep Learning Analytics – Senior Advanced Data Scientist / Software Engineer (REMOTE)",
        "industry": "Information Technology and Services,Defense &amp; Space,Computer Software",
        "description": "General Dynamics Mission Systems (GDMS) engineers a diverse portfolio of high technology solutions, products and services that enable customers to successfully execute missions across all domains of operation.  With a global team of 13,000+ top professionals, we partner with the best in industry to expand the bounds of innovation in the defense and scientific arenas.  Given the nature of our work and who we are, we value trust, honesty, alignment and transparency.  We offer highly competitive benefits and pride ourselves in being a great place to work with a shared sense of purpose.  You will also enjoy a flexible work environment where contributions are recognized and rewarded.  If who we are and what we do resonates with you, we invite you to join our high performance team! General Dynamics is an Equal Opportunity/Affirmative Action Employer that is committed to hiring a diverse and talented workforce.  EOE/Disability/Veteran Basic Qualifications: Bachelor’s of Science or Arts in a STEM (Science, Technology, Engineering, Mathematics) related field plus 8 yrs or Master’s degree plus 6 yrs. Clearance Requirements: Ability to obtain a Department of Defense Top Secret security clearance is required at time of hire. Department of Defense Top Secret security clearance is preferred . Applicants selected will be subject to a U.S. Government security investigation and must meet eligibility requirements for access to classified information. Due to the nature of work performed within our facilities, U.S. citizenship is required. Deep Learning Analytics Center of Excellence (DLACoE) is looking for a seasoned, experienced professional having a wide range of data integration, data visualization, big data and programming skills, possessing a demonstrated understanding of artificial intelligence or machine learning with the ability to apply these skills under real world conditions. Duties and Tasks: Lead the design and development of machine learning algorithms to support and achieve customer goals Accountable for the direction and completion of a project Perform program management duties Draw on expertise and research to apply data science and machine learning to challenging problems over a broad range of domains Direct and collaborate with a dispersed and diverse team of engineers and scientists to implement data driven solutions Represent DLA CoE as a subject matter expert (SME) across the organization and with senior leaders Assignments vary by task and may require you to: Wrangle, preprocess and manipulate data for use in machine learning algorithms Develop a proficiency with deep learning algorithms, design considerations, and methods to overcome limitations or constraints due to hardware or data Plan and conduct experiments to improve model performance Export deep architectures onto a small SWAP hardware platform (such as an FPGA or GPU SoC systems) Optimize deep architectures for performance, and implement systems to formalize and support such optimization Communicate results to team members and external non-technical leadership Provide mentoring and training to team members Collaborate with customer/domain experts through research and development Contribute to technical proposals and business development Present new concepts clearly through oral and visual media Excellent written and verbal communications skills Technical Skills: Machine learning and deep learning in Python and CUDA (including scikit-learn, TensorFlow, Caffe / Caffe2, PyTorch, etc.) DevOps, including machine provisioning (e.g. Vagrant, Puppet, Docker) Familiarity with the Linux command line (bash scripting) Experience working with large, complex datasets (images, cyber, NLP, and other signals) Distributed version control systems (e.g. git) Data preparation and corpus filtering (with PostgresSQL, mySQL, and other DBs) Validation methods Experimental design #CJ3",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-06T19:34:00.000Z"
    },
    "company": {
        "name": "General Dynamics Mission Systems",
        "link": "https://www.linkedin.com/company/gdms"
    },
    "education": {
        "required_credential": null
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "United",
        "region": "PA",
        "postal_code": "15689",
        "street_address": null,
        "latitude": 40.218006,
        "longitude": -79.49159
    }
}