{
    "job": {
        "title": "Data Scientist",
        "industry": "",
        "description": "·        Apply statistics, mathematics, data science, machine learning techniques and solutions meet software requirements. ·        Design and implement machine learning architecture and methods per client’s requirement. ·        Enhance and maintain current analysis tools, including automation of current processes using AI/ML algorithms. ·        Build supervised and un-supervised models for risk prediction, anomaly detection and timeseries analysis. ·        Conduct quantitative data analysis using a variety of large structured and unstructured datasets, including developing retrieval, processing, fusion, analysis, and visualization of various datasets. ·        Identify and test hypotheses, ensuring statistical significance, as part of building predictive models for business application. ·        Translate quantitative analysis, findings into accessible visuals for non-technical audiences, and provide a clear view into data interpretation. ·        Enable business to make clear tradeoffs between and among choices, with a reasonable view into likely outcomes. ·        Maintain understanding of strategic goals, business challenges and customer needs. ·        Write clean scripts for data analysis, ETL, and visualization. ·        Prepare and present findings of investigations & solutions to stakeholder. ·        Help your team understand use of various analytics/statical/ machine learning tools and methods. ·        Bring your curiosity, innovative spirit, and passion to deliver on the promise of technology in a difficult, competitive, and exciting vertical. Required Qualifications & Experience: ·        Master’s degree or higher in Computer Science, Data Science, Engineering, Mathematics, Applied Statistics, or related field. ·        Experience 3+ years with machine learning in industry environment. ·        Experience 5+ years coding in Python, Scala, or similar. ·        Advanced understanding of probability, statistics, machine learning, data science. ·        Expertise in data correlation/feature analysis, analysis of machine learning models, and optimizing models for accuracy. ·        Proficiency in transforming and cleaning data & working across multiple models. ·        Ability to research and manipulate complex and large data sets (both distributed and non-distributed). ·        Strong fundamentals in problem solving, algorithm design, and model building. ·        Ability to solve complex business problem through logical and creative thinking. ·        Strong ability to synthesize complex information. ·        Excellent Code writing capability in Python and familiarity with relevant ML packages. ·        Familiarity with libraries such as Pandas, Scikit-learn etc. ·        Experience of working on Fraud detection solution. ·        Excellent knowledge of anomalies/outliers detection using unsupervised algorithms – clustering, Local Outlier Factor, Isolation Forest , etc. ·        Deep learning experience would be added advantage. ·        Experience with Spark DataBricks frameworks. ·        Interest in applying data science in the fields of compliance. ·        Strong written and verbal communication skills. Title : Data Science Analyst Roles & Responsibilities Partner with clients to develop strong understanding of business needs and use business understanding to help design effective analytical solutions. Perform all data preparation and exploratory data analysis steps. Apply common statistical methods, data modeling to answer strategic questions for the business. Mine complex digital behavioral data, unveil insights and transform it into actionable information. Conduct quantitative data analysis using a variety of large structured and unstructured datasets including developing retrieval, processing, fusion, analysis, and visualization of various datasets. Identify and test hypotheses, ensuring statistical significance, as part of building predictive models for business application. Translate findings into succinct, actionable business insights, and coordinate with technical/ business partners to prepare holistic story. Use advanced data visualization techniques to communicate solutions to business stakeholders. Guide implementation, testing, and evaluation of models. Present methodology and findings of analysis to a broad range of audiences, including both technical and non-technical, at all levels of the organization. Enable business to make clear tradeoffs between and among choices, with a reasonable view into likely outcomes. Collaborate closely with other members of the analytics and data science team and the Harman data science community. Articulate complex ideas clearly to a nontechnical business audience. Manage and control changes & scope. Lead analysis, design, development, implementation, and post implementation phases of data science modules. Lead work progress and address any questions or challenges regarding projects. Own progress reporting. Lead planning, execution, and delivery of data science modules within program. Identify risks, gaps, and opportunities and communicate to stakeholders and other teams to drive resolution Required Qualifications & Experience: Master’s degree or higher in Computer Science, Data Science, Engineering, Mathematics, Statistics, or related field. Advanced understanding of probability, statistics, machine learning, data science. Expertise in data correlation/feature analysis, analysis of machine learning models, and optimizing models for accuracy. Proficiency in transforming and cleaning data & working across multiple models. Ability to research and manipulate complex and large data sets (both distributed and non-distributed). Strong ability to synthesize complex information. 3+ years’ experience in Python, Scala, Power BI, Excel, or similar. Excellent knowledge of anomalies/outliers detection using unsupervised algorithms – clustering, Local Outlier Factor, Isolation Forest , etc. Strong written and verbal communication skills. Experience in stakeholder management. Experience in leading cross geography data science teams.",
        "employment_type": "CONTRACTOR",
        "date_posted": "2021-08-02T19:38:27.000Z"
    },
    "company": {
        "name": "Blackapple Solutions LLC",
        "link": "https://www.linkedin.com/company/blackapplesolutionsllc"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Bellevue",
        "region": "WA",
        "postal_code": "98007",
        "street_address": null,
        "latitude": 47.6137,
        "longitude": -122.19093
    }
}