{
    "job": {
        "title": "Senior Software Engineer, Stealth Startups",
        "industry": "Computer Software,Internet,Financial Services",
        "description": "Rex is a billion-dollar technology, investment, and real estate company led by Executive Chairman Peter Rex. We're looking for world-class Senior Software Engineers with the character, skill, and backbone to build the next great technology business. This is a greenfield development effort and you will be a foundational engineer building from inception through to a production-ready product ready to scale. We are launching a number of companies in our ecosystem focused on PropertyTech, FinTech, and InsuranceTech. You can learn more about each stealth startup by checking out our initiatives page. You will be a foundational engineer at one of these companies so we are looking for people passionate about building new technologies that can serve people and can effectively own development efforts. What You'll Do You have the experience of leading development efforts which include questioning everything around you, verifying the job is done, being deadline-driven, and executing Experience architecting backend systems for web and mobile applications with a long-term goal of building scalable systems You’ll partner with a designer and product leader, and will contribute to either role as needed You’ll write reusable, well documented code that is easy to maintain You will stay disciplined with code reviews, without losing the fast-paced demands of a startup You’ll ensure we build quickly, yet always in a way that doesn’t preclude scaling You will act as a thought partner within the founding team to ensure the platform is built well to meet both short-term goals and long-term durability and growth Who You Are You have 6+ years of experience of software design and development with a product mindset You have experience architecting backend systems for web and mobile applications with a long-term goal of building scalable systems You are able to take on complex problems, learn quickly, and push relentlessly towards scalable solutions You have experience coding in Java, Kotlin, or similar language; you consider yourself a polyglot You have a strong knowledge of API development with either Rest or GraphQL You feel comfortable with building systems on cloud-based infrastructure platforms You have experience working with continuous delivery, automated deployments (CI/CD) and related engineering practices and tools You have some experience with frontend development using JavaScript and frameworks like ReactJS, AngularJS, or VueJS You understand the end user and can build simple, elegant solutions You think about why something needs to be built, not just what needs to be built You love to learn and develop new skills continuously Before you apply, review these resources to better understand our culture and mission: Peter Rex writing in WSJ about moving Rex from Seattle to Austin Peter Rex on Fox Business Peter Rex on Bloomberg Radio In Addition, We Offer The Following Our compensation & benefits package is designed to reward long-term career growth. Your total compensation can and should grow as you progress with the company. We evaluate performance and provide direct feedback to all teammates throughout the year and ensure that compensation matches the role and performance. Coaching and stretch assignments that will test your limits Competitive salary and equity awards Discounted rent at any properties owned by ResProp Management Medical, dental, and vision benefits 401(k) retirement plan Work from office culture",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-01T06:47:08.000Z"
    },
    "company": {
        "name": "rex",
        "link": "https://www.linkedin.com/company/rexteams"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 72,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Austin",
        "region": "TX",
        "postal_code": "78746",
        "street_address": null,
        "latitude": 30.264978,
        "longitude": -97.7466
    }
}