{
    "job": {
        "title": "Data Engineer",
        "industry": "Information Technology and Services,Computer Software,Insurance",
        "description": "Company Description Derex Technologies Inc specializes in providing IT consulting, staffing solutions and software services. Globally headquartered in Harrison New Jersey since 1996 Derex delivers the highest quality technology professionals and an array of customized IT talent solutions designed to improve productivity and drive results to global clients throughout North America. With over two decades of unparalleled experience, Derex provides supports to its clientele, across such industries as Systems Integration, Banking and Finance, Telecommunications, Pharmaceutical and Life Sciences, Energy, Healthcare, Technology, Transportation, and local and federal Government agencies. Job Description As a Data Engineer III, you will be responsible for designing, maintaining, and optimizing large-scale automated ELT processes. Working actively with analysts and customer teams specializing in enterprise data warehousing, you will leverage industry-standard data orchestration tools as well as in-house proprietary scheduling and automation tools to create efficient and reliable ELT jobs which support product offerings and data warehousing needs for our customers. As we incorporate more cloud technologies into our processes, you will be at the forefront of exploring and defining best practices and helping us transition our products to be more scalable. Qualifications Taking end-to-end ownership of data pipelines and custom solutions for our clients Coordinating with the systems, core, CX, and analytics teams to build and maintain data products and custom solutions for our clients Designing and writing automated scripts to preprocess terabytes of data from our partners/clients Designing and writing new enterprise-scale ELT/ETL workflows from scratch in Python using Airflow, Docker, AWS, etc. Modifying/redesigning legacy ELT/ETL processes to leverage cutting-edge open source and proprietary technologies Ensuring quality, reliability and uptime for critical automated processes Migrating our products and processes into the cloud while drastically reducing our in-house data center footprint. Required Skills: At least 5-8 years in a Data Engineering role/similar programming in Python with exposure to Docker Ability to work independently Proficient in SQL Prior experience managing a small team in an Engineering role. Exposure to ETL/ELT pipeline automation Knowledge of Apache Airflow Exposure to basic database concepts Preferred Skills: Good understanding of Data Engineering, NoSQL databases and database design, distributed systems and/or information retrieval Work with SaaS products DBA experience Ability to plan and collect requirements for projects, and interact with the analyst and data science teams Additional Information All your information will be kept confidential according to EEO guidelines.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-09T00:00:00.000Z"
    },
    "company": {
        "name": "Derex Technologies Inc",
        "link": "https://www.linkedin.com/company/derex-technologies-inc"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "New York",
        "region": "NY",
        "postal_code": "10132",
        "street_address": null,
        "latitude": 40.713047,
        "longitude": -74.00723
    }
}