{
    "job": {
        "title": "Machine Learning Engineer",
        "industry": "Information Technology and Services,Computer Software",
        "description": "An analytics based professional services company located in NYC is looking to bring on a Senior Machine Learning Engineer for a large scale, end to end project! 100% remote! This Jobot Job is hosted by Christine McNamara Are you a fit? Easy Apply now by clicking the \"Apply\" button and sending us your resume. Salary $130,000 - $150,000 per year A Bit About Us A global organization dedicated to partnering with companies across multiple industries is looking to expand their data and analytics team by bringing on a Machine Learning Engineer. The role will involve working for one of their most prestigious clients and will have a heavy emphasis on Tensorflow and Kubernetes. If you are a data scientist that enjoys working end to end and the ability to see your work impact an entire industry- this is the role for you! Why join us? Competitive base salaries Annual performance bonuses 401k with company match Work from home flexibility Generous PTO and paid sick leave Medical, dental, vision insurance Training and career development Job Details Responsibilities Design & build data pipelines and production level ML infrastructure, using tools such as TFX, Kubernetes, Kubeflow Pipelines, TensorFlow Work with data engineering teams to iterate upon the pipelines that feed the data science models Deploy ML models under the constraints of scalability, correctness and maintainability. Work with large big data sources, focusing on efficient data creation and feature engineering Drive work on creating a state of the art codebase and machine learning lifecycle infrastructure Contribute to the team through mentorship, technical methods, improvements in how we work Qualifications Masters or Bachelor's degree in Computer Science (or) math heavy degrees from top-tier universities with strong record of achievement Deep knowledge of statistical methods and machine learning with special emphasis on deep learning algorithms. 3+ Years of experience in algorithms, machine learning, data science (or) statistics Experience solving problems using Machine Learning Frameworks(e.g. PyTorch, TensorFlow) Experience with Big Query; Comfortable with writing complex SQL queries for data retrieval & transformation Proficient in Python / Pyspark. Prior experience in management consulting and/or analytics based consulting is a plus Interested in hearing more? Easy Apply now by clicking the \"Apply\" button.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-14T21:12:42.000Z"
    },
    "company": {
        "name": "Jobot",
        "link": "https://www.linkedin.com/company/jobot"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "New York",
        "region": "NY",
        "postal_code": "10132",
        "street_address": null,
        "latitude": 40.713047,
        "longitude": -74.00723
    }
}