{
    "job": {
        "title": "Site Reliability Engineer",
        "industry": "Information Technology and Services,Hospital &amp; Health Care",
        "description": "STRATEGIC STAFFING SOLUTIONS HAS AN OPENING! Strategic Staffing Solutions (S3) is currently looking for an Application Development Senior Advisor/SRE for a contract opening with one of our largest Healthcare clients located in Bloomfield, CT/ Remote! This is a Contract Opportunity with our company that MUST be worked on a W2 ONLY, NO visa sponsorship or C2C eligibility for this position . The details are below. Application Development Senior Advisor We are looking for a Site Reliability Engineer (SRE) who is passionate around solving business problems through innovation and engineering practices. The SRE would serve as the bridge between our operations members and service delivery members. The individual will be embedded in the operations team and enable the SRE community of practice by helping to bridge the needs and technologies of both teams while enabling the operations members to streamline and automate the repetitive and manual activities. The application environment is a blend between on premise & cloud. Roles and Responsibilities: Monitoring, Alerting and Communication Manage and monitor production systems Application Availability & performance issues Data and Integration issues Stakeholder communication Incident Management and root cause analysis Facilitate the incident management Guide the team on root cause analysis Manage performance metrics Work with stakeholders to identify & define the service level indicators and objectives Measure and report the performance metrics. Automation and tools Work with the service delivery teams in developing and testing automation of repetitive and manual efforts. Work closely with engineering teams on monitoring and performance management tools initiatives to improve system reliability and performance. Team building Help teams transition to SRE mind set Help with SRE adoption across teams Desired Qualifications: Bachelor’s degree or equivalent experience 5+ years of experience in Developer, Operations roles Knowledge of application, data and infrastructure architecture dislines Working proficiency in development and monitoring tools Ability to work in large, collaborative teams to achieve organization goals A mindset focused on reliability, uptime and the customer experience 4+ years of SRE experience 3+ years of public cloud experience Willing to work on a distributed team spanning multiple time zones. Analytical and problem-solving skills Good communication skills The desire to continually learn and test your own boundaries Exposure to standard software development practices including agile, deployment pipelines, continuous integrations and continuous delivery Understanding of software skills such as business analysis, development, maintenance and software improvements Experience with monitoring and observability systems like Dynatrace, CA APM, Splunk etc. Experience in one or more programming languages Python, Java, Scala, PySpark Experience with build and deployment pipeline technologies like Jenkins, Cloudbees, Terraform, Urban Code Deploy, Ansible, Maven, GitHub Experience working with relational databases or HDFS or cloud storage Hands on experiences in AWS technologies – Cloud Watch, Step Functions, Lambda, Glue, EC2, Redshift, DynamoDB, SQS, ECS/EKS, Elastic Search, SnowFlake, Elastic Cache, databricks, to name a few Exposure to containerization – Docker and Kubernetes Skills and Experience: SITE RELIABILITY ENGINEER JAVA SQL J2EE MQ Series KAFKA PYTHON OPENSHIFT ORACLE Additional Skills: JENKINS MAVEN METRICS PYSPARK RELIABILITY ENGINEER ROOT CAUSE ANALYSIS SCALA SOFTWARE DEVELOPMENT SPLUNK STRUCTURED SOFTWARE PROBLEM-SOLVING AMAZON DYNAMODB AMAZON ELASTIC COMPUTE CLOUD APACHE HADOOP HDFS CACHE CLOUD STORAGE CLOUDBEES CONTAINERIZATION DATABASES DOCKER DYNAMODB EC2 ECS ENGINEER HADOOP DISTRIBUTED FILE SYSTEM HDFS INCIDENT MANAGEMENT INTEGRATION INTEGRATOR BUSINESS ANALYSIS DEPLOYMENT MAINTENANCE OPERATIONS The S3 Difference : The global mission of S3 is to build trusting relationships and deliver solutions that positively impact our customers, our consultants, and our communities. The four pillars of our company are to: Set the bar high for what a company should do Create jobs Offer people an opportunity to succeed and change their station in life Improve the communities where we live and work through volunteering and charitable giving As an S3 employee, you’re eligible for a full benefits package that may include: Medical Insurance Dental Insurance Vision Insurance 401(k) Plan Vacation Package Life & Disability Insurance Plans Flexible Spending Accounts Tuition Reimbursement",
        "employment_type": "CONTRACTOR",
        "date_posted": "2021-08-12T12:46:09.000Z"
    },
    "company": {
        "name": "Strategic Staffing Solutions",
        "link": "https://www.linkedin.com/company/strategic-staffing-solutions"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Bloomfield",
        "region": "CT",
        "postal_code": "06002",
        "street_address": null,
        "latitude": 41.830956,
        "longitude": -72.73743
    }
}