{
    "job": {
        "title": "Software Engineer",
        "industry": "",
        "description": "About CoParse At CoParse, we are creating the future of how we read and write documents. We are building the \"IDE\" for complex documents. As software engineers, we use sophisticated tools to read and write code. It should be the same for documents! The last major breakthroughs in word processing and viewer technology came in the 1990s. It's time for a new innovator. CoParse is an AI integrated document viewer and editor. We apply proprietary text analysis algorithms to extract meaningful information from documents, making them faster and easier to read. CoParse features syntax highlighting, cross-linking between definitions and clauses, and auto-extraction of document structure. Alongside this powerful parsing engine, we've developed a fully-featured, elegant document viewer as a web and desktop app. Over the past year, we have been building out the CoParse viewer and gotten some amazing feedback from customers spanning top financial and legal firms. We've also attracted venture money from some of the best VCs in the US. We've built out a powerful tool that is already providing massive value to our customers, and we're looking for engineers that can take our product to the next level! The Role We are looking for an early engineer to join our growing team - building new features that customers will love, and evolving the product to revolutionize the reading and writing process. You will: Own the design process of new features, from the UI and UX to the technical implementation. Develop in React/Typescript on the frontend and Java on the backend. Collaborate with Product, Design, and Engineering to create impactful customer value. Mentor teammates and share your technical expertise with others to build our collective knowledge Qualifications A bachelors degree or equivalent in Computer Science or related field. A strong background developing with React, Typescript, and Java. 3+ years of relevant experience (preferred). A proven record of solving tough engineering problems and building beautiful products. A desire to build something that impacts a massive audience of people and changes the way we interact with documents. Our Team The members of our team have learned a lot from working at startups, as well as Amazon, Bridgewater, Salesforce, and Palantir. We are super excited to build out a team of passionate, creative, and caring people who want to change the world. If you resonate with all of this, let's talk! Our Benefits 100% health insurance coverage Unlimited PTO Remote and in-office options as you desire (we are NYC based but embrace the choice to work remotely)",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-17T23:45:50.000Z"
    },
    "company": {
        "name": "CoParse",
        "link": "https://www.linkedin.com/company/coparse"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "New York",
        "region": "NY",
        "postal_code": "10132",
        "street_address": null,
        "latitude": 40.713047,
        "longitude": -74.00723
    }
}