{
    "job": {
        "title": "Software Engineer – Entry Level",
        "industry": "Information Technology and Services,Defense &amp; Space,Computer Software",
        "description": "Summary Role and Responsibilities This is a hands-on software engineering position in Link's Common Training Environment (CTE) group. Link's CTE group is responsible for development and delivery of discriminating total training solutions, including Link's HD World® next generation simulation product line that provides war fighters with exceptionally realistic and relevant training for combat and peace keeping missions. HD World® products include: SimuSphere™ HD immersive visual display system, SimuView™ / SimuViewÆ™ image generator system, PBEG physics-based environment generator, and World Content Database Generation. Essential Duties And Responsibilities Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. The primary responsibility of this position is supporting the SimuView™ / SimuViewÆ™ image generator product. Job duties include product deployment, integration and support into a multitude of Fast Jet, Helo, Wide-body and UAV applications. The position is focused on new product feature design and development utilizing the latest 3D graphics technologies and concepts. Candidate should be a fast learner with very strong analysis and problem-solving skills with the ability to carry tasks through to completion with only general technical direction. Qualifications And Education Requirements US citizen able to obtain DoD Secret Clearance Bachelor's Degree in computer science or related engineering, science, or math discipline. C++ and Linux experience Experience with Standard Template Library (STL) Experience developing in a Linux environment using an IDE and the gcc toolchain Experience with a graphics API such as OpenGL or Vulkan Experience with 3D graphics and GPU software development Understanding of Object Oriented Design (OOD) and concepts Understanding of Configuration Management Understanding of operating system and concurrency concepts such as process/thread management, scheduling and synchronization, networks and distributed systems. Understanding of basic physics principles and concepts with an emphasis on electromagnetic radiation, radiometry/photometry, and blackbody physics. Understanding of the mathematics associated with 3D graphics: linear algebra, matrix manipulation Conceptual understanding of thermal balance models related to multi-spectral sensor applications and the impact of environmental and atmospheric factors. 5+ years’ experience working in a team environment Exceptional communications skills Preferred Skills Experience identifying and addressing the root cause of defects using software debugging tools like GDB in large scale and/or distributed systems. Experience with computer networking communications and socket programming Experience with real-time and distributed systems Experience with 3D graphics and GPU software development Experience with versioning tools such as Git/Bitbucket/Perforce Experience with using mid-range infrared (MWIR), image intensifier, night vision goggle (NVG), or other multi/hyper spectral sensors. Experience with the application of computer vision algorithms and/or a strong understanding of biological vision Experience using and applying algorithms related to massively parallel processing Mathematical scripting language such as MATLAB or Python Computational mathematics experience, including PDEs, signal processing, etc. CUDA CentOS / Red Hat Python Familiarity with X11 Familiarity with Atlassian tools GLSL Experience Security Responsibilities Must comply with all company security and data protection / usage policies and procedures. Personally responsible for proper marking and handling of all information and materials, in any form. Shall not divulge any information, or afford access, to other employees not having a need-to-know. Shall not divulge information outside company without management approval. All government and proprietary information will be accessed and stored electronically on company provided resources. Incumbent must be eligible for DoD Personal Security Clearance. Work Environment This job operates in a professional office environment. This role routinely uses standard office equipment such as computers, phones, photocopiers, filing cabinets and fax machines. Physical Demands The physical demands described here are representative of those that must be met by an employee to successfully perform the essential functions of this job. Infrequent lifting of 10-20 lbs Other Duties Please note this job description is not designed to cover or contain a comprehensive listing of activities, duties or responsibilities that are required of the employee for their job. Duties, responsibilities, and activities may change at any time with or without notice. CAE USA Inc. is an EOE/AA employer and gives consideration for employment to all qualified applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, disability or protected veteran status. If you’d like more information about your EEO rights as an applicant under the law, please click here EEO is the Law poster . PAY TRANSPARENCY NONDISCRIMINATION PROVISION The contractor will not discharge or in any other manner discriminate against employees or applicants because they have inquired about, discussed, or disclosed their own pay or the pay of another employee or applicant. However, employees who have access to the compensation information of other employees or applicants as a part of their essential job functions cannot disclose the pay of other employees or applicants to individuals who do not otherwise have access to compensation information, unless the disclosure is (a) in response to a formal complaint or charge, (b) in furtherance of an investigation, proceeding, hearing, or action, including an investigation conducted by the employer, or (c) consistent with the contractor’s legal duty to furnish information. Position Type Regular CAE thanks all applicants for their interest. However, only those whose background and experience match the requirements of the role will be contacted. Equal Employment Opportunity At CAE, everyone is welcome to contribute to our success. With no exception. As captured in our overarching value \"One CAE\", we’re proud to work as one passionate, boundaryless and inclusive team. At CAE, all employees are welcome regardless of race, nationality, colour, religion, sex, gender identity or expression, sexual orientation, disability or age. The masculine form may be used in this job description solely for ease of reading, but refers to men, women and the gender diverse.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-12T23:59:58.000Z"
    },
    "company": {
        "name": "CAE",
        "link": "https://ca.linkedin.com/company/cae"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Grand Prairie",
        "region": "TX",
        "postal_code": "75054",
        "street_address": null,
        "latitude": 32.745495,
        "longitude": -97.00353
    }
}