{
    "job": {
        "title": "Software Test Engineer",
        "industry": "Information Technology and Services,Defense &amp; Space,Computer Software",
        "description": "Job Description Metron's ORCA division in San Diego, CA is seeking software testers to contribute to the design and development of a family of large-scale defense and homeland security simulations. The successful candidate will be responsible for testing and evaluating ORCA’s applications and systems. Responsibilities Designing, executing, and debugging test plans of applications based on software requirements and technical specifications Creating test cases and validating results against functional requirements Detecting and identifying software failures so that defects may be discovered and corrected Documenting results and generating historical analysis of applications’ state and stability Documenting anomalies and defects in a maintained issue tracking database Deploying, operating, and maintaining application test instances and/or networks Ensuring compliance with general software development, testing, and maintenance best practices Ensuring data integrity standards Participating in application planning meetings Evaluating software ease of usability and error handling procedures Providing application instructions for users Desired Qualifications Bachelors Degree in Computer Science, Electrical Engineering or other related field Minimum 1 year of experience Must possess excellent written and verbal skills to communication with development team Must be able to work independently as well as in a team environment Strong knowledge of quality assurance methodologies, test plans, and debugging is required Previous test automation experience is a plus US CITIZENSHIP REQUIRED, position will require background investigation to authorize access to classified information Position Location: Liberty Station, San Diego, CA All qualified applicants will receive consideration for employment and will not be discriminated against on the basis of race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, or protected veteran status. Metron takes affirmative action in support of its policy to employ and advance in employment individuals who are minorities, women, protected veterans, and individuals with disabilities. VEVRAA Federal Contractor",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-06-18T01:21:21.000Z"
    },
    "company": {
        "name": "Metron, Inc.",
        "link": "https://www.linkedin.com/company/metron-inc-"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 12,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "San Diego",
        "region": "CA",
        "postal_code": "92161",
        "street_address": null,
        "latitude": 32.71576,
        "longitude": -117.16382
    }
}