{
    "job": {
        "title": "Software Engineer 2021",
        "industry": "Marketing and Advertising,Computer Software,Internet",
        "description": "As a Software Engineer at Lucid Software you will be helping to build our world-class web applications that push the boundaries of what is possible in your browser. They are powerful HTML5/JavaScript applications that use a state of the art tech stack like Angular, TypeScript, Scala, and AWS to craft a user experience that feels like a desktop application. We are looking for extraordinary Software Engineers to join our team immediately who are ready to build creative applications that customers love. You will have a significant influence on our strategy by helping to define product features, drive the system architecture, and spearhead best practices to create a quality product. If you know how to deliver, are deeply technical and highly innovative, and relish the opportunity to delight customers with pioneering solutions to challenging problems, we want to talk to you! Our mission is to help teams see and build the future. And we hold true to our core values of: (1) Innovation in everything we do; (2) Passion & excellence in every area; (3) Providing individual empowerment, initiative and ownership; and (4) Teamwork over ego. Responsibilities Design, develop, test, deploy, maintain, and improve software Manage project priorities, deadlines, and deliverables Collaborate with team members to set and achieve team goals Other duties as assigned Requirements Completed a BS or MS Degree in Computer Science or in a related technical field with a minor in Computer Science High academic performance in Computer Science courses Commitment to teamwork and strong communication skills (to both business and technical partners) Preferred Qualifications Experience with JavaScript Experience with CSS/HTML/DOM manipulation Understanding of MySQL or other relational database Bias towards finding solutions vs. shutting down ideas Detail oriented and organized LI-MJ6",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-09-30T02:38:14.000Z"
    },
    "company": {
        "name": "Lucid",
        "link": "https://www.linkedin.com/company/lucidsoftware"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Salt Lake City",
        "region": "UT",
        "postal_code": "84101",
        "street_address": null,
        "latitude": 40.758476,
        "longitude": -111.888145
    }
}