{
    "job": {
        "title": "Software Engineer",
        "industry": "",
        "description": "Job Description As a Software Engineer, you will: Be involved in full-stack web application development with a variety of languages and frameworks including Python, TypeScript, HTML, React, Flask, Postgres, etc. Work closely with our PM and design teams to define feature specifications and build impactful products. Work closely with operations to build user-friendly data visualization and processing software. Minimum Qualifications 1-2+ years of experience in full stack web development B.S. Computer Science or related technical field preferred, fresh grad is also ok. Experience with Python and Javascript required 1-2+ years of experience with Python 1-2+ years of experience with Javascript 1-2+ years of experience with relational databases and SQL Experience in ReactJS and Flask preferred Experience with AWS and GCP a plus Experience with AI a plus ********************************************************************* We're urgently in need for a Senior Software Engineers. Know anyone who might be interested? Please fill-up on the below link, attach your updated CV and don't forget to take the coding challenge!!! Kindly mention my name on \"referred by\" https://lnkd.in/gmZYssbT #SWE #softwareengineerjobs #remotework #hiring #careers #nowhiring",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-10T05:14:29.000Z"
    },
    "company": {
        "name": "Expedock",
        "link": "https://www.linkedin.com/company/expedock"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 12,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "United States",
        "region": null,
        "postal_code": "99999",
        "street_address": null,
        "latitude": 39.50355,
        "longitude": -99.0183
    }
}