{
    "job": {
        "title": "Software Engineer",
        "industry": "Computer Software",
        "description": "About The Role Lambda is growing! Come work at a profitable startup where we’re building powerful research computers and software for Machine Learning and Artificial Intelligence experts around the world. We're looking for Software Engineers to work across a variety of projects as we build new products and fine-tune our engineering processes, including our e-Commerce platform, internal systems for complex server manufacturing execution, and beyond. Our team is small so you'll have impact across many facets of our software development evolution. What You’ll Do Implement and maintain new features used by both external and internal customers. Uphold Lambda's high standards in security, software architecture, engineering, and privacy. Work along the entire stack including Database, ORM, Frontend, Backend, API integration, HTML/CSS, Javascript, system administration. Experience that's great to have Extremely comfortable in a UNIX shell. Able to quickly pick up and learn new systems, APIs, languages, and tools. Self-directed in your learning and execution attitude. Know how to prioritize your time and how to make polish vs. launch trade-offs. Internal desire to implement and uphold industry best practices in security. Experience shipping: whether that's a game title, web app, or open-source software package. Bachelors’ degree in an engineering or scientific field preferred Example projects Add a new feature to our computer configuration platform. Implement a new feature in our internal manufacturing execution system to help us improve company-wide manufacturing throughput. Add dashboards to help our team better understand and execute on company metrics & summary statistics. ## Quick Company Highlights Our research papers have been accepted into the top machine learning and graphics conferences, including ICCV, SIGGRAPH Asia, NeurIPS, and ACM Transactions on Graphics (TOG). Profitable and growing 50% quarter over quarter. We’re backed by investors including Gradient Ventures, Google’s AI-focused venture fund. Headquartered in the Dogpatch and a short walk from the 22nd Street Caltrain station in SF. Our Benefits Generous cash & equity compensation Health, vision, and dental coverage for you and your dependents 401k Plan Paid Time Off Commuter benefits Daily catered lunch",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-28T05:06:22.000Z"
    },
    "company": {
        "name": "Lambda Labs",
        "link": "https://ba.linkedin.com/company/lambda-labs-ba"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "San Francisco",
        "region": "CA",
        "postal_code": "94121",
        "street_address": null,
        "latitude": 37.78008,
        "longitude": -122.42016
    }
}