{
    "job": {
        "title": "R&amp;D Engineer - Web Developer",
        "industry": "Information Technology and Services,Computer Software,Automotive",
        "description": "Company Overview Hunter Engineering Company is a world leader in automotive service equipment, offering state-of-the-art wheel alignment systems, wheel balancers, lift racks and more. Hunter equipment is approved and used by vehicle manufacturers, dealers, and automotive service facilities around the world. Hunter is at the forefront of change, thanks to our remarkable people who bring cutting-edge products and services to life. Job Summary A new lead front end developer would focus on sophisticated high quality web page development. The new developer would support the continued advancement of HunterNET with a range of user centered features for the display and analysis of results. Responsibilities Design and develop web applications and services that integrate with Hunter's products Collaborate with product managers, designers, and engineers to prototype and implement features Recommend best approaches for front-end architecture, tooling, and processes Required Qualifications Bachelor’s degree in Computer Science, Software Engineering, or related engineering and technical field. 3 + years of development experience in front end development Skilled with HTML , CSS, JS Basic familiarity with object-oriented programming concepts and technologies Preferred Experience with front-end frameworks such as React and Vue Experience with Agile development Some experience with a major cloud provider   such as Azure Skill in understanding and consuming RESTful APIs Knowledge of continuous integration is an advantage.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-27T05:24:31.000Z"
    },
    "company": {
        "name": "Hunter Engineering Company",
        "link": "https://www.linkedin.com/company/hunter-engineering"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Bridgeton",
        "region": "MO",
        "postal_code": "63044",
        "street_address": null,
        "latitude": 38.755707,
        "longitude": -90.4183
    }
}