{
    "job": {
        "title": "Data Scientist",
        "industry": "Information Technology and Services,Consumer Electronics,Marketing and Advertising",
        "description": "Duration: 6 month contract (possible extensions) Location: Menlo Park (All-star candidates may be considered to be fully remote!!) Day-2-Day A large networking company in Menlo Park, is looking for a Product Data Analysts to join their Marketplace product data science group. A strong candidate will have a background within Product Analytics or Data Science to help derive insights from large sets of data. Strong SQL skills are required with a knowledge of product insights. Strong product sense is important and this resource should be able to identify the Health, growth, and engagement of an application. As well as have a background in experimentation - A/b testing to test new features being implemented onto the web/mobile platform. These data scientist contractors will be working with their team to code, generate insights, and make recommendations about the product to their teams. MUST HAVES: 3+ years experience in Data Analytics/Data Science and product analytics. Experienced in Python and/or R Fluency in SQL. Ability to communicate the results of analyses in a clear and effective manner with product and leadership teams Good understanding of statistics A/B testing (e.g., hypothesis testing, regressions). Ability to understand Feature implementation on a Web/Mobile product",
        "employment_type": "CONTRACTOR",
        "date_posted": "2021-08-20T23:28:24.000Z"
    },
    "company": {
        "name": "Insight Global",
        "link": "https://www.linkedin.com/company/insight-global"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Menlo Park",
        "region": "CA",
        "postal_code": "94029",
        "street_address": null,
        "latitude": 37.45322,
        "longitude": -122.18322
    }
}