{
    "job": {
        "title": "Software Engineer, Customer Support",
        "industry": "Information Technology and Services,Computer Software,Internet",
        "description": "Company Background ThreatConnect, Inc. provides cybersecurity software that reduces complexity for everyone, makes decision making easy by turning intelligence into action, and integrates processes and technologies to continually strengthen defenses and drive down risk. Designed by analysts but built for the entire team (security leadership, risk, security operations, threat intelligence, and incident response), ThreatConnect’s decision and operational support platform is the only solution available today with cyber risk quantification, intelligence, automation, analytics, and workflows in one. To learn more, please visit www.threatconnect.com. We offer a competitive benefits package with comprehensive insurance coverage, unlimited paid time off, and unique perks designed to help you meet your financial and personal goals. We are committed to offering an employment experience and benefits package that enables you and your family to grow with us and to share in our success. We love to recognize our employees who have gone above and beyond, and offer incentives like quarterly awards, an employee bonus and referral program, and team-building outings. Job Description The Software Engineer, Customer Support will join our Customer Success team, which focuses on allowing our customers to build some of the most sophisticated Threat Intelligence operations in the world. The position will report to the Director of Customer Support and will provide top-tier customer support to the company’s growing list of important customers. About You You are highly motivated and work well in a fast-paced environment. In order to provide such an elite service, the ThreatConnect Customer Success team requires highly motivated individuals who love to tinker and solve problems as a team. You are tech-savvy and love working with customers. This service requires the ability to understand and troubleshoot a wide range of customer issues, from usability questions and technical configuration issues to complex system and software-related challenges. The right individual will be able to log and update cases, inform customers of case status, and provide solutions as they become known. They will also be responsible for identifying and addressing gaps in customer understanding by growing the documentation, knowledge base, and training materials as appropriate. You are a great collaborator and great at multitasking and pivoting when needed. Support Specialists will collaborate internally across Sales, Product Management, Engineering, and Customer Success to identify timely solutions to customer problems. They must also work with customers’ analysts, engineers, management, and other staff to understand issues, troubleshoot in a variety of environments, and convey solutions effectively. You have excellent communications skills. You believe that strong communication skills, both written and oral, are just as vital as technical expertise and critical thinking ability. In this role, you’ll get to... Take in Support Tickets from customers in the Support Desk Portal or, for outages, phone calls Analyze systems and software issues using logs sent by customers or internal systems teams Get on video calls with customers to understand problems, triage or debug the product installations, and propose and implement solutions to resolve their problems Work with internal Engineering and Product Management teams to debug problems and find, implement, or negotiate solutions for customer installations Help customer deployment teams with challenges faced during initial deployments or software upgrades Provide support to customers throughout installation, upgrade, and day-to-day use across a variety of browsers and operating systems (mainly Linux) Demonstrate a firm grasp of networking technologies (firewalls, routers, switches) and network protocols (TCP/IP, DNS, HTTP, SMTP, etc.) by identifying and troubleshooting potential network issues affecting product operations Diagnose application behaviors as communicated by customers or captured via code output, system logs, Java stack traces, and more Work through complex customer use cases and isolate core issues whether they are rooted in the product, systems, processes, workflows, or customer use cases Identify customer pain points and communicate needs with appropriate internal teams to implement and deploy a solution in a timely manner Work with other teammates to implement scaling efforts such as automation, new tool integrations, and reporting as required by customers Be a part of an on-call support rotation This Job is Awesome Because… You get to work with one of the top companies and teams in the cybersecurity space You will be a part of the growth of an already successful organization You will be exposed to and work with Fortune 500 customers in various business domains 1-3-6-12 Month Plan In the first month we’ll expect you to… Focus on learning the ThreatConnect platform and functionality Shadow senior teammates to understand the workings of the role and help them solve customer issues Have the ability to diagnose customer issues based on logs and stack traces sent by customers Communicate within and outside of ThreatConnect to understand issues and negotiate and plan solutions At 3 months we’ll expect you to… Have a good understanding of the ThreatConnect platform Able to help customers with functionality related questions and problems with other team members or independently At 6 months we’ll expect you to… Have a deeper level understanding of the ThreatConnect platform Be able to get on video calls with customers to triage and debug issues and propose and implement solutions independently At 12 months we’ll expect you to… Have an end-to-end understanding of the ThreatConnect platform Be able to independently lead an investigation or manage a priority 1 incident call with ThreatConnect’s top tier customers About The Team Our Team has a deep-rooted culture of collaboration We have constant and honest communication, a passion for customer support, and an understanding of the differences among people We believe that respect, accommodation, and flexibility are the cornerstones of our team culture We are spread across various states in the US and throughout Europe Required Skills Requirements 3-5 years of experience supporting customers in the network security industry Deep understanding of network security concepts and protocols (e.g. DNS, HTTP, TCP/IP) and application runtime environments (e.g. Virtual Machines, Java, and/or Python) Experience with cybersecurity fundamentals and products Expert-level knowledge and understanding of Linux environments Experience with relational database systems such as MySQL, Postgres, and HANA Experience supporting and troubleshooting custom enterprise software A passion for problem-solving and an eagerness to learn new technologies and skills Excellent verbal and written communication skills with the ability to discuss technical concepts The ability to work with internal and external teams spanning a range of positions and technical expertise Above-average organizational skills, time management skills, and attention to detail A self-starter mentality with the ability to work autonomously The ability to diagnose issues and produce timely and effective solutions to those issues Desired Skills Bachelor's Degree in Computer Science or related field or equivalent working experience Experience with Atlassian JIRA Benefits Work-Life Balance Unlimited Paid Time Off (PTO) Employee recognition program with quarterly awards Employee referral program Military leave options available Education reimbursement program for job-related college courses and professional training Quarterly events with your geographic team Annual company party Medical MEDICAL PREMIUM FOR INDIVIDUALS AND FAMILIES ARE 100% COVERED Prescription drug coverage Dental coverage Vision coverage Company-paid short term and long term disability Company-paid insurance and AD&D coverage Pet Insurance Financial 401K retirement savings plan with company matching program up to 6% Health Savings Account Flexible Spending Accounts (medical, dependent care, transit, and parking) Cell phone stipend Paid Parental Leave Paid Bereavement Leave Research shows that while men apply to jobs when they meet about 60% of job criteria, women and individuals from marginalized groups tend to apply only when they check every box. If you think you have what it takes but you’re not sure that you check every box, apply anyway!",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-17T03:23:45.000Z"
    },
    "company": {
        "name": "ThreatConnect",
        "link": "https://www.linkedin.com/company/threatconnect-inc"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Arlington",
        "region": "VA",
        "postal_code": "22210",
        "street_address": null,
        "latitude": 38.890762,
        "longitude": -77.084755
    }
}