{
    "job": {
        "title": "Senior Software Engineer",
        "industry": "Computer Software",
        "description": "Apply today if you are a Senior Software Engineer looking for a growing company in the Storage Industry Title: Senior Software Engineer Location: Salt Lake City, UT Salary: $110,000 - $140,000 Tech Stack: .NET/C# | AWS | Angular Our company has been around for about 50 years and continues to grow and be voted by Forbes as one of the best places to work. We are looking for an experienced software engineer to join our team and focus on development in our web applications that support our nationwide operations. What You Will Be Doing Write and maintain our current code base Evaluate technical plans and implementation Mentor and train other junior developers Recommend and learn new technology options. What You Need for this Position C# SQL Server ASP.NET Web API AngularJS Nice To Have automated testing and deployment AWS platforms including SQS, SNS, SWF, S3, and RDS What's In It for You Competitive base salary and overall compensation package Full benefits: Medical, Dental, Vision 401 (K) with generous company match Vacation, sick, and paid holidays Life Insurance coverage So, if you are a Senior Software Engineer with experience, please apply today! Apply directly to this job opening here! Or E-mail directly for more information to trent@cybercoders.com Email Your Resume In Word To Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also: Trent.Roberts@CyberCoders.com Please do NOT change the email subject line in any way. You must keep the JobID: linkedin : TR1-1637909 -- in the email subject line for your application to be considered.*** Trent Roberts - Sr. Executive Recruiter - CyberCoders Applicants must be authorized to work in the U.S. CyberCoders, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-31T07:22:43.000Z"
    },
    "company": {
        "name": "CyberCoders",
        "link": "https://www.linkedin.com/company/cybercoders"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Salt Lake City",
        "region": "UT",
        "postal_code": "84101",
        "street_address": null,
        "latitude": 40.758476,
        "longitude": -111.888145
    }
}