{
    "job": {
        "title": "Software Engineer, full stack",
        "industry": "Marketing and Advertising,Information Technology and Services,Computer Software",
        "description": "Our Company Changing the world through digital experiences is what Adobe’s all about. We give everyone—from emerging artists to global brands—everything they need to design and deliver exceptional digital experiences! We’re passionate about empowering people to create beautiful and powerful images, videos, and apps, and transform how companies interact with customers across every screen. We’re on a mission to hire the very best and are committed to creating exceptional employee experiences where everyone is respected and has access to equal opportunity. We realize that new ideas can come from everywhere in the organization, and we know the next big idea could be yours! Our Company Changing the world through digital experiences is what Adobe’s all about. We give everyone—from emerging artists to global brands—everything they need to design and deliver exceptional digital experiences! We’re passionate about empowering people to create breathtaking and powerful images, videos, and apps, and transform how companies interact with customers across every screen. We’re on a mission to hire the very best and are committed to creating exceptional employee experiences where everyone is respected and has access to equal opportunity. We realize that new ideas can come from everywhere in the organization, and we know the next big idea could be yours! Our team is looking for a driven developer who loves building delightful experiences for the creative professional across the full web solution stack, from user experiences to the services that support them. The ideal candidate will have a keen eye for details and high standards for code quality and efficiency. Join our awesome Adobe Stock team! Adobe Stock is a leading online marketplace for digital assets that provides designers and businesses access to hundreds of millions of high-quality, curated, royalty-free photos, vectors, illustrations, templates, audio, and 3D assets for all their creative projects. The Adobe Stock service provides an interactive web experience and is integrated with Adobe desktop apps to search, browse, and access assets across desktop and mobile devices. What you'll do You’ll be working on an agile development team, crafting innovative new features and maintaining existing ones using world-class technologies. You'll also be expected to debug issues across multiple systems, regularly share knowledge with peers, and contribute to architectural design discussions. Candidates who enjoy tackling sophisticated technical challenges, have a passion for delighting customers, and who are motivated to solve problems will thrive in our highly collaborative environment. What you need to succeed 4+ years of experience developing consumer-facing web applications B.S. in Computer Science, or a related field Love to learn new things, build cool software, and have fun Proficiency in JavaScript and Node.js Experience implementing JavaScript techniques, such as modules, async/await, compiling and bundling, and server rendering Understanding of ES6 / ES2015 and newer, React, Redux, Express, Webpack, or similar web technologies Experience building, maintaining, and monitoring highly available microservices using Node.js, PHP, or similar Knowledge of how to apply computer science principles to real-world problems, including algorithms, data structures, distributed systems, and data flow and storage Strong familiarity with SOLID design principles and object-oriented programming At Adobe, you will be immersed in an exceptional work environment that is recognized throughout the world on Best Companies lists. You will also be surrounded by colleagues who are committed to helping each other grow through our outstanding Check-In approach where ongoing feedback flows freely. If you’re looking to make an impact, Adobe's the place for you. Discover what our employees are saying about their career experiences on the Adobe Life blog and explore the meaningful benefits we offer. Adobe is an equal opportunity employer. We welcome and encourage diversity in the workplace regardless of gender, race or color, ethnicity or national origin, age, disability, religion, sexual orientation, gender identity or expression, or veteran status.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-18T22:01:36.000Z"
    },
    "company": {
        "name": "Adobe",
        "link": "https://www.linkedin.com/company/adobe"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 48,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "San Francisco",
        "region": "CA",
        "postal_code": "94121",
        "street_address": null,
        "latitude": 37.78008,
        "longitude": -122.42016
    }
}