{
    "job": {
        "title": "Data Scientist, Analytics (Remote)",
        "industry": "Information Technology and Services,Computer Software,Internet",
        "description": "Our Mission In the age of large marketplaces like Amazon, we expect products delivered to our doorsteps in one or two days at no extra cost. Millions of sellers on other marketplaces fall short, unable to afford fast product delivery to their customers. Our mission is to build an intelligent, asset-lite network that enables any seller to offer ultra-fast, low-cost fulfillment -- transforming the $8 - $12 trillion per year fragmented and outdated logistics industry. Our Team Our backgrounds span journalism, academia, consulting, entrepreneurship, and more. We’re united by our curiosity, bias for action, and entrepreneurial ownership. We're looking for intelligent and ambitious people to join us in the early stages of building our vision -- backed by leading firms in logistics and venture capital. What You'll Do We will train you to become Deliverr’s go-to expert on conducting data analysis in your domain (e.g., inbound shipping economics, on-time shipping) You will inform Deliverr’s decisions around unit economics and/or operational performance (e.g., on-time shipping, capacity usage) by defining core metrics with stakeholders You will be part of establishing Deliverr’s business intelligence foundation by designing, building, and maintaining analytics (e.g., reporting, dashboards) for company-wide use What We’re Looking For 2+ years of experience in a related role. Proficiency and best practices in SQL fundamentals Proficiency in building effective reporting (e.g., reports, dashboards) in Tableau or similar tools Ability to communicate concisely and unambiguously Urgency for action -- over rigor when necessary Ability to organize, prioritize, and adapt in a rapid-growth startup Must be based in North America. Bonus Points For Programming ability (e.g., Python, R) Experience setting up Tableau (or similar tools) from scratch Experience working in a software and/or logistics company",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-15T12:57:49.000Z"
    },
    "company": {
        "name": "Deliverr Inc.",
        "link": "https://www.linkedin.com/company/deliverr-inc"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "San Francisco",
        "region": "CA",
        "postal_code": "94121",
        "street_address": null,
        "latitude": 37.78008,
        "longitude": -122.42016
    }
}