{
    "job": {
        "title": "Staff ML Engineer - ML, NLP, Tensorflow",
        "industry": "Consumer Goods",
        "description": "If you are a Staff ML Engineer with experience, please read on! We are looking for someone who has extensive experience and expertise in designing and implementing ML training pipelines as we improve and scale our AI NLP solution. As our Staff Engineer, you will serve as the ML specialist and guide other engineers to tackle complex algorithmic and architectural challenges. What You Will Be Doing \" Investigate and experiment with new model architecture to improve existing ML model and training pipelines, run-time inference and performance improvements \" You will creatively balance the demands of production-level software engineering with exploratory research and development \" Work with teams to develop and improve machine learning pipeline that goes all the way from R&D to at-scale deployment What You Need for this Position \" Extensive experience working with, developing, and maintaining production-level Python \" You have some C++ experience \" Hands-on experience with ML model deployment and inference in a production setting \" Experience using TensorFlow, PyTorch, MxNet or similar tools \" Ability to build NLP data pipelines and perform data transformations to fit deep learning models for language learning \" Experience with sequence-to-sequence neural networks (e.g. LSTMs, GRUs, Transformers, etc.) in any domain So, if you are a Staff ML Engineer with experience, please apply today! Email Your Resume In Word To Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also: Stephen.Maroda@CyberCoders.com Please do NOT change the email subject line in any way. You must keep the JobID: linkedin : SM1-1643969 -- in the email subject line for your application to be considered.*** Stephen Maroda - Lead Recruiter - CyberCoders Applicants must be authorized to work in the U.S. CyberCoders, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-31T07:05:49.000Z"
    },
    "company": {
        "name": "CyberCoders",
        "link": "https://www.linkedin.com/company/cybercoders"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Mountain View",
        "region": "CA",
        "postal_code": "94040",
        "street_address": null,
        "latitude": 37.39008,
        "longitude": -122.08139
    }
}