{
    "job": {
        "title": "Senior Full-Stack Software Engineer, Machine Learning Platform",
        "industry": "Information Technology and Services,Computer Software,Automotive",
        "description": "We're Cruise, a self-driving service designed for the cities we love. We’re building the world’s most advanced, self-driving vehicles to safely connect people to the places, things, and experiences they care about. We believe self-driving vehicles will help save lives, reshape cities, give back time in transit, and restore freedom of movement for many. Cruisers have the opportunity to grow and develop while learning from leaders at the forefront of their fields. With a culture of internal mobility, there's an opportunity to thrive in a variety of disciplines. This is a place for dreamers and doers to succeed. If you are looking to play a part in making a positive impact in the world by advancing the revolutionary work of self-driving cars, join us. About The Team The Machine Learning Platform team builds and supports the essential tools and frameworks for every machine learning engineer at Cruise. Our goal is to greatly accelerate the development cycle of machine learning models across the whole company, empowering machine learning engineers to focus on improving the car’s safety and performance, instead of worrying about their infrastructure. Our scope covers the whole lifecycle of machine learning at Cruise: feature processing, model training and deployment to vehicles. We care about the performance, ease of use and reliability of our products. We are driven by the success of our partner teams who rely on our work to build the most advanced driverless cars in the world. About The Role The Machine Learning Platform team is looking for a Senior Frontend Engineer to design and implement specialized ML experiment management and data visualization applications that accelerate the evaluation and improvement of machine learning models. What You’ll Be Doing Work with Product Managers and Product Designers to design and implement web-based tools for visualizing and evaluating machine learning models and experiments Build automation that surfaces insights on how machine learning engineers can improve model performance Work closely with machine learning engineers to enable cutting-edge R&D efforts and improve existing systems Drive best practices in our team and code bases: testing, software design/architecture for component reuse, driving changes in the tech stack towards quality and productivity What We’re Looking For General: Passion for self-driving technology and its impact Experience and proficiency shipping products end-to-end Technical communication/collaboration skills: delegation, technical writing, driving alignment Demonstrated ability to empathize with customer problems and deliver creative product solutions Technical At least 5+ years of experience building production-level frontend applications using React, Redux, WebGL or similar frameworks Strong understanding of JavaScript/TypeScript and dynamic frontend fundamentals Experience with REST APIs and websockets Experience with scripting languages such as Python Experience building, deploying, and operating high-availability services Experience with Google Cloud, AWS, or Azure BS, MS, or PhD in Computer Science, Math, Physics, or equivalent real-world experience Bonus points! Experience building interactive tools that are core to people's daily work Experience evangelizing front-end web technologies Experience working closely with designers, product managers, and user experience researchers Experience with data science/visualization Experience with autonomous vehicle technology ML or experimental design knowledge Why Cruise? Our benefits are here to support the whole you: Competitive salary and benefits 401(k) Cruise matching program Medical / dental / vision, AD+D and Life One Medical membership Flexible vacation and company paid holidays Healthy meals and snacks provided for non-remote employees Paid parental leave Fertility Benefits Dependent Care Flexible Spending Account, subsidized by Cruise Flexible Spending Account Monthly wellness stipend Pre-tax Commuter Benefit Plan for non-remote employees We’re Integrated Through our partnerships with General Motors and Honda, we are the only self-driving company with fully integrated manufacturing at scale. We’re Funded GM, Honda, Microsoft, SoftBank, & T. Rowe Price, have invested billions in Cruise. Their backing for our technology demonstrates their confidence in our progress, team, and vision and makes us one of the leading autonomous vehicle organizations in the industry. Our deep resources greatly accelerate our operating speed. We’re Independent We have our own governance, board of directors, equity, and investors. Our independence allows us to not just work on the edge of technology, but also define it. We’re Vested You won’t just own your work here, you’ll have the potential to own equity in Cruise, too. We are competing in a market that is projected to grow exponentially, which gives our company valuation room to grow. Cruise LLC is an equal opportunity employer. We strive to create a supportive and inclusive workplace where contributions are valued and celebrated, and our employees thrive by being themselves and are inspired to do the best work of their lives. We seek applicants of all backgrounds and identities, across race, color, ethnicity, national origin or ancestry, citizenship, religion, sex, sexual orientation, gender identity or expression, veteran status, marital status, pregnancy or parental status, or disability. Applicants will not be discriminated against based on these or other protected categories or social identities. Cruise will consider for employment qualified applicants with arrest and conviction records, in accordance with applicable laws. Cruise is committed to the full inclusion of all applicants. If reasonable accommodation is needed to participate in the job application or interview process please let our recruiting team know or email HR@getcruise.com. We proactively work to design hiring processes that promote equity and inclusion while mitigating bias. To help us track the effectiveness and inclusivity of our recruiting efforts, please consider answering the following demographic questions. Answering these questions is entirely voluntary. Your answers to these questions will not be shared with the hiring decision makers and will not impact the hiring decision in any way. Instead, Cruise will use this information not only to comply with any government reporting obligations but also to track our progress toward meeting our diversity, equity, inclusion, and belonging objectives. Note to Recruitment Agencies: Cruise does not accept unsolicited agency resumes. Furthermore, Cruise does not pay placement fees for candidates submitted by any agency other than its approved partners.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-21T01:58:04.000Z"
    },
    "company": {
        "name": "Cruise",
        "link": "https://www.linkedin.com/company/getcruise"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "San Francisco",
        "region": "CA",
        "postal_code": "94121",
        "street_address": null,
        "latitude": 37.78008,
        "longitude": -122.42016
    }
}