{
    "job": {
        "title": "Insurance Sales Agent",
        "industry": "",
        "description": "If you live in the Charlotte Region and surrounding areas and don't have the following at your disposal, you owe it to yourself to contact me today to have a confidential conversation: Free marketing support, free exclusive direct-mail and telemarketing leads from interested consumers handed out weekly. We will get you in front of far more  people than you are currently seeing. Free training, office space, desk, phone, admin support, CRM, business cards, etc. (No hidden fees.) 165+ Insurance carriers, including many of the nations top insurance companies. This allows for the best possible solution for each client’s individual need. You will always be able to do the BEST job for your clients. We offer Index Annuities, Life Insurance, Medicare, LTC, Dental, Hospital Indemnity, etc Ownership of your renewals, overwrites, and clients. Agents receive top level payouts, significantly higher than most \"Career Agencies\". This is the support we offer agents at American Insurance Marketing Solutions. All of this is provided  free of charge with no hidden costs deducted from your paycheck every week. Email or call me if you are interested in a confidential interview.  Email: tripp@goaims.net or Call: 980.333.0003",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-25T17:28:13.000Z"
    },
    "company": {
        "name": "American Insurance Marketing Solutions",
        "link": "https://www.linkedin.com/company/american-insurance-marketing-solutions"
    },
    "education": {
        "required_credential": "high school"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Charlotte",
        "region": "NC",
        "postal_code": "28241",
        "street_address": null,
        "latitude": 35.223785,
        "longitude": -80.84114
    }
}