{
    "job": {
        "title": "Data Analyst",
        "industry": "Electrical/Electronic Manufacturing,Construction,Mechanical or Industrial Engineering",
        "description": "Our Story : Dover Food Retail (DFR) is a leading manufacturer of Display Cases, Specialty Products, Refrigeration Systems, Power Systems and Comprehensive Services; and l eading our industry by Innovating What’s Next in glass doors and intelligent merchandising technologies that keep food safe under brands such as HillPhoenix and Anthony . DFR is part of the Refrigeration and Food Equipment segment of the Dover Corporation® (NYSE: DOV). Dover is a diversified global manufacturer with annual revenues in excess of $7 billion. DFR is built on creativity and customer-centric innovation delivered by people invigorated by a strong sense of responsibility to help our customers win in their marketplaces. The relationships we build with our customers are as important to our success as the products we manufacture. This collaborative environment delivers FRESH THINKING, reassuring our customers that they choose the best when they choose to work with the people of Dover Food Retail. Job Title: Data Analyst Location: Conyers, GA What we’re looking for: We are looking for an innovative and experienced data analyst to join our team. The data analyst will work closely with business leaders to provide information to reduce quality costs and improve processes. To be successful as a quality analyst, you should have a strong background working with data and proven ability to demonstrate strong attention to detail along with strong analytical and problem-solving skills. The ideal candidate must be able to interpret and implement quality assurance data standards and provide accurate and comprehensive feedback to the business. You will be responsible for managing, extracting, transforming, reporting and visualizing data from a wide variety of sources as it relates to the performance of our products, services and key business processes. What you’ll be responsible for in this role: Exploring any and all available data for extraction, transformation, analysis and visualization, incl. proposing new ideas and solutions. Design, development, maintenance and improvement of processes and tools for managing, extracting, transforming, reporting and visualization of data. Development and maintenance of tools aimed at automation of existing processes and data bases. Working closely with end users to translate requirements into data-driven applications and data visualization solutions (e.g. reporting and dashboards). Transforming data into value: communicating findings and recommended actions across the entire company in an international environment. Work with business leaders to identify opportunities for improvement Create reports for internal and external teams Collaborate with team members to collect and analyze data Use graphs, infographics and other methods to visualize data Design and assist in implementation of quality data warehouse Establish KPIs to measure the effectiveness of business decisions Structure large data sets into usable information Work with a team to process information Create presentations and reports based on recommendations and findings Perform data integrity reviews What are the basic qualifications? 5+ years of experience as a data analyst Bachelor’s degree in business, Science, Engineer, or Data Analysis To be a great fit for the role: Mastery of programming tools such as SQL, PL/SQL, Python or R. Master Excel at an advanced level with Visual Basic. Experience on Power BI is a plus. Excellent written and verbal communication and the ability to present data to all levels in the organization. ERP and Lean Six Sigma certification are a plus. Experience writing queries to select and/or update data in a relational database like MSSQL server, Oracle or similar Ability to create dashboards, spreadsheet analysis, and presentations using reporting and data visualization software like, Excel, Power BI, Tableau or similar tools Ability to QA and troubleshoot data issues Ability to define and document data, system, and reporting requirements Ability to Strong analytical and problem-solving skills Understanding of data warehousing, ETL, data cleansing, and transformation techniques How We Define Our Values and Why You Should Join Our Team: The backbone behind our collection of outstanding businesses is a team of dedicated employees who protect and enhance our valued reputation for quality and delivering what we promise. It’s our values that define Dover to all of our key audiences: our shareholders, customers, prospective employees and especially to ourselves. These values must be expressed in our work and embody our actions, as they form the basis by which we do our jobs, make decisions and measure our performance. It’s our unwavering commitment to maintaining our values that defines who we are as a Company. Collaborative Entrepreneurial Spirit Winning Through Customers Respects and Values People Expectations for Results High Ethical Standards, Openness, and Trust What’s in it for you? Medical, Dental, and Vision 401k Retirement Plan Flexible Spending Paid Holidays The statements herein are intended to describe the general nature and level of work being performed by employees and are not to be construed as an exhaustive list of responsibilities, duties, and skills required of personnel so classified. Furthermore, they do not establish a contract for employment and are subject to change at the discretion of the Company. Dover Food Retail is an Equal Opportunity Employer. All qualified applicants will receive consideration for employment without discrimination based on race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, disability, age, genetic information, or any other factors prohibited by law.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-17T23:20:48.000Z"
    },
    "company": {
        "name": "Hillphoenix",
        "link": "https://www.linkedin.com/company/hillphoenix"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Conyers",
        "region": "GA",
        "postal_code": "30207",
        "street_address": null,
        "latitude": 33.66796,
        "longitude": -84.01779
    }
}