{
    "job": {
        "title": "Data Quality Analyst",
        "industry": "Market Research",
        "description": "Who We Are ClearCut Analytics is a leading provider of retail analytics for CPG brands. With over $50B in eCommerce and Amazon sales data analyzed, our intelligence delivers actionable insights into today’s complex retail marketplace to power successful product innovation, optimize cross-channel performance, and outmaneuver an expanding set of competitors. Beyond ClearCut’s technology, our team of experts ensure companies are equipped with a roadmap and partner for success in the digital era for consumer goods. For 20+ years, SPINS’ mission has been to increase the presence and accessibility of natural and organic products to encourage healthier and more vibrant living. By leveraging SPINS’ industry-leading proprietary data and analytics, our technology enables deeper, more engaged relationships between Retailers, Brands and Consumers through our platform, web, and mobile products. At the core of our work lies a passion to create a culture of sustainable health & wellness. ClearCut has chosen SPINS as a strategic partner to drive market acceleration, in-market execution, and product development. This is a highly strategic investment to accelerate SPINS’ omnichannel e-commerce strategy. What You Will Do We are looking for dynamic and passionate individuals to join our Data team as a Data Quality Analyst to help develop and grow our data and insights offering. The team focus is on the complete data quality cycle, from logging and auditing the receipt and processing of data to ensuring data deliverables are of the highest quality. You will be responsible for the execution of data quality routines. This individual will proactively monitor, measure, analyze, execute, track and report on data quality issues. The Data Quality Analyst will interact with other teams to resolve data quality related issues. This position reports to the VP Data and Insights. Track and audit data in and out of the business Assist in the processing and verification of data through our internal portal Identify, assess, monitor, document, and communicate potential quality issues in the way data is collected, stored, processed, or used Undertake and Conduct Data Quality Management activities such as (but not limited to): Identify, compare, and resolve data quality issues Evaluate large dataset for quality and accuracy Determine business impact level for data quality issues Determine root case for data quality errors and make recommendations for long-term solutions Research and determine scope and complexity of issues so as to identify steps to fix issue Develop process improvements to enhance overall data quality Develop and execute data clean-up measures Ensure adherence to data quality standards Resolve all internal data exceptions in timely and accurate manner Identify areas of improvement to achieve data quality What You Bring Minimum of 2 years of hands on, mixed experience in technology and process Minimum of 2 years of experience with Data Management, Data Governance, or Data Quality Proven experience of having worked and data quality skills in: Data Profiling, quality rules definition Data Discovery Data quality measurement and metric generation, and aggregation into quality performance indicators Root cause analysis Strong data analysis skills across multiple source systems of various formats Advanced MS Office Suite skills, especially Excel Demonstrated success in managing multiple deliverables concurrently often within aggressive timeframes; ability to cope under time pressure Being a team player who works collaboratively and provides coaching and support to transfer technical and data knowledge Why SPINS? For Now, We Can’t Have Some Of Our Favorite In-office Perks (plenty Of Snacks, Onsite Gym, And Bike Storage), We’ve Continued To Find Ways To Stay True To SPINS When we began working remotely a year ago due to COVID, we committed to keeping our healthy and active SPINS culture. This remained a high priority for us as we grew our employee population by nearly 20% while we worked remotely. We listen to employee feedback as we plan when and how we will return to the office in the future. Virtual yoga, HIIT, and Kinstretch classes each week Each employee is allotted paid time to use to volunteer with an organization of their choice and charitable donations are matched. Stay connected with other SPINS employees for a weekly PELOTON ride together CEO Connect, a monthly informal small group Q&A session with our top leader The SPINS Way Direct – We communicate with clarity, honesty and respect in all situations and embrace opportunities to provide solution-oriented feedback. Determined – We are committed to overcoming all obstacles to achieve results. We adapt to change, seek opportunities to learn and rapidly translate that learning into action. Passionate – We go above and beyond to help our partners achieve their goals. We challenge assumptions and are comfortable forging new paths. Collaborative – We leave our egos at the door, believing that working together we will produce an outcome that’s greater than each individual contribution.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-07-30T05:12:34.000Z"
    },
    "company": {
        "name": "SPINS",
        "link": "https://www.linkedin.com/company/spins"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "United States",
        "region": null,
        "postal_code": "99999",
        "street_address": null,
        "latitude": 39.50355,
        "longitude": -99.0183
    }
}