{
    "job": {
        "title": "data scientist",
        "industry": "Marketing and Advertising,Internet,Retail",
        "description": "About The Data Scientist Role the data scientist is going to use processes, algorithms and systems to extract knowledge and insights from data across a broad range of applications. we are looking for a proven technician to build and maintain the operational models to allow soona to grow and scale. this is an opportunity to build a data-driven culture in a fast-growing startup with a dynamic team. the role provides direct feedback to the leadership team on customers and product opportunities. an ideal candidate will be able to use strong business sense along with an ability to communicate findings to influence how soona approaches business challenges and opportunities. the single most important thing this role can do is make the entire company smarter and faster at understanding our customers and opportunities for improvement. the candidate must be able to sift, mine and analyze data from multiple angles, looking for trends that highlight problems or opportunities. this is a full-time position located in our denver, minneapolis or austin office with flexibility on working remote however must sit in one of our operating states CO, MN or TX and must be able to work mst or cst time zones. from insight extraction to process application, this role will report directly to the director of data science as we make moves on our next phase of growth. About Soona soona makes it possible for brands to create professional photo and video starting at $39. our studio stores give customers a playground for creating their content and our anytime platform makes it possible for any product company in the US to experience a remote shoot. we are creating a fast casual content revolution! Requirements an ideal candidate can use a combined knowledge of computer science and applications, modelling, statistics and analytics to solve problems demonstrate a background in decisions engineering and data science architect a foundational data infrastructure and routinely adapt and add-on to the infrastructure ensure validity and accuracy of the data bring strong quantitative and qualitative knowledge use strong business acumen, as well as an ability to communicate findings to soona’s leadership team and crew use these insights to influence how soona approaches business challenges work with stakeholders throughout the organization to identify opportunities for leveraging company data to drive business solutions. Has Experience In 5-7+ years of data analysis, business intelligence, and modelling experience data collection data and report analysis data architecting built algorithmic models for demand planning, order routing, and capacity scheduling have a degree in computer science or related field masters preferred denver location preferred but open to remote at any of of our operating locations CO/MN/TX Benefits we can offer strong starting salary $110,000 - $130,000 + equity benefits & perks + unlimited pto + killer culture really badass headshots",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-11T04:05:52.000Z"
    },
    "company": {
        "name": "soona",
        "link": "https://www.linkedin.com/company/soona"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Denver",
        "region": "CO",
        "postal_code": "80247",
        "street_address": null,
        "latitude": 39.738453,
        "longitude": -104.984856
    }
}