{
    "job": {
        "title": "Site Reliability Engineer",
        "industry": "",
        "description": "SFOX is looking for a Site Reliability Engineer passionate about blockchain based financial technology. We are looking for someone who shares our values, is a team player but can work independently, and who thrives in a dynamic environment. Role In this role, you will build and maintain a real-time trading infrastructure alongside the backend and frontend engineers. The ideal candidate for this position is a tool builder. We are looking for a strong engineer who is passionate about applying that skill set to problems related to operations and system administration. What you'll do Develop and maintain an SLA and error budget for hundreds of microservices Engineer services aimed at infrastructure automation and high availability Own and improve SFOX’s continuous integration and deployment processes Develop and maintain infrastructure and security strategy Analyze potential risks of downtime and develop systems that will eliminate the issue Work alongside the engineering team to improve the quality of their code & systems About you Undergraduate Degree in Computer Science and Engineering, or equivalent, required. Masters degree is a plus. Five years of experience maintaining high availability services Extensive experience with AWS, cloudflare, kubernetes, docker, and linux Working knowledge of Google App Engine, kops, cloudformation, terraform, and circleci Knowledge of security best practices Experience with Bash, Python, YAML, Configuration and Secret Management Intimate knowledge of building and maintaining database clusters, caches and proxies (redis, nginx, etc) Passion for innovation, automation and for working in early stage startups We love Experience working with trading and market data Experience in high-frequency or algorithmic trading Experience in trading digital currency Knowledge of computational mathematics, statistics, and machine learning Understanding of digital currency trading market Interest in Bitcoin, digital currency, and distributed ledger technology",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-27T15:39:48.000Z"
    },
    "company": {
        "name": "SFOX",
        "link": "https://www.linkedin.com/company/sfox"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 60,
        "seniority_level": "Senior Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "California",
        "region": "United States",
        "postal_code": "93266",
        "street_address": null,
        "latitude": 37.254673,
        "longitude": -119.61728
    }
}