{
    "job": {
        "title": "Remote Senior Software Engineer (EC2, Docker, Rancher)",
        "industry": "Information Technology and Services,Computer Software,Financial Services",
        "description": "If you are a Senior Software Engineer coming from a background including AWS (EC2), Docker & Rancher - please read on! This will be a full time role offering a generous base salary + 5-10% performance bonus + amazing (full) benefits! We have offices located in Stamford, CT and Dana Point, CA. This role will be REMOTE. Our team is about 70 people in size (We've been steadily growing since our inception 13 years ago!) We are a profitable, web-based financial research and media company providing information centering around investment. What You Will Be Doing Develop products and services, build and maintain software in support of all our digital media offerings including web, mobile, video and audio Maintain, modify, and update web and backend applications Design and create engineering specs, prototypes, and features for web-based applications Collaborate with developers, product managers and other participants in the development of solutions Gather requirements and development specs What You Need for this Position Docker Rancher Ruby on Rails preferred (Python, Java or similar will also work in lieu of) AWS (EC2) Heroku Infrastructure What's In It for You Option for REMOTE work or on-site in Stamford, CT or Dana Point, CA We have a VERY high retention rate and support career growth! Continuous Learning: we'll fund you attending conferences (when they're open again) You'll be reporting to and learning from a prestigious MIT grad that is well known in the industry So, if you are a Senior Software Engineer (EC2, Docker, Rancher) looking for fully remote, please apply today! Email Your Resume In Word To Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also: Bobby.June@Optello.com Please do NOT change the email subject line in any way. You must keep the JobID: linkedin : BJ1-1633211 -- in the email subject line for your application to be considered.*** Bobby June - Recruiting Manager - Optello Applicants must be authorized to work in the U.S. Optello is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-17T23:26:03.000Z"
    },
    "company": {
        "name": "Optello",
        "link": "https://www.linkedin.com/company/optello-us"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Stamford",
        "region": "CT",
        "postal_code": "06928",
        "street_address": null,
        "latitude": 41.051926,
        "longitude": -73.539474
    }
}