{
    "job": {
        "title": "People Data and Process Analyst - Excellence",
        "industry": "Commercial Real Estate,Financial Services,Real Estate",
        "description": "Job Title People Data and Process Analyst - Excellence Job Description Summary The People Data and Process Analyst - Excellence will collect, compile, and analyze HR data and metrics and apply this data to make recommendations for all HR data related activities. This role is responsible for regular data audits ensuring the integrity and accuracy of the data related to HR records, transactions, and processes. This role is also responsible for Tier 2 issue resolution for all global HR platforms. Responsibilities Job Description Performs Data Audits Troubleshooting of process, data, reporting, and transactional issues within the People Team Resolves tickets including organizational creation, process rescinds, data validation, and reporting requests within specified Service Level Agreement. Supports tactical light configuration within global platforms including table maintenance and calculated fields Analyzes trends and makes recommendations to support data governance and integrity Supports M&A activities by preparing and loading where applicable EIB and other mass data loads Supports testing activities and provides opinions associated to data impacts for technical changes and releases. Aligns data knowledge wit HR Centers of excellence to ensure data quality and translates data into consumable business language Provides training and support to People teams as needed to ensure understanding of processes, transactions, reports, and data outcomes. Performs other related duties as required or requested. Qualifications 3+ years of relative experience Bachelor's degree is preferred or equivalent experience Experience in Workday, JD Edwards, People Experience Tool is preferred Excellent verbal and written communication skills. Strong analytical and problem-solving skills. An understanding of local, state, and federal laws involving employment, HR, and HR policies. Proficient with Microsoft Office Suite or related software. Proficient with or the ability to quickly learn the organizations HRIS, payroll, and similar employee software. Cushman & Wakefield provides equal employment opportunity. Discrimination of any type will not be tolerated. Cushman & Wakefield is an Equal Opportunity / Affirmative Action employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, sexual orientation, gender identity, disability, protected veteran status or any other characteristic protected by state, federal, or local law.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-09-02T05:46:04.000Z"
    },
    "company": {
        "name": "Cushman &amp; Wakefield",
        "link": "https://www.linkedin.com/company/cushman-&amp;-wakefield"
    },
    "education": {
        "required_credential": null
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Oklahoma City",
        "region": "OK",
        "postal_code": "73118",
        "street_address": null,
        "latitude": 35.468494,
        "longitude": -97.52126
    }
}