{
    "job": {
        "title": "Software Engineer",
        "industry": "Financial Services,Real Estate,Hospitality",
        "description": "Why Vacasa We started with just one home and an idea: to bring homeowners and renters together with smart technology and caring local teams. Today, we’re the largest full-service vacation rental company in the US thanks to the people who give us their best every day. You’ll fit right in here if you’re curious, collaborative, innovative, and thrive in a rapid-growth environment. Why Software Engineering at Vacasa? We build the industry-leading technology that enables Vacasa to manage over 25,000 homes and service more than 2 million guest stays per year--a scale that is otherwise unprecedented in the vacation rental management industry and continues to grow. We have big ambitions and aim to move fast. We live in the cloud (AWS), empower our teams to design and operate their own applications & services, and release software into production systems many times per day. What You’ll Do As a Software Engineer, you’ll be a key contributor on your team, solving mission-critical problems working on our ever-evolving systems. We believe to shine in this role, you’re good at: Building both customer facing web apps and back-end services with modern tools Building towards high quality standards and creating robust automated tests Engaging in daily stand-ups, code reviews, and architecture discussions Utilizing DevOps tools and practices for building, deploying, and maintaining software in production environments Optimizing applications for maximum reliability, security, speed, and scalability Continuously learning new technologies and validating concepts in order to pick the right tool for the job Participating in a collaborative, productive culture around product-focused goals Skills You'll Need 3+ years of professional experience in full-stack development Experience in cloud platforms with Infrastructure as Code Experience with JavaScript/TypeScript, Python, React Knowledge and experience with SQL & NoSQL databases Nice to have Completed a B.S./M.S. in Computer Science (or equivalent work experience) AWS Serverless tech What You’ll Get Health/dental/vision insurance—100% coverage option Employer Sponsored & Voluntary Supplemental Benefits 401K retirement savings plan with immediate 100% company match on the first 6% you contribute Health & Dependent Care Flexible Spending Accounts Flexible vacation time Paid sick days and holidays Paid parental leave after one year of tenure Employee Assistance Program Career advancement opportunities Employee discounts and All the equipment you’ll need to be successful Great colleagues and culture Please visit our careers page to review our full benefits offerings Vacasa is an equal opportunity employer committed to fostering a diverse and inclusive workplace. We do not discriminate against applicants based upon race, color, religion, sex (including pregnancy, gender identity, and sexual orientation), national origin, age, disability, genetic information, or other classes protected by applicable law. Vacasa is committed to maintaining a safe and productive work environment. Possession, use, or being under the influence of alcohol or illegal drugs in the workplace is prohibited. An offer of employment for this role will be contingent upon the successful completion of a background check.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-16T00:00:00.000Z"
    },
    "company": {
        "name": "Vacasa",
        "link": "https://www.linkedin.com/company/vacasa"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Boise",
        "region": "ID",
        "postal_code": "83712",
        "street_address": null,
        "latitude": 43.61579,
        "longitude": -116.20158
    }
}