{
    "job": {
        "title": "Software Engineer – Windows C# Developer",
        "industry": "Electrical/Electronic Manufacturing,Information Technology and Services,Staffing and Recruiting",
        "description": "Overview The Windows C# Developer will work with an experienced team of software, firmware, and hardware engineers to develop our Q-Sys platform. Q-Sys is a fast growing, award winning, software and hardware platform built on cutting-edge audio, video and control products. This position is based in Boulder, Colorado, with possibility of hybrid or fully remote work. QSC thrives where innovative technology and compelling audio-visual experiences intersect. For over 50 years, QSC has pioneered the technology and solutions that enable immersive cinema, live performance audio, themed entertainment, digital collaboration and meeting experiences for our customers and partners around the world. A globally recognized innovator in the design, engineering, and manufacture of category leading high-performance loudspeakers, digital mixers, power amplifiers, audio processors, digital cinema solutions, and the Q-SYS™ software-based audio, video and control Ecosystem. By joining the QSC team, you will be in a challenging, collaborative, fun, and innovative environment. We encourage employees to take ownership, to color outside the lines, and to imagine possibilities. Our culture is casual but dynamic, with cross-functional teams collaborating on creating memorable audio-visual experiences that deliver joy to people, wherever they are. At QSC, fun and hard work go hand in hand. Join us and make a difference in the way people experience movies, meetings, presentations, live performances, and much more. Responsibilities Develop world-class software within the pro audio, video & control industry Add features to a top tier Windows application using C#, WPF, and JavaScript Assist in continuously improving the architecture of the Q-SYS Designer application Maintain a strong focus on software quality, quickly addressing defects as they occur Work with Software Quality Assurance to develop appropriate test strategies Perform other duties as assigned Qualifications B.S. in Computer Science, Electrical Engineering, Computer Engineering or equivalent Minimum of 3 years of work experience in a professional software development environment Hands on experience coding large C# code bases Excellent SW design, engineering, implementation, and debugging skills Passionate, persistent, creative – you are excited to find solutions to difficult problems Must be self-motivated in order to achieve assigned objectives with minimal supervision The successful candidate will have the following skills: Strong knowledge of modern C# Working knowledge of git source control Experience with WPF framework using XAML Application development for shipping Windows-based software products The ideal candidate will have experience with one or more the following: Experience with C# asynchronous programming C++ experience in a large scale codebase Development of hardware/software solutions Experience with real-time audio or video applications Interfacing with REST APIs",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-17T07:23:20.000Z"
    },
    "company": {
        "name": "QSC",
        "link": "https://www.linkedin.com/company/qsc-audio-products-llc"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Boulder",
        "region": "CO",
        "postal_code": "80310",
        "street_address": null,
        "latitude": 40.016872,
        "longitude": -105.279625
    }
}