{
    "job": {
        "title": "REMOTE Sr Software Engineer - Python, React, PostgreSQL, GraphQL",
        "industry": "Hospital &amp; Health Care",
        "description": "If you are a REMOTE Senior Software Engineer with experience, please read on! We are looking for a Senior Software Engineer to join our team in Overland Park, KS! You will work independently on complex assignments and assists in coming up with appropriate procedures on new assignments. You'll also assist in serving as a resource to both internal and 3rd party team members on higher level issues as well as analyzing and designing specs of junior team members. What You Will Be Doing Utilizing technical expertise; creates system requirements, performs design and analysis, and coding and unit testing of complex to highly complex system functionality and/or defect correction across multiple platforms. Resolves complex technical design issues. Provides functional and/or technical guidance in evaluating applications systems or evaluating requests for proposals. Coordinates changes and influences and prioritizes tasks with business or technical departments. Analyzes and influences technical, system, and/or user requirements. Identifies and creates solutions to improve system performance and availability. Facilitates root cause analysis of system issues to minimize impact and future occurrences. Creates system documentation/play book(s) and serves as a lead technical reviewer and contributor in requirements, design and code reviews. Analyzes and designs specifications for less experienced engineers. Acts as a technical resource throughout the development life cycle. May also actively contribute to the technical and soft skills development of team members. Assists team leads and management with delegation of work to cross functional and third party team members for execution through the full development life cycle. Keeps management appropriately informed of progress and issues. Coordinates system application transition from development teams to maintenance and production teams. Constructs and implements necessary controls to assure system/application traceability. What You Need for this Position Python REACT PostgreSQL GraphQL API Gateway AWS Lambda EC2 Agile Microservices SNS Excellent communication skills! Fully REMOTE! What's In It for You Competitive compensation ($130-215k/yr DPE) 401k w/match Full health benefits (medical, dental, vision) Generous PTO Fun work culture We pride ourselves in a healthy work/life balance! So, if you are a REMOTE Senior Software Engineer with experience, please apply today! This job is open to telecommute candidates. Applicants must be authorized to work in the U.S. So, if you are a REMOTE Senior Software Engineer with experience, please apply today! Email Your Resume In Word To Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also: Nick.Valenti@CyberCoders.com Please do NOT change the email subject line in any way. You must keep the JobID: linkedin : NV1-1639671 -- in the email subject line for your application to be considered.*** Nick Valenti - Executive Recruiter - CyberCoders Applicants must be authorized to work in the U.S. CyberCoders, Inc is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work - In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-25T17:32:31.000Z"
    },
    "company": {
        "name": "CyberCoders",
        "link": "https://www.linkedin.com/company/cybercoders"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Overland Park",
        "region": "KS",
        "postal_code": "66214",
        "street_address": null,
        "latitude": 38.97482,
        "longitude": -94.6836
    }
}