{
    "job": {
        "title": "Data Analyst",
        "industry": "Information Technology and Services",
        "description": "Technical Business / Data Analyst Full Time - NO C2C We are looking for a Med 4 - 5 years of experienced and versatile Technical Business / Data Analyst to improve our information technology systems. To ensure success as a Technical Business Analyst, you should demonstrate experience and creativity in data analysis and data-oriented system development. Outstanding Technical Business / Data Analysts combine their IT expertise with in-depth business knowledge. Technical Business Analyst Responsibilities: Performing system and data analyses on software programs, databases, data pipelines, applications, and web services. Design test plans, scenarios, and scripts in order to conduct quality assurance testing. Develop user stories and maintaining the backlog in an Agile environment Develop automation scripts and reporting systems. Translate business requirements into technical requirements, including SQL queries. Working with both business and technical resources, often acting as a liaison Efficiently integrating new systems, programs, and applications with business operations and services. Determining system efficiency and functionality by liaising with all stakeholders. Analyzing and improving the performance of data-oriented services. Ensuring end-user proficiency with new systems, programs, and applications across departments. Promoting system efficiency and security by integrating performance metrics and encryption. Implementing new advancements in the field of system and enterprise architecture. Technical Business Analyst Requirements: Must have experience working within the financial/banking industries or manufacturing/supply chain industries A Bachelor's Degree in Computer Science, Information Technology, Information Systems or similar field. 4 years of directly related experience in database management systems, data analysis, data pipelines, and data-oriented quality assurance testing. Extensive experience in all phases of the software development life cycle (SDLC). Advanced knowledge of programming languages like SQL and system integration solutions. Experience working with data analysis on cloud platforms like Azure and AWS Experience with database technologies such as NoSQL, Cosmos DB, MongoDB. Nice to have – knowledge / exposure to Azure services like – Logic Apps, Service Bus, Azure Data Factory, Azure Data Catalog and Storage Explorer Exceptional written and oral communication skills. Expert level skills with MS Excel and PowerPoint Ability to facilitate internal, team and client meetings to achieve their objectives. Ability to keep up with IT advancements.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-03T03:15:01.000Z"
    },
    "company": {
        "name": "WorldLink US",
        "link": "https://www.linkedin.com/company/worldlink-inc."
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 48,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Texas",
        "region": "United States",
        "postal_code": "76522",
        "street_address": null,
        "latitude": 31.463793,
        "longitude": -99.333275
    }
}