{
    "job": {
        "title": "Data Scientist",
        "industry": "",
        "description": "Qualifications : 2+ years of experience leading work streams with 2+ data scientists, engineers, and other data & analytics professionals, including innovation, quality management, utilizing analytics and software development processes for Natural Language Processing , Machine Learning on unstructured data, and/or information retrieval; multidisciplinary backgrounds.. Masters or PhD in Computer Science, Engineering, or related fields; PhD preferred. Ability to apply artificial intelligence techniques to achieve concrete business goals and work with the business and team members to understand business objectives, available resources, and constraints around data (sources, integrity, and definitions), processing platforms, and security; provide assistance and resolve problems using solid problem-solving skills and verbal/written communication. Solid experience performing data science from data discovery, cleaning, model selection, validation, and deployment; experience coding Artificial Intelligence methods using object-oriented programming in a software development process, and ability to restructure, refactor, and optimize code for efficiency. Ability to utilize a diverse array of technologies and tools as needed, to deliver insights ( R, Python, Spark, Hadoop ), and emerging Cloud Capabilities on Azure, GCP , and/or AWS ; experience with command-line scripting , data structures, and algorithms and the ability to work in a Linux environment. Ability to travel up to 80% of the time. Must be legally authorized to work in the United States without sponsorship of a visa.",
        "employment_type": "CONTRACTOR",
        "date_posted": "2021-08-19T20:18:11.000Z"
    },
    "company": {
        "name": "Brilliant Infotech Inc.",
        "link": "https://www.linkedin.com/company/brilliant-infotech-inc."
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 24,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Princeton",
        "region": "NJ",
        "postal_code": "08540",
        "street_address": null,
        "latitude": 40.35198,
        "longitude": -74.66074
    }
}