{
    "job": {
        "title": "Jr Software Integration Engineer",
        "industry": "",
        "description": "Job Description UNDERGRADUATE DEGREE IN COMPUTER SCIENCE (OR SIMILAR) AND MINIMUM 1 YEAR OF RELEVANT JAVA DEVELOPMENT REQUIRED. SPONSORSHIP IS NOT AVAILABLE AT THIS TIME. The Team We're an energetic team of repeat entrepreneurs, and we’re excited to be building the next generation of e-commerce software! We've worked together in the past to build exciting, and successful, software platforms. We wear hats, a lot of hats. It's basically a hat shop. But at the end of the day we're creators who love to work hard and learn from each other. We might debate fiercely in the office, but at the end of the day we'll all share a few pints and laughs. We celebrate our successes and failures equally, and we never let an idea go unchallenged. Syndic8 We're process people as much as software people - we build software to help facilitate struggling processes. We dig until we find a problem so profound that non-software companies try to build software to fix a problem - that, to us, is the golden opportunity. E-commerce is wrapped around traditional logistics - one of the oldest and least technologically-refined industries. Manufacturers, brands, retailers, and marketplaces are technologically underwater, struggling to cope with today's data demands. We've built Syndic8 to unite all of these entities in a centralized, controlled, workflow-driven communication platform. Our Tech Our backend and API are powered by Java (Quarkus), and our frontend is Angular JS . We use Jenkins and Ansible to control a tight code pipeline, which deploys docker images into OKD clusters across a multitude of environments. We also make use of some major AWS components, namely S3 , Lambda , CloudFront , as well as 3rd-party products such as Vault, Auth0, and AMQ. You You are young, curious, very technical, and hungry to learn. You bring keen tech skills and some working knowledge of data integration to the table. You'll work hands-on with our team of seasoned engineers, as well as directly with our CTO, to take over our integration work (both pre-existing and new). This is an excellent opportunity to get exposure to our senior management, as well as valuable client-facing time with our largest customers. This is very much a growth role - the right candidate will progress quickly from ETL-intensive work to learn the skills necessary to contribute to core (Java) code. We love to promote internally and will invest in intensively training someone who is dedicated to learning. Your Responsibilities Map inbound and outbound data to our data schema, creating transformations where necessary (e.g. data validation or regex-style replacement) Maintain and monitor current data movement / data transformation integrations Work with external technology groups to resolve connectivity issues (e.g. outages or format changes) Manage multiple concurrent integration projects and report internally the status of overall connectivity Expand current processes for outbound data delivery and inbound data ingestion via flat file, EDI, FTP, API, etc. Manage our cloud-based ETL tool (Dell Boomi) You'll Be a Skills Fit If You have 1-2 years of experience in professional software development, or relevant project work that demonstrates your coding abilities ( Java preferred) understand relational databases, ideally MySQL have customer/client-facing skills and understand how to manage client expectations with respect to software delivery have experience with version control, e.g. Git have a working knowledge of data transformation tools (cloud-based ETL), such as Talend Open Data Studio, Informatica, Cleo, or ideally, Dell Boomi You'll Be a Character Fit If You enjoy the challenges and rewards of working in an early stage startup (very strong preference for someone who has worked in a <50 person company) are constantly tinkering (we love tinkerers!) enjoy challenging the status quo, and constantly come to your team with ideas for improvement know when to check in for approval vs. run with an idea keep yourself organized and communicate well – we primarily use Jira and Slack to keep everyone on the same page, but when necessary we expect you to pick up the phone and call team members. view working for a large corporation as the death of productivity, innovation, intellectual stimulation, education, and pretty much any other goal of a company/job do not sit idle once a task is complete - you have a constant backlog of tasks, or things you want to learn have worked in a variety of team environments - distributed, remote, off-shore, near-shore, etc. want to create (and I really mean *create*) a fun, hard-working environment of peers with whom you're excited to slay the day don't get wrapped up in titles, and chip in on things that need doing without asking (even if they have absolutely nothing to do with your responsibilities What You Get excellent benefits, including top-of-the-line health/dental/vision insurance, 401k, commuter benefits, generous vacation, BYOD compensation, etc. flexible work environment - e.g. working from home, shifted hours, etc. potentially, equity shares in the company, depending on your experience the unique experience, pride and status that comes from being one of the first employees of a software startup the opportunity to build your own team as we expand, and shape the entire company/product the opportunity to \"do it right\" this time. We have all inherited someone else's mess at some point, and wished we could build something from scratch to meet our own impeccable standards. It’s time to seize the opportunity. Company Description Join a small, well-funded startup with growing revenue and help us get to the next level! We’re a team of 13, which means you’ll have incredible mentorship directly from the leadership team, and rapidly increasing reward/responsibility as your role expands. We have built the first true communication platform (enterprise SaaS) for e-commerce. There are many “point” solutions available, that tackle specific problems for a specific type of organization. Syndic8 takes a higher-level approach by coordinating multiple disparate activities, both within and between e-commerce companies.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-05T17:39:26.000Z"
    },
    "company": {
        "name": "Syndic8",
        "link": "https://www.linkedin.com/company/syndic8-dms"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 12,
        "seniority_level": "Intermediate Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Boston",
        "region": "MA",
        "postal_code": "02118",
        "street_address": null,
        "latitude": 42.358994,
        "longitude": -71.05863
    }
}