{
    "job": {
        "title": "Senior Software Engineer",
        "industry": "Financial Services,Information Technology and Services,Information Services",
        "description": "Job Description The Role As a hands-on senior software engineer, your primary role will be building, testing and engineering REST API’s on our Planning & Advice Platform. You will also be part of the technology team that defines and implements outstanding engineering solutions for our technology products. You are encouraged to quickly gain an understanding of all the components of our platform to be able to contribute to strategic roadmaps and initiatives related to the improvement, maintenance, and support of the platform. The Expertise And Skills You Bring Bachelor's / Master’s degree or equivalent in Computer Science or Engineering Outstanding problem-solving skills dealing with sophisticated distributed deployments You must be passionate about engineering perfection, highly focused, innovative, standout colleague, self-starter, collaborator, and someone who’s eager to learn and guide every day. 4+ years of API development experience (currently hands on) in core Java, Spring MVC / Spring Core / SpringBoot / Web Services (SOAP/REST) and configuring web containers. 3+ years of experience in Docker, Code Quality tools like Sonar and Log aggregation tools like Splunk. 3+ years of proven experience in supporting high-volume applications in production. Deep experience with common issues related to scalability, availability, intelligent monitoring, performance, and how to craft proactively to avoid them. Proven experience in Domain Driven API design, Swagger or Open API Specifications and API Lifecycle management. Ability to prioritize the work based on strategic nature, importance, and urgency. Champion and advocate of Test Driven Development, Unit testing using frameworks and tools like Junit, Cucumber, REST Assured. Hands on with IDE’s Spring Tool Suite and Eclipse/IntelliJ Idea - within a UNIX and Windows environment. Fully hands on with application builds and deploys using Continuous Integration/ Deployment (CI/CD) tools like Jenkins, Maven, uDeploy, etc. Good understanding of cloud-computing / cloud services platforms (e.g. AWS or Azure) Contribute to multiple development work streams through integration and ensure architecture is scalable and extensible Collaborate with other software developers to ensure a common vision Align with the leadership’s vision for the products and ensure that day-to-day tactical requests don’t compromise that vision. Cultivate the culture of an engaged and highly skilled team. Enforce existing engineering practices and setting new ones as and when needed. Lead the effort to define, maintain, and support Java development environment and standard methodologies, such as Maven, Sonar, and other Open Source tools Lead the identification, isolation, resolution, and communication of sophisticated problems within the production and nonproduction environment. Ensure a robust code review process is in place and followed consistently. Proactively lead process and technology improvement initiatives. Understand the leadership vision and lead the execution of that vision. Help strengthen further the culture of innovation by setting examples Find creative ways to get things done, and do them right Cultivate a culture of best in class software engineering practices Exercise a passion for keeping your knowledge up-to-date with the latest and greatest Help maintain the high level of integrity in the team Take ownership and accountability for figuring out what needs to be done The Team Join a team helping millions of customers achieve their financials dreams. Our chapter comprises teams working on a collection of engines that come together to power Fidelity's Planning and Advice capabilities available on platforms like Fidelity.com and NetBenefits.com. We're looking for highly motivated, passionate and inquisitive product-aware engineers, who work well in a collaborative, iterative, and fast-paced environment helping us deliver the best planning and advice engines. Certifications Company Overview At Fidelity Investments, our customers are at the heart of everything we do. As a privately held company with a rich 75-year history, our mission has remained the same since our founding: to strengthen the financial well-being of our clients . We help people invest and plan for their future. We assist companies and non-profit organizations in delivering benefits to their employees. And we provide institutions and independent advisors with investment and technology solutions to help invest their own clients’ money. Join Us At Fidelity, you’ll find endless opportunities to build a meaningful career that positively impacts peoples’ lives, including yours. You can take advantage of flexible benefits that support you through every stage of your career, empowering you to thrive at work and at home. And you don’t need a finance background to succeed at Fidelity—we offer a range of opportunities for learning and growth so you can build the career you’ve always imagined. We welcome associates from different backgrounds and with different perspectives to help us innovate and make a difference for our customers and our communities. We invite you to Find Your Fidelity at fidelitycareers.com. Fidelity Investments is an equal opportunity employer. We believe that the most effective way to attract, develop and retain a diverse workforce is to build an enduring culture of inclusion and belonging. Fidelity will reasonably accommodate applicants with disabilities who need adjustments to participate in the application or interview process. To initiate a request for an accommodation, contact the HR Leave of Absence/Accommodation Team by sending an email to accommodations @fmr.com, or by calling 800-835-5099, prompt 2, option 2.",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-17T07:13:26.000Z"
    },
    "company": {
        "name": "Fidelity Investments",
        "link": "https://www.linkedin.com/company/fidelity-investments"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 48,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Durham",
        "region": "NC",
        "postal_code": "27717",
        "street_address": null,
        "latitude": 35.99695,
        "longitude": -78.899025
    }
}