{
    "job": {
        "title": "Software Engineer",
        "industry": "Information Technology and Services",
        "description": "About Us We're an innovative tech consultancy - a team of problem solvers. Since 1993 we have been finding better ways to solve complex technology problems for some of the world’s leading organizations and delivered solutions that millions of people use every day. We bring together experts from diverse backgrounds and experiences in a collaborative and open culture to deliver outstanding outcomes for our clients, and a stimulating and rewarding environment for our people. Our clients tell us that our people are the best they’ve worked with – not only because of their professional ability, but also their behavior and attitude. As part of the BJSS Software Engineering team, you will hone all these skills delivering real engagements for a variety of clients. About the Role We love to experiment with the latest tools, technologies, and techniques to improve how we deliver our solutions and as a software engineer you can expect to be involved in: Engineering software solutions - working with prototypes and proof of concepts and developing fully functioning applications based on frameworks such as .Net and Spring/Spring Boot, and using languages including Java, Scala, JavaScript, Python, C# and Go . Producing rich front-end UI and efficient services with technologies like React, Angular and Vue. The automation of environmental and application deployment, scaling, and management using Kubernetes, Terraform, both in the cloud (AWS, Azure or GCP) or on-premise. About You You're an engineer at heart and enjoy the challenge of building complex software solutions You want to work across a range of tech environments. Your priorities will be building new systems and improving stability, security and efficiency You're keen to learn new technologies and languages You're comfortable operating in an Agile environment with a good working knowledge in areas such as CI/CD, build pipelines, testing and architecture You have a good understanding of computing fundamentals (e.g. logic, data structures, algorithms, low-level architecture, networks stack) along with strong software design skills, including OO, and knowledge of version control systems such as Git You love nothing more than grabbing a pen and whiteboarding the next challenge",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-04T15:40:32.000Z"
    },
    "company": {
        "name": "BJSS",
        "link": "https://uk.linkedin.com/company/bjss"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Houston",
        "region": "TX",
        "postal_code": "77208",
        "street_address": null,
        "latitude": 29.760803,
        "longitude": -95.36951
    }
}