{
    "job": {
        "title": "Senior DevOps Operator",
        "industry": "Consumer Electronics",
        "description": "Summary Shape the next generation of big data solutions at Apple by working on the bleeding-edge technologies and solutions for the Strategic Data Solutions (SDS) team. SDS is looking for exceptional DevOps operators to help bring our environment to the next level. Be a member of the team that is responsible for the data collection and reporting for all of Apple’s products around the world. You will build systems that every iPhone, iPad and Mac have interacted with. Apple’s engineering and operations teams will utilize your systems to build the next insanely great product. Do something amazing and be a critical part of a company that everyone recognizes and loves. Key Qualifications Production experience with: Kubernetes application cluster BigData technologies (Hadoop, Spark Streaming, Kafka, CDH is a plus) Relational DB experience (mysql) Instrumentation: Grafana, logstash, Kibana or AppD Incident management, reporting, communication, production feedback process Description In this role, you will be managing a very large-scale, highly-available Hadoop infrastructure supporting many-Petabytes of data and growing very rapidly. You will be a key part of operating and maintaining the design, architecture, instrumentation and delivery of a massive data platform empowering Apple’s products. As a member of a cross-functional global team, you'll have the opportunity to solve challenging operational problems across a broad range of Apple manufacturing services. You will be leading innovation by exploring, investigating, instrumenting, recommending, benchmarking and implementing data centric technology solutions for the platform. Education & Experience • Bachelor’s degree in computer science, mathematics or relatable field Additional Requirements Natural influencer, and selfless team player Excellent problem solving skills; proven technical leadership and communication skills Provide hardware architectural guidance, planning, estimating cluster capacity, and creating roadmaps Methodical with the ability to Simplify and Refine Continuous learner Relentless Customer Focus Role Number: 200237512",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-23T06:37:53.000Z"
    },
    "company": {
        "name": "Apple",
        "link": "https://www.linkedin.com/company/apple"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Elk Grove",
        "region": "CA",
        "postal_code": "95757",
        "street_address": null,
        "latitude": 38.418133,
        "longitude": -121.39326
    }
}