{
    "job": {
        "title": "Machine Learning Engineer",
        "industry": "Information Technology and Services",
        "description": "Title - Machine Learning Engineer Type - Fulltime Location - San Francisco, California, United States We are seeking a Machine Learning Software Engineer to become an integral part of our team! You will be responsible for creating and modifying software or specialized programs. Responsibilities: Analyze user needs and develop software solutions Work with project manager or product owner to meet specification needs Recommend software upgrades to optimize operational efficiency Collaborate with other developers to design and optimize code Document all programming tasks and procedures Perform routine software maintenance Qualifications: Previous experience in software development, computer engineering, or other related fields 3+ years working experience with: Python applied to SaaS/Enterprise Data-pipeline/classification projects Relational database technologies: Postgres/SQL Alchemy (preferably thru AWS-RDS) Text/document processing & machine learning technologies: NLP, Tensor Flow/PyTorch, Recurrent Neural Networks (RNN), Computational linguistics experience, Clustering, Decision tree learning and their real-world advantages/drawbacks. Document processing: Document format Conversion, meta-data Extraction, content Classification, & content Summarization Agile software development: JIRA (SCRUM, PR/Code reviews, unit tests) Bachelor’s Degree in Computer Science/related discipline, or equivalent work experience Bonus points for commercial experience working on any of the following: Search ranking, relevance and optimization: Elasticsearch Containerization + Container Orchestration Workflow scalable infrastructure: Celery/RabbitMQ, Airflow DevOps via AWS: AWS Sagemaker, AWS-ECS, AWS-EKS, CloudWatch NoSQL: Any document-oriented database Continuous integration, Automated testing",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-06T12:58:42.000Z"
    },
    "company": {
        "name": "Avesta Computer Services",
        "link": "https://www.linkedin.com/company/avesta-computer-services"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": 36,
        "seniority_level": "Experienced Level"
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "San Francisco",
        "region": "CA",
        "postal_code": "94121",
        "street_address": null,
        "latitude": 37.78008,
        "longitude": -122.42016
    }
}