{
    "job": {
        "title": "Data Scientist - Causal Inference and Econometrics",
        "industry": "Computer Software,Internet,Financial Services",
        "description": "At Clarity AI, we are committed to bringing social impact to markets. We are a tech company started in 2017, leveraging AI and machine learning technologies to ensure environmental, social and governance dimensions are the focal point of decision making within financial markets. We are now a team of more than 100 highly passionate individuals coming from all over the world. Together, we have established Clarity AI as a leading startup backed by investors and strategic partners such as Blackrock and Deutsche Börse who believe in us and share our goals. We have plans to continue growing our teams in Spain, the UK and the US this year so if you would like to join us on this rocket ship, keep reading! LOCATION New York City Requirements What are we looking for? We like data scientists that work with data in a scientific way and that share our passion for bringing social impact to the markets and making a difference. At Clarity you will help develop the “gold standard” to quantify social impact that will be used by investors, consumers and governments. Specifically, you will Lead efforts to understand what drives sustainability in companies and governments Work side-by-side with a top-talent team from business and academia. As the ideal candidate for the position You have a strong background in statistics, econometrics, and causal inference You excel at problem solving Clarifying the nature of a problem and formulating relevant questions. Breaking down a problem into smaller, more manageable parts, creating business value every step of the way. Deciding among possible solutions in a critical way. Implementing actions and evaluating outcomes in a quantitative way. You have strong communication skills. The right candidate can thrive in an environment of asynchronous conversation, since the clarity team is located across the globe. We expect you to have strong communication skills and be able to create working relationships with coworkers across various locations. You possess and know how to share technical expertise Analyzing and getting insights from complex, unstructured and incomplete datasets. Using data visualizations to generate insights and communicate results. Using data science tools Python or R Causal inference modules like dowhy Bonus points Experience in policy making and policy evaluation You have a start-up way of working Self-motivation and drive to succeed. Getting-the-job-done mentality. Learn by doing, all the time. Authorized to work in the US Responsibilities of the role include You’ll immerse yourself and deep dive into our ever-growing set of external and internal data flows, and produce insightful analyses that enable data-driven discovery and innovation throughout Clarity.ai and the emergent field of impact investment as a whole. You’ll research, design, validate, and deploy machine learned models that use structured and unstructured data and leverage advanced techniques for classification, regression, topic modeling, and NLP to produce new metrics that will be included in the Clarity platform. After experimenting and building with different data sources, modeling tools, and advanced techniques, you will share your findings with the team. Besides, you may eventually present your work at international conferences and top tier journals. What We Offer Benefits Our people are our main asset. We have built a unique team and we all share 3 differential aspects Excellence, Passion and Values Our team comprises professionals from leading consulting and banking firms, MBA graduates from top business schools, entrepreneurs and PhDs. Clarity’s Founder and CEO, Rebeca Minguela, is a successful entrepreneur who has been recognized as one of the most distinguished leaders under the age of 40 by prestigious institutions like the World Economic Forum. We are different. We work hard to become the best place to work and pride ourselves on our culture Fact based Promoting objective, fact-based and solution-oriented discussions. Diverse Encouraging diversity of personalities, cultures and experiences. Transparent Communicating feedback transparently, constructively and in real-time. Meritocratic Striving for excellence and rewarding the best. Flexible Working flexibly in the broadest sense (schedule, location, vacation, styles). We care about our employees and think they deserve the best. Stock/ Phantom We want our employees to feel part of Clarity. That’s why we give them the opportunity to participate in our success with phantom stock options. Remote benefits We offer remote working flexibility and provide everyone with a budget in set up the best workspace that meets their needs. Training budget Continued learning is important to us so we provide everyone with a yearly training budget. Additional benefits are available depending on your location. We are a US company with a Spanish subsidiary. We have amazing offices in Madrid, London and New York City. Clarity has received several awards Young Global Leader to Rebeca Minguela 2017 Top 10 Fintech startup worldwide by BBVA Open Talent Top 2 start-ups with impact worldwide by IMPACT Growth 2017 One of the most innovative Spanish companies by NeoTec One of the most innovative projects in the US. Harvard Innovation Lab Privacy Policy Responsibility Clarity AI Inc. 160 Greentree Drive, Suite 101, City of Dover, County of Kent, Delaware 19904, United States. Purpose management of selection processes for new employees. Legitimation necessary processing for contract execution. Recipients company of the Clarity Group in the country that would carry out the contract or where position is being offered. Rights the interested party may exercise the rights of access, rectification, opposition, limitation, suppression, portability and not to be the object of automated decisions according to the Privacy Policy. More info to consult the privacy policy in detail, click on the following link (Privacy Policy)",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-06-14T00:59:56.000Z"
    },
    "company": {
        "name": "Clarity AI",
        "link": "https://www.linkedin.com/company/clarity-ai"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": null,
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "New York",
        "region": "United States",
        "postal_code": "13856",
        "street_address": null,
        "latitude": 42.93923,
        "longitude": -75.62005
    }
}