{
    "job": {
        "title": "Software Engineer",
        "industry": "Information Technology and Services,Computer Software,Telecommunications",
        "description": "Job ID: 120950 Required Travel : Minimal Managerial - No Location: : USA- Dallas Texas (Customer Site) Who are we? At Amdocs, our purpose is to enrich lives and progress society. With our creativity and technology, we help make a better-connected world. Amdocs and its 25,000 employees serve the top tier players in the communications and media industry, enabling next-generation experiences in 85 countries. Our cloud-native, open and dynamic portfolio of digital solutions, platforms and services brings greater choice, faster time to market and flexibility, to better meet the evolving needs of our customers as they drive growth, transform and take their business to the cloud. Listed on the NASDAQ Global Select Market, Amdocs had revenue of $4.1 billion in fiscal 2019. For more information, visit Amdocs at http://www.amdocs.com In one sentence Responsible for design, develop, modify, debug and/or maintain software systems. Responsible for one or more specific modules within a large software system scope What will your job look like? Accomplish test procedures and/ or scripts either manually or by automated tools. Supervise and report on the test execution in a timely manner with attention given to achieving outstanding quality. Capture and detail the outcome of test executions and all information needed to support ongoing measurements and reporting on risks, defects, tests, and coverage. Analyze reports and discrepancies to resolve root cause and evaluate script failures at a high level. Compare and analyze system behavior vs. encouraged results/important metrics based on business and technical requirements. Identifies issues, proposes system improvements and performs repetitive test execution to resolve identified issues. You will participate and contribute to internal design reviews of testing materials. All you need is... B.A. /B.SC in IT/ Computer Science/ Industrial Engineering/ Systems Analysis. Proven experience/knowledge in Programming, testing tools and testing methodologies. Hands-on technical experience in testing of software projects. Why You Will Love This Job Get the chance to work with the industry's most ground-breaking testing technologies and help customers shift into the new testing realities of the digitized world! Get the opportunity to work in a growing organization, with ever growing opportunities for personal growth and one of the highest scores of employee engagement in Amdocs! We offer a wide range of stellar benefits including health, dental, vision, and life insurance as well as paid time off, sick time, and parental leave! Amdocs is an equal opportunity employer. We welcome applicants from all backgrounds and are committed to encouraging a diverse and inclusive workforce. Amdocs is an equal opportunity employer. We welcome applicants from all backgrounds and are committed to fostering a diverse and inclusive workforce",
        "employment_type": "FULL_TIME",
        "date_posted": "2021-08-17T00:00:00.000Z"
    },
    "company": {
        "name": "Amdocs",
        "link": "https://www.linkedin.com/company/amdocs"
    },
    "education": {
        "required_credential": "bachelor degree"
    },
    "experience": {
        "months_of_experience": null,
        "seniority_level": null
    },
    "salary": {
        "currency": "USD",
        "min_value": null,
        "max_value": null,
        "unit": null
    },
    "location": {
        "country": "US",
        "locality": "Dallas",
        "region": "TX",
        "postal_code": "75342",
        "street_address": null,
        "latitude": 32.777977,
        "longitude": -96.79621
    }
}